; ModuleID = '../bc_files/bitarray.bc'
source_filename = "/home/sri/zephyrproject/zephyr/lib/os/bitarray.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }
%struct.z_spinlock_key = type { i32 }
%struct.sys_bitarray = type { i32, i32, ptr, %struct.k_spinlock }
%struct.bundle_data = type { i32, i32, i32, i32, i32, i32 }

; Function Attrs: inlinehint nounwind optsize

!58 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!85 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!86 = !{!87, !88}
!87 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !89, line: 64, baseType: !90)
!89 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!90 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!91 = !{i32 7, !"Dwarf Version", i32 4}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{i32 1, !"wchar_size", i32 4}
!94 = !{i32 1, !"static_rwdata", i32 1}
!95 = !{i32 1, !"enumsize_buildattr", i32 1}
!96 = !{i32 1, !"armlib_unavailable", i32 0}
!97 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!98 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !4, file: !4, line: 223, type: !99, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !220)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !101, !103}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !105, line: 250, size: 896, elements: !106)
!105 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!106 = !{!107, !178, !191, !192, !193, !194, !215}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !104, file: !105, line: 252, baseType: !108, size: 384)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !105, line: 58, size: 384, elements: !109)
!109 = !{!110, !138, !146, !148, !149, !162, !163, !165}
!110 = !DIDerivedType(tag: DW_TAG_member, scope: !108, file: !105, line: 61, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !105, line: 61, size: 64, elements: !112)
!112 = !{!113, !129}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !111, file: !105, line: 62, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !115, line: 55, baseType: !116)
!115 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !115, line: 37, size: 64, elements: !117)
!117 = !{!118, !124}
!118 = !DIDerivedType(tag: DW_TAG_member, scope: !116, file: !115, line: 38, baseType: !119, size: 32)
!119 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !116, file: !115, line: 38, size: 32, elements: !120)
!120 = !{!121, !123}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !119, file: !115, line: 39, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !119, file: !115, line: 40, baseType: !122, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, scope: !116, file: !115, line: 42, baseType: !125, size: 32, offset: 32)
!125 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !116, file: !115, line: 42, size: 32, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !125, file: !115, line: 43, baseType: !122, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !125, file: !115, line: 44, baseType: !122, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !111, file: !105, line: 63, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !131, line: 58, size: 64, elements: !132)
!131 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !130, file: !131, line: 60, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 64, elements: !136)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!136 = !{!137}
!137 = !DISubrange(count: 2)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !108, file: !105, line: 69, baseType: !139, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !141, line: 243, baseType: !142)
!141 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 241, size: 64, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !142, file: !141, line: 242, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !115, line: 51, baseType: !116)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !108, file: !105, line: 72, baseType: !147, size: 8, offset: 96)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !89, line: 62, baseType: !5)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !108, file: !105, line: 75, baseType: !147, size: 8, offset: 104)
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !108, file: !105, line: 91, baseType: !150, size: 16, offset: 112)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !105, line: 91, size: 16, elements: !151)
!151 = !{!152, !159}
!152 = !DIDerivedType(tag: DW_TAG_member, scope: !150, file: !105, line: 92, baseType: !153, size: 16)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !150, file: !105, line: 92, size: 16, elements: !154)
!154 = !{!155, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !153, file: !105, line: 97, baseType: !156, size: 8)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !89, line: 56, baseType: !157)
!157 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !153, file: !105, line: 98, baseType: !147, size: 8, offset: 8)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !150, file: !105, line: 101, baseType: !160, size: 16)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !89, line: 63, baseType: !161)
!161 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !108, file: !105, line: 108, baseType: !88, size: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !108, file: !105, line: 132, baseType: !164, size: 32, offset: 160)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !108, file: !105, line: 136, baseType: !166, size: 192, offset: 192)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !141, line: 254, size: 192, elements: !167)
!167 = !{!168, !169, !175}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !166, file: !141, line: 255, baseType: !114, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !166, file: !141, line: 256, baseType: !170, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !141, line: 252, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !166, file: !141, line: 259, baseType: !176, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !89, line: 59, baseType: !177)
!177 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !104, file: !105, line: 255, baseType: !179, size: 288, offset: 384)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !180, line: 25, size: 288, elements: !181)
!180 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!181 = !{!182, !183, !184, !185, !186, !187, !188, !189, !190}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !179, file: !180, line: 26, baseType: !88, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !179, file: !180, line: 27, baseType: !88, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !179, file: !180, line: 28, baseType: !88, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !179, file: !180, line: 29, baseType: !88, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !179, file: !180, line: 30, baseType: !88, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !179, file: !180, line: 31, baseType: !88, size: 32, offset: 160)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !179, file: !180, line: 32, baseType: !88, size: 32, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !179, file: !180, line: 33, baseType: !88, size: 32, offset: 224)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !179, file: !180, line: 34, baseType: !88, size: 32, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !104, file: !105, line: 258, baseType: !164, size: 32, offset: 672)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !104, file: !105, line: 261, baseType: !140, size: 64, offset: 704)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !104, file: !105, line: 302, baseType: !87, size: 32, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !104, file: !105, line: 333, baseType: !195, size: 32, offset: 800)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !197, line: 5291, size: 160, elements: !198)
!197 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!198 = !{!199, !210, !211}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !196, file: !197, line: 5292, baseType: !200, size: 96)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !201, line: 56, size: 96, elements: !202)
!201 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!202 = !{!203, !206, !207}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !200, file: !201, line: 57, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !201, line: 57, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !200, file: !201, line: 58, baseType: !164, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !200, file: !201, line: 59, baseType: !208, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !209, line: 53, baseType: !90)
!209 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdio.h", directory: "")
!210 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !196, file: !197, line: 5293, baseType: !140, size: 64, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !196, file: !197, line: 5294, baseType: !212, offset: 160)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !213, line: 45, elements: !214)
!213 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!214 = !{}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !104, file: !105, line: 355, baseType: !216, size: 64, offset: 832)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !180, line: 60, size: 64, elements: !217)
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !216, file: !180, line: 63, baseType: !88, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !216, file: !180, line: 66, baseType: !88, size: 32, offset: 32)
!220 = !{!221, !222}
!221 = !DILocalVariable(name: "object", arg: 1, scope: !98, file: !4, line: 223, type: !101)
!222 = !DILocalVariable(name: "thread", arg: 2, scope: !98, file: !4, line: 224, type: !103)
!223 = !DILocation(line: 223, column: 61, scope: !98)
!224 = !DILocation(line: 224, column: 24, scope: !98)
!225 = !DILocation(line: 226, column: 9, scope: !98)
!226 = !DILocation(line: 227, column: 9, scope: !98)
!227 = !DILocation(line: 228, column: 1, scope: !98)
!228 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !4, file: !4, line: 243, type: !229, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !231)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !101}
!231 = !{!232}
!232 = !DILocalVariable(name: "object", arg: 1, scope: !228, file: !4, line: 243, type: !101)
!233 = !DILocation(line: 243, column: 56, scope: !228)
!234 = !DILocation(line: 245, column: 9, scope: !228)
!235 = !DILocation(line: 246, column: 1, scope: !228)
!236 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !4, file: !4, line: 359, type: !237, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !239)
!237 = !DISubroutineType(types: !238)
!238 = !{!164, !3}
!239 = !{!240}
!240 = !DILocalVariable(name: "otype", arg: 1, scope: !236, file: !4, line: 359, type: !3)
!241 = !DILocation(line: 359, column: 58, scope: !236)
!242 = !DILocation(line: 361, column: 9, scope: !236)
!243 = !DILocation(line: 363, column: 2, scope: !236)
!244 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !4, file: !4, line: 366, type: !245, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !247)
!245 = !DISubroutineType(types: !246)
!246 = !{!164, !3, !208}
!247 = !{!248, !249}
!248 = !DILocalVariable(name: "otype", arg: 1, scope: !244, file: !4, line: 366, type: !3)
!249 = !DILocalVariable(name: "size", arg: 2, scope: !244, file: !4, line: 367, type: !208)
!250 = !DILocation(line: 366, column: 63, scope: !244)
!251 = !DILocation(line: 367, column: 13, scope: !244)
!252 = !DILocation(line: 369, column: 9, scope: !244)
!253 = !DILocation(line: 370, column: 9, scope: !244)
!254 = !DILocation(line: 372, column: 2, scope: !244)
!255 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !197, file: !197, line: 656, type: !256, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !262)
!256 = !DISubroutineType(types: !257)
!257 = !{!258, !260}
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !259, line: 46, baseType: !176)
!259 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!262 = !{!263}
!263 = !DILocalVariable(name: "t", arg: 1, scope: !255, file: !197, line: 657, type: !260)
!264 = !DILocation(line: 657, column: 30, scope: !255)
!265 = !DILocation(line: 659, column: 28, scope: !255)
!266 = !DILocation(line: 659, column: 31, scope: !255)
!267 = !DILocation(line: 659, column: 36, scope: !255)
!268 = !DILocation(line: 659, column: 9, scope: !255)
!269 = !DILocation(line: 659, column: 2, scope: !255)
!270 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !197, file: !197, line: 671, type: !256, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !271)
!271 = !{!272}
!272 = !DILocalVariable(name: "t", arg: 1, scope: !270, file: !197, line: 672, type: !260)
!273 = !DILocation(line: 672, column: 30, scope: !270)
!274 = !DILocation(line: 674, column: 30, scope: !270)
!275 = !DILocation(line: 674, column: 33, scope: !270)
!276 = !DILocation(line: 674, column: 38, scope: !270)
!277 = !DILocation(line: 674, column: 9, scope: !270)
!278 = !DILocation(line: 674, column: 2, scope: !270)
!279 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !197, file: !197, line: 1634, type: !280, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !301)
!280 = !DISubroutineType(types: !281)
!281 = !{!258, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !197, line: 1439, size: 448, elements: !285)
!285 = !{!286, !287, !288, !293, !294, !299, !300}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !284, file: !197, line: 1445, baseType: !166, size: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !284, file: !197, line: 1448, baseType: !140, size: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !284, file: !197, line: 1451, baseType: !289, size: 32, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !284, file: !197, line: 1454, baseType: !289, size: 32, offset: 288)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !284, file: !197, line: 1457, baseType: !295, size: 64, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !259, line: 67, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !259, line: 65, size: 64, elements: !297)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !296, file: !259, line: 66, baseType: !258, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !284, file: !197, line: 1460, baseType: !88, size: 32, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !284, file: !197, line: 1463, baseType: !164, size: 32, offset: 416)
!301 = !{!302}
!302 = !DILocalVariable(name: "timer", arg: 1, scope: !279, file: !197, line: 1635, type: !282)
!303 = !DILocation(line: 1635, column: 34, scope: !279)
!304 = !DILocation(line: 1637, column: 28, scope: !279)
!305 = !DILocation(line: 1637, column: 35, scope: !279)
!306 = !DILocation(line: 1637, column: 9, scope: !279)
!307 = !DILocation(line: 1637, column: 2, scope: !279)
!308 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !197, file: !197, line: 1649, type: !280, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !309)
!309 = !{!310}
!310 = !DILocalVariable(name: "timer", arg: 1, scope: !308, file: !197, line: 1650, type: !282)
!311 = !DILocation(line: 1650, column: 34, scope: !308)
!312 = !DILocation(line: 1652, column: 30, scope: !308)
!313 = !DILocation(line: 1652, column: 37, scope: !308)
!314 = !DILocation(line: 1652, column: 9, scope: !308)
!315 = !DILocation(line: 1652, column: 2, scope: !308)
!316 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !197, file: !197, line: 1689, type: !317, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !319)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !292, !164}
!319 = !{!320, !321}
!320 = !DILocalVariable(name: "timer", arg: 1, scope: !316, file: !197, line: 1689, type: !292)
!321 = !DILocalVariable(name: "user_data", arg: 2, scope: !316, file: !197, line: 1690, type: !164)
!322 = !DILocation(line: 1689, column: 65, scope: !316)
!323 = !DILocation(line: 1690, column: 19, scope: !316)
!324 = !DILocation(line: 1692, column: 21, scope: !316)
!325 = !DILocation(line: 1692, column: 2, scope: !316)
!326 = !DILocation(line: 1692, column: 9, scope: !316)
!327 = !DILocation(line: 1692, column: 19, scope: !316)
!328 = !DILocation(line: 1693, column: 1, scope: !316)
!329 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !197, file: !197, line: 1704, type: !330, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !332)
!330 = !DISubroutineType(types: !331)
!331 = !{!164, !282}
!332 = !{!333}
!333 = !DILocalVariable(name: "timer", arg: 1, scope: !329, file: !197, line: 1704, type: !282)
!334 = !DILocation(line: 1704, column: 72, scope: !329)
!335 = !DILocation(line: 1706, column: 9, scope: !329)
!336 = !DILocation(line: 1706, column: 16, scope: !329)
!337 = !DILocation(line: 1706, column: 2, scope: !329)
!338 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !197, file: !197, line: 2071, type: !339, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !359)
!339 = !DISubroutineType(types: !340)
!340 = !{!87, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !197, line: 1830, size: 128, elements: !343)
!343 = !{!344, !357, !358}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !342, file: !197, line: 1831, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !346, line: 60, baseType: !347)
!346 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !346, line: 53, size: 64, elements: !348)
!348 = !{!349, !356}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !347, file: !346, line: 54, baseType: !350, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !346, line: 50, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !346, line: 44, size: 32, elements: !353)
!353 = !{!354}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !352, file: !346, line: 45, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !346, line: 40, baseType: !88)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !347, file: !346, line: 55, baseType: !350, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !342, file: !197, line: 1832, baseType: !212, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !342, file: !197, line: 1833, baseType: !140, size: 64, offset: 64)
!359 = !{!360}
!360 = !DILocalVariable(name: "queue", arg: 1, scope: !338, file: !197, line: 2071, type: !341)
!361 = !DILocation(line: 2071, column: 59, scope: !338)
!362 = !DILocation(line: 2073, column: 35, scope: !338)
!363 = !DILocation(line: 2073, column: 42, scope: !338)
!364 = !DILocation(line: 2073, column: 14, scope: !338)
!365 = !DILocation(line: 2073, column: 9, scope: !338)
!366 = !DILocation(line: 2073, column: 2, scope: !338)
!367 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !197, file: !197, line: 3209, type: !368, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !376)
!368 = !DISubroutineType(types: !369)
!369 = !{!90, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !197, line: 3092, size: 128, elements: !372)
!372 = !{!373, !374, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !371, file: !197, line: 3093, baseType: !140, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !371, file: !197, line: 3094, baseType: !90, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !371, file: !197, line: 3095, baseType: !90, size: 32, offset: 96)
!376 = !{!377}
!377 = !DILocalVariable(name: "sem", arg: 1, scope: !367, file: !197, line: 3209, type: !370)
!378 = !DILocation(line: 3209, column: 65, scope: !367)
!379 = !DILocation(line: 3211, column: 9, scope: !367)
!380 = !DILocation(line: 3211, column: 14, scope: !367)
!381 = !DILocation(line: 3211, column: 2, scope: !367)
!382 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !197, file: !197, line: 4649, type: !383, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !400)
!383 = !DISubroutineType(types: !384)
!384 = !{!88, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !197, line: 4390, size: 320, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !395, !396, !397, !398, !399}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !386, file: !197, line: 4392, baseType: !140, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !386, file: !197, line: 4394, baseType: !212, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !386, file: !197, line: 4396, baseType: !208, size: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !386, file: !197, line: 4398, baseType: !88, size: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !386, file: !197, line: 4400, baseType: !393, size: 32, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !386, file: !197, line: 4402, baseType: !393, size: 32, offset: 160)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !386, file: !197, line: 4404, baseType: !393, size: 32, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !386, file: !197, line: 4406, baseType: !393, size: 32, offset: 224)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !386, file: !197, line: 4408, baseType: !88, size: 32, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !386, file: !197, line: 4413, baseType: !147, size: 8, offset: 288)
!400 = !{!401}
!401 = !DILocalVariable(name: "msgq", arg: 1, scope: !382, file: !197, line: 4649, type: !385)
!402 = !DILocation(line: 4649, column: 66, scope: !382)
!403 = !DILocation(line: 4651, column: 9, scope: !382)
!404 = !DILocation(line: 4651, column: 15, scope: !382)
!405 = !DILocation(line: 4651, column: 26, scope: !382)
!406 = !DILocation(line: 4651, column: 32, scope: !382)
!407 = !DILocation(line: 4651, column: 24, scope: !382)
!408 = !DILocation(line: 4651, column: 2, scope: !382)
!409 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !197, file: !197, line: 4665, type: !383, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !410)
!410 = !{!411}
!411 = !DILocalVariable(name: "msgq", arg: 1, scope: !409, file: !197, line: 4665, type: !385)
!412 = !DILocation(line: 4665, column: 66, scope: !409)
!413 = !DILocation(line: 4667, column: 9, scope: !409)
!414 = !DILocation(line: 4667, column: 15, scope: !409)
!415 = !DILocation(line: 4667, column: 2, scope: !409)
!416 = distinct !DISubprogram(name: "sys_bitarray_set_bit", scope: !417, file: !417, line: 213, type: !418, scopeLine: 214, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !430)
!417 = !DIFile(filename: "lib/os/bitarray.c", directory: "/home/sri/zephyrproject/zephyr")
!418 = !DISubroutineType(types: !419)
!419 = !{!87, !420, !208}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_bitarray_t", file: !422, line: 48, baseType: !423)
!422 = !DIFile(filename: "include/zephyr/sys/bitarray.h", directory: "/home/sri/zephyrproject/zephyr")
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_bitarray", file: !422, line: 32, size: 96, elements: !424)
!424 = !{!425, !426, !427, !429}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "num_bits", scope: !423, file: !422, line: 34, baseType: !88, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "num_bundles", scope: !423, file: !422, line: 37, baseType: !88, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "bundles", scope: !423, file: !422, line: 40, baseType: !428, size: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !423, file: !422, line: 43, baseType: !212, offset: 96)
!430 = !{!431, !432, !433, !438, !439, !440, !441}
!431 = !DILocalVariable(name: "bitarray", arg: 1, scope: !416, file: !417, line: 213, type: !420)
!432 = !DILocalVariable(name: "bit", arg: 2, scope: !416, file: !417, line: 213, type: !208)
!433 = !DILocalVariable(name: "key", scope: !416, file: !417, line: 215, type: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !213, line: 108, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !213, line: 34, size: 32, elements: !436)
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !435, file: !213, line: 35, baseType: !87, size: 32)
!438 = !DILocalVariable(name: "ret", scope: !416, file: !417, line: 216, type: !87)
!439 = !DILocalVariable(name: "idx", scope: !416, file: !417, line: 217, type: !208)
!440 = !DILocalVariable(name: "off", scope: !416, file: !417, line: 217, type: !208)
!441 = !DILabel(scope: !416, name: "out", file: !417, line: 236)
!442 = !DILocation(line: 213, column: 42, scope: !416)
!443 = !DILocation(line: 213, column: 59, scope: !416)
!444 = !DILocation(line: 215, column: 2, scope: !416)
!445 = !DILocation(line: 215, column: 19, scope: !416)
!446 = !DILocation(line: 216, column: 2, scope: !416)
!447 = !DILocation(line: 216, column: 6, scope: !416)
!448 = !DILocation(line: 217, column: 2, scope: !416)
!449 = !DILocation(line: 217, column: 9, scope: !416)
!450 = !DILocation(line: 217, column: 14, scope: !416)
!451 = !DILocation(line: 219, column: 8, scope: !416)
!452 = !DILocation(line: 219, column: 21, scope: !416)
!453 = !DILocation(line: 219, column: 31, scope: !416)
!454 = !DILocalVariable(name: "l", arg: 1, scope: !455, file: !213, line: 160, type: !458)
!455 = distinct !DISubprogram(name: "k_spin_lock", scope: !213, file: !213, line: 160, type: !456, scopeLine: 161, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !459)
!456 = !DISubroutineType(types: !457)
!457 = !{!434, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!459 = !{!454, !460}
!460 = !DILocalVariable(name: "k", scope: !455, file: !213, line: 163, type: !434)
!461 = !DILocation(line: 160, column: 94, scope: !455, inlinedAt: !462)
!462 = distinct !DILocation(line: 219, column: 8, scope: !416)
!463 = !DILocation(line: 162, column: 9, scope: !455, inlinedAt: !462)
!464 = !DILocation(line: 163, column: 19, scope: !455, inlinedAt: !462)
!465 = !DILocation(line: 44, column: 2, scope: !466, inlinedAt: !472)
!466 = distinct !DISubprogram(name: "arch_irq_lock", scope: !467, file: !467, line: 42, type: !468, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !470)
!467 = !DIFile(filename: "include/zephyr/arch/arm/asm_inline_gcc.h", directory: "/home/sri/zephyrproject/zephyr")
!468 = !DISubroutineType(types: !469)
!469 = !{!90}
!470 = !{!471}
!471 = !DILocalVariable(name: "key", scope: !466, file: !467, line: 44, type: !90)
!472 = distinct !DILocation(line: 169, column: 10, scope: !455, inlinedAt: !462)
!473 = !DILocation(line: 44, column: 15, scope: !466, inlinedAt: !472)
!474 = !DILocation(line: 48, column: 2, scope: !466, inlinedAt: !472)
!475 = !{i64 82286}
!476 = !DILocation(line: 80, column: 9, scope: !466, inlinedAt: !472)
!477 = !DILocation(line: 81, column: 1, scope: !466, inlinedAt: !472)
!478 = !DILocation(line: 169, column: 8, scope: !455, inlinedAt: !462)
!479 = !DILocation(line: 171, column: 26, scope: !455, inlinedAt: !462)
!480 = !DILocalVariable(name: "l", arg: 1, scope: !481, file: !213, line: 110, type: !458)
!481 = distinct !DISubprogram(name: "z_spinlock_validate_pre", scope: !213, file: !213, line: 110, type: !482, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !484)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !458}
!484 = !{!480}
!485 = !DILocation(line: 110, column: 94, scope: !481, inlinedAt: !486)
!486 = distinct !DILocation(line: 171, column: 2, scope: !455, inlinedAt: !462)
!487 = !DILocation(line: 112, column: 9, scope: !481, inlinedAt: !486)
!488 = !DILocation(line: 177, column: 27, scope: !455, inlinedAt: !462)
!489 = !DILocalVariable(name: "l", arg: 1, scope: !490, file: !213, line: 121, type: !458)
!490 = distinct !DISubprogram(name: "z_spinlock_validate_post", scope: !213, file: !213, line: 121, type: !482, scopeLine: 122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !491)
!491 = !{!489}
!492 = !DILocation(line: 121, column: 95, scope: !490, inlinedAt: !493)
!493 = distinct !DILocation(line: 177, column: 2, scope: !455, inlinedAt: !462)
!494 = !DILocation(line: 123, column: 9, scope: !490, inlinedAt: !493)
!495 = !DILocation(line: 179, column: 2, scope: !455, inlinedAt: !462)
!496 = !DILocation(line: 224, column: 6, scope: !497)
!497 = distinct !DILexicalBlock(scope: !416, file: !417, line: 224, column: 6)
!498 = !DILocation(line: 224, column: 13, scope: !497)
!499 = !DILocation(line: 224, column: 23, scope: !497)
!500 = !DILocation(line: 224, column: 10, scope: !497)
!501 = !DILocation(line: 224, column: 6, scope: !416)
!502 = !DILocation(line: 225, column: 7, scope: !503)
!503 = distinct !DILexicalBlock(scope: !497, file: !417, line: 224, column: 33)
!504 = !DILocation(line: 226, column: 3, scope: !503)
!505 = !DILocation(line: 229, column: 8, scope: !416)
!506 = !DILocation(line: 229, column: 12, scope: !416)
!507 = !DILocation(line: 229, column: 6, scope: !416)
!508 = !DILocation(line: 230, column: 8, scope: !416)
!509 = !DILocation(line: 230, column: 12, scope: !416)
!510 = !DILocation(line: 230, column: 6, scope: !416)
!511 = !DILocation(line: 232, column: 37, scope: !416)
!512 = !DILocation(line: 232, column: 33, scope: !416)
!513 = !DILocation(line: 232, column: 2, scope: !416)
!514 = !DILocation(line: 232, column: 12, scope: !416)
!515 = !DILocation(line: 232, column: 20, scope: !416)
!516 = !DILocation(line: 232, column: 25, scope: !416)
!517 = !DILocation(line: 234, column: 6, scope: !416)
!518 = !DILocation(line: 234, column: 2, scope: !416)
!519 = !DILocation(line: 236, column: 1, scope: !416)
!520 = !DILocation(line: 237, column: 17, scope: !416)
!521 = !DILocation(line: 237, column: 27, scope: !416)
!522 = !DILocation(line: 237, column: 2, scope: !416)
!523 = !DILocalVariable(name: "l", arg: 1, scope: !524, file: !213, line: 235, type: !458)
!524 = distinct !DISubprogram(name: "k_spin_unlock", scope: !213, file: !213, line: 235, type: !525, scopeLine: 237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !527)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !458, !434}
!527 = !{!523, !528}
!528 = !DILocalVariable(name: "key", arg: 2, scope: !524, file: !213, line: 236, type: !434)
!529 = !DILocation(line: 235, column: 84, scope: !524, inlinedAt: !530)
!530 = distinct !DILocation(line: 237, column: 2, scope: !416)
!531 = !DILocation(line: 236, column: 23, scope: !524, inlinedAt: !530)
!532 = !DILocation(line: 238, column: 9, scope: !524, inlinedAt: !530)
!533 = !DILocation(line: 261, column: 22, scope: !524, inlinedAt: !530)
!534 = !DILocalVariable(name: "key", arg: 1, scope: !535, file: !467, line: 88, type: !90)
!535 = distinct !DISubprogram(name: "arch_irq_unlock", scope: !467, file: !467, line: 88, type: !536, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !538)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !90}
!538 = !{!534}
!539 = !DILocation(line: 88, column: 80, scope: !535, inlinedAt: !540)
!540 = distinct !DILocation(line: 261, column: 2, scope: !524, inlinedAt: !530)
!541 = !DILocation(line: 91, column: 6, scope: !542, inlinedAt: !540)
!542 = distinct !DILexicalBlock(scope: !535, file: !467, line: 91, column: 6)
!543 = !DILocation(line: 91, column: 10, scope: !542, inlinedAt: !540)
!544 = !DILocation(line: 91, column: 6, scope: !535, inlinedAt: !540)
!545 = !DILocation(line: 92, column: 3, scope: !546, inlinedAt: !540)
!546 = distinct !DILexicalBlock(scope: !542, file: !467, line: 91, column: 17)
!547 = !DILocation(line: 94, column: 2, scope: !535, inlinedAt: !540)
!548 = !{i64 82590}
!549 = !DILocation(line: 114, column: 1, scope: !535, inlinedAt: !540)
!550 = !DILocation(line: 238, column: 9, scope: !416)
!551 = !DILocation(line: 239, column: 1, scope: !416)
!552 = !DILocation(line: 238, column: 2, scope: !416)
!553 = distinct !DISubprogram(name: "sys_bitarray_clear_bit", scope: !417, file: !417, line: 241, type: !418, scopeLine: 242, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561}
!555 = !DILocalVariable(name: "bitarray", arg: 1, scope: !553, file: !417, line: 241, type: !420)
!556 = !DILocalVariable(name: "bit", arg: 2, scope: !553, file: !417, line: 241, type: !208)
!557 = !DILocalVariable(name: "key", scope: !553, file: !417, line: 243, type: !434)
!558 = !DILocalVariable(name: "ret", scope: !553, file: !417, line: 244, type: !87)
!559 = !DILocalVariable(name: "idx", scope: !553, file: !417, line: 245, type: !208)
!560 = !DILocalVariable(name: "off", scope: !553, file: !417, line: 245, type: !208)
!561 = !DILabel(scope: !553, name: "out", file: !417, line: 264)
!562 = !DILocation(line: 241, column: 44, scope: !553)
!563 = !DILocation(line: 241, column: 61, scope: !553)
!564 = !DILocation(line: 243, column: 2, scope: !553)
!565 = !DILocation(line: 243, column: 19, scope: !553)
!566 = !DILocation(line: 244, column: 2, scope: !553)
!567 = !DILocation(line: 244, column: 6, scope: !553)
!568 = !DILocation(line: 245, column: 2, scope: !553)
!569 = !DILocation(line: 245, column: 9, scope: !553)
!570 = !DILocation(line: 245, column: 14, scope: !553)
!571 = !DILocation(line: 250, column: 8, scope: !553)
!572 = !DILocation(line: 250, column: 21, scope: !553)
!573 = !DILocation(line: 250, column: 31, scope: !553)
!574 = !DILocation(line: 160, column: 94, scope: !455, inlinedAt: !575)
!575 = distinct !DILocation(line: 250, column: 8, scope: !553)
!576 = !DILocation(line: 162, column: 9, scope: !455, inlinedAt: !575)
!577 = !DILocation(line: 163, column: 19, scope: !455, inlinedAt: !575)
!578 = !DILocation(line: 44, column: 2, scope: !466, inlinedAt: !579)
!579 = distinct !DILocation(line: 169, column: 10, scope: !455, inlinedAt: !575)
!580 = !DILocation(line: 44, column: 15, scope: !466, inlinedAt: !579)
!581 = !DILocation(line: 48, column: 2, scope: !466, inlinedAt: !579)
!582 = !DILocation(line: 80, column: 9, scope: !466, inlinedAt: !579)
!583 = !DILocation(line: 81, column: 1, scope: !466, inlinedAt: !579)
!584 = !DILocation(line: 169, column: 8, scope: !455, inlinedAt: !575)
!585 = !DILocation(line: 171, column: 26, scope: !455, inlinedAt: !575)
!586 = !DILocation(line: 110, column: 94, scope: !481, inlinedAt: !587)
!587 = distinct !DILocation(line: 171, column: 2, scope: !455, inlinedAt: !575)
!588 = !DILocation(line: 112, column: 9, scope: !481, inlinedAt: !587)
!589 = !DILocation(line: 177, column: 27, scope: !455, inlinedAt: !575)
!590 = !DILocation(line: 121, column: 95, scope: !490, inlinedAt: !591)
!591 = distinct !DILocation(line: 177, column: 2, scope: !455, inlinedAt: !575)
!592 = !DILocation(line: 123, column: 9, scope: !490, inlinedAt: !591)
!593 = !DILocation(line: 179, column: 2, scope: !455, inlinedAt: !575)
!594 = !DILocation(line: 252, column: 6, scope: !595)
!595 = distinct !DILexicalBlock(scope: !553, file: !417, line: 252, column: 6)
!596 = !DILocation(line: 252, column: 13, scope: !595)
!597 = !DILocation(line: 252, column: 23, scope: !595)
!598 = !DILocation(line: 252, column: 10, scope: !595)
!599 = !DILocation(line: 252, column: 6, scope: !553)
!600 = !DILocation(line: 253, column: 7, scope: !601)
!601 = distinct !DILexicalBlock(scope: !595, file: !417, line: 252, column: 33)
!602 = !DILocation(line: 254, column: 3, scope: !601)
!603 = !DILocation(line: 257, column: 8, scope: !553)
!604 = !DILocation(line: 257, column: 12, scope: !553)
!605 = !DILocation(line: 257, column: 6, scope: !553)
!606 = !DILocation(line: 258, column: 8, scope: !553)
!607 = !DILocation(line: 258, column: 12, scope: !553)
!608 = !DILocation(line: 258, column: 6, scope: !553)
!609 = !DILocation(line: 260, column: 38, scope: !553)
!610 = !DILocation(line: 260, column: 34, scope: !553)
!611 = !DILocation(line: 260, column: 28, scope: !553)
!612 = !DILocation(line: 260, column: 2, scope: !553)
!613 = !DILocation(line: 260, column: 12, scope: !553)
!614 = !DILocation(line: 260, column: 20, scope: !553)
!615 = !DILocation(line: 260, column: 25, scope: !553)
!616 = !DILocation(line: 262, column: 6, scope: !553)
!617 = !DILocation(line: 262, column: 2, scope: !553)
!618 = !DILocation(line: 264, column: 1, scope: !553)
!619 = !DILocation(line: 265, column: 17, scope: !553)
!620 = !DILocation(line: 265, column: 27, scope: !553)
!621 = !DILocation(line: 265, column: 2, scope: !553)
!622 = !DILocation(line: 235, column: 84, scope: !524, inlinedAt: !623)
!623 = distinct !DILocation(line: 265, column: 2, scope: !553)
!624 = !DILocation(line: 236, column: 23, scope: !524, inlinedAt: !623)
!625 = !DILocation(line: 238, column: 9, scope: !524, inlinedAt: !623)
!626 = !DILocation(line: 261, column: 22, scope: !524, inlinedAt: !623)
!627 = !DILocation(line: 88, column: 80, scope: !535, inlinedAt: !628)
!628 = distinct !DILocation(line: 261, column: 2, scope: !524, inlinedAt: !623)
!629 = !DILocation(line: 91, column: 6, scope: !542, inlinedAt: !628)
!630 = !DILocation(line: 91, column: 10, scope: !542, inlinedAt: !628)
!631 = !DILocation(line: 91, column: 6, scope: !535, inlinedAt: !628)
!632 = !DILocation(line: 92, column: 3, scope: !546, inlinedAt: !628)
!633 = !DILocation(line: 94, column: 2, scope: !535, inlinedAt: !628)
!634 = !DILocation(line: 114, column: 1, scope: !535, inlinedAt: !628)
!635 = !DILocation(line: 266, column: 9, scope: !553)
!636 = !DILocation(line: 267, column: 1, scope: !553)
!637 = !DILocation(line: 266, column: 2, scope: !553)
!638 = distinct !DISubprogram(name: "sys_bitarray_test_bit", scope: !417, file: !417, line: 269, type: !639, scopeLine: 270, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !642)
!639 = !DISubroutineType(types: !640)
!640 = !{!87, !420, !208, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 32)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650}
!643 = !DILocalVariable(name: "bitarray", arg: 1, scope: !638, file: !417, line: 269, type: !420)
!644 = !DILocalVariable(name: "bit", arg: 2, scope: !638, file: !417, line: 269, type: !208)
!645 = !DILocalVariable(name: "val", arg: 3, scope: !638, file: !417, line: 269, type: !641)
!646 = !DILocalVariable(name: "key", scope: !638, file: !417, line: 271, type: !434)
!647 = !DILocalVariable(name: "ret", scope: !638, file: !417, line: 272, type: !87)
!648 = !DILocalVariable(name: "idx", scope: !638, file: !417, line: 273, type: !208)
!649 = !DILocalVariable(name: "off", scope: !638, file: !417, line: 273, type: !208)
!650 = !DILabel(scope: !638, name: "out", file: !417, line: 301)
!651 = !DILocation(line: 269, column: 43, scope: !638)
!652 = !DILocation(line: 269, column: 60, scope: !638)
!653 = !DILocation(line: 269, column: 70, scope: !638)
!654 = !DILocation(line: 271, column: 2, scope: !638)
!655 = !DILocation(line: 271, column: 19, scope: !638)
!656 = !DILocation(line: 272, column: 2, scope: !638)
!657 = !DILocation(line: 272, column: 6, scope: !638)
!658 = !DILocation(line: 273, column: 2, scope: !638)
!659 = !DILocation(line: 273, column: 9, scope: !638)
!660 = !DILocation(line: 273, column: 14, scope: !638)
!661 = !DILocation(line: 278, column: 8, scope: !638)
!662 = !DILocation(line: 278, column: 21, scope: !638)
!663 = !DILocation(line: 278, column: 31, scope: !638)
!664 = !DILocation(line: 160, column: 94, scope: !455, inlinedAt: !665)
!665 = distinct !DILocation(line: 278, column: 8, scope: !638)
!666 = !DILocation(line: 162, column: 9, scope: !455, inlinedAt: !665)
!667 = !DILocation(line: 163, column: 19, scope: !455, inlinedAt: !665)
!668 = !DILocation(line: 44, column: 2, scope: !466, inlinedAt: !669)
!669 = distinct !DILocation(line: 169, column: 10, scope: !455, inlinedAt: !665)
!670 = !DILocation(line: 44, column: 15, scope: !466, inlinedAt: !669)
!671 = !DILocation(line: 48, column: 2, scope: !466, inlinedAt: !669)
!672 = !DILocation(line: 80, column: 9, scope: !466, inlinedAt: !669)
!673 = !DILocation(line: 81, column: 1, scope: !466, inlinedAt: !669)
!674 = !DILocation(line: 169, column: 8, scope: !455, inlinedAt: !665)
!675 = !DILocation(line: 171, column: 26, scope: !455, inlinedAt: !665)
!676 = !DILocation(line: 110, column: 94, scope: !481, inlinedAt: !677)
!677 = distinct !DILocation(line: 171, column: 2, scope: !455, inlinedAt: !665)
!678 = !DILocation(line: 112, column: 9, scope: !481, inlinedAt: !677)
!679 = !DILocation(line: 177, column: 27, scope: !455, inlinedAt: !665)
!680 = !DILocation(line: 121, column: 95, scope: !490, inlinedAt: !681)
!681 = distinct !DILocation(line: 177, column: 2, scope: !455, inlinedAt: !665)
!682 = !DILocation(line: 123, column: 9, scope: !490, inlinedAt: !681)
!683 = !DILocation(line: 179, column: 2, scope: !455, inlinedAt: !665)
!684 = !DILocation(line: 280, column: 6, scope: !685)
!685 = distinct !DILexicalBlock(scope: !638, file: !417, line: 280, column: 6)
!686 = !DILocation(line: 280, column: 10, scope: !685)
!687 = !DILocation(line: 280, column: 6, scope: !638)
!688 = !DILocation(line: 281, column: 7, scope: !689)
!689 = distinct !DILexicalBlock(scope: !685, file: !417, line: 280, column: 16)
!690 = !DILocation(line: 282, column: 3, scope: !689)
!691 = !DILocation(line: 285, column: 6, scope: !692)
!692 = distinct !DILexicalBlock(scope: !638, file: !417, line: 285, column: 6)
!693 = !DILocation(line: 285, column: 13, scope: !692)
!694 = !DILocation(line: 285, column: 23, scope: !692)
!695 = !DILocation(line: 285, column: 10, scope: !692)
!696 = !DILocation(line: 285, column: 6, scope: !638)
!697 = !DILocation(line: 286, column: 7, scope: !698)
!698 = distinct !DILexicalBlock(scope: !692, file: !417, line: 285, column: 33)
!699 = !DILocation(line: 287, column: 3, scope: !698)
!700 = !DILocation(line: 290, column: 8, scope: !638)
!701 = !DILocation(line: 290, column: 12, scope: !638)
!702 = !DILocation(line: 290, column: 6, scope: !638)
!703 = !DILocation(line: 291, column: 8, scope: !638)
!704 = !DILocation(line: 291, column: 12, scope: !638)
!705 = !DILocation(line: 291, column: 6, scope: !638)
!706 = !DILocation(line: 293, column: 7, scope: !707)
!707 = distinct !DILexicalBlock(scope: !638, file: !417, line: 293, column: 6)
!708 = !DILocation(line: 293, column: 17, scope: !707)
!709 = !DILocation(line: 293, column: 25, scope: !707)
!710 = !DILocation(line: 293, column: 41, scope: !707)
!711 = !DILocation(line: 293, column: 37, scope: !707)
!712 = !DILocation(line: 293, column: 30, scope: !707)
!713 = !DILocation(line: 293, column: 48, scope: !707)
!714 = !DILocation(line: 293, column: 6, scope: !638)
!715 = !DILocation(line: 294, column: 4, scope: !716)
!716 = distinct !DILexicalBlock(scope: !707, file: !417, line: 293, column: 54)
!717 = !DILocation(line: 294, column: 8, scope: !716)
!718 = !DILocation(line: 295, column: 2, scope: !716)
!719 = !DILocation(line: 296, column: 4, scope: !720)
!720 = distinct !DILexicalBlock(scope: !707, file: !417, line: 295, column: 9)
!721 = !DILocation(line: 296, column: 8, scope: !720)
!722 = !DILocation(line: 299, column: 6, scope: !638)
!723 = !DILocation(line: 299, column: 2, scope: !638)
!724 = !DILocation(line: 301, column: 1, scope: !638)
!725 = !DILocation(line: 302, column: 17, scope: !638)
!726 = !DILocation(line: 302, column: 27, scope: !638)
!727 = !DILocation(line: 302, column: 2, scope: !638)
!728 = !DILocation(line: 235, column: 84, scope: !524, inlinedAt: !729)
!729 = distinct !DILocation(line: 302, column: 2, scope: !638)
!730 = !DILocation(line: 236, column: 23, scope: !524, inlinedAt: !729)
!731 = !DILocation(line: 238, column: 9, scope: !524, inlinedAt: !729)
!732 = !DILocation(line: 261, column: 22, scope: !524, inlinedAt: !729)
!733 = !DILocation(line: 88, column: 80, scope: !535, inlinedAt: !734)
!734 = distinct !DILocation(line: 261, column: 2, scope: !524, inlinedAt: !729)
!735 = !DILocation(line: 91, column: 6, scope: !542, inlinedAt: !734)
!736 = !DILocation(line: 91, column: 10, scope: !542, inlinedAt: !734)
!737 = !DILocation(line: 91, column: 6, scope: !535, inlinedAt: !734)
!738 = !DILocation(line: 92, column: 3, scope: !546, inlinedAt: !734)
!739 = !DILocation(line: 94, column: 2, scope: !535, inlinedAt: !734)
!740 = !DILocation(line: 114, column: 1, scope: !535, inlinedAt: !734)
!741 = !DILocation(line: 303, column: 9, scope: !638)
!742 = !DILocation(line: 304, column: 1, scope: !638)
!743 = !DILocation(line: 303, column: 2, scope: !638)
!744 = distinct !DISubprogram(name: "sys_bitarray_test_and_set_bit", scope: !417, file: !417, line: 306, type: !639, scopeLine: 307, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753}
!746 = !DILocalVariable(name: "bitarray", arg: 1, scope: !744, file: !417, line: 306, type: !420)
!747 = !DILocalVariable(name: "bit", arg: 2, scope: !744, file: !417, line: 306, type: !208)
!748 = !DILocalVariable(name: "prev_val", arg: 3, scope: !744, file: !417, line: 306, type: !641)
!749 = !DILocalVariable(name: "key", scope: !744, file: !417, line: 308, type: !434)
!750 = !DILocalVariable(name: "ret", scope: !744, file: !417, line: 309, type: !87)
!751 = !DILocalVariable(name: "idx", scope: !744, file: !417, line: 310, type: !208)
!752 = !DILocalVariable(name: "off", scope: !744, file: !417, line: 310, type: !208)
!753 = !DILabel(scope: !744, name: "out", file: !417, line: 340)
!754 = !DILocation(line: 306, column: 51, scope: !744)
!755 = !DILocation(line: 306, column: 68, scope: !744)
!756 = !DILocation(line: 306, column: 78, scope: !744)
!757 = !DILocation(line: 308, column: 2, scope: !744)
!758 = !DILocation(line: 308, column: 19, scope: !744)
!759 = !DILocation(line: 309, column: 2, scope: !744)
!760 = !DILocation(line: 309, column: 6, scope: !744)
!761 = !DILocation(line: 310, column: 2, scope: !744)
!762 = !DILocation(line: 310, column: 9, scope: !744)
!763 = !DILocation(line: 310, column: 14, scope: !744)
!764 = !DILocation(line: 315, column: 8, scope: !744)
!765 = !DILocation(line: 315, column: 21, scope: !744)
!766 = !DILocation(line: 315, column: 31, scope: !744)
!767 = !DILocation(line: 160, column: 94, scope: !455, inlinedAt: !768)
!768 = distinct !DILocation(line: 315, column: 8, scope: !744)
!769 = !DILocation(line: 162, column: 9, scope: !455, inlinedAt: !768)
!770 = !DILocation(line: 163, column: 19, scope: !455, inlinedAt: !768)
!771 = !DILocation(line: 44, column: 2, scope: !466, inlinedAt: !772)
!772 = distinct !DILocation(line: 169, column: 10, scope: !455, inlinedAt: !768)
!773 = !DILocation(line: 44, column: 15, scope: !466, inlinedAt: !772)
!774 = !DILocation(line: 48, column: 2, scope: !466, inlinedAt: !772)
!775 = !DILocation(line: 80, column: 9, scope: !466, inlinedAt: !772)
!776 = !DILocation(line: 81, column: 1, scope: !466, inlinedAt: !772)
!777 = !DILocation(line: 169, column: 8, scope: !455, inlinedAt: !768)
!778 = !DILocation(line: 171, column: 26, scope: !455, inlinedAt: !768)
!779 = !DILocation(line: 110, column: 94, scope: !481, inlinedAt: !780)
!780 = distinct !DILocation(line: 171, column: 2, scope: !455, inlinedAt: !768)
!781 = !DILocation(line: 112, column: 9, scope: !481, inlinedAt: !780)
!782 = !DILocation(line: 177, column: 27, scope: !455, inlinedAt: !768)
!783 = !DILocation(line: 121, column: 95, scope: !490, inlinedAt: !784)
!784 = distinct !DILocation(line: 177, column: 2, scope: !455, inlinedAt: !768)
!785 = !DILocation(line: 123, column: 9, scope: !490, inlinedAt: !784)
!786 = !DILocation(line: 179, column: 2, scope: !455, inlinedAt: !768)
!787 = !DILocation(line: 317, column: 6, scope: !788)
!788 = distinct !DILexicalBlock(scope: !744, file: !417, line: 317, column: 6)
!789 = !DILocation(line: 317, column: 15, scope: !788)
!790 = !DILocation(line: 317, column: 6, scope: !744)
!791 = !DILocation(line: 318, column: 7, scope: !792)
!792 = distinct !DILexicalBlock(scope: !788, file: !417, line: 317, column: 21)
!793 = !DILocation(line: 319, column: 3, scope: !792)
!794 = !DILocation(line: 322, column: 6, scope: !795)
!795 = distinct !DILexicalBlock(scope: !744, file: !417, line: 322, column: 6)
!796 = !DILocation(line: 322, column: 13, scope: !795)
!797 = !DILocation(line: 322, column: 23, scope: !795)
!798 = !DILocation(line: 322, column: 10, scope: !795)
!799 = !DILocation(line: 322, column: 6, scope: !744)
!800 = !DILocation(line: 323, column: 7, scope: !801)
!801 = distinct !DILexicalBlock(scope: !795, file: !417, line: 322, column: 33)
!802 = !DILocation(line: 324, column: 3, scope: !801)
!803 = !DILocation(line: 327, column: 8, scope: !744)
!804 = !DILocation(line: 327, column: 12, scope: !744)
!805 = !DILocation(line: 327, column: 6, scope: !744)
!806 = !DILocation(line: 328, column: 8, scope: !744)
!807 = !DILocation(line: 328, column: 12, scope: !744)
!808 = !DILocation(line: 328, column: 6, scope: !744)
!809 = !DILocation(line: 330, column: 7, scope: !810)
!810 = distinct !DILexicalBlock(scope: !744, file: !417, line: 330, column: 6)
!811 = !DILocation(line: 330, column: 17, scope: !810)
!812 = !DILocation(line: 330, column: 25, scope: !810)
!813 = !DILocation(line: 330, column: 41, scope: !810)
!814 = !DILocation(line: 330, column: 37, scope: !810)
!815 = !DILocation(line: 330, column: 30, scope: !810)
!816 = !DILocation(line: 330, column: 48, scope: !810)
!817 = !DILocation(line: 330, column: 6, scope: !744)
!818 = !DILocation(line: 331, column: 4, scope: !819)
!819 = distinct !DILexicalBlock(scope: !810, file: !417, line: 330, column: 54)
!820 = !DILocation(line: 331, column: 13, scope: !819)
!821 = !DILocation(line: 332, column: 2, scope: !819)
!822 = !DILocation(line: 333, column: 4, scope: !823)
!823 = distinct !DILexicalBlock(scope: !810, file: !417, line: 332, column: 9)
!824 = !DILocation(line: 333, column: 13, scope: !823)
!825 = !DILocation(line: 336, column: 37, scope: !744)
!826 = !DILocation(line: 336, column: 33, scope: !744)
!827 = !DILocation(line: 336, column: 2, scope: !744)
!828 = !DILocation(line: 336, column: 12, scope: !744)
!829 = !DILocation(line: 336, column: 20, scope: !744)
!830 = !DILocation(line: 336, column: 25, scope: !744)
!831 = !DILocation(line: 338, column: 6, scope: !744)
!832 = !DILocation(line: 338, column: 2, scope: !744)
!833 = !DILocation(line: 340, column: 1, scope: !744)
!834 = !DILocation(line: 341, column: 17, scope: !744)
!835 = !DILocation(line: 341, column: 27, scope: !744)
!836 = !DILocation(line: 341, column: 2, scope: !744)
!837 = !DILocation(line: 235, column: 84, scope: !524, inlinedAt: !838)
!838 = distinct !DILocation(line: 341, column: 2, scope: !744)
!839 = !DILocation(line: 236, column: 23, scope: !524, inlinedAt: !838)
!840 = !DILocation(line: 238, column: 9, scope: !524, inlinedAt: !838)
!841 = !DILocation(line: 261, column: 22, scope: !524, inlinedAt: !838)
!842 = !DILocation(line: 88, column: 80, scope: !535, inlinedAt: !843)
!843 = distinct !DILocation(line: 261, column: 2, scope: !524, inlinedAt: !838)
!844 = !DILocation(line: 91, column: 6, scope: !542, inlinedAt: !843)
!845 = !DILocation(line: 91, column: 10, scope: !542, inlinedAt: !843)
!846 = !DILocation(line: 91, column: 6, scope: !535, inlinedAt: !843)
!847 = !DILocation(line: 92, column: 3, scope: !546, inlinedAt: !843)
!848 = !DILocation(line: 94, column: 2, scope: !535, inlinedAt: !843)
!849 = !DILocation(line: 114, column: 1, scope: !535, inlinedAt: !843)
!850 = !DILocation(line: 342, column: 9, scope: !744)
!851 = !DILocation(line: 343, column: 1, scope: !744)
!852 = !DILocation(line: 342, column: 2, scope: !744)
!853 = distinct !DISubprogram(name: "sys_bitarray_test_and_clear_bit", scope: !417, file: !417, line: 345, type: !639, scopeLine: 346, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !861, !862}
!855 = !DILocalVariable(name: "bitarray", arg: 1, scope: !853, file: !417, line: 345, type: !420)
!856 = !DILocalVariable(name: "bit", arg: 2, scope: !853, file: !417, line: 345, type: !208)
!857 = !DILocalVariable(name: "prev_val", arg: 3, scope: !853, file: !417, line: 345, type: !641)
!858 = !DILocalVariable(name: "key", scope: !853, file: !417, line: 347, type: !434)
!859 = !DILocalVariable(name: "ret", scope: !853, file: !417, line: 348, type: !87)
!860 = !DILocalVariable(name: "idx", scope: !853, file: !417, line: 349, type: !208)
!861 = !DILocalVariable(name: "off", scope: !853, file: !417, line: 349, type: !208)
!862 = !DILabel(scope: !853, name: "out", file: !417, line: 379)
!863 = !DILocation(line: 345, column: 53, scope: !853)
!864 = !DILocation(line: 345, column: 70, scope: !853)
!865 = !DILocation(line: 345, column: 80, scope: !853)
!866 = !DILocation(line: 347, column: 2, scope: !853)
!867 = !DILocation(line: 347, column: 19, scope: !853)
!868 = !DILocation(line: 348, column: 2, scope: !853)
!869 = !DILocation(line: 348, column: 6, scope: !853)
!870 = !DILocation(line: 349, column: 2, scope: !853)
!871 = !DILocation(line: 349, column: 9, scope: !853)
!872 = !DILocation(line: 349, column: 14, scope: !853)
!873 = !DILocation(line: 354, column: 8, scope: !853)
!874 = !DILocation(line: 354, column: 21, scope: !853)
!875 = !DILocation(line: 354, column: 31, scope: !853)
!876 = !DILocation(line: 160, column: 94, scope: !455, inlinedAt: !877)
!877 = distinct !DILocation(line: 354, column: 8, scope: !853)
!878 = !DILocation(line: 162, column: 9, scope: !455, inlinedAt: !877)
!879 = !DILocation(line: 163, column: 19, scope: !455, inlinedAt: !877)
!880 = !DILocation(line: 44, column: 2, scope: !466, inlinedAt: !881)
!881 = distinct !DILocation(line: 169, column: 10, scope: !455, inlinedAt: !877)
!882 = !DILocation(line: 44, column: 15, scope: !466, inlinedAt: !881)
!883 = !DILocation(line: 48, column: 2, scope: !466, inlinedAt: !881)
!884 = !DILocation(line: 80, column: 9, scope: !466, inlinedAt: !881)
!885 = !DILocation(line: 81, column: 1, scope: !466, inlinedAt: !881)
!886 = !DILocation(line: 169, column: 8, scope: !455, inlinedAt: !877)
!887 = !DILocation(line: 171, column: 26, scope: !455, inlinedAt: !877)
!888 = !DILocation(line: 110, column: 94, scope: !481, inlinedAt: !889)
!889 = distinct !DILocation(line: 171, column: 2, scope: !455, inlinedAt: !877)
!890 = !DILocation(line: 112, column: 9, scope: !481, inlinedAt: !889)
!891 = !DILocation(line: 177, column: 27, scope: !455, inlinedAt: !877)
!892 = !DILocation(line: 121, column: 95, scope: !490, inlinedAt: !893)
!893 = distinct !DILocation(line: 177, column: 2, scope: !455, inlinedAt: !877)
!894 = !DILocation(line: 123, column: 9, scope: !490, inlinedAt: !893)
!895 = !DILocation(line: 179, column: 2, scope: !455, inlinedAt: !877)
!896 = !DILocation(line: 356, column: 6, scope: !897)
!897 = distinct !DILexicalBlock(scope: !853, file: !417, line: 356, column: 6)
!898 = !DILocation(line: 356, column: 15, scope: !897)
!899 = !DILocation(line: 356, column: 6, scope: !853)
!900 = !DILocation(line: 357, column: 7, scope: !901)
!901 = distinct !DILexicalBlock(scope: !897, file: !417, line: 356, column: 21)
!902 = !DILocation(line: 358, column: 3, scope: !901)
!903 = !DILocation(line: 361, column: 6, scope: !904)
!904 = distinct !DILexicalBlock(scope: !853, file: !417, line: 361, column: 6)
!905 = !DILocation(line: 361, column: 13, scope: !904)
!906 = !DILocation(line: 361, column: 23, scope: !904)
!907 = !DILocation(line: 361, column: 10, scope: !904)
!908 = !DILocation(line: 361, column: 6, scope: !853)
!909 = !DILocation(line: 362, column: 7, scope: !910)
!910 = distinct !DILexicalBlock(scope: !904, file: !417, line: 361, column: 33)
!911 = !DILocation(line: 363, column: 3, scope: !910)
!912 = !DILocation(line: 366, column: 8, scope: !853)
!913 = !DILocation(line: 366, column: 12, scope: !853)
!914 = !DILocation(line: 366, column: 6, scope: !853)
!915 = !DILocation(line: 367, column: 8, scope: !853)
!916 = !DILocation(line: 367, column: 12, scope: !853)
!917 = !DILocation(line: 367, column: 6, scope: !853)
!918 = !DILocation(line: 369, column: 7, scope: !919)
!919 = distinct !DILexicalBlock(scope: !853, file: !417, line: 369, column: 6)
!920 = !DILocation(line: 369, column: 17, scope: !919)
!921 = !DILocation(line: 369, column: 25, scope: !919)
!922 = !DILocation(line: 369, column: 41, scope: !919)
!923 = !DILocation(line: 369, column: 37, scope: !919)
!924 = !DILocation(line: 369, column: 30, scope: !919)
!925 = !DILocation(line: 369, column: 48, scope: !919)
!926 = !DILocation(line: 369, column: 6, scope: !853)
!927 = !DILocation(line: 370, column: 4, scope: !928)
!928 = distinct !DILexicalBlock(scope: !919, file: !417, line: 369, column: 54)
!929 = !DILocation(line: 370, column: 13, scope: !928)
!930 = !DILocation(line: 371, column: 2, scope: !928)
!931 = !DILocation(line: 372, column: 4, scope: !932)
!932 = distinct !DILexicalBlock(scope: !919, file: !417, line: 371, column: 9)
!933 = !DILocation(line: 372, column: 13, scope: !932)
!934 = !DILocation(line: 375, column: 38, scope: !853)
!935 = !DILocation(line: 375, column: 34, scope: !853)
!936 = !DILocation(line: 375, column: 28, scope: !853)
!937 = !DILocation(line: 375, column: 2, scope: !853)
!938 = !DILocation(line: 375, column: 12, scope: !853)
!939 = !DILocation(line: 375, column: 20, scope: !853)
!940 = !DILocation(line: 375, column: 25, scope: !853)
!941 = !DILocation(line: 377, column: 6, scope: !853)
!942 = !DILocation(line: 377, column: 2, scope: !853)
!943 = !DILocation(line: 379, column: 1, scope: !853)
!944 = !DILocation(line: 380, column: 17, scope: !853)
!945 = !DILocation(line: 380, column: 27, scope: !853)
!946 = !DILocation(line: 380, column: 2, scope: !853)
!947 = !DILocation(line: 235, column: 84, scope: !524, inlinedAt: !948)
!948 = distinct !DILocation(line: 380, column: 2, scope: !853)
!949 = !DILocation(line: 236, column: 23, scope: !524, inlinedAt: !948)
!950 = !DILocation(line: 238, column: 9, scope: !524, inlinedAt: !948)
!951 = !DILocation(line: 261, column: 22, scope: !524, inlinedAt: !948)
!952 = !DILocation(line: 88, column: 80, scope: !535, inlinedAt: !953)
!953 = distinct !DILocation(line: 261, column: 2, scope: !524, inlinedAt: !948)
!954 = !DILocation(line: 91, column: 6, scope: !542, inlinedAt: !953)
!955 = !DILocation(line: 91, column: 10, scope: !542, inlinedAt: !953)
!956 = !DILocation(line: 91, column: 6, scope: !535, inlinedAt: !953)
!957 = !DILocation(line: 92, column: 3, scope: !546, inlinedAt: !953)
!958 = !DILocation(line: 94, column: 2, scope: !535, inlinedAt: !953)
!959 = !DILocation(line: 114, column: 1, scope: !535, inlinedAt: !953)
!960 = !DILocation(line: 381, column: 9, scope: !853)
!961 = !DILocation(line: 382, column: 1, scope: !853)
!962 = !DILocation(line: 381, column: 2, scope: !853)
!963 = distinct !DISubprogram(name: "sys_bitarray_alloc", scope: !417, file: !417, line: 384, type: !964, scopeLine: 386, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !967)
!964 = !DISubroutineType(types: !965)
!965 = !{!87, !420, !208, !966}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!967 = !{!968, !969, !970, !971, !972, !973, !974, !983, !984, !985, !986, !988}
!968 = !DILocalVariable(name: "bitarray", arg: 1, scope: !963, file: !417, line: 384, type: !420)
!969 = !DILocalVariable(name: "num_bits", arg: 2, scope: !963, file: !417, line: 384, type: !208)
!970 = !DILocalVariable(name: "offset", arg: 3, scope: !963, file: !417, line: 385, type: !966)
!971 = !DILocalVariable(name: "key", scope: !963, file: !417, line: 387, type: !434)
!972 = !DILocalVariable(name: "bit_idx", scope: !963, file: !417, line: 388, type: !88)
!973 = !DILocalVariable(name: "ret", scope: !963, file: !417, line: 389, type: !87)
!974 = !DILocalVariable(name: "bd", scope: !963, file: !417, line: 390, type: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bundle_data", file: !417, line: 18, size: 192, elements: !976)
!976 = !{!977, !978, !979, !980, !981, !982}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "sidx", scope: !975, file: !417, line: 20, baseType: !208, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "eidx", scope: !975, file: !417, line: 20, baseType: !208, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "soff", scope: !975, file: !417, line: 23, baseType: !208, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "eoff", scope: !975, file: !417, line: 23, baseType: !208, size: 32, offset: 96)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "smask", scope: !975, file: !417, line: 26, baseType: !88, size: 32, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "emask", scope: !975, file: !417, line: 26, baseType: !88, size: 32, offset: 160)
!983 = !DILocalVariable(name: "off_start", scope: !963, file: !417, line: 391, type: !208)
!984 = !DILocalVariable(name: "off_end", scope: !963, file: !417, line: 391, type: !208)
!985 = !DILocalVariable(name: "mismatch", scope: !963, file: !417, line: 392, type: !208)
!986 = !DILocalVariable(name: "idx", scope: !987, file: !417, line: 417, type: !208)
!987 = distinct !DILexicalBlock(scope: !963, file: !417, line: 417, column: 2)
!988 = !DILabel(scope: !963, name: "out", file: !417, line: 451)
!989 = !DILocation(line: 384, column: 40, scope: !963)
!990 = !DILocation(line: 384, column: 57, scope: !963)
!991 = !DILocation(line: 385, column: 18, scope: !963)
!992 = !DILocation(line: 387, column: 2, scope: !963)
!993 = !DILocation(line: 387, column: 19, scope: !963)
!994 = !DILocation(line: 388, column: 2, scope: !963)
!995 = !DILocation(line: 388, column: 11, scope: !963)
!996 = !DILocation(line: 389, column: 2, scope: !963)
!997 = !DILocation(line: 389, column: 6, scope: !963)
!998 = !DILocation(line: 390, column: 2, scope: !963)
!999 = !DILocation(line: 390, column: 21, scope: !963)
!1000 = !DILocation(line: 391, column: 2, scope: !963)
!1001 = !DILocation(line: 391, column: 9, scope: !963)
!1002 = !DILocation(line: 391, column: 20, scope: !963)
!1003 = !DILocation(line: 392, column: 2, scope: !963)
!1004 = !DILocation(line: 392, column: 9, scope: !963)
!1005 = !DILocation(line: 397, column: 8, scope: !963)
!1006 = !DILocation(line: 397, column: 21, scope: !963)
!1007 = !DILocation(line: 397, column: 31, scope: !963)
!1008 = !DILocation(line: 160, column: 94, scope: !455, inlinedAt: !1009)
!1009 = distinct !DILocation(line: 397, column: 8, scope: !963)
!1010 = !DILocation(line: 162, column: 9, scope: !455, inlinedAt: !1009)
!1011 = !DILocation(line: 163, column: 19, scope: !455, inlinedAt: !1009)
!1012 = !DILocation(line: 44, column: 2, scope: !466, inlinedAt: !1013)
!1013 = distinct !DILocation(line: 169, column: 10, scope: !455, inlinedAt: !1009)
!1014 = !DILocation(line: 44, column: 15, scope: !466, inlinedAt: !1013)
!1015 = !DILocation(line: 48, column: 2, scope: !466, inlinedAt: !1013)
!1016 = !DILocation(line: 80, column: 9, scope: !466, inlinedAt: !1013)
!1017 = !DILocation(line: 81, column: 1, scope: !466, inlinedAt: !1013)
!1018 = !DILocation(line: 169, column: 8, scope: !455, inlinedAt: !1009)
!1019 = !DILocation(line: 171, column: 26, scope: !455, inlinedAt: !1009)
!1020 = !DILocation(line: 110, column: 94, scope: !481, inlinedAt: !1021)
!1021 = distinct !DILocation(line: 171, column: 2, scope: !455, inlinedAt: !1009)
!1022 = !DILocation(line: 112, column: 9, scope: !481, inlinedAt: !1021)
!1023 = !DILocation(line: 177, column: 27, scope: !455, inlinedAt: !1009)
!1024 = !DILocation(line: 121, column: 95, scope: !490, inlinedAt: !1025)
!1025 = distinct !DILocation(line: 177, column: 2, scope: !455, inlinedAt: !1009)
!1026 = !DILocation(line: 123, column: 9, scope: !490, inlinedAt: !1025)
!1027 = !DILocation(line: 179, column: 2, scope: !455, inlinedAt: !1009)
!1028 = !DILocation(line: 399, column: 6, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !963, file: !417, line: 399, column: 6)
!1030 = !DILocation(line: 399, column: 13, scope: !1029)
!1031 = !DILocation(line: 399, column: 6, scope: !963)
!1032 = !DILocation(line: 400, column: 7, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1029, file: !417, line: 399, column: 19)
!1034 = !DILocation(line: 401, column: 3, scope: !1033)
!1035 = !DILocation(line: 404, column: 7, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !963, file: !417, line: 404, column: 6)
!1037 = !DILocation(line: 404, column: 16, scope: !1036)
!1038 = !DILocation(line: 404, column: 22, scope: !1036)
!1039 = !DILocation(line: 404, column: 26, scope: !1036)
!1040 = !DILocation(line: 404, column: 37, scope: !1036)
!1041 = !DILocation(line: 404, column: 47, scope: !1036)
