; ModuleID = '../bc_files/bitarray.bc'
source_filename = "/home/sri/zephyrproject/zephyr/lib/os/bitarray.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }
%struct.z_spinlock_key = type { i32 }
%struct.sys_bitarray = type { i32, i32, ptr, %struct.k_spinlock }
%struct.bundle_data = type { i32, i32, i32, i32, i32, i32 }

; Function Attrs: noinline nounwind optnone

!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!85 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!86 = !{!87, !88}
!87 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !89, line: 64, baseType: !90)
!89 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!90 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!91 = !{i32 7, !"Dwarf Version", i32 4}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{i32 1, !"wchar_size", i32 4}
!94 = !{i32 1, !"static_rwdata", i32 1}
!95 = !{i32 1, !"enumsize_buildattr", i32 1}
!96 = !{i32 1, !"armlib_unavailable", i32 0}
!97 = !{i32 8, !"PIC Level", i32 2}
!98 = !{i32 7, !"PIE Level", i32 2}
!99 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!100 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !4, file: !4, line: 223, type: !101, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !103, !105}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !107, line: 250, size: 896, elements: !108)
!107 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!108 = !{!109, !180, !193, !194, !195, !196, !217}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !106, file: !107, line: 252, baseType: !110, size: 384)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !107, line: 58, size: 384, elements: !111)
!111 = !{!112, !140, !148, !150, !151, !164, !165, !167}
!112 = !DIDerivedType(tag: DW_TAG_member, scope: !110, file: !107, line: 61, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !107, line: 61, size: 64, elements: !114)
!114 = !{!115, !131}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !113, file: !107, line: 62, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !117, line: 55, baseType: !118)
!117 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !117, line: 37, size: 64, elements: !119)
!119 = !{!120, !126}
!120 = !DIDerivedType(tag: DW_TAG_member, scope: !118, file: !117, line: 38, baseType: !121, size: 32)
!121 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !118, file: !117, line: 38, size: 32, elements: !122)
!122 = !{!123, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !121, file: !117, line: 39, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !117, line: 40, baseType: !124, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, scope: !118, file: !117, line: 42, baseType: !127, size: 32, offset: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !118, file: !117, line: 42, size: 32, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !127, file: !117, line: 43, baseType: !124, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !127, file: !117, line: 44, baseType: !124, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !113, file: !107, line: 63, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !133, line: 58, size: 64, elements: !134)
!133 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !132, file: !133, line: 60, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 64, elements: !138)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!138 = !{!139}
!139 = !DISubrange(count: 2)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !110, file: !107, line: 69, baseType: !141, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !143, line: 243, baseType: !144)
!143 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 241, size: 64, elements: !145)
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !144, file: !143, line: 242, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !117, line: 51, baseType: !118)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !110, file: !107, line: 72, baseType: !149, size: 8, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !89, line: 62, baseType: !5)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !110, file: !107, line: 75, baseType: !149, size: 8, offset: 104)
!151 = !DIDerivedType(tag: DW_TAG_member, scope: !110, file: !107, line: 91, baseType: !152, size: 16, offset: 112)
!152 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !107, line: 91, size: 16, elements: !153)
!153 = !{!154, !161}
!154 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !107, line: 92, baseType: !155, size: 16)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !152, file: !107, line: 92, size: 16, elements: !156)
!156 = !{!157, !160}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !155, file: !107, line: 97, baseType: !158, size: 8)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !89, line: 56, baseType: !159)
!159 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !155, file: !107, line: 98, baseType: !149, size: 8, offset: 8)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !152, file: !107, line: 101, baseType: !162, size: 16)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !89, line: 63, baseType: !163)
!163 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !110, file: !107, line: 108, baseType: !88, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !110, file: !107, line: 132, baseType: !166, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !110, file: !107, line: 136, baseType: !168, size: 192, offset: 192)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !143, line: 254, size: 192, elements: !169)
!169 = !{!170, !171, !177}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !168, file: !143, line: 255, baseType: !116, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !168, file: !143, line: 256, baseType: !172, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !143, line: 252, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !168, file: !143, line: 259, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !89, line: 59, baseType: !179)
!179 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !106, file: !107, line: 255, baseType: !181, size: 288, offset: 384)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !182, line: 25, size: 288, elements: !183)
!182 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191, !192}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !181, file: !182, line: 26, baseType: !88, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !181, file: !182, line: 27, baseType: !88, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !181, file: !182, line: 28, baseType: !88, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !181, file: !182, line: 29, baseType: !88, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !181, file: !182, line: 30, baseType: !88, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !181, file: !182, line: 31, baseType: !88, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !181, file: !182, line: 32, baseType: !88, size: 32, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !181, file: !182, line: 33, baseType: !88, size: 32, offset: 224)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !181, file: !182, line: 34, baseType: !88, size: 32, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !106, file: !107, line: 258, baseType: !166, size: 32, offset: 672)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !106, file: !107, line: 261, baseType: !142, size: 64, offset: 704)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !106, file: !107, line: 302, baseType: !87, size: 32, offset: 768)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !106, file: !107, line: 333, baseType: !197, size: 32, offset: 800)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !199, line: 5291, size: 160, elements: !200)
!199 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!200 = !{!201, !212, !213}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !198, file: !199, line: 5292, baseType: !202, size: 96)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !203, line: 56, size: 96, elements: !204)
!203 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!204 = !{!205, !208, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !202, file: !203, line: 57, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !203, line: 57, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !202, file: !203, line: 58, baseType: !166, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !202, file: !203, line: 59, baseType: !210, size: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !211, line: 53, baseType: !90)
!211 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdio.h", directory: "")
!212 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !198, file: !199, line: 5293, baseType: !142, size: 64, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !198, file: !199, line: 5294, baseType: !214, offset: 160)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !215, line: 45, elements: !216)
!215 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!216 = !{}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !106, file: !107, line: 355, baseType: !218, size: 64, offset: 832)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !182, line: 60, size: 64, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !218, file: !182, line: 63, baseType: !88, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !218, file: !182, line: 66, baseType: !88, size: 32, offset: 32)
!222 = !DILocalVariable(name: "object", arg: 1, scope: !100, file: !4, line: 223, type: !103)
!223 = !DILocation(line: 223, column: 61, scope: !100)
!224 = !DILocalVariable(name: "thread", arg: 2, scope: !100, file: !4, line: 224, type: !105)
!225 = !DILocation(line: 224, column: 24, scope: !100)
!226 = !DILocation(line: 226, column: 9, scope: !100)
!227 = !DILocation(line: 227, column: 9, scope: !100)
!228 = !DILocation(line: 228, column: 1, scope: !100)
!229 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !4, file: !4, line: 243, type: !230, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !103}
!232 = !DILocalVariable(name: "object", arg: 1, scope: !229, file: !4, line: 243, type: !103)
!233 = !DILocation(line: 243, column: 56, scope: !229)
!234 = !DILocation(line: 245, column: 9, scope: !229)
!235 = !DILocation(line: 246, column: 1, scope: !229)
!236 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !4, file: !4, line: 359, type: !237, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!237 = !DISubroutineType(types: !238)
!238 = !{!166, !3}
!239 = !DILocalVariable(name: "otype", arg: 1, scope: !236, file: !4, line: 359, type: !3)
!240 = !DILocation(line: 359, column: 58, scope: !236)
!241 = !DILocation(line: 361, column: 9, scope: !236)
!242 = !DILocation(line: 363, column: 2, scope: !236)
!243 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !4, file: !4, line: 366, type: !244, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!244 = !DISubroutineType(types: !245)
!245 = !{!166, !3, !210}
!246 = !DILocalVariable(name: "otype", arg: 1, scope: !243, file: !4, line: 366, type: !3)
!247 = !DILocation(line: 366, column: 63, scope: !243)
!248 = !DILocalVariable(name: "size", arg: 2, scope: !243, file: !4, line: 367, type: !210)
!249 = !DILocation(line: 367, column: 13, scope: !243)
!250 = !DILocation(line: 369, column: 9, scope: !243)
!251 = !DILocation(line: 370, column: 9, scope: !243)
!252 = !DILocation(line: 372, column: 2, scope: !243)
!253 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !199, file: !199, line: 656, type: !254, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!254 = !DISubroutineType(types: !255)
!255 = !{!256, !258}
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !257, line: 46, baseType: !178)
!257 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!260 = !DILocalVariable(name: "t", arg: 1, scope: !253, file: !199, line: 657, type: !258)
!261 = !DILocation(line: 657, column: 30, scope: !253)
!262 = !DILocation(line: 659, column: 28, scope: !253)
!263 = !DILocation(line: 659, column: 31, scope: !253)
!264 = !DILocation(line: 659, column: 36, scope: !253)
!265 = !DILocation(line: 659, column: 9, scope: !253)
!266 = !DILocation(line: 659, column: 2, scope: !253)
!267 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !199, file: !199, line: 671, type: !254, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!268 = !DILocalVariable(name: "t", arg: 1, scope: !267, file: !199, line: 672, type: !258)
!269 = !DILocation(line: 672, column: 30, scope: !267)
!270 = !DILocation(line: 674, column: 30, scope: !267)
!271 = !DILocation(line: 674, column: 33, scope: !267)
!272 = !DILocation(line: 674, column: 38, scope: !267)
!273 = !DILocation(line: 674, column: 9, scope: !267)
!274 = !DILocation(line: 674, column: 2, scope: !267)
!275 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !199, file: !199, line: 1634, type: !276, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!276 = !DISubroutineType(types: !277)
!277 = !{!256, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !199, line: 1439, size: 448, elements: !281)
!281 = !{!282, !283, !284, !289, !290, !295, !296}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !280, file: !199, line: 1445, baseType: !168, size: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !280, file: !199, line: 1448, baseType: !142, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !280, file: !199, line: 1451, baseType: !285, size: 32, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !280, file: !199, line: 1454, baseType: !285, size: 32, offset: 288)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !280, file: !199, line: 1457, baseType: !291, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !257, line: 67, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 65, size: 64, elements: !293)
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !292, file: !257, line: 66, baseType: !256, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !280, file: !199, line: 1460, baseType: !88, size: 32, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !280, file: !199, line: 1463, baseType: !166, size: 32, offset: 416)
!297 = !DILocalVariable(name: "timer", arg: 1, scope: !275, file: !199, line: 1635, type: !278)
!298 = !DILocation(line: 1635, column: 34, scope: !275)
!299 = !DILocation(line: 1637, column: 28, scope: !275)
!300 = !DILocation(line: 1637, column: 35, scope: !275)
!301 = !DILocation(line: 1637, column: 9, scope: !275)
!302 = !DILocation(line: 1637, column: 2, scope: !275)
!303 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !199, file: !199, line: 1649, type: !276, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!304 = !DILocalVariable(name: "timer", arg: 1, scope: !303, file: !199, line: 1650, type: !278)
!305 = !DILocation(line: 1650, column: 34, scope: !303)
!306 = !DILocation(line: 1652, column: 30, scope: !303)
!307 = !DILocation(line: 1652, column: 37, scope: !303)
!308 = !DILocation(line: 1652, column: 9, scope: !303)
!309 = !DILocation(line: 1652, column: 2, scope: !303)
!310 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !199, file: !199, line: 1689, type: !311, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !288, !166}
!313 = !DILocalVariable(name: "timer", arg: 1, scope: !310, file: !199, line: 1689, type: !288)
!314 = !DILocation(line: 1689, column: 65, scope: !310)
!315 = !DILocalVariable(name: "user_data", arg: 2, scope: !310, file: !199, line: 1690, type: !166)
!316 = !DILocation(line: 1690, column: 19, scope: !310)
!317 = !DILocation(line: 1692, column: 21, scope: !310)
!318 = !DILocation(line: 1692, column: 2, scope: !310)
!319 = !DILocation(line: 1692, column: 9, scope: !310)
!320 = !DILocation(line: 1692, column: 19, scope: !310)
!321 = !DILocation(line: 1693, column: 1, scope: !310)
!322 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !199, file: !199, line: 1704, type: !323, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!323 = !DISubroutineType(types: !324)
!324 = !{!166, !278}
!325 = !DILocalVariable(name: "timer", arg: 1, scope: !322, file: !199, line: 1704, type: !278)
!326 = !DILocation(line: 1704, column: 72, scope: !322)
!327 = !DILocation(line: 1706, column: 9, scope: !322)
!328 = !DILocation(line: 1706, column: 16, scope: !322)
!329 = !DILocation(line: 1706, column: 2, scope: !322)
!330 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !199, file: !199, line: 2071, type: !331, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!331 = !DISubroutineType(types: !332)
!332 = !{!87, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !199, line: 1830, size: 128, elements: !335)
!335 = !{!336, !349, !350}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !334, file: !199, line: 1831, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !338, line: 60, baseType: !339)
!338 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !338, line: 53, size: 64, elements: !340)
!340 = !{!341, !348}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !339, file: !338, line: 54, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !338, line: 50, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !338, line: 44, size: 32, elements: !345)
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !344, file: !338, line: 45, baseType: !347, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !338, line: 40, baseType: !88)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !339, file: !338, line: 55, baseType: !342, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !334, file: !199, line: 1832, baseType: !214, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !334, file: !199, line: 1833, baseType: !142, size: 64, offset: 64)
!351 = !DILocalVariable(name: "queue", arg: 1, scope: !330, file: !199, line: 2071, type: !333)
!352 = !DILocation(line: 2071, column: 59, scope: !330)
!353 = !DILocation(line: 2073, column: 35, scope: !330)
!354 = !DILocation(line: 2073, column: 42, scope: !330)
!355 = !DILocation(line: 2073, column: 14, scope: !330)
!356 = !DILocation(line: 2073, column: 9, scope: !330)
!357 = !DILocation(line: 2073, column: 2, scope: !330)
!358 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !199, file: !199, line: 3209, type: !359, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!359 = !DISubroutineType(types: !360)
!360 = !{!90, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !199, line: 3092, size: 128, elements: !363)
!363 = !{!364, !365, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !362, file: !199, line: 3093, baseType: !142, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !362, file: !199, line: 3094, baseType: !90, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !362, file: !199, line: 3095, baseType: !90, size: 32, offset: 96)
!367 = !DILocalVariable(name: "sem", arg: 1, scope: !358, file: !199, line: 3209, type: !361)
!368 = !DILocation(line: 3209, column: 65, scope: !358)
!369 = !DILocation(line: 3211, column: 9, scope: !358)
!370 = !DILocation(line: 3211, column: 14, scope: !358)
!371 = !DILocation(line: 3211, column: 2, scope: !358)
!372 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !199, file: !199, line: 4649, type: !373, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!373 = !DISubroutineType(types: !374)
!374 = !{!88, !375}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !199, line: 4390, size: 320, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !385, !386, !387, !388, !389}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !376, file: !199, line: 4392, baseType: !142, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !376, file: !199, line: 4394, baseType: !214, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !376, file: !199, line: 4396, baseType: !210, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !376, file: !199, line: 4398, baseType: !88, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !376, file: !199, line: 4400, baseType: !383, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !376, file: !199, line: 4402, baseType: !383, size: 32, offset: 160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !376, file: !199, line: 4404, baseType: !383, size: 32, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !376, file: !199, line: 4406, baseType: !383, size: 32, offset: 224)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !376, file: !199, line: 4408, baseType: !88, size: 32, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !376, file: !199, line: 4413, baseType: !149, size: 8, offset: 288)
!390 = !DILocalVariable(name: "msgq", arg: 1, scope: !372, file: !199, line: 4649, type: !375)
!391 = !DILocation(line: 4649, column: 66, scope: !372)
!392 = !DILocation(line: 4651, column: 9, scope: !372)
!393 = !DILocation(line: 4651, column: 15, scope: !372)
!394 = !DILocation(line: 4651, column: 26, scope: !372)
!395 = !DILocation(line: 4651, column: 32, scope: !372)
!396 = !DILocation(line: 4651, column: 24, scope: !372)
!397 = !DILocation(line: 4651, column: 2, scope: !372)
!398 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !199, file: !199, line: 4665, type: !373, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!399 = !DILocalVariable(name: "msgq", arg: 1, scope: !398, file: !199, line: 4665, type: !375)
!400 = !DILocation(line: 4665, column: 66, scope: !398)
!401 = !DILocation(line: 4667, column: 9, scope: !398)
!402 = !DILocation(line: 4667, column: 15, scope: !398)
!403 = !DILocation(line: 4667, column: 2, scope: !398)
!404 = distinct !DISubprogram(name: "sys_bitarray_set_bit", scope: !405, file: !405, line: 213, type: !406, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !216)
!405 = !DIFile(filename: "lib/os/bitarray.c", directory: "/home/sri/zephyrproject/zephyr")
!406 = !DISubroutineType(types: !407)
!407 = !{!87, !408, !210}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_bitarray_t", file: !410, line: 48, baseType: !411)
!410 = !DIFile(filename: "include/zephyr/sys/bitarray.h", directory: "/home/sri/zephyrproject/zephyr")
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_bitarray", file: !410, line: 32, size: 96, elements: !412)
!412 = !{!413, !414, !415, !417}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num_bits", scope: !411, file: !410, line: 34, baseType: !88, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "num_bundles", scope: !411, file: !410, line: 37, baseType: !88, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "bundles", scope: !411, file: !410, line: 40, baseType: !416, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !411, file: !410, line: 43, baseType: !214, offset: 96)
!418 = !DILocalVariable(name: "bitarray", arg: 1, scope: !404, file: !405, line: 213, type: !408)
!419 = !DILocation(line: 213, column: 42, scope: !404)
!420 = !DILocalVariable(name: "bit", arg: 2, scope: !404, file: !405, line: 213, type: !210)
!421 = !DILocation(line: 213, column: 59, scope: !404)
!422 = !DILocalVariable(name: "key", scope: !404, file: !405, line: 215, type: !423)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !215, line: 108, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !215, line: 34, size: 32, elements: !425)
!425 = !{!426}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !424, file: !215, line: 35, baseType: !87, size: 32)
!427 = !DILocation(line: 215, column: 19, scope: !404)
!428 = !DILocalVariable(name: "ret", scope: !404, file: !405, line: 216, type: !87)
!429 = !DILocation(line: 216, column: 6, scope: !404)
!430 = !DILocalVariable(name: "idx", scope: !404, file: !405, line: 217, type: !210)
!431 = !DILocation(line: 217, column: 9, scope: !404)
!432 = !DILocalVariable(name: "off", scope: !404, file: !405, line: 217, type: !210)
!433 = !DILocation(line: 217, column: 14, scope: !404)
!434 = !DILocation(line: 219, column: 21, scope: !404)
!435 = !DILocation(line: 219, column: 31, scope: !404)
!436 = !DILocalVariable(name: "l", arg: 1, scope: !437, file: !215, line: 160, type: !440)
!437 = distinct !DISubprogram(name: "k_spin_lock", scope: !215, file: !215, line: 160, type: !438, scopeLine: 161, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!438 = !DISubroutineType(types: !439)
!439 = !{!423, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!441 = !DILocation(line: 160, column: 94, scope: !437, inlinedAt: !442)
!442 = distinct !DILocation(line: 219, column: 8, scope: !404)
!443 = !DILocation(line: 162, column: 9, scope: !437, inlinedAt: !442)
!444 = !DILocalVariable(name: "k", scope: !437, file: !215, line: 163, type: !423)
!445 = !DILocation(line: 163, column: 19, scope: !437, inlinedAt: !442)
!446 = !DILocalVariable(name: "key", scope: !447, file: !448, line: 44, type: !90)
!447 = distinct !DISubprogram(name: "arch_irq_lock", scope: !448, file: !448, line: 42, type: !449, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!448 = !DIFile(filename: "include/zephyr/arch/arm/asm_inline_gcc.h", directory: "/home/sri/zephyrproject/zephyr")
!449 = !DISubroutineType(types: !450)
!450 = !{!90}
!451 = !DILocation(line: 44, column: 15, scope: !447, inlinedAt: !452)
!452 = distinct !DILocation(line: 169, column: 10, scope: !437, inlinedAt: !442)
!453 = !DILocation(line: 48, column: 2, scope: !447, inlinedAt: !452)
!454 = !{i64 82286}
!455 = !DILocation(line: 80, column: 9, scope: !447, inlinedAt: !452)
!456 = !DILocation(line: 169, column: 8, scope: !437, inlinedAt: !442)
!457 = !DILocation(line: 171, column: 26, scope: !437, inlinedAt: !442)
!458 = !DILocalVariable(name: "l", arg: 1, scope: !459, file: !215, line: 110, type: !440)
!459 = distinct !DISubprogram(name: "z_spinlock_validate_pre", scope: !215, file: !215, line: 110, type: !460, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !440}
!462 = !DILocation(line: 110, column: 94, scope: !459, inlinedAt: !463)
!463 = distinct !DILocation(line: 171, column: 2, scope: !437, inlinedAt: !442)
!464 = !DILocation(line: 112, column: 9, scope: !459, inlinedAt: !463)
!465 = !DILocation(line: 177, column: 27, scope: !437, inlinedAt: !442)
!466 = !DILocalVariable(name: "l", arg: 1, scope: !467, file: !215, line: 121, type: !440)
!467 = distinct !DISubprogram(name: "z_spinlock_validate_post", scope: !215, file: !215, line: 121, type: !460, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!468 = !DILocation(line: 121, column: 95, scope: !467, inlinedAt: !469)
!469 = distinct !DILocation(line: 177, column: 2, scope: !437, inlinedAt: !442)
!470 = !DILocation(line: 123, column: 9, scope: !467, inlinedAt: !469)
!471 = !DILocation(line: 179, column: 2, scope: !437, inlinedAt: !442)
!472 = !DILocation(line: 219, column: 8, scope: !404)
!473 = !DILocation(line: 224, column: 6, scope: !474)
!474 = distinct !DILexicalBlock(scope: !404, file: !405, line: 224, column: 6)
!475 = !DILocation(line: 224, column: 13, scope: !474)
!476 = !DILocation(line: 224, column: 23, scope: !474)
!477 = !DILocation(line: 224, column: 10, scope: !474)
!478 = !DILocation(line: 224, column: 6, scope: !404)
!479 = !DILocation(line: 225, column: 7, scope: !480)
!480 = distinct !DILexicalBlock(scope: !474, file: !405, line: 224, column: 33)
!481 = !DILocation(line: 226, column: 3, scope: !480)
!482 = !DILocation(line: 229, column: 8, scope: !404)
!483 = !DILocation(line: 229, column: 12, scope: !404)
!484 = !DILocation(line: 229, column: 6, scope: !404)
!485 = !DILocation(line: 230, column: 8, scope: !404)
!486 = !DILocation(line: 230, column: 12, scope: !404)
!487 = !DILocation(line: 230, column: 6, scope: !404)
!488 = !DILocation(line: 232, column: 37, scope: !404)
!489 = !DILocation(line: 232, column: 33, scope: !404)
!490 = !DILocation(line: 232, column: 2, scope: !404)
!491 = !DILocation(line: 232, column: 12, scope: !404)
!492 = !DILocation(line: 232, column: 20, scope: !404)
!493 = !DILocation(line: 232, column: 25, scope: !404)
!494 = !DILocation(line: 234, column: 6, scope: !404)
!495 = !DILocation(line: 234, column: 2, scope: !404)
!496 = !DILabel(scope: !404, name: "out", file: !405, line: 236)
!497 = !DILocation(line: 236, column: 1, scope: !404)
!498 = !DILocation(line: 237, column: 17, scope: !404)
!499 = !DILocation(line: 237, column: 27, scope: !404)
!500 = !DILocation(line: 237, column: 2, scope: !404)
!501 = !DILocalVariable(name: "l", arg: 1, scope: !502, file: !215, line: 235, type: !440)
!502 = distinct !DISubprogram(name: "k_spin_unlock", scope: !215, file: !215, line: 235, type: !503, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !440, !423}
!505 = !DILocation(line: 235, column: 84, scope: !502, inlinedAt: !506)
!506 = distinct !DILocation(line: 237, column: 2, scope: !404)
!507 = !DILocalVariable(name: "key", arg: 2, scope: !502, file: !215, line: 236, type: !423)
!508 = !DILocation(line: 236, column: 23, scope: !502, inlinedAt: !506)
!509 = !DILocation(line: 238, column: 9, scope: !502, inlinedAt: !506)
!510 = !DILocation(line: 261, column: 22, scope: !502, inlinedAt: !506)
!511 = !DILocalVariable(name: "key", arg: 1, scope: !512, file: !448, line: 88, type: !90)
!512 = distinct !DISubprogram(name: "arch_irq_unlock", scope: !448, file: !448, line: 88, type: !513, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !216)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !90}
!515 = !DILocation(line: 88, column: 80, scope: !512, inlinedAt: !516)
!516 = distinct !DILocation(line: 261, column: 2, scope: !502, inlinedAt: !506)
!517 = !DILocation(line: 91, column: 6, scope: !518, inlinedAt: !516)
!518 = distinct !DILexicalBlock(scope: !512, file: !448, line: 91, column: 6)
!519 = !DILocation(line: 91, column: 10, scope: !518, inlinedAt: !516)
!520 = !DILocation(line: 91, column: 6, scope: !512, inlinedAt: !516)
!521 = !DILocation(line: 92, column: 3, scope: !522, inlinedAt: !516)
!522 = distinct !DILexicalBlock(scope: !518, file: !448, line: 91, column: 17)
!523 = !DILocation(line: 94, column: 2, scope: !512, inlinedAt: !516)
!524 = !{i64 82590}
!525 = !DILocation(line: 114, column: 1, scope: !512, inlinedAt: !516)
!526 = !DILocation(line: 238, column: 9, scope: !404)
!527 = !DILocation(line: 238, column: 2, scope: !404)
!528 = distinct !DISubprogram(name: "sys_bitarray_clear_bit", scope: !405, file: !405, line: 241, type: !406, scopeLine: 242, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !216)
!529 = !DILocalVariable(name: "bitarray", arg: 1, scope: !528, file: !405, line: 241, type: !408)
!530 = !DILocation(line: 241, column: 44, scope: !528)
!531 = !DILocalVariable(name: "bit", arg: 2, scope: !528, file: !405, line: 241, type: !210)
!532 = !DILocation(line: 241, column: 61, scope: !528)
!533 = !DILocalVariable(name: "key", scope: !528, file: !405, line: 243, type: !423)
!534 = !DILocation(line: 243, column: 19, scope: !528)
!535 = !DILocalVariable(name: "ret", scope: !528, file: !405, line: 244, type: !87)
!536 = !DILocation(line: 244, column: 6, scope: !528)
!537 = !DILocalVariable(name: "idx", scope: !528, file: !405, line: 245, type: !210)
!538 = !DILocation(line: 245, column: 9, scope: !528)
!539 = !DILocalVariable(name: "off", scope: !528, file: !405, line: 245, type: !210)
!540 = !DILocation(line: 245, column: 14, scope: !528)
!541 = !DILocation(line: 250, column: 21, scope: !528)
!542 = !DILocation(line: 250, column: 31, scope: !528)
!543 = !DILocation(line: 160, column: 94, scope: !437, inlinedAt: !544)
!544 = distinct !DILocation(line: 250, column: 8, scope: !528)
!545 = !DILocation(line: 162, column: 9, scope: !437, inlinedAt: !544)
!546 = !DILocation(line: 163, column: 19, scope: !437, inlinedAt: !544)
!547 = !DILocation(line: 44, column: 15, scope: !447, inlinedAt: !548)
!548 = distinct !DILocation(line: 169, column: 10, scope: !437, inlinedAt: !544)
!549 = !DILocation(line: 48, column: 2, scope: !447, inlinedAt: !548)
!550 = !DILocation(line: 80, column: 9, scope: !447, inlinedAt: !548)
!551 = !DILocation(line: 169, column: 8, scope: !437, inlinedAt: !544)
!552 = !DILocation(line: 171, column: 26, scope: !437, inlinedAt: !544)
!553 = !DILocation(line: 110, column: 94, scope: !459, inlinedAt: !554)
!554 = distinct !DILocation(line: 171, column: 2, scope: !437, inlinedAt: !544)
!555 = !DILocation(line: 112, column: 9, scope: !459, inlinedAt: !554)
!556 = !DILocation(line: 177, column: 27, scope: !437, inlinedAt: !544)
!557 = !DILocation(line: 121, column: 95, scope: !467, inlinedAt: !558)
!558 = distinct !DILocation(line: 177, column: 2, scope: !437, inlinedAt: !544)
!559 = !DILocation(line: 123, column: 9, scope: !467, inlinedAt: !558)
!560 = !DILocation(line: 179, column: 2, scope: !437, inlinedAt: !544)
!561 = !DILocation(line: 250, column: 8, scope: !528)
!562 = !DILocation(line: 252, column: 6, scope: !563)
!563 = distinct !DILexicalBlock(scope: !528, file: !405, line: 252, column: 6)
!564 = !DILocation(line: 252, column: 13, scope: !563)
!565 = !DILocation(line: 252, column: 23, scope: !563)
!566 = !DILocation(line: 252, column: 10, scope: !563)
!567 = !DILocation(line: 252, column: 6, scope: !528)
!568 = !DILocation(line: 253, column: 7, scope: !569)
!569 = distinct !DILexicalBlock(scope: !563, file: !405, line: 252, column: 33)
!570 = !DILocation(line: 254, column: 3, scope: !569)
!571 = !DILocation(line: 257, column: 8, scope: !528)
!572 = !DILocation(line: 257, column: 12, scope: !528)
!573 = !DILocation(line: 257, column: 6, scope: !528)
!574 = !DILocation(line: 258, column: 8, scope: !528)
!575 = !DILocation(line: 258, column: 12, scope: !528)
!576 = !DILocation(line: 258, column: 6, scope: !528)
!577 = !DILocation(line: 260, column: 38, scope: !528)
!578 = !DILocation(line: 260, column: 34, scope: !528)
!579 = !DILocation(line: 260, column: 28, scope: !528)
!580 = !DILocation(line: 260, column: 2, scope: !528)
!581 = !DILocation(line: 260, column: 12, scope: !528)
!582 = !DILocation(line: 260, column: 20, scope: !528)
!583 = !DILocation(line: 260, column: 25, scope: !528)
!584 = !DILocation(line: 262, column: 6, scope: !528)
!585 = !DILocation(line: 262, column: 2, scope: !528)
!586 = !DILabel(scope: !528, name: "out", file: !405, line: 264)
!587 = !DILocation(line: 264, column: 1, scope: !528)
!588 = !DILocation(line: 265, column: 17, scope: !528)
!589 = !DILocation(line: 265, column: 27, scope: !528)
!590 = !DILocation(line: 265, column: 2, scope: !528)
!591 = !DILocation(line: 235, column: 84, scope: !502, inlinedAt: !592)
!592 = distinct !DILocation(line: 265, column: 2, scope: !528)
!593 = !DILocation(line: 236, column: 23, scope: !502, inlinedAt: !592)
!594 = !DILocation(line: 238, column: 9, scope: !502, inlinedAt: !592)
!595 = !DILocation(line: 261, column: 22, scope: !502, inlinedAt: !592)
!596 = !DILocation(line: 88, column: 80, scope: !512, inlinedAt: !597)
!597 = distinct !DILocation(line: 261, column: 2, scope: !502, inlinedAt: !592)
!598 = !DILocation(line: 91, column: 6, scope: !518, inlinedAt: !597)
!599 = !DILocation(line: 91, column: 10, scope: !518, inlinedAt: !597)
!600 = !DILocation(line: 91, column: 6, scope: !512, inlinedAt: !597)
!601 = !DILocation(line: 92, column: 3, scope: !522, inlinedAt: !597)
!602 = !DILocation(line: 94, column: 2, scope: !512, inlinedAt: !597)
!603 = !DILocation(line: 114, column: 1, scope: !512, inlinedAt: !597)
!604 = !DILocation(line: 266, column: 9, scope: !528)
!605 = !DILocation(line: 266, column: 2, scope: !528)
!606 = distinct !DISubprogram(name: "sys_bitarray_test_bit", scope: !405, file: !405, line: 269, type: !607, scopeLine: 270, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !216)
!607 = !DISubroutineType(types: !608)
!608 = !{!87, !408, !210, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 32)
!610 = !DILocalVariable(name: "bitarray", arg: 1, scope: !606, file: !405, line: 269, type: !408)
!611 = !DILocation(line: 269, column: 43, scope: !606)
!612 = !DILocalVariable(name: "bit", arg: 2, scope: !606, file: !405, line: 269, type: !210)
!613 = !DILocation(line: 269, column: 60, scope: !606)
!614 = !DILocalVariable(name: "val", arg: 3, scope: !606, file: !405, line: 269, type: !609)
!615 = !DILocation(line: 269, column: 70, scope: !606)
!616 = !DILocalVariable(name: "key", scope: !606, file: !405, line: 271, type: !423)
!617 = !DILocation(line: 271, column: 19, scope: !606)
!618 = !DILocalVariable(name: "ret", scope: !606, file: !405, line: 272, type: !87)
!619 = !DILocation(line: 272, column: 6, scope: !606)
!620 = !DILocalVariable(name: "idx", scope: !606, file: !405, line: 273, type: !210)
!621 = !DILocation(line: 273, column: 9, scope: !606)
!622 = !DILocalVariable(name: "off", scope: !606, file: !405, line: 273, type: !210)
!623 = !DILocation(line: 273, column: 14, scope: !606)
!624 = !DILocation(line: 278, column: 21, scope: !606)
!625 = !DILocation(line: 278, column: 31, scope: !606)
!626 = !DILocation(line: 160, column: 94, scope: !437, inlinedAt: !627)
!627 = distinct !DILocation(line: 278, column: 8, scope: !606)
!628 = !DILocation(line: 162, column: 9, scope: !437, inlinedAt: !627)
!629 = !DILocation(line: 163, column: 19, scope: !437, inlinedAt: !627)
!630 = !DILocation(line: 44, column: 15, scope: !447, inlinedAt: !631)
!631 = distinct !DILocation(line: 169, column: 10, scope: !437, inlinedAt: !627)
!632 = !DILocation(line: 48, column: 2, scope: !447, inlinedAt: !631)
!633 = !DILocation(line: 80, column: 9, scope: !447, inlinedAt: !631)
!634 = !DILocation(line: 169, column: 8, scope: !437, inlinedAt: !627)
!635 = !DILocation(line: 171, column: 26, scope: !437, inlinedAt: !627)
!636 = !DILocation(line: 110, column: 94, scope: !459, inlinedAt: !637)
!637 = distinct !DILocation(line: 171, column: 2, scope: !437, inlinedAt: !627)
!638 = !DILocation(line: 112, column: 9, scope: !459, inlinedAt: !637)
!639 = !DILocation(line: 177, column: 27, scope: !437, inlinedAt: !627)
!640 = !DILocation(line: 121, column: 95, scope: !467, inlinedAt: !641)
!641 = distinct !DILocation(line: 177, column: 2, scope: !437, inlinedAt: !627)
!642 = !DILocation(line: 123, column: 9, scope: !467, inlinedAt: !641)
!643 = !DILocation(line: 179, column: 2, scope: !437, inlinedAt: !627)
!644 = !DILocation(line: 278, column: 8, scope: !606)
!645 = !DILocation(line: 280, column: 6, scope: !646)
!646 = distinct !DILexicalBlock(scope: !606, file: !405, line: 280, column: 6)
!647 = !DILocation(line: 280, column: 10, scope: !646)
!648 = !DILocation(line: 280, column: 6, scope: !606)
!649 = !DILocation(line: 281, column: 7, scope: !650)
!650 = distinct !DILexicalBlock(scope: !646, file: !405, line: 280, column: 16)
!651 = !DILocation(line: 282, column: 3, scope: !650)
!652 = !DILocation(line: 285, column: 6, scope: !653)
!653 = distinct !DILexicalBlock(scope: !606, file: !405, line: 285, column: 6)
!654 = !DILocation(line: 285, column: 13, scope: !653)
!655 = !DILocation(line: 285, column: 23, scope: !653)
!656 = !DILocation(line: 285, column: 10, scope: !653)
!657 = !DILocation(line: 285, column: 6, scope: !606)
!658 = !DILocation(line: 286, column: 7, scope: !659)
!659 = distinct !DILexicalBlock(scope: !653, file: !405, line: 285, column: 33)
!660 = !DILocation(line: 287, column: 3, scope: !659)
!661 = !DILocation(line: 290, column: 8, scope: !606)
!662 = !DILocation(line: 290, column: 12, scope: !606)
!663 = !DILocation(line: 290, column: 6, scope: !606)
!664 = !DILocation(line: 291, column: 8, scope: !606)
!665 = !DILocation(line: 291, column: 12, scope: !606)
!666 = !DILocation(line: 291, column: 6, scope: !606)
!667 = !DILocation(line: 293, column: 7, scope: !668)
!668 = distinct !DILexicalBlock(scope: !606, file: !405, line: 293, column: 6)
!669 = !DILocation(line: 293, column: 17, scope: !668)
!670 = !DILocation(line: 293, column: 25, scope: !668)
!671 = !DILocation(line: 293, column: 41, scope: !668)
!672 = !DILocation(line: 293, column: 37, scope: !668)
!673 = !DILocation(line: 293, column: 30, scope: !668)
!674 = !DILocation(line: 293, column: 48, scope: !668)
!675 = !DILocation(line: 293, column: 6, scope: !606)
!676 = !DILocation(line: 294, column: 4, scope: !677)
!677 = distinct !DILexicalBlock(scope: !668, file: !405, line: 293, column: 54)
!678 = !DILocation(line: 294, column: 8, scope: !677)
!679 = !DILocation(line: 295, column: 2, scope: !677)
!680 = !DILocation(line: 296, column: 4, scope: !681)
!681 = distinct !DILexicalBlock(scope: !668, file: !405, line: 295, column: 9)
!682 = !DILocation(line: 296, column: 8, scope: !681)
!683 = !DILocation(line: 299, column: 6, scope: !606)
!684 = !DILocation(line: 299, column: 2, scope: !606)
!685 = !DILabel(scope: !606, name: "out", file: !405, line: 301)
!686 = !DILocation(line: 301, column: 1, scope: !606)
!687 = !DILocation(line: 302, column: 17, scope: !606)
!688 = !DILocation(line: 302, column: 27, scope: !606)
!689 = !DILocation(line: 302, column: 2, scope: !606)
!690 = !DILocation(line: 235, column: 84, scope: !502, inlinedAt: !691)
!691 = distinct !DILocation(line: 302, column: 2, scope: !606)
!692 = !DILocation(line: 236, column: 23, scope: !502, inlinedAt: !691)
!693 = !DILocation(line: 238, column: 9, scope: !502, inlinedAt: !691)
!694 = !DILocation(line: 261, column: 22, scope: !502, inlinedAt: !691)
!695 = !DILocation(line: 88, column: 80, scope: !512, inlinedAt: !696)
!696 = distinct !DILocation(line: 261, column: 2, scope: !502, inlinedAt: !691)
!697 = !DILocation(line: 91, column: 6, scope: !518, inlinedAt: !696)
!698 = !DILocation(line: 91, column: 10, scope: !518, inlinedAt: !696)
!699 = !DILocation(line: 91, column: 6, scope: !512, inlinedAt: !696)
!700 = !DILocation(line: 92, column: 3, scope: !522, inlinedAt: !696)
!701 = !DILocation(line: 94, column: 2, scope: !512, inlinedAt: !696)
!702 = !DILocation(line: 114, column: 1, scope: !512, inlinedAt: !696)
!703 = !DILocation(line: 303, column: 9, scope: !606)
!704 = !DILocation(line: 303, column: 2, scope: !606)
!705 = distinct !DISubprogram(name: "sys_bitarray_test_and_set_bit", scope: !405, file: !405, line: 306, type: !607, scopeLine: 307, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !216)
!706 = !DILocalVariable(name: "bitarray", arg: 1, scope: !705, file: !405, line: 306, type: !408)
!707 = !DILocation(line: 306, column: 51, scope: !705)
!708 = !DILocalVariable(name: "bit", arg: 2, scope: !705, file: !405, line: 306, type: !210)
!709 = !DILocation(line: 306, column: 68, scope: !705)
!710 = !DILocalVariable(name: "prev_val", arg: 3, scope: !705, file: !405, line: 306, type: !609)
!711 = !DILocation(line: 306, column: 78, scope: !705)
!712 = !DILocalVariable(name: "key", scope: !705, file: !405, line: 308, type: !423)
!713 = !DILocation(line: 308, column: 19, scope: !705)
!714 = !DILocalVariable(name: "ret", scope: !705, file: !405, line: 309, type: !87)
!715 = !DILocation(line: 309, column: 6, scope: !705)
!716 = !DILocalVariable(name: "idx", scope: !705, file: !405, line: 310, type: !210)
!717 = !DILocation(line: 310, column: 9, scope: !705)
!718 = !DILocalVariable(name: "off", scope: !705, file: !405, line: 310, type: !210)
!719 = !DILocation(line: 310, column: 14, scope: !705)
!720 = !DILocation(line: 315, column: 21, scope: !705)
!721 = !DILocation(line: 315, column: 31, scope: !705)
!722 = !DILocation(line: 160, column: 94, scope: !437, inlinedAt: !723)
!723 = distinct !DILocation(line: 315, column: 8, scope: !705)
!724 = !DILocation(line: 162, column: 9, scope: !437, inlinedAt: !723)
!725 = !DILocation(line: 163, column: 19, scope: !437, inlinedAt: !723)
!726 = !DILocation(line: 44, column: 15, scope: !447, inlinedAt: !727)
!727 = distinct !DILocation(line: 169, column: 10, scope: !437, inlinedAt: !723)
!728 = !DILocation(line: 48, column: 2, scope: !447, inlinedAt: !727)
!729 = !DILocation(line: 80, column: 9, scope: !447, inlinedAt: !727)
!730 = !DILocation(line: 169, column: 8, scope: !437, inlinedAt: !723)
!731 = !DILocation(line: 171, column: 26, scope: !437, inlinedAt: !723)
!732 = !DILocation(line: 110, column: 94, scope: !459, inlinedAt: !733)
!733 = distinct !DILocation(line: 171, column: 2, scope: !437, inlinedAt: !723)
!734 = !DILocation(line: 112, column: 9, scope: !459, inlinedAt: !733)
!735 = !DILocation(line: 177, column: 27, scope: !437, inlinedAt: !723)
!736 = !DILocation(line: 121, column: 95, scope: !467, inlinedAt: !737)
!737 = distinct !DILocation(line: 177, column: 2, scope: !437, inlinedAt: !723)
!738 = !DILocation(line: 123, column: 9, scope: !467, inlinedAt: !737)
!739 = !DILocation(line: 179, column: 2, scope: !437, inlinedAt: !723)
!740 = !DILocation(line: 315, column: 8, scope: !705)
!741 = !DILocation(line: 317, column: 6, scope: !742)
!742 = distinct !DILexicalBlock(scope: !705, file: !405, line: 317, column: 6)
!743 = !DILocation(line: 317, column: 15, scope: !742)
!744 = !DILocation(line: 317, column: 6, scope: !705)
!745 = !DILocation(line: 318, column: 7, scope: !746)
!746 = distinct !DILexicalBlock(scope: !742, file: !405, line: 317, column: 21)
!747 = !DILocation(line: 319, column: 3, scope: !746)
!748 = !DILocation(line: 322, column: 6, scope: !749)
!749 = distinct !DILexicalBlock(scope: !705, file: !405, line: 322, column: 6)
!750 = !DILocation(line: 322, column: 13, scope: !749)
!751 = !DILocation(line: 322, column: 23, scope: !749)
!752 = !DILocation(line: 322, column: 10, scope: !749)
!753 = !DILocation(line: 322, column: 6, scope: !705)
!754 = !DILocation(line: 323, column: 7, scope: !755)
!755 = distinct !DILexicalBlock(scope: !749, file: !405, line: 322, column: 33)
!756 = !DILocation(line: 324, column: 3, scope: !755)
!757 = !DILocation(line: 327, column: 8, scope: !705)
!758 = !DILocation(line: 327, column: 12, scope: !705)
!759 = !DILocation(line: 327, column: 6, scope: !705)
!760 = !DILocation(line: 328, column: 8, scope: !705)
!761 = !DILocation(line: 328, column: 12, scope: !705)
!762 = !DILocation(line: 328, column: 6, scope: !705)
!763 = !DILocation(line: 330, column: 7, scope: !764)
!764 = distinct !DILexicalBlock(scope: !705, file: !405, line: 330, column: 6)
!765 = !DILocation(line: 330, column: 17, scope: !764)
!766 = !DILocation(line: 330, column: 25, scope: !764)
!767 = !DILocation(line: 330, column: 41, scope: !764)
!768 = !DILocation(line: 330, column: 37, scope: !764)
!769 = !DILocation(line: 330, column: 30, scope: !764)
!770 = !DILocation(line: 330, column: 48, scope: !764)
!771 = !DILocation(line: 330, column: 6, scope: !705)
!772 = !DILocation(line: 331, column: 4, scope: !773)
!773 = distinct !DILexicalBlock(scope: !764, file: !405, line: 330, column: 54)
!774 = !DILocation(line: 331, column: 13, scope: !773)
!775 = !DILocation(line: 332, column: 2, scope: !773)
!776 = !DILocation(line: 333, column: 4, scope: !777)
!777 = distinct !DILexicalBlock(scope: !764, file: !405, line: 332, column: 9)
!778 = !DILocation(line: 333, column: 13, scope: !777)
!779 = !DILocation(line: 336, column: 37, scope: !705)
!780 = !DILocation(line: 336, column: 33, scope: !705)
!781 = !DILocation(line: 336, column: 2, scope: !705)
!782 = !DILocation(line: 336, column: 12, scope: !705)
!783 = !DILocation(line: 336, column: 20, scope: !705)
!784 = !DILocation(line: 336, column: 25, scope: !705)
!785 = !DILocation(line: 338, column: 6, scope: !705)
!786 = !DILocation(line: 338, column: 2, scope: !705)
!787 = !DILabel(scope: !705, name: "out", file: !405, line: 340)
!788 = !DILocation(line: 340, column: 1, scope: !705)
!789 = !DILocation(line: 341, column: 17, scope: !705)
!790 = !DILocation(line: 341, column: 27, scope: !705)
!791 = !DILocation(line: 341, column: 2, scope: !705)
!792 = !DILocation(line: 235, column: 84, scope: !502, inlinedAt: !793)
!793 = distinct !DILocation(line: 341, column: 2, scope: !705)
!794 = !DILocation(line: 236, column: 23, scope: !502, inlinedAt: !793)
!795 = !DILocation(line: 238, column: 9, scope: !502, inlinedAt: !793)
!796 = !DILocation(line: 261, column: 22, scope: !502, inlinedAt: !793)
!797 = !DILocation(line: 88, column: 80, scope: !512, inlinedAt: !798)
!798 = distinct !DILocation(line: 261, column: 2, scope: !502, inlinedAt: !793)
!799 = !DILocation(line: 91, column: 6, scope: !518, inlinedAt: !798)
!800 = !DILocation(line: 91, column: 10, scope: !518, inlinedAt: !798)
!801 = !DILocation(line: 91, column: 6, scope: !512, inlinedAt: !798)
!802 = !DILocation(line: 92, column: 3, scope: !522, inlinedAt: !798)
!803 = !DILocation(line: 94, column: 2, scope: !512, inlinedAt: !798)
!804 = !DILocation(line: 114, column: 1, scope: !512, inlinedAt: !798)
!805 = !DILocation(line: 342, column: 9, scope: !705)
!806 = !DILocation(line: 342, column: 2, scope: !705)
!807 = distinct !DISubprogram(name: "sys_bitarray_test_and_clear_bit", scope: !405, file: !405, line: 345, type: !607, scopeLine: 346, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !216)
!808 = !DILocalVariable(name: "bitarray", arg: 1, scope: !807, file: !405, line: 345, type: !408)
!809 = !DILocation(line: 345, column: 53, scope: !807)
!810 = !DILocalVariable(name: "bit", arg: 2, scope: !807, file: !405, line: 345, type: !210)
!811 = !DILocation(line: 345, column: 70, scope: !807)
!812 = !DILocalVariable(name: "prev_val", arg: 3, scope: !807, file: !405, line: 345, type: !609)
!813 = !DILocation(line: 345, column: 80, scope: !807)
!814 = !DILocalVariable(name: "key", scope: !807, file: !405, line: 347, type: !423)
!815 = !DILocation(line: 347, column: 19, scope: !807)
!816 = !DILocalVariable(name: "ret", scope: !807, file: !405, line: 348, type: !87)
!817 = !DILocation(line: 348, column: 6, scope: !807)
!818 = !DILocalVariable(name: "idx", scope: !807, file: !405, line: 349, type: !210)
!819 = !DILocation(line: 349, column: 9, scope: !807)
!820 = !DILocalVariable(name: "off", scope: !807, file: !405, line: 349, type: !210)
!821 = !DILocation(line: 349, column: 14, scope: !807)
!822 = !DILocation(line: 354, column: 21, scope: !807)
!823 = !DILocation(line: 354, column: 31, scope: !807)
!824 = !DILocation(line: 160, column: 94, scope: !437, inlinedAt: !825)
!825 = distinct !DILocation(line: 354, column: 8, scope: !807)
!826 = !DILocation(line: 162, column: 9, scope: !437, inlinedAt: !825)
!827 = !DILocation(line: 163, column: 19, scope: !437, inlinedAt: !825)
!828 = !DILocation(line: 44, column: 15, scope: !447, inlinedAt: !829)
!829 = distinct !DILocation(line: 169, column: 10, scope: !437, inlinedAt: !825)
!830 = !DILocation(line: 48, column: 2, scope: !447, inlinedAt: !829)
!831 = !DILocation(line: 80, column: 9, scope: !447, inlinedAt: !829)
!832 = !DILocation(line: 169, column: 8, scope: !437, inlinedAt: !825)
!833 = !DILocation(line: 171, column: 26, scope: !437, inlinedAt: !825)
!834 = !DILocation(line: 110, column: 94, scope: !459, inlinedAt: !835)
!835 = distinct !DILocation(line: 171, column: 2, scope: !437, inlinedAt: !825)
!836 = !DILocation(line: 112, column: 9, scope: !459, inlinedAt: !835)
!837 = !DILocation(line: 177, column: 27, scope: !437, inlinedAt: !825)
!838 = !DILocation(line: 121, column: 95, scope: !467, inlinedAt: !839)
!839 = distinct !DILocation(line: 177, column: 2, scope: !437, inlinedAt: !825)
!840 = !DILocation(line: 123, column: 9, scope: !467, inlinedAt: !839)
!841 = !DILocation(line: 179, column: 2, scope: !437, inlinedAt: !825)
!842 = !DILocation(line: 354, column: 8, scope: !807)
!843 = !DILocation(line: 356, column: 6, scope: !844)
!844 = distinct !DILexicalBlock(scope: !807, file: !405, line: 356, column: 6)
!845 = !DILocation(line: 356, column: 15, scope: !844)
!846 = !DILocation(line: 356, column: 6, scope: !807)
!847 = !DILocation(line: 357, column: 7, scope: !848)
!848 = distinct !DILexicalBlock(scope: !844, file: !405, line: 356, column: 21)
!849 = !DILocation(line: 358, column: 3, scope: !848)
!850 = !DILocation(line: 361, column: 6, scope: !851)
!851 = distinct !DILexicalBlock(scope: !807, file: !405, line: 361, column: 6)
!852 = !DILocation(line: 361, column: 13, scope: !851)
!853 = !DILocation(line: 361, column: 23, scope: !851)
!854 = !DILocation(line: 361, column: 10, scope: !851)
!855 = !DILocation(line: 361, column: 6, scope: !807)
!856 = !DILocation(line: 362, column: 7, scope: !857)
!857 = distinct !DILexicalBlock(scope: !851, file: !405, line: 361, column: 33)
!858 = !DILocation(line: 363, column: 3, scope: !857)
!859 = !DILocation(line: 366, column: 8, scope: !807)
!860 = !DILocation(line: 366, column: 12, scope: !807)
!861 = !DILocation(line: 366, column: 6, scope: !807)
!862 = !DILocation(line: 367, column: 8, scope: !807)
!863 = !DILocation(line: 367, column: 12, scope: !807)
!864 = !DILocation(line: 367, column: 6, scope: !807)
!865 = !DILocation(line: 369, column: 7, scope: !866)
!866 = distinct !DILexicalBlock(scope: !807, file: !405, line: 369, column: 6)
!867 = !DILocation(line: 369, column: 17, scope: !866)
!868 = !DILocation(line: 369, column: 25, scope: !866)
!869 = !DILocation(line: 369, column: 41, scope: !866)
!870 = !DILocation(line: 369, column: 37, scope: !866)
!871 = !DILocation(line: 369, column: 30, scope: !866)
!872 = !DILocation(line: 369, column: 48, scope: !866)
!873 = !DILocation(line: 369, column: 6, scope: !807)
!874 = !DILocation(line: 370, column: 4, scope: !875)
!875 = distinct !DILexicalBlock(scope: !866, file: !405, line: 369, column: 54)
!876 = !DILocation(line: 370, column: 13, scope: !875)
!877 = !DILocation(line: 371, column: 2, scope: !875)
!878 = !DILocation(line: 372, column: 4, scope: !879)
!879 = distinct !DILexicalBlock(scope: !866, file: !405, line: 371, column: 9)
!880 = !DILocation(line: 372, column: 13, scope: !879)
!881 = !DILocation(line: 375, column: 38, scope: !807)
!882 = !DILocation(line: 375, column: 34, scope: !807)
!883 = !DILocation(line: 375, column: 28, scope: !807)
!884 = !DILocation(line: 375, column: 2, scope: !807)
!885 = !DILocation(line: 375, column: 12, scope: !807)
!886 = !DILocation(line: 375, column: 20, scope: !807)
!887 = !DILocation(line: 375, column: 25, scope: !807)
!888 = !DILocation(line: 377, column: 6, scope: !807)
!889 = !DILocation(line: 377, column: 2, scope: !807)
!890 = !DILabel(scope: !807, name: "out", file: !405, line: 379)
!891 = !DILocation(line: 379, column: 1, scope: !807)
!892 = !DILocation(line: 380, column: 17, scope: !807)
!893 = !DILocation(line: 380, column: 27, scope: !807)
!894 = !DILocation(line: 380, column: 2, scope: !807)
!895 = !DILocation(line: 235, column: 84, scope: !502, inlinedAt: !896)
!896 = distinct !DILocation(line: 380, column: 2, scope: !807)
!897 = !DILocation(line: 236, column: 23, scope: !502, inlinedAt: !896)
!898 = !DILocation(line: 238, column: 9, scope: !502, inlinedAt: !896)
!899 = !DILocation(line: 261, column: 22, scope: !502, inlinedAt: !896)
!900 = !DILocation(line: 88, column: 80, scope: !512, inlinedAt: !901)
!901 = distinct !DILocation(line: 261, column: 2, scope: !502, inlinedAt: !896)
!902 = !DILocation(line: 91, column: 6, scope: !518, inlinedAt: !901)
!903 = !DILocation(line: 91, column: 10, scope: !518, inlinedAt: !901)
!904 = !DILocation(line: 91, column: 6, scope: !512, inlinedAt: !901)
!905 = !DILocation(line: 92, column: 3, scope: !522, inlinedAt: !901)
!906 = !DILocation(line: 94, column: 2, scope: !512, inlinedAt: !901)
!907 = !DILocation(line: 114, column: 1, scope: !512, inlinedAt: !901)
!908 = !DILocation(line: 381, column: 9, scope: !807)
!909 = !DILocation(line: 381, column: 2, scope: !807)
!910 = distinct !DISubprogram(name: "sys_bitarray_alloc", scope: !405, file: !405, line: 384, type: !911, scopeLine: 386, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !216)
!911 = !DISubroutineType(types: !912)
!912 = !{!87, !408, !210, !913}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!914 = !DILocalVariable(name: "bitarray", arg: 1, scope: !910, file: !405, line: 384, type: !408)
!915 = !DILocation(line: 384, column: 40, scope: !910)
!916 = !DILocalVariable(name: "num_bits", arg: 2, scope: !910, file: !405, line: 384, type: !210)
!917 = !DILocation(line: 384, column: 57, scope: !910)
!918 = !DILocalVariable(name: "offset", arg: 3, scope: !910, file: !405, line: 385, type: !913)
!919 = !DILocation(line: 385, column: 18, scope: !910)
!920 = !DILocalVariable(name: "key", scope: !910, file: !405, line: 387, type: !423)
!921 = !DILocation(line: 387, column: 19, scope: !910)
!922 = !DILocalVariable(name: "bit_idx", scope: !910, file: !405, line: 388, type: !88)
!923 = !DILocation(line: 388, column: 11, scope: !910)
!924 = !DILocalVariable(name: "ret", scope: !910, file: !405, line: 389, type: !87)
!925 = !DILocation(line: 389, column: 6, scope: !910)
!926 = !DILocalVariable(name: "bd", scope: !910, file: !405, line: 390, type: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bundle_data", file: !405, line: 18, size: 192, elements: !928)
!928 = !{!929, !930, !931, !932, !933, !934}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "sidx", scope: !927, file: !405, line: 20, baseType: !210, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "eidx", scope: !927, file: !405, line: 20, baseType: !210, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "soff", scope: !927, file: !405, line: 23, baseType: !210, size: 32, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "eoff", scope: !927, file: !405, line: 23, baseType: !210, size: 32, offset: 96)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "smask", scope: !927, file: !405, line: 26, baseType: !88, size: 32, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "emask", scope: !927, file: !405, line: 26, baseType: !88, size: 32, offset: 160)
!935 = !DILocation(line: 390, column: 21, scope: !910)
!936 = !DILocalVariable(name: "off_start", scope: !910, file: !405, line: 391, type: !210)
!937 = !DILocation(line: 391, column: 9, scope: !910)
!938 = !DILocalVariable(name: "off_end", scope: !910, file: !405, line: 391, type: !210)
!939 = !DILocation(line: 391, column: 20, scope: !910)
!940 = !DILocalVariable(name: "mismatch", scope: !910, file: !405, line: 392, type: !210)
!941 = !DILocation(line: 392, column: 9, scope: !910)
!942 = !DILocation(line: 397, column: 21, scope: !910)
!943 = !DILocation(line: 397, column: 31, scope: !910)
!944 = !DILocation(line: 160, column: 94, scope: !437, inlinedAt: !945)
!945 = distinct !DILocation(line: 397, column: 8, scope: !910)
!946 = !DILocation(line: 162, column: 9, scope: !437, inlinedAt: !945)
!947 = !DILocation(line: 163, column: 19, scope: !437, inlinedAt: !945)
!948 = !DILocation(line: 44, column: 15, scope: !447, inlinedAt: !949)
!949 = distinct !DILocation(line: 169, column: 10, scope: !437, inlinedAt: !945)
!950 = !DILocation(line: 48, column: 2, scope: !447, inlinedAt: !949)
!951 = !DILocation(line: 80, column: 9, scope: !447, inlinedAt: !949)
!952 = !DILocation(line: 169, column: 8, scope: !437, inlinedAt: !945)
!953 = !DILocation(line: 171, column: 26, scope: !437, inlinedAt: !945)
!954 = !DILocation(line: 110, column: 94, scope: !459, inlinedAt: !955)
!955 = distinct !DILocation(line: 171, column: 2, scope: !437, inlinedAt: !945)
!956 = !DILocation(line: 112, column: 9, scope: !459, inlinedAt: !955)
!957 = !DILocation(line: 177, column: 27, scope: !437, inlinedAt: !945)
!958 = !DILocation(line: 121, column: 95, scope: !467, inlinedAt: !959)
!959 = distinct !DILocation(line: 177, column: 2, scope: !437, inlinedAt: !945)
!960 = !DILocation(line: 123, column: 9, scope: !467, inlinedAt: !959)
!961 = !DILocation(line: 179, column: 2, scope: !437, inlinedAt: !945)
!962 = !DILocation(line: 397, column: 8, scope: !910)
!963 = !DILocation(line: 399, column: 6, scope: !964)
!964 = distinct !DILexicalBlock(scope: !910, file: !405, line: 399, column: 6)
!965 = !DILocation(line: 399, column: 13, scope: !964)
!966 = !DILocation(line: 399, column: 6, scope: !910)
!967 = !DILocation(line: 400, column: 7, scope: !968)
!968 = distinct !DILexicalBlock(scope: !964, file: !405, line: 399, column: 19)
!969 = !DILocation(line: 401, column: 3, scope: !968)
!970 = !DILocation(line: 404, column: 7, scope: !971)
!971 = distinct !DILexicalBlock(scope: !910, file: !405, line: 404, column: 6)
!972 = !DILocation(line: 404, column: 16, scope: !971)
!973 = !DILocation(line: 404, column: 22, scope: !971)
!974 = !DILocation(line: 404, column: 26, scope: !971)
!975 = !DILocation(line: 404, column: 37, scope: !971)
!976 = !DILocation(line: 404, column: 47, scope: !971)
!977 = !DILocation(line: 404, column: 35, scope: !971)
!978 = !DILocation(line: 404, column: 6, scope: !910)
!979 = !DILocation(line: 405, column: 7, scope: !980)
!980 = distinct !DILexicalBlock(scope: !971, file: !405, line: 404, column: 58)
!981 = !DILocation(line: 406, column: 3, scope: !980)
!982 = !DILocation(line: 409, column: 10, scope: !910)
!983 = !DILocalVariable(name: "idx", scope: !984, file: !405, line: 417, type: !210)
!984 = distinct !DILexicalBlock(scope: !910, file: !405, line: 417, column: 2)
!985 = !DILocation(line: 417, column: 14, scope: !984)
!986 = !DILocation(line: 417, column: 7, scope: !984)
!987 = !DILocation(line: 417, column: 23, scope: !988)
!988 = distinct !DILexicalBlock(scope: !984, file: !405, line: 417, column: 2)
!989 = !DILocation(line: 417, column: 29, scope: !988)
!990 = !DILocation(line: 417, column: 39, scope: !988)
!991 = !DILocation(line: 417, column: 27, scope: !988)
!992 = !DILocation(line: 417, column: 2, scope: !984)
!993 = !DILocation(line: 418, column: 8, scope: !994)
