; ModuleID = '../bc_files/cbprintf_complete.bc'
source_filename = "/home/sri/zephyrproject/zephyr/lib/os/cbprintf_complete.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.__va_list = type { ptr }
%struct.anon = type { %union.argument_value, %struct.conversion }
%union.argument_value = type { i64 }
%struct.conversion = type { i8, i8, i8, i8, %union.anon, %union.anon.0 }
%union.anon = type { i32 }
%union.anon.0 = type { i32 }

@.str = private unnamed_addr constant [6 x i8] c"(nil)\00", align 1, !dbg !0
@__aeabi_ctype_table_ = external constant [257 x i8], align 1

; Function Attrs: noinline nounwind optnone
define hidden i32 @z_cbvprintf_impl(ptr noundef %0, ptr noundef %1, ptr noundef %2, [1 x i32] %3, i32 noundef %4) #0 !dbg !70 {
  %6 = alloca i32, align 4
  %7 = alloca %struct.__va_list, align 4
  %8 = alloca ptr, align 4
  %9 = alloca ptr, align 4
  %10 = alloca ptr, align 4
  %11 = alloca i32, align 4
  %12 = alloca [22 x i8], align 1
  %13 = alloca i32, align 4
  %14 = alloca i64, align 8
  %15 = alloca i8, align 1
  %16 = alloca i32, align 4
  %17 = alloca %struct.anon, align 8
  %18 = alloca ptr, align 4
  %19 = alloca ptr, align 4
  %20 = alloca ptr, align 4
  %21 = alloca i32, align 4
  %22 = alloca i32, align 4
  %23 = alloca ptr, align 4
  %24 = alloca ptr, align 4
  %25 = alloca i8, align 1
  %26 = alloca i32, align 4
  %27 = alloca i8, align 1
  %28 = alloca i8, align 1

!72 = !{!30, !73, !78, !44, !79, !85}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbprintf_cb", file: !74, line: 302, baseType: !75)
!74 = !DIFile(filename: "include/zephyr/sys/cbprintf.h", directory: "/home/sri/zephyrproject/zephyr")
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = !DISubroutineType(types: !77)
!77 = !{!30, null}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !80, line: 22, baseType: !81)
!80 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stdarg.h", directory: "")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !8, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 32, elements: !83)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__ap", scope: !82, file: !8, baseType: !78, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !33, line: 64, baseType: !39)
!86 = !{}
!87 = !DILocalVariable(name: "out", arg: 1, scope: !70, file: !2, line: 1338, type: !73)
!88 = !DILocation(line: 1338, column: 34, scope: !70)
!89 = !DILocalVariable(name: "ctx", arg: 2, scope: !70, file: !2, line: 1338, type: !78)
!90 = !DILocation(line: 1338, column: 45, scope: !70)
!91 = !DILocalVariable(name: "fp", arg: 3, scope: !70, file: !2, line: 1338, type: !44)
!92 = !DILocation(line: 1338, column: 62, scope: !70)
!93 = !DILocalVariable(name: "ap", arg: 4, scope: !70, file: !2, line: 1339, type: !79)
!94 = !DILocation(line: 1339, column: 16, scope: !70)
!95 = !DILocalVariable(name: "flags", arg: 5, scope: !70, file: !2, line: 1339, type: !85)
!96 = !DILocation(line: 1339, column: 29, scope: !70)
!97 = !DILocalVariable(name: "buf", scope: !70, file: !2, line: 1341, type: !98)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 22)
!101 = !DILocation(line: 1341, column: 7, scope: !70)
!102 = !DILocalVariable(name: "count", scope: !70, file: !2, line: 1342, type: !46)
!103 = !DILocation(line: 1342, column: 9, scope: !70)
!104 = !DILocalVariable(name: "sint", scope: !70, file: !2, line: 1343, type: !31)
!105 = !DILocation(line: 1343, column: 18, scope: !70)
!106 = !DILocalVariable(name: "tagged_ap", scope: !70, file: !2, line: 1345, type: !107)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!109 = !DILocation(line: 1345, column: 14, scope: !70)
!110 = !DILocation(line: 1345, column: 27, scope: !70)
!111 = !DILocation(line: 1345, column: 33, scope: !70)
!112 = !DILocation(line: 1346, column: 11, scope: !70)
!113 = !DILocation(line: 1375, column: 2, scope: !70)
!114 = !DILocation(line: 1375, column: 10, scope: !70)
!115 = !DILocation(line: 1375, column: 9, scope: !70)
!116 = !DILocation(line: 1375, column: 13, scope: !70)
!117 = !DILocation(line: 1376, column: 8, scope: !118)
!118 = distinct !DILexicalBlock(scope: !119, file: !2, line: 1376, column: 7)
!119 = distinct !DILexicalBlock(scope: !70, file: !2, line: 1375, column: 19)
!120 = !DILocation(line: 1376, column: 7, scope: !118)
!121 = !DILocation(line: 1376, column: 11, scope: !118)
!122 = !DILocation(line: 1376, column: 7, scope: !119)
!123 = !DILocation(line: 1377, column: 4, scope: !124)
!124 = distinct !DILexicalBlock(scope: !118, file: !2, line: 1376, column: 19)
!125 = !DILocalVariable(name: "rc", scope: !126, file: !2, line: 1377, type: !30)
!126 = distinct !DILexicalBlock(scope: !124, file: !2, line: 1377, column: 7)
!127 = !DILocation(line: 1377, column: 13, scope: !126)
!128 = !DILocation(line: 1377, column: 20, scope: !126)
!129 = !DILocation(line: 1377, column: 34, scope: !126)
!130 = !DILocation(line: 1377, column: 31, scope: !126)
!131 = !DILocation(line: 1377, column: 25, scope: !126)
!132 = !DILocation(line: 1377, column: 39, scope: !126)
!133 = !DILocation(line: 1377, column: 18, scope: !126)
!134 = !DILocation(line: 1377, column: 49, scope: !135)
!135 = distinct !DILexicalBlock(scope: !126, file: !2, line: 1377, column: 49)
!136 = !DILocation(line: 1377, column: 52, scope: !135)
!137 = !DILocation(line: 1377, column: 49, scope: !126)
!138 = !DILocation(line: 1377, column: 66, scope: !139)
!139 = distinct !DILexicalBlock(scope: !135, file: !2, line: 1377, column: 57)
!140 = !DILocation(line: 1377, column: 59, scope: !139)
!141 = !DILocation(line: 1377, column: 72, scope: !126)
!142 = !DILocation(line: 1377, column: 81, scope: !126)
!143 = !DILocation(line: 1378, column: 4, scope: !124)
!144 = distinct !{!144, !113, !145}
!145 = !DILocation(line: 1839, column: 2, scope: !70)
!146 = !DILocalVariable(name: "state", scope: !119, file: !2, line: 1395, type: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !2, line: 1392, size: 192, elements: !148)
!148 = !{!149, !159}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !147, file: !2, line: 1393, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "argument_value", file: !2, line: 166, size: 64, elements: !151)
!151 = !{!152, !153, !154, !156, !158}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sint", scope: !150, file: !2, line: 168, baseType: !31, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "uint", scope: !150, file: !2, line: 171, baseType: !40, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !150, file: !2, line: 174, baseType: !155, size: 64)
!155 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ldbl", scope: !150, file: !2, line: 177, baseType: !157, size: 64)
!157 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !150, file: !2, line: 180, baseType: !78, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "conv", scope: !147, file: !2, line: 1394, baseType: !160, size: 96, offset: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conversion", file: !2, line: 189, size: 96, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !186}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "invalid", scope: !160, file: !2, line: 191, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "unsupported", scope: !160, file: !2, line: 194, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dash", scope: !160, file: !2, line: 197, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flag_plus", scope: !160, file: !2, line: 200, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flag_space", scope: !160, file: !2, line: 203, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flag_hash", scope: !160, file: !2, line: 206, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "flag_zero", scope: !160, file: !2, line: 209, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "width_present", scope: !160, file: !2, line: 212, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "width_star", scope: !160, file: !2, line: 219, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "prec_present", scope: !160, file: !2, line: 222, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 8)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prec_star", scope: !160, file: !2, line: 229, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 8)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "length_mod", scope: !160, file: !2, line: 232, baseType: !39, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "specifier_a", scope: !160, file: !2, line: 238, baseType: !108, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "specifier_cat", scope: !160, file: !2, line: 241, baseType: !39, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 16)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "altform_0", scope: !160, file: !2, line: 244, baseType: !108, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 16)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "altform_0c", scope: !160, file: !2, line: 247, baseType: !108, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 16)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pad_postdp", scope: !160, file: !2, line: 252, baseType: !108, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 16)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pad_fp", scope: !160, file: !2, line: 257, baseType: !108, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 16)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "specifier", scope: !160, file: !2, line: 260, baseType: !11, size: 8, offset: 24)
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !160, file: !2, line: 262, baseType: !182, size: 32, offset: 32)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !160, file: !2, line: 262, size: 32, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "width_value", scope: !182, file: !2, line: 267, baseType: !30, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pad0_value", scope: !182, file: !2, line: 289, baseType: !30, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, scope: !160, file: !2, line: 292, baseType: !187, size: 32, offset: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !160, file: !2, line: 292, size: 32, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prec_value", scope: !187, file: !2, line: 297, baseType: !30, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pad0_pre_exp", scope: !187, file: !2, line: 306, baseType: !30, size: 32)
!191 = !DILocation(line: 1395, column: 5, scope: !119)
!192 = !DILocalVariable(name: "conv", scope: !119, file: !2, line: 1400, type: !193)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!195 = !DILocation(line: 1400, column: 28, scope: !119)
!196 = !DILocation(line: 1400, column: 42, scope: !119)
!197 = !DILocalVariable(name: "value", scope: !119, file: !2, line: 1401, type: !198)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!200 = !DILocation(line: 1401, column: 31, scope: !119)
!201 = !DILocation(line: 1401, column: 46, scope: !119)
!202 = !DILocalVariable(name: "sp", scope: !119, file: !2, line: 1402, type: !44)
!203 = !DILocation(line: 1402, column: 15, scope: !119)
!204 = !DILocation(line: 1402, column: 20, scope: !119)
!205 = !DILocalVariable(name: "width", scope: !119, file: !2, line: 1403, type: !30)
!206 = !DILocation(line: 1403, column: 7, scope: !119)
!207 = !DILocalVariable(name: "precision", scope: !119, file: !2, line: 1404, type: !30)
!208 = !DILocation(line: 1404, column: 7, scope: !119)
!209 = !DILocalVariable(name: "bps", scope: !119, file: !2, line: 1405, type: !44)
!210 = !DILocation(line: 1405, column: 15, scope: !119)
!211 = !DILocalVariable(name: "bpe", scope: !119, file: !2, line: 1406, type: !44)
!212 = !DILocation(line: 1406, column: 15, scope: !119)
!213 = !DILocation(line: 1406, column: 21, scope: !119)
!214 = !DILocation(line: 1406, column: 25, scope: !119)
!215 = !DILocalVariable(name: "sign", scope: !119, file: !2, line: 1407, type: !4)
!216 = !DILocation(line: 1407, column: 8, scope: !119)
!217 = !DILocation(line: 1409, column: 27, scope: !119)
!218 = !DILocation(line: 1409, column: 33, scope: !119)
!219 = !DILocation(line: 1409, column: 8, scope: !119)
!220 = !DILocation(line: 1409, column: 6, scope: !119)
!221 = !DILocation(line: 1414, column: 7, scope: !222)
!222 = distinct !DILexicalBlock(scope: !119, file: !2, line: 1414, column: 7)
!223 = !DILocation(line: 1414, column: 13, scope: !222)
!224 = !DILocation(line: 1414, column: 7, scope: !119)
!225 = !DILocation(line: 1415, column: 12, scope: !226)
!226 = distinct !DILexicalBlock(scope: !222, file: !2, line: 1414, column: 25)
!227 = !DILocation(line: 1415, column: 10, scope: !226)
!228 = !DILocation(line: 1417, column: 8, scope: !229)
!229 = distinct !DILexicalBlock(scope: !226, file: !2, line: 1417, column: 8)
!230 = !DILocation(line: 1417, column: 14, scope: !229)
!231 = !DILocation(line: 1417, column: 8, scope: !226)
!232 = !DILocation(line: 1418, column: 5, scope: !233)
!233 = distinct !DILexicalBlock(scope: !229, file: !2, line: 1417, column: 19)
!234 = !DILocation(line: 1418, column: 21, scope: !233)
!235 = !DILocation(line: 1419, column: 14, scope: !233)
