; ModuleID = '../bc_files/cbprintf_complete.bc'
source_filename = "/home/sri/zephyrproject/zephyr/lib/os/cbprintf_complete.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.__va_list = type { ptr }
%struct.anon = type { %union.argument_value, %struct.conversion }
%union.argument_value = type { i64 }
%struct.conversion = type { i8, i8, i8, i8, %union.anon, %union.anon.0 }
%union.anon = type { i32 }
%union.anon.0 = type { i32 }

@.str = private unnamed_addr constant [6 x i8] c"(nil)\00", align 1, !dbg !0
@__aeabi_ctype_table_ = external dso_local constant [257 x i8], align 1

; Function Attrs: nounwind optsize
define hidden i32 @z_cbvprintf_impl(ptr noundef %0, ptr noundef %1, ptr noundef %2, [1 x i32] %3, i32 noundef %4) #0 !dbg !68 {
  %6 = alloca i32, align 4
  %7 = alloca %struct.__va_list, align 4
  %8 = alloca ptr, align 4
  %9 = alloca ptr, align 4
  %10 = alloca ptr, align 4
  %11 = alloca i32, align 4
  %12 = alloca [22 x i8], align 1
  %13 = alloca i32, align 4
  %14 = alloca i64, align 8
  %15 = alloca i8, align 1
  %16 = alloca i32, align 4
  %17 = alloca i32, align 4
  %18 = alloca %struct.anon, align 8
  %19 = alloca ptr, align 4
  %20 = alloca ptr, align 4
  %21 = alloca ptr, align 4
  %22 = alloca i32, align 4
  %23 = alloca i32, align 4
  %24 = alloca ptr, align 4
  %25 = alloca ptr, align 4
  %26 = alloca i8, align 1
  %27 = alloca i32, align 4
  %28 = alloca i8, align 1

!43 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !47, line: 51, baseType: !39)
!47 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/string.h", directory: "")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !33, line: 102, baseType: !39)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32)
!52 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !58, line: 35, baseType: !30)
!58 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!60 = !{!0}
!61 = !{i32 7, !"Dwarf Version", i32 4}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{i32 1, !"wchar_size", i32 4}
!64 = !{i32 1, !"static_rwdata", i32 1}
!65 = !{i32 1, !"enumsize_buildattr", i32 1}
!66 = !{i32 1, !"armlib_unavailable", i32 0}
!67 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!68 = distinct !DISubprogram(name: "z_cbvprintf_impl", scope: !2, file: !2, line: 1338, type: !69, scopeLine: 1340, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !84)
!69 = !DISubroutineType(types: !70)
!70 = !{!30, !71, !76, !44, !77, !83}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbprintf_cb", file: !72, line: 302, baseType: !73)
!72 = !DIFile(filename: "include/zephyr/sys/cbprintf.h", directory: "/home/sri/zephyrproject/zephyr")
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!74 = !DISubroutineType(types: !75)
!75 = !{!30, null}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !78, line: 22, baseType: !79)
!78 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stdarg.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !8, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 32, elements: !81)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__ap", scope: !80, file: !8, baseType: !76, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !33, line: 64, baseType: !39)
!84 = !{!85, !86, !87, !88, !89, !90, !94, !95, !96, !99, !104, !149, !152, !155, !156, !157, !158, !159, !160, !161, !164, !165, !166, !170, !173, !175, !178, !179, !180, !185, !191, !194, !198, !204, !208, !211, !213, !216}
!85 = !DILocalVariable(name: "out", arg: 1, scope: !68, file: !2, line: 1338, type: !71)
!86 = !DILocalVariable(name: "ctx", arg: 2, scope: !68, file: !2, line: 1338, type: !76)
!87 = !DILocalVariable(name: "fp", arg: 3, scope: !68, file: !2, line: 1338, type: !44)
!88 = !DILocalVariable(name: "ap", arg: 4, scope: !68, file: !2, line: 1339, type: !77)
!89 = !DILocalVariable(name: "flags", arg: 5, scope: !68, file: !2, line: 1339, type: !83)
!90 = !DILocalVariable(name: "buf", scope: !68, file: !2, line: 1341, type: !91)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 22)
!94 = !DILocalVariable(name: "count", scope: !68, file: !2, line: 1342, type: !46)
!95 = !DILocalVariable(name: "sint", scope: !68, file: !2, line: 1343, type: !31)
!96 = !DILocalVariable(name: "tagged_ap", scope: !68, file: !2, line: 1345, type: !97)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!99 = !DILocalVariable(name: "rc", scope: !100, file: !2, line: 1377, type: !30)
!100 = distinct !DILexicalBlock(scope: !101, file: !2, line: 1377, column: 7)
!101 = distinct !DILexicalBlock(scope: !102, file: !2, line: 1376, column: 19)
!102 = distinct !DILexicalBlock(scope: !103, file: !2, line: 1376, column: 7)
!103 = distinct !DILexicalBlock(scope: !68, file: !2, line: 1375, column: 19)
!104 = !DILocalVariable(name: "state", scope: !103, file: !2, line: 1395, type: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !68, file: !2, line: 1392, size: 192, elements: !106)
!106 = !{!107, !117}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !105, file: !2, line: 1393, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "argument_value", file: !2, line: 166, size: 64, elements: !109)
!109 = !{!110, !111, !112, !114, !116}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "sint", scope: !108, file: !2, line: 168, baseType: !31, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "uint", scope: !108, file: !2, line: 171, baseType: !40, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !108, file: !2, line: 174, baseType: !113, size: 64)
!113 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ldbl", scope: !108, file: !2, line: 177, baseType: !115, size: 64)
!115 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !108, file: !2, line: 180, baseType: !76, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "conv", scope: !105, file: !2, line: 1394, baseType: !118, size: 96, offset: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conversion", file: !2, line: 189, size: 96, elements: !119)
!119 = !{!120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !144}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "invalid", scope: !118, file: !2, line: 191, baseType: !98, size: 1, flags: DIFlagBitField, extraData: i64 0)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "unsupported", scope: !118, file: !2, line: 194, baseType: !98, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dash", scope: !118, file: !2, line: 197, baseType: !98, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "flag_plus", scope: !118, file: !2, line: 200, baseType: !98, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flag_space", scope: !118, file: !2, line: 203, baseType: !98, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flag_hash", scope: !118, file: !2, line: 206, baseType: !98, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "flag_zero", scope: !118, file: !2, line: 209, baseType: !98, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "width_present", scope: !118, file: !2, line: 212, baseType: !98, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "width_star", scope: !118, file: !2, line: 219, baseType: !98, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "prec_present", scope: !118, file: !2, line: 222, baseType: !98, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 8)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "prec_star", scope: !118, file: !2, line: 229, baseType: !98, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 8)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "length_mod", scope: !118, file: !2, line: 232, baseType: !39, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "specifier_a", scope: !118, file: !2, line: 238, baseType: !98, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "specifier_cat", scope: !118, file: !2, line: 241, baseType: !39, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 16)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "altform_0", scope: !118, file: !2, line: 244, baseType: !98, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 16)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "altform_0c", scope: !118, file: !2, line: 247, baseType: !98, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 16)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pad_postdp", scope: !118, file: !2, line: 252, baseType: !98, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pad_fp", scope: !118, file: !2, line: 257, baseType: !98, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 16)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "specifier", scope: !118, file: !2, line: 260, baseType: !11, size: 8, offset: 24)
!139 = !DIDerivedType(tag: DW_TAG_member, scope: !118, file: !2, line: 262, baseType: !140, size: 32, offset: 32)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !118, file: !2, line: 262, size: 32, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "width_value", scope: !140, file: !2, line: 267, baseType: !30, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pad0_value", scope: !140, file: !2, line: 289, baseType: !30, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, scope: !118, file: !2, line: 292, baseType: !145, size: 32, offset: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !118, file: !2, line: 292, size: 32, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "prec_value", scope: !145, file: !2, line: 297, baseType: !30, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pad0_pre_exp", scope: !145, file: !2, line: 306, baseType: !30, size: 32)
!149 = !DILocalVariable(name: "conv", scope: !103, file: !2, line: 1400, type: !150)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!152 = !DILocalVariable(name: "value", scope: !103, file: !2, line: 1401, type: !153)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!155 = !DILocalVariable(name: "sp", scope: !103, file: !2, line: 1402, type: !44)
!156 = !DILocalVariable(name: "width", scope: !103, file: !2, line: 1403, type: !30)
!157 = !DILocalVariable(name: "precision", scope: !103, file: !2, line: 1404, type: !30)
!158 = !DILocalVariable(name: "bps", scope: !103, file: !2, line: 1405, type: !44)
!159 = !DILocalVariable(name: "bpe", scope: !103, file: !2, line: 1406, type: !44)
!160 = !DILocalVariable(name: "sign", scope: !103, file: !2, line: 1407, type: !4)
!161 = !DILocalVariable(name: "arg", scope: !162, file: !2, line: 1432, type: !30)
!162 = distinct !DILexicalBlock(scope: !163, file: !2, line: 1431, column: 24)
!163 = distinct !DILexicalBlock(scope: !103, file: !2, line: 1431, column: 7)
!164 = !DILocalVariable(name: "specifier_cat", scope: !103, file: !2, line: 1468, type: !10)
!165 = !DILocalVariable(name: "length_mod", scope: !103, file: !2, line: 1470, type: !18)
!166 = !DILocalVariable(name: "rc", scope: !167, file: !2, line: 1575, type: !30)
!167 = distinct !DILexicalBlock(scope: !168, file: !2, line: 1575, column: 7)
!168 = distinct !DILexicalBlock(scope: !169, file: !2, line: 1574, column: 43)
!169 = distinct !DILexicalBlock(scope: !103, file: !2, line: 1574, column: 7)
!170 = !DILocalVariable(name: "rc", scope: !171, file: !2, line: 1584, type: !30)
!171 = distinct !DILexicalBlock(scope: !172, file: !2, line: 1584, column: 7)
!172 = distinct !DILexicalBlock(scope: !103, file: !2, line: 1582, column: 28)
!173 = !DILocalVariable(name: "len", scope: !174, file: !2, line: 1589, type: !46)
!174 = distinct !DILexicalBlock(scope: !172, file: !2, line: 1586, column: 13)
!175 = !DILocalVariable(name: "len", scope: !176, file: !2, line: 1641, type: !46)
!176 = distinct !DILexicalBlock(scope: !177, file: !2, line: 1640, column: 24)
!177 = distinct !DILexicalBlock(scope: !172, file: !2, line: 1640, column: 8)
!178 = !DILocalVariable(name: "nj_len", scope: !103, file: !2, line: 1722, type: !46)
!179 = !DILocalVariable(name: "pad_len", scope: !103, file: !2, line: 1723, type: !30)
!180 = !DILocalVariable(name: "pad", scope: !181, file: !2, line: 1751, type: !4)
!181 = distinct !DILexicalBlock(scope: !182, file: !2, line: 1750, column: 26)
!182 = distinct !DILexicalBlock(scope: !183, file: !2, line: 1750, column: 8)
!183 = distinct !DILexicalBlock(scope: !184, file: !2, line: 1747, column: 18)
!184 = distinct !DILexicalBlock(scope: !103, file: !2, line: 1747, column: 7)
