; ModuleID = '../bc_files/clock_stm32_ll_common.bc'
source_filename = "/home/sri/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.clock_control_driver_api = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.device_state = type { i8, i8 }
%struct.device = type { ptr, ptr, ptr, ptr, ptr }
%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }

!23 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!24 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!25 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!26 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!27 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!28 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!29 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!30 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!31 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!32 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 17)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 18)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 19)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 20)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 23)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 24)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 25)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 26)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 27)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 28)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 29)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 30)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 31)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 32)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 33)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 34)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 35)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 36)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 37)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 38)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 39)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 40)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 41)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 42)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 43)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 44)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 45)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 46)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 47)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!94 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !96, line: 44, baseType: !14, size: 8, elements: !97)
!96 = !DIFile(filename: "include/zephyr/drivers/clock_control.h", directory: "/home/sri/zephyrproject/zephyr")
!97 = !{!98, !99, !100, !101}
!98 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!99 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!100 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!101 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!102 = !{!103, !104, !105, !108, !128, !134}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !106, line: 64, baseType: !107)
!106 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!107 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !110, line: 461, baseType: !111)
!110 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 445, size: 448, elements: !112)
!112 = !{!113, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !111, file: !110, line: 447, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !105)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !111, file: !110, line: 448, baseType: !114, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !111, file: !110, line: 449, baseType: !114, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !111, file: !110, line: 450, baseType: !114, size: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !111, file: !110, line: 451, baseType: !114, size: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !111, file: !110, line: 452, baseType: !114, size: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !111, file: !110, line: 453, baseType: !114, size: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !111, file: !110, line: 454, baseType: !114, size: 32, offset: 224)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !111, file: !110, line: 455, baseType: !114, size: 32, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !111, file: !110, line: 456, baseType: !114, size: 32, offset: 288)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !111, file: !110, line: 457, baseType: !114, size: 32, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR2", scope: !111, file: !110, line: 458, baseType: !114, size: 32, offset: 352)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR3", scope: !111, file: !110, line: 459, baseType: !114, size: 32, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !111, file: !110, line: 460, baseType: !114, size: 32, offset: 416)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !130, line: 396, size: 64, elements: !131)
!130 = !DIFile(filename: "include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/sri/zephyrproject/zephyr")
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !129, file: !130, line: 397, baseType: !105, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !129, file: !130, line: 398, baseType: !105, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!135 = !{!0, !136, !158, !177, !7}
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !9, file: !2, line: 824, type: !138, isLocal: false, isDefinition: true, align: 32)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !140, line: 381, size: 160, elements: !141)
!140 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!141 = !{!142, !145, !148, !149, !157}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !139, file: !140, line: 383, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !139, file: !140, line: 385, baseType: !146, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !139, file: !140, line: 387, baseType: !146, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !139, file: !140, line: 389, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !140, line: 354, size: 16, elements: !152)
!152 = !{!153, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !151, file: !140, line: 362, baseType: !154, size: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !106, line: 62, baseType: !14)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !151, file: !140, line: 367, baseType: !156, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!156 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !139, file: !140, line: 391, baseType: !103, size: 32, offset: 128)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !9, file: !2, line: 824, type: !160, isLocal: true, isDefinition: true, align: 32)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !162, line: 92, size: 64, elements: !163)
!162 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!163 = !{!164, !176}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !161, file: !162, line: 94, baseType: !165, size: 32)
!165 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !162, line: 59, size: 32, elements: !166)
!166 = !{!167, !171}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !165, file: !162, line: 66, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DISubroutineType(types: !170)
!170 = !{!104}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !165, file: !162, line: 75, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = !DISubroutineType(types: !174)
!174 = !{!104, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !161, file: !162, line: 99, baseType: !175, size: 32, offset: 32)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !9, file: !2, line: 824, type: !151, isLocal: true, isDefinition: true, align: 8)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !96, line: 100, size: 224, elements: !180)
!180 = !{!181, !187, !188, !197, !203, !208, !214}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !179, file: !96, line: 101, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !96, line: 76, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{!104, !175, !186}
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !96, line: 56, baseType: !103)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !179, file: !96, line: 102, baseType: !182, size: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !179, file: !96, line: 103, baseType: !189, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !96, line: 83, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(types: !192)
!192 = !{!104, !175, !186, !193, !103}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !96, line: 72, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !175, !186, !103}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !179, file: !96, line: 104, baseType: !198, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !96, line: 79, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!104, !175, !186, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !179, file: !96, line: 105, baseType: !204, size: 32, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !96, line: 88, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DISubroutineType(types: !207)
!207 = !{!95, !175, !186}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !179, file: !96, line: 106, baseType: !209, size: 32, offset: 160)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !96, line: 92, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DISubroutineType(types: !212)
!212 = !{!104, !175, !186, !213}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !96, line: 64, baseType: !103)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !179, file: !96, line: 107, baseType: !215, size: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !96, line: 96, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DISubroutineType(types: !218)
!218 = !{!104, !175, !186, !103}
!219 = !{i32 7, !"Dwarf Version", i32 4}
!220 = !{i32 2, !"Debug Info Version", i32 3}
!221 = !{i32 1, !"wchar_size", i32 4}
!222 = !{i32 1, !"static_rwdata", i32 1}
!223 = !{i32 1, !"enumsize_buildattr", i32 1}
!224 = !{i32 1, !"armlib_unavailable", i32 0}
!225 = !{i32 8, !"PIC Level", i32 2}
!226 = !{i32 7, !"PIE Level", i32 2}
!227 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!228 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !140, file: !140, line: 744, type: !229, scopeLine: 745, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!229 = !DISubroutineType(types: !230)
!230 = !{!156, !175}
!231 = !{}
!232 = !DILocalVariable(name: "dev", arg: 1, scope: !228, file: !140, line: 744, type: !175)
!233 = !DILocation(line: 744, column: 65, scope: !228)
!234 = !DILocation(line: 746, column: 27, scope: !228)
!235 = !DILocation(line: 746, column: 9, scope: !228)
!236 = !DILocation(line: 746, column: 2, scope: !228)
!237 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !13, file: !13, line: 223, type: !238, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !146, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !242, line: 250, size: 896, elements: !243)
!242 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!243 = !{!244, !313, !326, !327, !328, !329, !349}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !241, file: !242, line: 252, baseType: !245, size: 384)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !242, line: 58, size: 384, elements: !246)
!246 = !{!247, !275, !283, !284, !285, !298, !299, !300}
!247 = !DIDerivedType(tag: DW_TAG_member, scope: !245, file: !242, line: 61, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !245, file: !242, line: 61, size: 64, elements: !249)
!249 = !{!250, !266}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !248, file: !242, line: 62, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !252, line: 55, baseType: !253)
!252 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !252, line: 37, size: 64, elements: !254)
!254 = !{!255, !261}
!255 = !DIDerivedType(tag: DW_TAG_member, scope: !253, file: !252, line: 38, baseType: !256, size: 32)
!256 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !253, file: !252, line: 38, size: 32, elements: !257)
!257 = !{!258, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !256, file: !252, line: 39, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !252, line: 40, baseType: !259, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, scope: !253, file: !252, line: 42, baseType: !262, size: 32, offset: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !253, file: !252, line: 42, size: 32, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !262, file: !252, line: 43, baseType: !259, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !262, file: !252, line: 44, baseType: !259, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !248, file: !242, line: 63, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !268, line: 58, size: 64, elements: !269)
!268 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !267, file: !268, line: 60, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 64, elements: !273)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!273 = !{!274}
!274 = !DISubrange(count: 2)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !245, file: !242, line: 69, baseType: !276, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !278, line: 243, baseType: !279)
!278 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 241, size: 64, elements: !280)
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !279, file: !278, line: 242, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !252, line: 51, baseType: !253)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !245, file: !242, line: 72, baseType: !154, size: 8, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !245, file: !242, line: 75, baseType: !154, size: 8, offset: 104)
!285 = !DIDerivedType(tag: DW_TAG_member, scope: !245, file: !242, line: 91, baseType: !286, size: 16, offset: 112)
!286 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !245, file: !242, line: 91, size: 16, elements: !287)
!287 = !{!288, !295}
!288 = !DIDerivedType(tag: DW_TAG_member, scope: !286, file: !242, line: 92, baseType: !289, size: 16)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !242, line: 92, size: 16, elements: !290)
!290 = !{!291, !294}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !289, file: !242, line: 97, baseType: !292, size: 8)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !106, line: 56, baseType: !293)
!293 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !289, file: !242, line: 98, baseType: !154, size: 8, offset: 8)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !286, file: !242, line: 101, baseType: !296, size: 16)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !106, line: 63, baseType: !297)
!297 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !245, file: !242, line: 108, baseType: !105, size: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !245, file: !242, line: 132, baseType: !103, size: 32, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !245, file: !242, line: 136, baseType: !301, size: 192, offset: 192)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !278, line: 254, size: 192, elements: !302)
!302 = !{!303, !304, !310}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !301, file: !278, line: 255, baseType: !251, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !301, file: !278, line: 256, baseType: !305, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !278, line: 252, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !301, file: !278, line: 259, baseType: !311, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !106, line: 59, baseType: !312)
!312 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !241, file: !242, line: 255, baseType: !314, size: 288, offset: 384)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !315, line: 25, size: 288, elements: !316)
!315 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !314, file: !315, line: 26, baseType: !105, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !314, file: !315, line: 27, baseType: !105, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !314, file: !315, line: 28, baseType: !105, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !314, file: !315, line: 29, baseType: !105, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !314, file: !315, line: 30, baseType: !105, size: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !314, file: !315, line: 31, baseType: !105, size: 32, offset: 160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !314, file: !315, line: 32, baseType: !105, size: 32, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !314, file: !315, line: 33, baseType: !105, size: 32, offset: 224)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !314, file: !315, line: 34, baseType: !105, size: 32, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !241, file: !242, line: 258, baseType: !103, size: 32, offset: 672)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !241, file: !242, line: 261, baseType: !277, size: 64, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !241, file: !242, line: 302, baseType: !104, size: 32, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !241, file: !242, line: 333, baseType: !330, size: 32, offset: 800)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !332, line: 5291, size: 160, elements: !333)
!332 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!333 = !{!334, !345, !346}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !331, file: !332, line: 5292, baseType: !335, size: 96)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !336, line: 56, size: 96, elements: !337)
!336 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!337 = !{!338, !341, !342}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !335, file: !336, line: 57, baseType: !339, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !336, line: 57, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !335, file: !336, line: 58, baseType: !103, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !335, file: !336, line: 59, baseType: !343, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !344, line: 46, baseType: !107)
!344 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!345 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !331, file: !332, line: 5293, baseType: !277, size: 64, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !331, file: !332, line: 5294, baseType: !347, offset: 160)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !348, line: 45, elements: !231)
!348 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!349 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !241, file: !242, line: 355, baseType: !350, size: 64, offset: 832)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !315, line: 60, size: 64, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !350, file: !315, line: 63, baseType: !105, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !350, file: !315, line: 66, baseType: !105, size: 32, offset: 32)
!354 = !DILocalVariable(name: "object", arg: 1, scope: !237, file: !13, line: 223, type: !146)
!355 = !DILocation(line: 223, column: 61, scope: !237)
!356 = !DILocalVariable(name: "thread", arg: 2, scope: !237, file: !13, line: 224, type: !240)
!357 = !DILocation(line: 224, column: 24, scope: !237)
!358 = !DILocation(line: 226, column: 9, scope: !237)
!359 = !DILocation(line: 227, column: 9, scope: !237)
!360 = !DILocation(line: 228, column: 1, scope: !237)
!361 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !13, file: !13, line: 243, type: !362, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !146}
!364 = !DILocalVariable(name: "object", arg: 1, scope: !361, file: !13, line: 243, type: !146)
!365 = !DILocation(line: 243, column: 56, scope: !361)
!366 = !DILocation(line: 245, column: 9, scope: !361)
!367 = !DILocation(line: 246, column: 1, scope: !361)
!368 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !13, file: !13, line: 359, type: !369, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!369 = !DISubroutineType(types: !370)
!370 = !{!103, !12}
!371 = !DILocalVariable(name: "otype", arg: 1, scope: !368, file: !13, line: 359, type: !12)
!372 = !DILocation(line: 359, column: 58, scope: !368)
!373 = !DILocation(line: 361, column: 9, scope: !368)
!374 = !DILocation(line: 363, column: 2, scope: !368)
!375 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !13, file: !13, line: 366, type: !376, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!376 = !DISubroutineType(types: !377)
!377 = !{!103, !12, !343}
!378 = !DILocalVariable(name: "otype", arg: 1, scope: !375, file: !13, line: 366, type: !12)
!379 = !DILocation(line: 366, column: 63, scope: !375)
!380 = !DILocalVariable(name: "size", arg: 2, scope: !375, file: !13, line: 367, type: !343)
!381 = !DILocation(line: 367, column: 13, scope: !375)
!382 = !DILocation(line: 369, column: 9, scope: !375)
!383 = !DILocation(line: 370, column: 9, scope: !375)
!384 = !DILocation(line: 372, column: 2, scope: !375)
!385 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !332, file: !332, line: 656, type: !386, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!386 = !DISubroutineType(types: !387)
!387 = !{!388, !390}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !389, line: 46, baseType: !311)
!389 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!392 = !DILocalVariable(name: "t", arg: 1, scope: !385, file: !332, line: 657, type: !390)
!393 = !DILocation(line: 657, column: 30, scope: !385)
!394 = !DILocation(line: 659, column: 28, scope: !385)
!395 = !DILocation(line: 659, column: 31, scope: !385)
!396 = !DILocation(line: 659, column: 36, scope: !385)
!397 = !DILocation(line: 659, column: 9, scope: !385)
!398 = !DILocation(line: 659, column: 2, scope: !385)
!399 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !332, file: !332, line: 671, type: !386, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!400 = !DILocalVariable(name: "t", arg: 1, scope: !399, file: !332, line: 672, type: !390)
!401 = !DILocation(line: 672, column: 30, scope: !399)
!402 = !DILocation(line: 674, column: 30, scope: !399)
!403 = !DILocation(line: 674, column: 33, scope: !399)
!404 = !DILocation(line: 674, column: 38, scope: !399)
!405 = !DILocation(line: 674, column: 9, scope: !399)
!406 = !DILocation(line: 674, column: 2, scope: !399)
!407 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !332, file: !332, line: 1634, type: !408, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!408 = !DISubroutineType(types: !409)
!409 = !{!388, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !332, line: 1439, size: 448, elements: !413)
!413 = !{!414, !415, !416, !421, !422, !427, !428}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !412, file: !332, line: 1445, baseType: !301, size: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !412, file: !332, line: 1448, baseType: !277, size: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !412, file: !332, line: 1451, baseType: !417, size: 32, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !412, file: !332, line: 1454, baseType: !417, size: 32, offset: 288)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !412, file: !332, line: 1457, baseType: !423, size: 64, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !389, line: 67, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 65, size: 64, elements: !425)
!425 = !{!426}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !424, file: !389, line: 66, baseType: !388, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !412, file: !332, line: 1460, baseType: !105, size: 32, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !412, file: !332, line: 1463, baseType: !103, size: 32, offset: 416)
!429 = !DILocalVariable(name: "timer", arg: 1, scope: !407, file: !332, line: 1635, type: !410)
!430 = !DILocation(line: 1635, column: 34, scope: !407)
!431 = !DILocation(line: 1637, column: 28, scope: !407)
!432 = !DILocation(line: 1637, column: 35, scope: !407)
!433 = !DILocation(line: 1637, column: 9, scope: !407)
!434 = !DILocation(line: 1637, column: 2, scope: !407)
!435 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !332, file: !332, line: 1649, type: !408, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!436 = !DILocalVariable(name: "timer", arg: 1, scope: !435, file: !332, line: 1650, type: !410)
!437 = !DILocation(line: 1650, column: 34, scope: !435)
!438 = !DILocation(line: 1652, column: 30, scope: !435)
!439 = !DILocation(line: 1652, column: 37, scope: !435)
!440 = !DILocation(line: 1652, column: 9, scope: !435)
!441 = !DILocation(line: 1652, column: 2, scope: !435)
!442 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !332, file: !332, line: 1689, type: !443, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !420, !103}
!445 = !DILocalVariable(name: "timer", arg: 1, scope: !442, file: !332, line: 1689, type: !420)
!446 = !DILocation(line: 1689, column: 65, scope: !442)
!447 = !DILocalVariable(name: "user_data", arg: 2, scope: !442, file: !332, line: 1690, type: !103)
!448 = !DILocation(line: 1690, column: 19, scope: !442)
!449 = !DILocation(line: 1692, column: 21, scope: !442)
!450 = !DILocation(line: 1692, column: 2, scope: !442)
!451 = !DILocation(line: 1692, column: 9, scope: !442)
!452 = !DILocation(line: 1692, column: 19, scope: !442)
!453 = !DILocation(line: 1693, column: 1, scope: !442)
!454 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !332, file: !332, line: 1704, type: !455, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!455 = !DISubroutineType(types: !456)
!456 = !{!103, !410}
!457 = !DILocalVariable(name: "timer", arg: 1, scope: !454, file: !332, line: 1704, type: !410)
!458 = !DILocation(line: 1704, column: 72, scope: !454)
!459 = !DILocation(line: 1706, column: 9, scope: !454)
!460 = !DILocation(line: 1706, column: 16, scope: !454)
!461 = !DILocation(line: 1706, column: 2, scope: !454)
!462 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !332, file: !332, line: 2071, type: !463, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!463 = !DISubroutineType(types: !464)
!464 = !{!104, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !332, line: 1830, size: 128, elements: !467)
!467 = !{!468, !481, !482}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !466, file: !332, line: 1831, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !470, line: 60, baseType: !471)
!470 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !470, line: 53, size: 64, elements: !472)
!472 = !{!473, !480}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !471, file: !470, line: 54, baseType: !474, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !470, line: 50, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !470, line: 44, size: 32, elements: !477)
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !476, file: !470, line: 45, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !470, line: 40, baseType: !105)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !471, file: !470, line: 55, baseType: !474, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !466, file: !332, line: 1832, baseType: !347, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !466, file: !332, line: 1833, baseType: !277, size: 64, offset: 64)
!483 = !DILocalVariable(name: "queue", arg: 1, scope: !462, file: !332, line: 2071, type: !465)
!484 = !DILocation(line: 2071, column: 59, scope: !462)
!485 = !DILocation(line: 2073, column: 35, scope: !462)
!486 = !DILocation(line: 2073, column: 42, scope: !462)
!487 = !DILocation(line: 2073, column: 14, scope: !462)
!488 = !DILocation(line: 2073, column: 9, scope: !462)
!489 = !DILocation(line: 2073, column: 2, scope: !462)
!490 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !332, file: !332, line: 3209, type: !491, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!491 = !DISubroutineType(types: !492)
!492 = !{!107, !493}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !332, line: 3092, size: 128, elements: !495)
!495 = !{!496, !497, !498}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !494, file: !332, line: 3093, baseType: !277, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !494, file: !332, line: 3094, baseType: !107, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !494, file: !332, line: 3095, baseType: !107, size: 32, offset: 96)
!499 = !DILocalVariable(name: "sem", arg: 1, scope: !490, file: !332, line: 3209, type: !493)
!500 = !DILocation(line: 3209, column: 65, scope: !490)
!501 = !DILocation(line: 3211, column: 9, scope: !490)
!502 = !DILocation(line: 3211, column: 14, scope: !490)
!503 = !DILocation(line: 3211, column: 2, scope: !490)
!504 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !332, file: !332, line: 4649, type: !505, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!505 = !DISubroutineType(types: !506)
!506 = !{!105, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 32)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !332, line: 4390, size: 320, elements: !509)
!509 = !{!510, !511, !512, !513, !514, !516, !517, !518, !519, !520}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !508, file: !332, line: 4392, baseType: !277, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !508, file: !332, line: 4394, baseType: !347, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !508, file: !332, line: 4396, baseType: !343, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !508, file: !332, line: 4398, baseType: !105, size: 32, offset: 96)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !508, file: !332, line: 4400, baseType: !515, size: 32, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !508, file: !332, line: 4402, baseType: !515, size: 32, offset: 160)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !508, file: !332, line: 4404, baseType: !515, size: 32, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !508, file: !332, line: 4406, baseType: !515, size: 32, offset: 224)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !508, file: !332, line: 4408, baseType: !105, size: 32, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !508, file: !332, line: 4413, baseType: !154, size: 8, offset: 288)
!521 = !DILocalVariable(name: "msgq", arg: 1, scope: !504, file: !332, line: 4649, type: !507)
!522 = !DILocation(line: 4649, column: 66, scope: !504)
!523 = !DILocation(line: 4651, column: 9, scope: !504)
!524 = !DILocation(line: 4651, column: 15, scope: !504)
!525 = !DILocation(line: 4651, column: 26, scope: !504)
!526 = !DILocation(line: 4651, column: 32, scope: !504)
!527 = !DILocation(line: 4651, column: 24, scope: !504)
!528 = !DILocation(line: 4651, column: 2, scope: !504)
!529 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !332, file: !332, line: 4665, type: !505, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !231)
!530 = !DILocalVariable(name: "msgq", arg: 1, scope: !529, file: !332, line: 4665, type: !507)
!531 = !DILocation(line: 4665, column: 66, scope: !529)
!532 = !DILocation(line: 4667, column: 9, scope: !529)
!533 = !DILocation(line: 4667, column: 15, scope: !529)
!534 = !DILocation(line: 4667, column: 2, scope: !529)
!535 = distinct !DISubprogram(name: "stm32_clock_control_init", scope: !2, file: !2, line: 719, type: !173, scopeLine: 720, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !231)
!536 = !DILocalVariable(name: "dev", arg: 1, scope: !535, file: !2, line: 719, type: !175)
!537 = !DILocation(line: 719, column: 51, scope: !535)
!538 = !DILocation(line: 721, column: 9, scope: !535)
!539 = !DILocation(line: 724, column: 2, scope: !535)
!540 = !DILocalVariable(name: "old_flash_freq", scope: !535, file: !2, line: 727, type: !105)
!541 = !DILocation(line: 727, column: 11, scope: !535)
!542 = !DILocalVariable(name: "new_flash_freq", scope: !535, file: !2, line: 728, type: !105)
!543 = !DILocation(line: 728, column: 11, scope: !535)
!544 = !DILocation(line: 730, column: 21, scope: !535)
!545 = !DILocation(line: 730, column: 67, scope: !535)
!546 = !DILocation(line: 730, column: 93, scope: !535)
!547 = !DILocation(line: 730, column: 112, scope: !535)
!548 = !DILocation(line: 730, column: 51, scope: !535)
!549 = !DILocation(line: 730, column: 48, scope: !535)
!550 = !DILocation(line: 730, column: 17, scope: !535)
!551 = !DILocation(line: 733, column: 34, scope: !535)
!552 = !DILocation(line: 733, column: 31, scope: !535)
!553 = !DILocation(line: 733, column: 17, scope: !535)
!554 = !DILocation(line: 737, column: 6, scope: !555)
!555 = distinct !DILexicalBlock(scope: !535, file: !2, line: 737, column: 6)
!556 = !DILocation(line: 737, column: 23, scope: !555)
!557 = !DILocation(line: 737, column: 21, scope: !555)
!558 = !DILocation(line: 737, column: 6, scope: !535)
!559 = !DILocation(line: 738, column: 22, scope: !560)
!560 = distinct !DILexicalBlock(scope: !555, file: !2, line: 737, column: 39)
!561 = !DILocation(line: 738, column: 3, scope: !560)
!562 = !DILocation(line: 739, column: 2, scope: !560)
!563 = !DILocation(line: 743, column: 2, scope: !535)
!564 = !DILocation(line: 746, column: 2, scope: !535)
!565 = !DILocation(line: 753, column: 3, scope: !566)
!566 = distinct !DILexicalBlock(scope: !567, file: !2, line: 752, column: 9)
!567 = distinct !DILexicalBlock(scope: !535, file: !2, line: 748, column: 6)
!568 = !DILocation(line: 758, column: 2, scope: !535)
!569 = !DILocation(line: 759, column: 2, scope: !535)
!570 = !DILocation(line: 759, column: 9, scope: !535)
!571 = !DILocation(line: 759, column: 34, scope: !535)
!572 = distinct !{!572, !569, !573}
!573 = !DILocation(line: 760, column: 2, scope: !535)
!574 = !DILocation(line: 783, column: 6, scope: !575)
!575 = distinct !DILexicalBlock(scope: !535, file: !2, line: 783, column: 6)
!576 = !DILocation(line: 783, column: 24, scope: !575)
!577 = !DILocation(line: 783, column: 21, scope: !575)
!578 = !DILocation(line: 783, column: 6, scope: !535)
!579 = !DILocation(line: 784, column: 22, scope: !580)
