; ModuleID = '../bc_files/clock_stm32_ll_common.bc'
source_filename = "/home/sri/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.clock_control_driver_api = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.device_state = type { i8, i8 }
%struct.device = type { ptr, ptr, ptr, ptr, ptr }
%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }

!28 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!29 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!30 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!31 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!32 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!33 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!34 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!35 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!36 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!37 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 17)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 18)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 19)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 20)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 21)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 22)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 25)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 26)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 27)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 28)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 29)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 30)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 31)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 32)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 33)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 34)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 35)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 36)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 37)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 38)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 39)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 40)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 41)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 42)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 43)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 44)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 45)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 46)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 47)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!99 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !101, line: 44, baseType: !14, size: 8, elements: !102)
!101 = !DIFile(filename: "include/zephyr/drivers/clock_control.h", directory: "/home/sri/zephyrproject/zephyr")
!102 = !{!103, !104, !105, !106}
!103 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!104 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!105 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!106 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!107 = !{!108, !109, !110, !113, !133, !139}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !111, line: 64, baseType: !112)
!111 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!112 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !115, line: 461, baseType: !116)
!115 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 445, size: 448, elements: !117)
!117 = !{!118, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !116, file: !115, line: 447, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !116, file: !115, line: 448, baseType: !119, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !116, file: !115, line: 449, baseType: !119, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !116, file: !115, line: 450, baseType: !119, size: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !116, file: !115, line: 451, baseType: !119, size: 32, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !116, file: !115, line: 452, baseType: !119, size: 32, offset: 160)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !116, file: !115, line: 453, baseType: !119, size: 32, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !116, file: !115, line: 454, baseType: !119, size: 32, offset: 224)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !116, file: !115, line: 455, baseType: !119, size: 32, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !116, file: !115, line: 456, baseType: !119, size: 32, offset: 288)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !116, file: !115, line: 457, baseType: !119, size: 32, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR2", scope: !116, file: !115, line: 458, baseType: !119, size: 32, offset: 352)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR3", scope: !116, file: !115, line: 459, baseType: !119, size: 32, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !116, file: !115, line: 460, baseType: !119, size: 32, offset: 416)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !135, line: 396, size: 64, elements: !136)
!135 = !DIFile(filename: "include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/sri/zephyrproject/zephyr")
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !134, file: !135, line: 397, baseType: !110, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !134, file: !135, line: 398, baseType: !110, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!140 = !{!0, !141, !163, !182, !7}
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !9, file: !2, line: 824, type: !143, isLocal: false, isDefinition: true, align: 32)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !145, line: 381, size: 160, elements: !146)
!145 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!146 = !{!147, !150, !153, !154, !162}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !144, file: !145, line: 383, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !144, file: !145, line: 385, baseType: !151, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !144, file: !145, line: 387, baseType: !151, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !144, file: !145, line: 389, baseType: !155, size: 32, offset: 96)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !145, line: 354, size: 16, elements: !157)
!157 = !{!158, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !156, file: !145, line: 362, baseType: !159, size: 8)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !111, line: 62, baseType: !14)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !156, file: !145, line: 367, baseType: !161, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!161 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !145, line: 391, baseType: !108, size: 32, offset: 128)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !9, file: !2, line: 824, type: !165, isLocal: true, isDefinition: true, align: 32)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !167, line: 92, size: 64, elements: !168)
!167 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!168 = !{!169, !181}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !166, file: !167, line: 94, baseType: !170, size: 32)
!170 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !167, line: 59, size: 32, elements: !171)
!171 = !{!172, !176}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !170, file: !167, line: 66, baseType: !173, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DISubroutineType(types: !175)
!175 = !{!109}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !170, file: !167, line: 75, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(types: !179)
!179 = !{!109, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !166, file: !167, line: 99, baseType: !180, size: 32, offset: 32)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !9, file: !2, line: 824, type: !156, isLocal: true, isDefinition: true, align: 8)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !101, line: 100, size: 224, elements: !185)
!185 = !{!186, !192, !193, !202, !208, !213, !219}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !184, file: !101, line: 101, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !101, line: 76, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{!109, !180, !191}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !101, line: 56, baseType: !108)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !184, file: !101, line: 102, baseType: !187, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !184, file: !101, line: 103, baseType: !194, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !101, line: 83, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!196 = !DISubroutineType(types: !197)
!197 = !{!109, !180, !191, !198, !108}
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !101, line: 72, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !180, !191, !108}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !184, file: !101, line: 104, baseType: !203, size: 32, offset: 96)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !101, line: 79, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DISubroutineType(types: !206)
!206 = !{!109, !180, !191, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !184, file: !101, line: 105, baseType: !209, size: 32, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !101, line: 88, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DISubroutineType(types: !212)
!212 = !{!100, !180, !191}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !184, file: !101, line: 106, baseType: !214, size: 32, offset: 160)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !101, line: 92, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = !DISubroutineType(types: !217)
!217 = !{!109, !180, !191, !218}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !101, line: 64, baseType: !108)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !184, file: !101, line: 107, baseType: !220, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !101, line: 96, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DISubroutineType(types: !223)
!223 = !{!109, !180, !191, !108}
!224 = !{i32 7, !"Dwarf Version", i32 4}
!225 = !{i32 2, !"Debug Info Version", i32 3}
!226 = !{i32 1, !"wchar_size", i32 4}
!227 = !{i32 1, !"static_rwdata", i32 1}
!228 = !{i32 1, !"enumsize_buildattr", i32 1}
!229 = !{i32 1, !"armlib_unavailable", i32 0}
!230 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!231 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !145, file: !145, line: 744, type: !232, scopeLine: 745, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !234)
!232 = !DISubroutineType(types: !233)
!233 = !{!161, !180}
!234 = !{!235}
!235 = !DILocalVariable(name: "dev", arg: 1, scope: !231, file: !145, line: 744, type: !180)
!236 = !DILocation(line: 744, column: 65, scope: !231)
!237 = !DILocation(line: 746, column: 27, scope: !231)
!238 = !DILocation(line: 746, column: 9, scope: !231)
!239 = !DILocation(line: 746, column: 2, scope: !231)
!240 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !19, file: !19, line: 223, type: !241, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !358)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !151, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !245, line: 250, size: 896, elements: !246)
!245 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!246 = !{!247, !316, !329, !330, !331, !332, !353}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !244, file: !245, line: 252, baseType: !248, size: 384)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !245, line: 58, size: 384, elements: !249)
!249 = !{!250, !278, !286, !287, !288, !301, !302, !303}
!250 = !DIDerivedType(tag: DW_TAG_member, scope: !248, file: !245, line: 61, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !248, file: !245, line: 61, size: 64, elements: !252)
!252 = !{!253, !269}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !251, file: !245, line: 62, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !255, line: 55, baseType: !256)
!255 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !255, line: 37, size: 64, elements: !257)
!257 = !{!258, !264}
!258 = !DIDerivedType(tag: DW_TAG_member, scope: !256, file: !255, line: 38, baseType: !259, size: 32)
!259 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !255, line: 38, size: 32, elements: !260)
!260 = !{!261, !263}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !259, file: !255, line: 39, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !259, file: !255, line: 40, baseType: !262, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, scope: !256, file: !255, line: 42, baseType: !265, size: 32, offset: 32)
!265 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !255, line: 42, size: 32, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !265, file: !255, line: 43, baseType: !262, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !265, file: !255, line: 44, baseType: !262, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !251, file: !245, line: 63, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !271, line: 58, size: 64, elements: !272)
!271 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !270, file: !271, line: 60, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 64, elements: !276)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!276 = !{!277}
!277 = !DISubrange(count: 2)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !248, file: !245, line: 69, baseType: !279, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !281, line: 243, baseType: !282)
!281 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !281, line: 241, size: 64, elements: !283)
!283 = !{!284}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !282, file: !281, line: 242, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !255, line: 51, baseType: !256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !248, file: !245, line: 72, baseType: !159, size: 8, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !248, file: !245, line: 75, baseType: !159, size: 8, offset: 104)
!288 = !DIDerivedType(tag: DW_TAG_member, scope: !248, file: !245, line: 91, baseType: !289, size: 16, offset: 112)
!289 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !248, file: !245, line: 91, size: 16, elements: !290)
!290 = !{!291, !298}
!291 = !DIDerivedType(tag: DW_TAG_member, scope: !289, file: !245, line: 92, baseType: !292, size: 16)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !289, file: !245, line: 92, size: 16, elements: !293)
!293 = !{!294, !297}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !292, file: !245, line: 97, baseType: !295, size: 8)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !111, line: 56, baseType: !296)
!296 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !292, file: !245, line: 98, baseType: !159, size: 8, offset: 8)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !289, file: !245, line: 101, baseType: !299, size: 16)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !111, line: 63, baseType: !300)
!300 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !248, file: !245, line: 108, baseType: !110, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !248, file: !245, line: 132, baseType: !108, size: 32, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !248, file: !245, line: 136, baseType: !304, size: 192, offset: 192)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !281, line: 254, size: 192, elements: !305)
!305 = !{!306, !307, !313}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !304, file: !281, line: 255, baseType: !254, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !304, file: !281, line: 256, baseType: !308, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !281, line: 252, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !312}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !304, file: !281, line: 259, baseType: !314, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !111, line: 59, baseType: !315)
!315 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !244, file: !245, line: 255, baseType: !317, size: 288, offset: 384)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !318, line: 25, size: 288, elements: !319)
!318 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !317, file: !318, line: 26, baseType: !110, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !317, file: !318, line: 27, baseType: !110, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !317, file: !318, line: 28, baseType: !110, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !317, file: !318, line: 29, baseType: !110, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !317, file: !318, line: 30, baseType: !110, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !317, file: !318, line: 31, baseType: !110, size: 32, offset: 160)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !317, file: !318, line: 32, baseType: !110, size: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !317, file: !318, line: 33, baseType: !110, size: 32, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !317, file: !318, line: 34, baseType: !110, size: 32, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !244, file: !245, line: 258, baseType: !108, size: 32, offset: 672)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !244, file: !245, line: 261, baseType: !280, size: 64, offset: 704)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !244, file: !245, line: 302, baseType: !109, size: 32, offset: 768)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !244, file: !245, line: 333, baseType: !333, size: 32, offset: 800)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !335, line: 5291, size: 160, elements: !336)
!335 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!336 = !{!337, !348, !349}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !334, file: !335, line: 5292, baseType: !338, size: 96)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !339, line: 56, size: 96, elements: !340)
!339 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!340 = !{!341, !344, !345}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !338, file: !339, line: 57, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !339, line: 57, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !338, file: !339, line: 58, baseType: !108, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !338, file: !339, line: 59, baseType: !346, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !347, line: 46, baseType: !112)
!347 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!348 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !334, file: !335, line: 5293, baseType: !280, size: 64, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !334, file: !335, line: 5294, baseType: !350, offset: 160)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !351, line: 45, elements: !352)
!351 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!352 = !{}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !244, file: !245, line: 355, baseType: !354, size: 64, offset: 832)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !318, line: 60, size: 64, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !354, file: !318, line: 63, baseType: !110, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !354, file: !318, line: 66, baseType: !110, size: 32, offset: 32)
!358 = !{!359, !360}
!359 = !DILocalVariable(name: "object", arg: 1, scope: !240, file: !19, line: 223, type: !151)
!360 = !DILocalVariable(name: "thread", arg: 2, scope: !240, file: !19, line: 224, type: !243)
!361 = !DILocation(line: 223, column: 61, scope: !240)
!362 = !DILocation(line: 224, column: 24, scope: !240)
!363 = !DILocation(line: 226, column: 9, scope: !240)
!364 = !DILocation(line: 227, column: 9, scope: !240)
!365 = !DILocation(line: 228, column: 1, scope: !240)
!366 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !19, file: !19, line: 243, type: !367, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !369)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !151}
!369 = !{!370}
!370 = !DILocalVariable(name: "object", arg: 1, scope: !366, file: !19, line: 243, type: !151)
!371 = !DILocation(line: 243, column: 56, scope: !366)
!372 = !DILocation(line: 245, column: 9, scope: !366)
!373 = !DILocation(line: 246, column: 1, scope: !366)
!374 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !19, file: !19, line: 359, type: !375, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !377)
!375 = !DISubroutineType(types: !376)
!376 = !{!108, !18}
!377 = !{!378}
!378 = !DILocalVariable(name: "otype", arg: 1, scope: !374, file: !19, line: 359, type: !18)
!379 = !DILocation(line: 359, column: 58, scope: !374)
!380 = !DILocation(line: 361, column: 9, scope: !374)
!381 = !DILocation(line: 363, column: 2, scope: !374)
!382 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !19, file: !19, line: 366, type: !383, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !385)
!383 = !DISubroutineType(types: !384)
!384 = !{!108, !18, !346}
!385 = !{!386, !387}
!386 = !DILocalVariable(name: "otype", arg: 1, scope: !382, file: !19, line: 366, type: !18)
!387 = !DILocalVariable(name: "size", arg: 2, scope: !382, file: !19, line: 367, type: !346)
!388 = !DILocation(line: 366, column: 63, scope: !382)
!389 = !DILocation(line: 367, column: 13, scope: !382)
!390 = !DILocation(line: 369, column: 9, scope: !382)
!391 = !DILocation(line: 370, column: 9, scope: !382)
!392 = !DILocation(line: 372, column: 2, scope: !382)
!393 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !335, file: !335, line: 656, type: !394, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !400)
!394 = !DISubroutineType(types: !395)
!395 = !{!396, !398}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !397, line: 46, baseType: !314)
!397 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!400 = !{!401}
!401 = !DILocalVariable(name: "t", arg: 1, scope: !393, file: !335, line: 657, type: !398)
!402 = !DILocation(line: 657, column: 30, scope: !393)
!403 = !DILocation(line: 659, column: 28, scope: !393)
!404 = !DILocation(line: 659, column: 31, scope: !393)
!405 = !DILocation(line: 659, column: 36, scope: !393)
!406 = !DILocation(line: 659, column: 9, scope: !393)
!407 = !DILocation(line: 659, column: 2, scope: !393)
!408 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !335, file: !335, line: 671, type: !394, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !409)
!409 = !{!410}
!410 = !DILocalVariable(name: "t", arg: 1, scope: !408, file: !335, line: 672, type: !398)
!411 = !DILocation(line: 672, column: 30, scope: !408)
!412 = !DILocation(line: 674, column: 30, scope: !408)
!413 = !DILocation(line: 674, column: 33, scope: !408)
!414 = !DILocation(line: 674, column: 38, scope: !408)
!415 = !DILocation(line: 674, column: 9, scope: !408)
!416 = !DILocation(line: 674, column: 2, scope: !408)
!417 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !335, file: !335, line: 1634, type: !418, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !439)
!418 = !DISubroutineType(types: !419)
!419 = !{!396, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !335, line: 1439, size: 448, elements: !423)
!423 = !{!424, !425, !426, !431, !432, !437, !438}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !422, file: !335, line: 1445, baseType: !304, size: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !422, file: !335, line: 1448, baseType: !280, size: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !422, file: !335, line: 1451, baseType: !427, size: 32, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !422, file: !335, line: 1454, baseType: !427, size: 32, offset: 288)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !422, file: !335, line: 1457, baseType: !433, size: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !397, line: 67, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 65, size: 64, elements: !435)
!435 = !{!436}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !434, file: !397, line: 66, baseType: !396, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !422, file: !335, line: 1460, baseType: !110, size: 32, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !422, file: !335, line: 1463, baseType: !108, size: 32, offset: 416)
!439 = !{!440}
!440 = !DILocalVariable(name: "timer", arg: 1, scope: !417, file: !335, line: 1635, type: !420)
!441 = !DILocation(line: 1635, column: 34, scope: !417)
!442 = !DILocation(line: 1637, column: 28, scope: !417)
!443 = !DILocation(line: 1637, column: 35, scope: !417)
!444 = !DILocation(line: 1637, column: 9, scope: !417)
!445 = !DILocation(line: 1637, column: 2, scope: !417)
!446 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !335, file: !335, line: 1649, type: !418, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !447)
!447 = !{!448}
!448 = !DILocalVariable(name: "timer", arg: 1, scope: !446, file: !335, line: 1650, type: !420)
!449 = !DILocation(line: 1650, column: 34, scope: !446)
!450 = !DILocation(line: 1652, column: 30, scope: !446)
!451 = !DILocation(line: 1652, column: 37, scope: !446)
!452 = !DILocation(line: 1652, column: 9, scope: !446)
!453 = !DILocation(line: 1652, column: 2, scope: !446)
!454 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !335, file: !335, line: 1689, type: !455, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !457)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !430, !108}
!457 = !{!458, !459}
!458 = !DILocalVariable(name: "timer", arg: 1, scope: !454, file: !335, line: 1689, type: !430)
!459 = !DILocalVariable(name: "user_data", arg: 2, scope: !454, file: !335, line: 1690, type: !108)
!460 = !DILocation(line: 1689, column: 65, scope: !454)
!461 = !DILocation(line: 1690, column: 19, scope: !454)
!462 = !DILocation(line: 1692, column: 21, scope: !454)
!463 = !DILocation(line: 1692, column: 2, scope: !454)
!464 = !DILocation(line: 1692, column: 9, scope: !454)
!465 = !DILocation(line: 1692, column: 19, scope: !454)
!466 = !DILocation(line: 1693, column: 1, scope: !454)
!467 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !335, file: !335, line: 1704, type: !468, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !470)
!468 = !DISubroutineType(types: !469)
!469 = !{!108, !420}
!470 = !{!471}
!471 = !DILocalVariable(name: "timer", arg: 1, scope: !467, file: !335, line: 1704, type: !420)
!472 = !DILocation(line: 1704, column: 72, scope: !467)
!473 = !DILocation(line: 1706, column: 9, scope: !467)
!474 = !DILocation(line: 1706, column: 16, scope: !467)
!475 = !DILocation(line: 1706, column: 2, scope: !467)
!476 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !335, file: !335, line: 2071, type: !477, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !497)
!477 = !DISubroutineType(types: !478)
!478 = !{!109, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !335, line: 1830, size: 128, elements: !481)
!481 = !{!482, !495, !496}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !480, file: !335, line: 1831, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !484, line: 60, baseType: !485)
!484 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !484, line: 53, size: 64, elements: !486)
!486 = !{!487, !494}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !485, file: !484, line: 54, baseType: !488, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !484, line: 50, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !484, line: 44, size: 32, elements: !491)
!491 = !{!492}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !490, file: !484, line: 45, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !484, line: 40, baseType: !110)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !485, file: !484, line: 55, baseType: !488, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !480, file: !335, line: 1832, baseType: !350, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !480, file: !335, line: 1833, baseType: !280, size: 64, offset: 64)
!497 = !{!498}
!498 = !DILocalVariable(name: "queue", arg: 1, scope: !476, file: !335, line: 2071, type: !479)
!499 = !DILocation(line: 2071, column: 59, scope: !476)
!500 = !DILocation(line: 2073, column: 35, scope: !476)
!501 = !DILocation(line: 2073, column: 42, scope: !476)
!502 = !DILocation(line: 2073, column: 14, scope: !476)
!503 = !DILocation(line: 2073, column: 9, scope: !476)
!504 = !DILocation(line: 2073, column: 2, scope: !476)
!505 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !335, file: !335, line: 3209, type: !506, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !514)
!506 = !DISubroutineType(types: !507)
!507 = !{!112, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !335, line: 3092, size: 128, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !509, file: !335, line: 3093, baseType: !280, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !509, file: !335, line: 3094, baseType: !112, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !509, file: !335, line: 3095, baseType: !112, size: 32, offset: 96)
!514 = !{!515}
!515 = !DILocalVariable(name: "sem", arg: 1, scope: !505, file: !335, line: 3209, type: !508)
!516 = !DILocation(line: 3209, column: 65, scope: !505)
!517 = !DILocation(line: 3211, column: 9, scope: !505)
!518 = !DILocation(line: 3211, column: 14, scope: !505)
!519 = !DILocation(line: 3211, column: 2, scope: !505)
!520 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !335, file: !335, line: 4649, type: !521, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !537)
!521 = !DISubroutineType(types: !522)
!522 = !{!110, !523}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !335, line: 4390, size: 320, elements: !525)
!525 = !{!526, !527, !528, !529, !530, !532, !533, !534, !535, !536}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !524, file: !335, line: 4392, baseType: !280, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !524, file: !335, line: 4394, baseType: !350, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !524, file: !335, line: 4396, baseType: !346, size: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !524, file: !335, line: 4398, baseType: !110, size: 32, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !524, file: !335, line: 4400, baseType: !531, size: 32, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !524, file: !335, line: 4402, baseType: !531, size: 32, offset: 160)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !524, file: !335, line: 4404, baseType: !531, size: 32, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !524, file: !335, line: 4406, baseType: !531, size: 32, offset: 224)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !524, file: !335, line: 4408, baseType: !110, size: 32, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !524, file: !335, line: 4413, baseType: !159, size: 8, offset: 288)
!537 = !{!538}
!538 = !DILocalVariable(name: "msgq", arg: 1, scope: !520, file: !335, line: 4649, type: !523)
!539 = !DILocation(line: 4649, column: 66, scope: !520)
!540 = !DILocation(line: 4651, column: 9, scope: !520)
!541 = !DILocation(line: 4651, column: 15, scope: !520)
!542 = !DILocation(line: 4651, column: 26, scope: !520)
!543 = !DILocation(line: 4651, column: 32, scope: !520)
!544 = !DILocation(line: 4651, column: 24, scope: !520)
!545 = !DILocation(line: 4651, column: 2, scope: !520)
!546 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !335, file: !335, line: 4665, type: !521, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !547)
!547 = !{!548}
!548 = !DILocalVariable(name: "msgq", arg: 1, scope: !546, file: !335, line: 4665, type: !523)
!549 = !DILocation(line: 4665, column: 66, scope: !546)
!550 = !DILocation(line: 4667, column: 9, scope: !546)
!551 = !DILocation(line: 4667, column: 15, scope: !546)
!552 = !DILocation(line: 4667, column: 2, scope: !546)
!553 = distinct !DISubprogram(name: "stm32_clock_control_init", scope: !2, file: !2, line: 719, type: !178, scopeLine: 720, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !554)
!554 = !{!555, !556, !557}
!555 = !DILocalVariable(name: "dev", arg: 1, scope: !553, file: !2, line: 719, type: !180)
!556 = !DILocalVariable(name: "old_flash_freq", scope: !553, file: !2, line: 727, type: !110)
!557 = !DILocalVariable(name: "new_flash_freq", scope: !553, file: !2, line: 728, type: !110)
!558 = !DILocation(line: 719, column: 51, scope: !553)
!559 = !DILocation(line: 721, column: 9, scope: !553)
!560 = !DILocation(line: 724, column: 2, scope: !553)
!561 = !DILocation(line: 727, column: 2, scope: !553)
!562 = !DILocation(line: 727, column: 11, scope: !553)
!563 = !DILocation(line: 728, column: 2, scope: !553)
!564 = !DILocation(line: 728, column: 11, scope: !553)
!565 = !DILocation(line: 730, column: 21, scope: !553)
!566 = !DILocation(line: 730, column: 67, scope: !553)
!567 = !DILocation(line: 730, column: 93, scope: !553)
!568 = !DILocation(line: 730, column: 112, scope: !553)
!569 = !DILocation(line: 730, column: 51, scope: !553)
!570 = !DILocation(line: 730, column: 48, scope: !553)
!571 = !DILocation(line: 730, column: 17, scope: !553)
!572 = !DILocation(line: 733, column: 34, scope: !553)
!573 = !DILocation(line: 733, column: 31, scope: !553)
!574 = !DILocation(line: 733, column: 17, scope: !553)
!575 = !DILocation(line: 737, column: 6, scope: !576)
!576 = distinct !DILexicalBlock(scope: !553, file: !2, line: 737, column: 6)
!577 = !DILocation(line: 737, column: 23, scope: !576)
!578 = !DILocation(line: 737, column: 21, scope: !576)
!579 = !DILocation(line: 737, column: 6, scope: !553)
!580 = !DILocation(line: 738, column: 22, scope: !581)
!581 = distinct !DILexicalBlock(scope: !576, file: !2, line: 737, column: 39)
!582 = !DILocation(line: 738, column: 3, scope: !581)
!583 = !DILocation(line: 739, column: 2, scope: !581)
!584 = !DILocation(line: 743, column: 2, scope: !553)
!585 = !DILocation(line: 746, column: 2, scope: !553)
!586 = !DILocation(line: 753, column: 3, scope: !587)
!587 = distinct !DILexicalBlock(scope: !588, file: !2, line: 752, column: 9)
!588 = distinct !DILexicalBlock(scope: !553, file: !2, line: 748, column: 6)
!589 = !DILocation(line: 758, column: 2, scope: !553)
!590 = !DILocation(line: 759, column: 2, scope: !553)
!591 = !DILocation(line: 759, column: 9, scope: !553)
!592 = !DILocation(line: 759, column: 34, scope: !553)
!593 = distinct !{!593, !590, !594}
!594 = !DILocation(line: 760, column: 2, scope: !553)
!595 = !DILocation(line: 783, column: 6, scope: !596)
