; ModuleID = '../bc_files/cortex_m_systick.bc'
source_filename = "/home/sri/zephyrproject/zephyr/drivers/timer/cortex_m_systick.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_spinlock = type {}
%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.SysTick_Type = type { i32, i32, i32, i32 }
%struct.z_spinlock_key = type { i32 }
%struct.NVIC_Type = type { [1 x i32], [31 x i32], [1 x i32], [31 x i32], [1 x i32], [31 x i32], [1 x i32], [31 x i32], [64 x i32], [8 x i32] }
%struct.SCB_Type = type { i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32 }

@overflow_cyc = internal global i32 0, align 4, !dbg !0
@cycle_count = internal global i32 0, align 4, !dbg !138
@announced_cycles = internal global i32 0, align 4, !dbg !140
@last_load = internal global i32 0, align 4, !dbg !136
@lock = internal global %struct.k_spinlock zeroinitializer, align 1, !dbg !131
@__init_sys_clock_driver_init = internal constant %struct.init_entry { %union.init_function { ptr @sys_clock_driver_init }, ptr null }, section ".z_init_PRE_KERNEL_20_0_", align 4, !dbg !109
@llvm.used = appending global [1 x ptr] [ptr @__init_sys_clock_driver_init], section "llvm.metadata"

; Function Attrs: nounwind optsize
define hidden void @sys_clock_isr(ptr noundef %0) #0 !dbg !149 {
  %2 = alloca ptr, align 4
  %3 = alloca i32, align 4
  %4 = alloca i32, align 4
  store ptr %0, ptr %2, align 4

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "overflow_cyc", scope: !2, file: !111, line: 78, type: !57, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !45, globals: !108, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "cortex_m_systick.c", directory: "/home/sri/zephyrproject/zephyr/build")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 66, baseType: !7, size: 8, elements: !8)
!6 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!7 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!9 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!10 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!11 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!12 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!13 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!14 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!15 = !DIEnumerator(name: "PVD_VDDIO2_IRQn", value: 1)
!16 = !DIEnumerator(name: "RTC_IRQn", value: 2)
!17 = !DIEnumerator(name: "FLASH_IRQn", value: 3)
!18 = !DIEnumerator(name: "RCC_CRS_IRQn", value: 4)
!19 = !DIEnumerator(name: "EXTI0_1_IRQn", value: 5)
!20 = !DIEnumerator(name: "EXTI2_3_IRQn", value: 6)
!21 = !DIEnumerator(name: "EXTI4_15_IRQn", value: 7)
!22 = !DIEnumerator(name: "TSC_IRQn", value: 8)
!23 = !DIEnumerator(name: "DMA1_Ch1_IRQn", value: 9)
!24 = !DIEnumerator(name: "DMA1_Ch2_3_DMA2_Ch1_2_IRQn", value: 10)
!25 = !DIEnumerator(name: "DMA1_Ch4_7_DMA2_Ch3_5_IRQn", value: 11)
!26 = !DIEnumerator(name: "ADC1_COMP_IRQn", value: 12)
!27 = !DIEnumerator(name: "TIM1_BRK_UP_TRG_COM_IRQn", value: 13)
!28 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 14)
!29 = !DIEnumerator(name: "TIM2_IRQn", value: 15)
!30 = !DIEnumerator(name: "TIM3_IRQn", value: 16)
!31 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 17)
!32 = !DIEnumerator(name: "TIM7_IRQn", value: 18)
!33 = !DIEnumerator(name: "TIM14_IRQn", value: 19)
!34 = !DIEnumerator(name: "TIM15_IRQn", value: 20)
!35 = !DIEnumerator(name: "TIM16_IRQn", value: 21)
!36 = !DIEnumerator(name: "TIM17_IRQn", value: 22)
!37 = !DIEnumerator(name: "I2C1_IRQn", value: 23)
!38 = !DIEnumerator(name: "I2C2_IRQn", value: 24)
!39 = !DIEnumerator(name: "SPI1_IRQn", value: 25)
!40 = !DIEnumerator(name: "SPI2_IRQn", value: 26)
!41 = !DIEnumerator(name: "USART1_IRQn", value: 27)
!42 = !DIEnumerator(name: "USART2_IRQn", value: 28)
!43 = !DIEnumerator(name: "USART3_8_IRQn", value: 29)
!44 = !DIEnumerator(name: "CEC_CAN_IRQn", value: 30)
!45 = !{!46, !51, !64, !58, !66, !92}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !47, line: 46, baseType: !48)
!47 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !49, line: 59, baseType: !50)
!49 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!50 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !53, line: 454, baseType: !54)
!53 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/sri/zephyrproject")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 448, size: 128, elements: !55)
!55 = !{!56, !60, !61, !62}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !54, file: !53, line: 450, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !49, line: 64, baseType: !59)
!59 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !54, file: !53, line: 451, baseType: !57, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !54, file: !53, line: 452, baseType: !57, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !54, file: !53, line: 453, baseType: !63, size: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !49, line: 58, baseType: !65)
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !53, line: 326, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 314, size: 6400, elements: !69)
!69 = !{!70, !74, !78, !79, !80, !81, !82, !83, !84, !88}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !68, file: !53, line: 316, baseType: !71, size: 32)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 32, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 1)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !68, file: !53, line: 317, baseType: !75, size: 992, offset: 32)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 992, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 31)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !68, file: !53, line: 318, baseType: !71, size: 32, offset: 1024)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !68, file: !53, line: 319, baseType: !75, size: 992, offset: 1056)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !68, file: !53, line: 320, baseType: !71, size: 32, offset: 2048)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !68, file: !53, line: 321, baseType: !75, size: 992, offset: 2080)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !68, file: !53, line: 322, baseType: !71, size: 32, offset: 3072)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !68, file: !53, line: 323, baseType: !75, size: 992, offset: 3104)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !68, file: !53, line: 324, baseType: !85, size: 2048, offset: 4096)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 2048, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !68, file: !53, line: 325, baseType: !89, size: 256, offset: 6144)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 256, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 8)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !53, line: 352, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 341, size: 320, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !107}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !94, file: !53, line: 343, baseType: !63, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !94, file: !53, line: 344, baseType: !57, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !94, file: !53, line: 345, baseType: !58, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !94, file: !53, line: 346, baseType: !57, size: 32, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !94, file: !53, line: 347, baseType: !57, size: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !94, file: !53, line: 348, baseType: !57, size: 32, offset: 160)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !94, file: !53, line: 349, baseType: !58, size: 32, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !94, file: !53, line: 350, baseType: !104, size: 64, offset: 224)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 64, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 2)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !94, file: !53, line: 351, baseType: !57, size: 32, offset: 288)
!108 = !{!109, !131, !136, !138, !140, !0}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_sys_clock_driver_init", scope: !2, file: !111, line: 311, type: !112, isLocal: true, isDefinition: true, align: 32)
!111 = !DIFile(filename: "drivers/timer/cortex_m_systick.c", directory: "/home/sri/zephyrproject/zephyr")
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !114, line: 92, size: 64, elements: !115)
!114 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!115 = !{!116, !130}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !113, file: !114, line: 94, baseType: !117, size: 32)
!117 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !114, line: 59, size: 32, elements: !118)
!118 = !{!119, !123}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !117, file: !114, line: 66, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = !DISubroutineType(types: !122)
!122 = !{!65}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !117, file: !114, line: 75, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!65, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !114, line: 50, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !113, file: !114, line: 99, baseType: !127, size: 32, offset: 32)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "lock", scope: !2, file: !111, line: 35, type: !133, isLocal: true, isDefinition: true)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !134, line: 45, elements: !135)
!134 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!135 = !{}
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "last_load", scope: !2, file: !111, line: 37, type: !58, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "cycle_count", scope: !2, file: !111, line: 55, type: !58, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "announced_cycles", scope: !2, file: !111, line: 67, type: !58, isLocal: true, isDefinition: true)
!142 = !{i32 7, !"Dwarf Version", i32 4}
!143 = !{i32 2, !"Debug Info Version", i32 3}
!144 = !{i32 1, !"wchar_size", i32 4}
!145 = !{i32 1, !"static_rwdata", i32 1}
!146 = !{i32 1, !"enumsize_buildattr", i32 1}
!147 = !{i32 1, !"armlib_unavailable", i32 0}
!148 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!149 = distinct !DISubprogram(name: "sys_clock_isr", scope: !111, file: !111, line: 131, type: !150, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !153)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!153 = !{!154, !155, !156}
!154 = !DILocalVariable(name: "arg", arg: 1, scope: !149, file: !111, line: 131, type: !152)
!155 = !DILocalVariable(name: "dcycles", scope: !149, file: !111, line: 134, type: !58)
!156 = !DILocalVariable(name: "dticks", scope: !149, file: !111, line: 135, type: !58)
!157 = !DILocation(line: 131, column: 26, scope: !149)
!158 = !DILocation(line: 133, column: 9, scope: !149)
!159 = !DILocation(line: 134, column: 2, scope: !149)
!160 = !DILocation(line: 134, column: 11, scope: !149)
!161 = !DILocation(line: 135, column: 2, scope: !149)
!162 = !DILocation(line: 135, column: 11, scope: !149)
!163 = !DILocation(line: 138, column: 2, scope: !149)
!164 = !DILocation(line: 143, column: 17, scope: !149)
!165 = !DILocation(line: 143, column: 14, scope: !149)
!166 = !DILocation(line: 144, column: 15, scope: !149)
!167 = !DILocation(line: 159, column: 13, scope: !168)
!168 = distinct !DILexicalBlock(scope: !169, file: !111, line: 146, column: 11)
!169 = distinct !DILexicalBlock(scope: !149, file: !111, line: 146, column: 6)
!170 = !DILocation(line: 159, column: 27, scope: !168)
!171 = !DILocation(line: 159, column: 25, scope: !168)
!172 = !DILocation(line: 159, column: 11, scope: !168)
!173 = !DILocation(line: 160, column: 12, scope: !168)
!174 = !DILocation(line: 160, column: 23, scope: !168)
!175 = !DILocation(line: 160, column: 53, scope: !168)
!176 = !DILocation(line: 160, column: 20, scope: !168)
!177 = !DILocation(line: 160, column: 10, scope: !168)
!178 = !DILocation(line: 161, column: 23, scope: !168)
!179 = !DILocation(line: 161, column: 33, scope: !168)
!180 = !DILocation(line: 161, column: 63, scope: !168)
!181 = !DILocation(line: 161, column: 30, scope: !168)
!182 = !DILocation(line: 161, column: 20, scope: !168)
!183 = !DILocation(line: 162, column: 22, scope: !168)
!184 = !DILocation(line: 162, column: 3, scope: !168)
!185 = !DILocation(line: 166, column: 2, scope: !149)
!186 = !DILocation(line: 167, column: 1, scope: !149)
