; ModuleID = '../bc_files/fatal.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/fatal.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.z_kernel = type { [1 x %struct._cpu], %struct._ready_q }
%struct._cpu = type { i32, ptr, ptr, ptr, i8, %struct._cpu_arch }
%struct._cpu_arch = type {}
%struct._ready_q = type { ptr, %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%struct.log_source_const_data = type { ptr, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }

!97 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!108 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_fatal_error_reason", file: !110, line: 24, baseType: !7, size: 8, elements: !111)
!110 = !DIFile(filename: "include/zephyr/fatal_types.h", directory: "/home/sri/zephyrproject/zephyr")
!111 = !{!112, !113, !114, !115, !116, !117}
!112 = !DIEnumerator(name: "K_ERR_CPU_EXCEPTION", value: 0)
!113 = !DIEnumerator(name: "K_ERR_SPURIOUS_IRQ", value: 1)
!114 = !DIEnumerator(name: "K_ERR_STACK_CHK_FAIL", value: 2)
!115 = !DIEnumerator(name: "K_ERR_KERNEL_OOPS", value: 3)
!116 = !DIEnumerator(name: "K_ERR_KERNEL_PANIC", value: 4)
!117 = !DIEnumerator(name: "K_ERR_ARCH_START", value: 16)
!118 = !{!119, !120, !123}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !122, line: 62, baseType: !7)
!122 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !{!125, !132, !137, !142, !0, !147, !152, !157, !159, !164, !169, !171}
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !127, line: 45, type: !128, isLocal: true, isDefinition: true)
!127 = !DIFile(filename: "kernel/fatal.c", directory: "/home/sri/zephyrproject/zephyr")
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 120, elements: !130)
!129 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!130 = !{!131}
!131 = !DISubrange(count: 15)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !127, line: 100, type: !134, isLocal: true, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 320, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 40)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !127, line: 111, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 264, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 33)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !127, line: 115, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 192, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 24)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !127, line: 66, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 112, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 14)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !127, line: 68, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 160, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 20)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(scope: null, file: !127, line: 70, type: !128, isLocal: true, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(scope: null, file: !127, line: 72, type: !161, isLocal: true, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 96, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 12)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !127, line: 74, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 104, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 13)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !127, line: 76, type: !149, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !127, line: 56, type: !173, isLocal: true, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 64, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 8)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !179, line: 17, size: 64, elements: !180)
!179 = !DIFile(filename: "include/zephyr/logging/log_instance.h", directory: "/home/sri/zephyrproject/zephyr")
!180 = !{!181, !184}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !178, file: !179, line: 18, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !178, file: !179, line: 19, baseType: !121, size: 8, offset: 32)
!185 = !{i32 7, !"Dwarf Version", i32 4}
!186 = !{i32 2, !"Debug Info Version", i32 3}
!187 = !{i32 1, !"wchar_size", i32 4}
!188 = !{i32 1, !"static_rwdata", i32 1}
!189 = !{i32 1, !"enumsize_buildattr", i32 1}
!190 = !{i32 1, !"armlib_unavailable", i32 0}
!191 = !{i32 8, !"PIC Level", i32 2}
!192 = !{i32 7, !"PIE Level", i32 2}
!193 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!194 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !28, file: !28, line: 223, type: !195, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !310)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !197, !199}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !201, line: 250, size: 896, elements: !202)
!201 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!202 = !{!203, !274, !287, !288, !289, !290, !311}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !200, file: !201, line: 252, baseType: !204, size: 384)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !201, line: 58, size: 384, elements: !205)
!205 = !{!206, !234, !242, !243, !244, !257, !260, !261}
!206 = !DIDerivedType(tag: DW_TAG_member, scope: !204, file: !201, line: 61, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !204, file: !201, line: 61, size: 64, elements: !208)
!208 = !{!209, !225}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !207, file: !201, line: 62, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !211, line: 55, baseType: !212)
!211 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !211, line: 37, size: 64, elements: !213)
!213 = !{!214, !220}
!214 = !DIDerivedType(tag: DW_TAG_member, scope: !212, file: !211, line: 38, baseType: !215, size: 32)
!215 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !212, file: !211, line: 38, size: 32, elements: !216)
!216 = !{!217, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !215, file: !211, line: 39, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !211, line: 40, baseType: !218, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, scope: !212, file: !211, line: 42, baseType: !221, size: 32, offset: 32)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !212, file: !211, line: 42, size: 32, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !221, file: !211, line: 43, baseType: !218, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !221, file: !211, line: 44, baseType: !218, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !207, file: !201, line: 63, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !227, line: 58, size: 64, elements: !228)
!227 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !226, file: !227, line: 60, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 64, elements: !232)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!232 = !{!233}
!233 = !DISubrange(count: 2)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !204, file: !201, line: 69, baseType: !235, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !237, line: 243, baseType: !238)
!237 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 241, size: 64, elements: !239)
!239 = !{!240}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !238, file: !237, line: 242, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !211, line: 51, baseType: !212)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !204, file: !201, line: 72, baseType: !121, size: 8, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !204, file: !201, line: 75, baseType: !121, size: 8, offset: 104)
!244 = !DIDerivedType(tag: DW_TAG_member, scope: !204, file: !201, line: 91, baseType: !245, size: 16, offset: 112)
!245 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !204, file: !201, line: 91, size: 16, elements: !246)
!246 = !{!247, !254}
!247 = !DIDerivedType(tag: DW_TAG_member, scope: !245, file: !201, line: 92, baseType: !248, size: 16)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !245, file: !201, line: 92, size: 16, elements: !249)
!249 = !{!250, !253}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !248, file: !201, line: 97, baseType: !251, size: 8)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !122, line: 56, baseType: !252)
!252 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !248, file: !201, line: 98, baseType: !121, size: 8, offset: 8)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !245, file: !201, line: 101, baseType: !255, size: 16)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !122, line: 63, baseType: !256)
!256 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !204, file: !201, line: 108, baseType: !258, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !122, line: 64, baseType: !259)
!259 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !204, file: !201, line: 132, baseType: !119, size: 32, offset: 160)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !204, file: !201, line: 136, baseType: !262, size: 192, offset: 192)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !237, line: 254, size: 192, elements: !263)
!263 = !{!264, !265, !271}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !262, file: !237, line: 255, baseType: !210, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !262, file: !237, line: 256, baseType: !266, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !237, line: 252, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !270}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !262, file: !237, line: 259, baseType: !272, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !122, line: 59, baseType: !273)
!273 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !200, file: !201, line: 255, baseType: !275, size: 288, offset: 384)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !276, line: 25, size: 288, elements: !277)
!276 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !275, file: !276, line: 26, baseType: !258, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !275, file: !276, line: 27, baseType: !258, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !275, file: !276, line: 28, baseType: !258, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !275, file: !276, line: 29, baseType: !258, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !275, file: !276, line: 30, baseType: !258, size: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !275, file: !276, line: 31, baseType: !258, size: 32, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !275, file: !276, line: 32, baseType: !258, size: 32, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !275, file: !276, line: 33, baseType: !258, size: 32, offset: 224)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !275, file: !276, line: 34, baseType: !258, size: 32, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !200, file: !201, line: 258, baseType: !119, size: 32, offset: 672)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !200, file: !201, line: 261, baseType: !236, size: 64, offset: 704)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !200, file: !201, line: 302, baseType: !123, size: 32, offset: 768)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !200, file: !201, line: 333, baseType: !291, size: 32, offset: 800)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !293, line: 5291, size: 160, elements: !294)
!293 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!294 = !{!295, !306, !307}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !292, file: !293, line: 5292, baseType: !296, size: 96)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !297, line: 56, size: 96, elements: !298)
!297 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!298 = !{!299, !302, !303}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !296, file: !297, line: 57, baseType: !300, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !297, line: 57, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !296, file: !297, line: 58, baseType: !119, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !296, file: !297, line: 59, baseType: !304, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !305, line: 46, baseType: !259)
!305 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!306 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !292, file: !293, line: 5293, baseType: !236, size: 64, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !292, file: !293, line: 5294, baseType: !308, offset: 160)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !309, line: 45, elements: !310)
!309 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!310 = !{}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !200, file: !201, line: 355, baseType: !312, size: 64, offset: 832)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !276, line: 60, size: 64, elements: !313)
!313 = !{!314, !315}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !312, file: !276, line: 63, baseType: !258, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !312, file: !276, line: 66, baseType: !258, size: 32, offset: 32)
!316 = !DILocalVariable(name: "object", arg: 1, scope: !194, file: !28, line: 223, type: !197)
!317 = !DILocation(line: 223, column: 61, scope: !194)
!318 = !DILocalVariable(name: "thread", arg: 2, scope: !194, file: !28, line: 224, type: !199)
!319 = !DILocation(line: 224, column: 24, scope: !194)
!320 = !DILocation(line: 226, column: 9, scope: !194)
!321 = !DILocation(line: 227, column: 9, scope: !194)
!322 = !DILocation(line: 228, column: 1, scope: !194)
!323 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !28, file: !28, line: 243, type: !324, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !310)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !197}
!326 = !DILocalVariable(name: "object", arg: 1, scope: !323, file: !28, line: 243, type: !197)
!327 = !DILocation(line: 243, column: 56, scope: !323)
!328 = !DILocation(line: 245, column: 9, scope: !323)
!329 = !DILocation(line: 246, column: 1, scope: !323)
!330 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !28, file: !28, line: 359, type: !331, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !310)
!331 = !DISubroutineType(types: !332)
!332 = !{!119, !27}
!333 = !DILocalVariable(name: "otype", arg: 1, scope: !330, file: !28, line: 359, type: !27)
!334 = !DILocation(line: 359, column: 58, scope: !330)
!335 = !DILocation(line: 361, column: 9, scope: !330)
!336 = !DILocation(line: 363, column: 2, scope: !330)
!337 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !28, file: !28, line: 366, type: !338, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !310)
!338 = !DISubroutineType(types: !339)
!339 = !{!119, !27, !304}
!340 = !DILocalVariable(name: "otype", arg: 1, scope: !337, file: !28, line: 366, type: !27)
!341 = !DILocation(line: 366, column: 63, scope: !337)
!342 = !DILocalVariable(name: "size", arg: 2, scope: !337, file: !28, line: 367, type: !304)
!343 = !DILocation(line: 367, column: 13, scope: !337)
!344 = !DILocation(line: 369, column: 9, scope: !337)
!345 = !DILocation(line: 370, column: 9, scope: !337)
!346 = !DILocation(line: 372, column: 2, scope: !337)
!347 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !293, file: !293, line: 656, type: !348, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !310)
!348 = !DISubroutineType(types: !349)
!349 = !{!350, !352}
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !351, line: 46, baseType: !272)
!351 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!354 = !DILocalVariable(name: "t", arg: 1, scope: !347, file: !293, line: 657, type: !352)
!355 = !DILocation(line: 657, column: 30, scope: !347)
!356 = !DILocation(line: 659, column: 28, scope: !347)
!357 = !DILocation(line: 659, column: 31, scope: !347)
!358 = !DILocation(line: 659, column: 36, scope: !347)
!359 = !DILocation(line: 659, column: 9, scope: !347)
!360 = !DILocation(line: 659, column: 2, scope: !347)
!361 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !293, file: !293, line: 671, type: !348, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !310)
!362 = !DILocalVariable(name: "t", arg: 1, scope: !361, file: !293, line: 672, type: !352)
!363 = !DILocation(line: 672, column: 30, scope: !361)
!364 = !DILocation(line: 674, column: 30, scope: !361)
!365 = !DILocation(line: 674, column: 33, scope: !361)
!366 = !DILocation(line: 674, column: 38, scope: !361)
!367 = !DILocation(line: 674, column: 9, scope: !361)
!368 = !DILocation(line: 674, column: 2, scope: !361)
!369 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !293, file: !293, line: 1634, type: !370, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !310)
!370 = !DISubroutineType(types: !371)
!371 = !{!350, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !293, line: 1439, size: 448, elements: !375)
!375 = !{!376, !377, !378, !383, !384, !389, !390}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !374, file: !293, line: 1445, baseType: !262, size: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !374, file: !293, line: 1448, baseType: !236, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !374, file: !293, line: 1451, baseType: !379, size: 32, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !374, file: !293, line: 1454, baseType: !379, size: 32, offset: 288)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !374, file: !293, line: 1457, baseType: !385, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !351, line: 67, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 65, size: 64, elements: !387)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !386, file: !351, line: 66, baseType: !350, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !374, file: !293, line: 1460, baseType: !258, size: 32, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !374, file: !293, line: 1463, baseType: !119, size: 32, offset: 416)
!391 = !DILocalVariable(name: "timer", arg: 1, scope: !369, file: !293, line: 1635, type: !372)
!392 = !DILocation(line: 1635, column: 34, scope: !369)
!393 = !DILocation(line: 1637, column: 28, scope: !369)
!394 = !DILocation(line: 1637, column: 35, scope: !369)
!395 = !DILocation(line: 1637, column: 9, scope: !369)
!396 = !DILocation(line: 1637, column: 2, scope: !369)
!397 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !293, file: !293, line: 1649, type: !370, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !310)
!398 = !DILocalVariable(name: "timer", arg: 1, scope: !397, file: !293, line: 1650, type: !372)
!399 = !DILocation(line: 1650, column: 34, scope: !397)
!400 = !DILocation(line: 1652, column: 30, scope: !397)
!401 = !DILocation(line: 1652, column: 37, scope: !397)
!402 = !DILocation(line: 1652, column: 9, scope: !397)
!403 = !DILocation(line: 1652, column: 2, scope: !397)
!404 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !293, file: !293, line: 1689, type: !405, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !310)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !382, !119}
!407 = !DILocalVariable(name: "timer", arg: 1, scope: !404, file: !293, line: 1689, type: !382)
!408 = !DILocation(line: 1689, column: 65, scope: !404)
!409 = !DILocalVariable(name: "user_data", arg: 2, scope: !404, file: !293, line: 1690, type: !119)
!410 = !DILocation(line: 1690, column: 19, scope: !404)
!411 = !DILocation(line: 1692, column: 21, scope: !404)
!412 = !DILocation(line: 1692, column: 2, scope: !404)
!413 = !DILocation(line: 1692, column: 9, scope: !404)
!414 = !DILocation(line: 1692, column: 19, scope: !404)
!415 = !DILocation(line: 1693, column: 1, scope: !404)
!416 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !293, file: !293, line: 1704, type: !417, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !310)
!417 = !DISubroutineType(types: !418)
!418 = !{!119, !372}
!419 = !DILocalVariable(name: "timer", arg: 1, scope: !416, file: !293, line: 1704, type: !372)
!420 = !DILocation(line: 1704, column: 72, scope: !416)
!421 = !DILocation(line: 1706, column: 9, scope: !416)
!422 = !DILocation(line: 1706, column: 16, scope: !416)
!423 = !DILocation(line: 1706, column: 2, scope: !416)
!424 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !293, file: !293, line: 2071, type: !425, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !310)
!425 = !DISubroutineType(types: !426)
!426 = !{!123, !427}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !293, line: 1830, size: 128, elements: !429)
!429 = !{!430, !443, !444}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !428, file: !293, line: 1831, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !432, line: 60, baseType: !433)
!432 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !432, line: 53, size: 64, elements: !434)
!434 = !{!435, !442}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !433, file: !432, line: 54, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !432, line: 50, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !432, line: 44, size: 32, elements: !439)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !438, file: !432, line: 45, baseType: !441, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !432, line: 40, baseType: !258)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !433, file: !432, line: 55, baseType: !436, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !428, file: !293, line: 1832, baseType: !308, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !428, file: !293, line: 1833, baseType: !236, size: 64, offset: 64)
!445 = !DILocalVariable(name: "queue", arg: 1, scope: !424, file: !293, line: 2071, type: !427)
!446 = !DILocation(line: 2071, column: 59, scope: !424)
!447 = !DILocation(line: 2073, column: 35, scope: !424)
!448 = !DILocation(line: 2073, column: 42, scope: !424)
!449 = !DILocation(line: 2073, column: 14, scope: !424)
!450 = !DILocation(line: 2073, column: 9, scope: !424)
!451 = !DILocation(line: 2073, column: 2, scope: !424)
!452 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !293, file: !293, line: 3209, type: !453, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !310)
!453 = !DISubroutineType(types: !454)
!454 = !{!259, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !293, line: 3092, size: 128, elements: !457)
!457 = !{!458, !459, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !456, file: !293, line: 3093, baseType: !236, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !456, file: !293, line: 3094, baseType: !259, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !456, file: !293, line: 3095, baseType: !259, size: 32, offset: 96)
!461 = !DILocalVariable(name: "sem", arg: 1, scope: !452, file: !293, line: 3209, type: !455)
!462 = !DILocation(line: 3209, column: 65, scope: !452)
!463 = !DILocation(line: 3211, column: 9, scope: !452)
!464 = !DILocation(line: 3211, column: 14, scope: !452)
!465 = !DILocation(line: 3211, column: 2, scope: !452)
!466 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !293, file: !293, line: 4649, type: !467, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !310)
!467 = !DISubroutineType(types: !468)
!468 = !{!258, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !293, line: 4390, size: 320, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !478, !479, !480, !481, !482}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !470, file: !293, line: 4392, baseType: !236, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !470, file: !293, line: 4394, baseType: !308, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !470, file: !293, line: 4396, baseType: !304, size: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !470, file: !293, line: 4398, baseType: !258, size: 32, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !470, file: !293, line: 4400, baseType: !477, size: 32, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !470, file: !293, line: 4402, baseType: !477, size: 32, offset: 160)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !470, file: !293, line: 4404, baseType: !477, size: 32, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !470, file: !293, line: 4406, baseType: !477, size: 32, offset: 224)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !470, file: !293, line: 4408, baseType: !258, size: 32, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !470, file: !293, line: 4413, baseType: !121, size: 8, offset: 288)
!483 = !DILocalVariable(name: "msgq", arg: 1, scope: !466, file: !293, line: 4649, type: !469)
!484 = !DILocation(line: 4649, column: 66, scope: !466)
!485 = !DILocation(line: 4651, column: 9, scope: !466)
!486 = !DILocation(line: 4651, column: 15, scope: !466)
!487 = !DILocation(line: 4651, column: 26, scope: !466)
!488 = !DILocation(line: 4651, column: 32, scope: !466)
!489 = !DILocation(line: 4651, column: 24, scope: !466)
!490 = !DILocation(line: 4651, column: 2, scope: !466)
!491 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !293, file: !293, line: 4665, type: !467, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !310)
!492 = !DILocalVariable(name: "msgq", arg: 1, scope: !491, file: !293, line: 4665, type: !469)
!493 = !DILocation(line: 4665, column: 66, scope: !491)
!494 = !DILocation(line: 4667, column: 9, scope: !491)
!495 = !DILocation(line: 4667, column: 15, scope: !491)
!496 = !DILocation(line: 4667, column: 2, scope: !491)
!497 = distinct !DISubprogram(name: "coredump", scope: !6, file: !6, line: 232, type: !498, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !310)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !259, !500, !199}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_arch_esf_t", file: !503, line: 122, baseType: !504)
!503 = !DIFile(filename: "include/zephyr/arch/arm/cortex_m/exc.h", directory: "/home/sri/zephyrproject/zephyr")
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__esf", file: !503, line: 101, size: 256, elements: !505)
!505 = !{!506}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !504, file: !503, line: 111, baseType: !507, size: 256)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__basic_sf", file: !503, line: 102, size: 256, elements: !508)
!508 = !{!509, !514, !519, !524, !529, !534, !539, !544}
!509 = !DIDerivedType(tag: DW_TAG_member, scope: !507, file: !503, line: 103, baseType: !510, size: 32)
!510 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !507, file: !503, line: 103, size: 32, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !510, file: !503, line: 103, baseType: !258, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "r0", scope: !510, file: !503, line: 103, baseType: !258, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, scope: !507, file: !503, line: 104, baseType: !515, size: 32, offset: 32)
!515 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !507, file: !503, line: 104, size: 32, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !515, file: !503, line: 104, baseType: !258, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !515, file: !503, line: 104, baseType: !258, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, scope: !507, file: !503, line: 105, baseType: !520, size: 32, offset: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !507, file: !503, line: 105, size: 32, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "a3", scope: !520, file: !503, line: 105, baseType: !258, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "r2", scope: !520, file: !503, line: 105, baseType: !258, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, scope: !507, file: !503, line: 106, baseType: !525, size: 32, offset: 96)
!525 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !507, file: !503, line: 106, size: 32, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "a4", scope: !525, file: !503, line: 106, baseType: !258, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "r3", scope: !525, file: !503, line: 106, baseType: !258, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, scope: !507, file: !503, line: 107, baseType: !530, size: 32, offset: 128)
!530 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !507, file: !503, line: 107, size: 32, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !530, file: !503, line: 107, baseType: !258, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "r12", scope: !530, file: !503, line: 107, baseType: !258, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, scope: !507, file: !503, line: 108, baseType: !535, size: 32, offset: 160)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !507, file: !503, line: 108, size: 32, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lr", scope: !535, file: !503, line: 108, baseType: !258, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "r14", scope: !535, file: !503, line: 108, baseType: !258, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, scope: !507, file: !503, line: 109, baseType: !540, size: 32, offset: 192)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !507, file: !503, line: 109, size: 32, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !540, file: !503, line: 109, baseType: !258, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "r15", scope: !540, file: !503, line: 109, baseType: !258, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "xpsr", scope: !507, file: !503, line: 110, baseType: !258, size: 32, offset: 224)
!545 = !DILocalVariable(name: "reason", arg: 1, scope: !497, file: !6, line: 232, type: !259)
!546 = !DILocation(line: 232, column: 28, scope: !497)
!547 = !DILocalVariable(name: "esf", arg: 2, scope: !497, file: !6, line: 232, type: !500)
!548 = !DILocation(line: 232, column: 56, scope: !497)
!549 = !DILocalVariable(name: "thread", arg: 3, scope: !497, file: !6, line: 233, type: !199)
!550 = !DILocation(line: 233, column: 25, scope: !497)
!551 = !DILocation(line: 235, column: 9, scope: !497)
!552 = !DILocation(line: 236, column: 9, scope: !497)
!553 = !DILocation(line: 237, column: 9, scope: !497)
!554 = !DILocation(line: 238, column: 1, scope: !497)
!555 = distinct !DISubprogram(name: "coredump_memory_dump", scope: !6, file: !6, line: 240, type: !556, scopeLine: 241, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !310)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !558, !558}
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !122, line: 102, baseType: !259)
!559 = !DILocalVariable(name: "start_addr", arg: 1, scope: !555, file: !6, line: 240, type: !558)
!560 = !DILocation(line: 240, column: 37, scope: !555)
!561 = !DILocalVariable(name: "end_addr", arg: 2, scope: !555, file: !6, line: 240, type: !558)
!562 = !DILocation(line: 240, column: 59, scope: !555)
!563 = !DILocation(line: 242, column: 9, scope: !555)
!564 = !DILocation(line: 243, column: 9, scope: !555)
!565 = !DILocation(line: 244, column: 1, scope: !555)
!566 = distinct !DISubprogram(name: "coredump_buffer_output", scope: !6, file: !6, line: 246, type: !567, scopeLine: 247, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !310)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !120, !569}
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !570, line: 51, baseType: !259)
!570 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/string.h", directory: "")
!571 = !DILocalVariable(name: "buf", arg: 1, scope: !566, file: !6, line: 246, type: !120)
!572 = !DILocation(line: 246, column: 38, scope: !566)
!573 = !DILocalVariable(name: "buflen", arg: 2, scope: !566, file: !6, line: 246, type: !569)
!574 = !DILocation(line: 246, column: 50, scope: !566)
!575 = !DILocation(line: 248, column: 9, scope: !566)
!576 = !DILocation(line: 249, column: 9, scope: !566)
!577 = !DILocation(line: 250, column: 1, scope: !566)
!578 = distinct !DISubprogram(name: "coredump_query", scope: !6, file: !6, line: 252, type: !579, scopeLine: 253, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !310)
!579 = !DISubroutineType(types: !580)
!580 = !{!123, !5, !119}
!581 = !DILocalVariable(name: "query_id", arg: 1, scope: !578, file: !6, line: 252, type: !5)
!582 = !DILocation(line: 252, column: 43, scope: !578)
!583 = !DILocalVariable(name: "arg", arg: 2, scope: !578, file: !6, line: 252, type: !119)
!584 = !DILocation(line: 252, column: 59, scope: !578)
!585 = !DILocation(line: 254, column: 9, scope: !578)
!586 = !DILocation(line: 255, column: 9, scope: !578)
!587 = !DILocation(line: 256, column: 2, scope: !578)
!588 = distinct !DISubprogram(name: "coredump_cmd", scope: !6, file: !6, line: 259, type: !589, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !310)
!589 = !DISubroutineType(types: !590)
!590 = !{!123, !13, !119}
!591 = !DILocalVariable(name: "query_id", arg: 1, scope: !588, file: !6, line: 259, type: !13)
!592 = !DILocation(line: 259, column: 39, scope: !588)
!593 = !DILocalVariable(name: "arg", arg: 2, scope: !588, file: !6, line: 259, type: !119)
!594 = !DILocation(line: 259, column: 55, scope: !588)
!595 = !DILocation(line: 261, column: 9, scope: !588)
!596 = !DILocation(line: 262, column: 9, scope: !588)
!597 = !DILocation(line: 263, column: 2, scope: !588)
