; ModuleID = '../bc_files/fault.bc'
source_filename = "/home/sri/zephyrproject/zephyr/arch/arm/core/cortex_m/fault.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }
%struct.__esf = type { %struct.__basic_sf }
%struct.__basic_sf = type { %union.anon.3, %union.anon.4, %union.anon.5, %union.anon.6, %union.anon.7, %union.anon.8, %union.anon.9, i32 }

!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!16 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!17 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!18 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!19 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!20 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!21 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!22 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!23 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!24 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!25 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!26 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!27 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!28 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!29 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!30 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!31 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!32 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 17)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 18)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 19)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 20)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 21)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 22)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 25)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 26)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 27)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 28)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 29)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 30)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 31)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 32)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 33)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 34)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 35)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 36)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 37)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 38)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 39)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 40)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 41)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 42)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 43)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 44)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 45)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 46)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 47)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!94 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!95 = !{!96, !118, !119, !120, !164, !165}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !98, line: 352, baseType: !99)
!98 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/sri/zephyrproject")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 341, size: 320, elements: !100)
!100 = !{!101, !107, !108, !109, !110, !111, !112, !113, !117}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !99, file: !98, line: 343, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !105, line: 64, baseType: !106)
!105 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!106 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !99, file: !98, line: 344, baseType: !103, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !99, file: !98, line: 345, baseType: !104, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !99, file: !98, line: 346, baseType: !103, size: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !99, file: !98, line: 347, baseType: !103, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !99, file: !98, line: 348, baseType: !103, size: 32, offset: 160)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !99, file: !98, line: 349, baseType: !104, size: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !99, file: !98, line: 350, baseType: !114, size: 64, offset: 224)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 64, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 2)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !99, file: !98, line: 351, baseType: !103, size: 32, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!119 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_arch_esf_t", file: !122, line: 122, baseType: !123)
!122 = !DIFile(filename: "include/zephyr/arch/arm/cortex_m/exc.h", directory: "/home/sri/zephyrproject/zephyr")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__esf", file: !122, line: 101, size: 256, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !123, file: !122, line: 111, baseType: !126, size: 256)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__basic_sf", file: !122, line: 102, size: 256, elements: !127)
!127 = !{!128, !133, !138, !143, !148, !153, !158, !163}
!128 = !DIDerivedType(tag: DW_TAG_member, scope: !126, file: !122, line: 103, baseType: !129, size: 32)
!129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !122, line: 103, size: 32, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !129, file: !122, line: 103, baseType: !104, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "r0", scope: !129, file: !122, line: 103, baseType: !104, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, scope: !126, file: !122, line: 104, baseType: !134, size: 32, offset: 32)
!134 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !122, line: 104, size: 32, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !134, file: !122, line: 104, baseType: !104, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !134, file: !122, line: 104, baseType: !104, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, scope: !126, file: !122, line: 105, baseType: !139, size: 32, offset: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !122, line: 105, size: 32, elements: !140)
!140 = !{!141, !142}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "a3", scope: !139, file: !122, line: 105, baseType: !104, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "r2", scope: !139, file: !122, line: 105, baseType: !104, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !126, file: !122, line: 106, baseType: !144, size: 32, offset: 96)
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !122, line: 106, size: 32, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "a4", scope: !144, file: !122, line: 106, baseType: !104, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "r3", scope: !144, file: !122, line: 106, baseType: !104, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, scope: !126, file: !122, line: 107, baseType: !149, size: 32, offset: 128)
!149 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !122, line: 107, size: 32, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !149, file: !122, line: 107, baseType: !104, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "r12", scope: !149, file: !122, line: 107, baseType: !104, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, scope: !126, file: !122, line: 108, baseType: !154, size: 32, offset: 160)
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !122, line: 108, size: 32, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "lr", scope: !154, file: !122, line: 108, baseType: !104, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "r14", scope: !154, file: !122, line: 108, baseType: !104, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, scope: !126, file: !122, line: 109, baseType: !159, size: 32, offset: 192)
!159 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !122, line: 109, size: 32, elements: !160)
!160 = !{!161, !162}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !159, file: !122, line: 109, baseType: !104, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "r15", scope: !159, file: !122, line: 109, baseType: !104, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "xpsr", scope: !126, file: !122, line: 110, baseType: !104, size: 32, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !105, line: 102, baseType: !106)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !105, line: 63, baseType: !167)
!167 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!168 = !{i32 7, !"Dwarf Version", i32 4}
!169 = !{i32 2, !"Debug Info Version", i32 3}
!170 = !{i32 1, !"wchar_size", i32 4}
!171 = !{i32 1, !"static_rwdata", i32 1}
!172 = !{i32 1, !"enumsize_buildattr", i32 1}
!173 = !{i32 1, !"armlib_unavailable", i32 0}
!174 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!175 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !14, file: !14, line: 223, type: !176, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !292)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !178, !180}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !182, line: 250, size: 896, elements: !183)
!182 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!183 = !{!184, !250, !263, !264, !265, !266, !287}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !181, file: !182, line: 252, baseType: !185, size: 384)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !182, line: 58, size: 384, elements: !186)
!186 = !{!187, !213, !221, !223, !224, !235, !236, !237}
!187 = !DIDerivedType(tag: DW_TAG_member, scope: !185, file: !182, line: 61, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !185, file: !182, line: 61, size: 64, elements: !189)
!189 = !{!190, !206}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !188, file: !182, line: 62, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !192, line: 55, baseType: !193)
!192 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !192, line: 37, size: 64, elements: !194)
!194 = !{!195, !201}
!195 = !DIDerivedType(tag: DW_TAG_member, scope: !193, file: !192, line: 38, baseType: !196, size: 32)
!196 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !193, file: !192, line: 38, size: 32, elements: !197)
!197 = !{!198, !200}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !196, file: !192, line: 39, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !192, line: 40, baseType: !199, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, scope: !193, file: !192, line: 42, baseType: !202, size: 32, offset: 32)
!202 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !193, file: !192, line: 42, size: 32, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !202, file: !192, line: 43, baseType: !199, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !202, file: !192, line: 44, baseType: !199, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !188, file: !182, line: 63, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !208, line: 58, size: 64, elements: !209)
!208 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!209 = !{!210}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !207, file: !208, line: 60, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 64, elements: !115)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !185, file: !182, line: 69, baseType: !214, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !216, line: 243, baseType: !217)
!216 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 241, size: 64, elements: !218)
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !217, file: !216, line: 242, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !192, line: 51, baseType: !193)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !185, file: !182, line: 72, baseType: !222, size: 8, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !105, line: 62, baseType: !5)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !185, file: !182, line: 75, baseType: !222, size: 8, offset: 104)
!224 = !DIDerivedType(tag: DW_TAG_member, scope: !185, file: !182, line: 91, baseType: !225, size: 16, offset: 112)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !185, file: !182, line: 91, size: 16, elements: !226)
!226 = !{!227, !234}
!227 = !DIDerivedType(tag: DW_TAG_member, scope: !225, file: !182, line: 92, baseType: !228, size: 16)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !225, file: !182, line: 92, size: 16, elements: !229)
!229 = !{!230, !233}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !228, file: !182, line: 97, baseType: !231, size: 8)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !105, line: 56, baseType: !232)
!232 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !228, file: !182, line: 98, baseType: !222, size: 8, offset: 8)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !225, file: !182, line: 101, baseType: !166, size: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !185, file: !182, line: 108, baseType: !104, size: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !185, file: !182, line: 132, baseType: !118, size: 32, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !185, file: !182, line: 136, baseType: !238, size: 192, offset: 192)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !216, line: 254, size: 192, elements: !239)
!239 = !{!240, !241, !247}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !238, file: !216, line: 255, baseType: !191, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !238, file: !216, line: 256, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !216, line: 252, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !238, file: !216, line: 259, baseType: !248, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !105, line: 59, baseType: !249)
!249 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !181, file: !182, line: 255, baseType: !251, size: 288, offset: 384)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !252, line: 25, size: 288, elements: !253)
!252 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !262}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !251, file: !252, line: 26, baseType: !104, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !251, file: !252, line: 27, baseType: !104, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !251, file: !252, line: 28, baseType: !104, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !251, file: !252, line: 29, baseType: !104, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !251, file: !252, line: 30, baseType: !104, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !251, file: !252, line: 31, baseType: !104, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !251, file: !252, line: 32, baseType: !104, size: 32, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !251, file: !252, line: 33, baseType: !104, size: 32, offset: 224)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !251, file: !252, line: 34, baseType: !104, size: 32, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !181, file: !182, line: 258, baseType: !118, size: 32, offset: 672)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !181, file: !182, line: 261, baseType: !215, size: 64, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !181, file: !182, line: 302, baseType: !119, size: 32, offset: 768)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !181, file: !182, line: 333, baseType: !267, size: 32, offset: 800)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !269, line: 5291, size: 160, elements: !270)
!269 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!270 = !{!271, !282, !283}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !268, file: !269, line: 5292, baseType: !272, size: 96)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !273, line: 56, size: 96, elements: !274)
!273 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!274 = !{!275, !278, !279}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !272, file: !273, line: 57, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !273, line: 57, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !272, file: !273, line: 58, baseType: !118, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !272, file: !273, line: 59, baseType: !280, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !281, line: 46, baseType: !106)
!281 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!282 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !268, file: !269, line: 5293, baseType: !215, size: 64, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !268, file: !269, line: 5294, baseType: !284, offset: 160)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !285, line: 45, elements: !286)
!285 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!286 = !{}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !181, file: !182, line: 355, baseType: !288, size: 64, offset: 832)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !252, line: 60, size: 64, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !288, file: !252, line: 63, baseType: !104, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !288, file: !252, line: 66, baseType: !104, size: 32, offset: 32)
!292 = !{!293, !294}
!293 = !DILocalVariable(name: "object", arg: 1, scope: !175, file: !14, line: 223, type: !178)
!294 = !DILocalVariable(name: "thread", arg: 2, scope: !175, file: !14, line: 224, type: !180)
!295 = !DILocation(line: 223, column: 61, scope: !175)
!296 = !DILocation(line: 224, column: 24, scope: !175)
!297 = !DILocation(line: 226, column: 9, scope: !175)
!298 = !DILocation(line: 227, column: 9, scope: !175)
!299 = !DILocation(line: 228, column: 1, scope: !175)
!300 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !14, file: !14, line: 243, type: !301, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !303)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !178}
!303 = !{!304}
!304 = !DILocalVariable(name: "object", arg: 1, scope: !300, file: !14, line: 243, type: !178)
!305 = !DILocation(line: 243, column: 56, scope: !300)
!306 = !DILocation(line: 245, column: 9, scope: !300)
!307 = !DILocation(line: 246, column: 1, scope: !300)
!308 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !14, file: !14, line: 359, type: !309, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !311)
!309 = !DISubroutineType(types: !310)
!310 = !{!118, !13}
!311 = !{!312}
!312 = !DILocalVariable(name: "otype", arg: 1, scope: !308, file: !14, line: 359, type: !13)
!313 = !DILocation(line: 359, column: 58, scope: !308)
!314 = !DILocation(line: 361, column: 9, scope: !308)
!315 = !DILocation(line: 363, column: 2, scope: !308)
!316 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !14, file: !14, line: 366, type: !317, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !319)
!317 = !DISubroutineType(types: !318)
!318 = !{!118, !13, !280}
!319 = !{!320, !321}
!320 = !DILocalVariable(name: "otype", arg: 1, scope: !316, file: !14, line: 366, type: !13)
!321 = !DILocalVariable(name: "size", arg: 2, scope: !316, file: !14, line: 367, type: !280)
!322 = !DILocation(line: 366, column: 63, scope: !316)
!323 = !DILocation(line: 367, column: 13, scope: !316)
!324 = !DILocation(line: 369, column: 9, scope: !316)
!325 = !DILocation(line: 370, column: 9, scope: !316)
!326 = !DILocation(line: 372, column: 2, scope: !316)
!327 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !269, file: !269, line: 656, type: !328, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !334)
!328 = !DISubroutineType(types: !329)
!329 = !{!330, !332}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !331, line: 46, baseType: !248)
!331 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!334 = !{!335}
!335 = !DILocalVariable(name: "t", arg: 1, scope: !327, file: !269, line: 657, type: !332)
!336 = !DILocation(line: 657, column: 30, scope: !327)
!337 = !DILocation(line: 659, column: 28, scope: !327)
!338 = !DILocation(line: 659, column: 31, scope: !327)
!339 = !DILocation(line: 659, column: 36, scope: !327)
!340 = !DILocation(line: 659, column: 9, scope: !327)
!341 = !DILocation(line: 659, column: 2, scope: !327)
!342 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !269, file: !269, line: 671, type: !328, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !343)
!343 = !{!344}
!344 = !DILocalVariable(name: "t", arg: 1, scope: !342, file: !269, line: 672, type: !332)
!345 = !DILocation(line: 672, column: 30, scope: !342)
!346 = !DILocation(line: 674, column: 30, scope: !342)
!347 = !DILocation(line: 674, column: 33, scope: !342)
!348 = !DILocation(line: 674, column: 38, scope: !342)
!349 = !DILocation(line: 674, column: 9, scope: !342)
!350 = !DILocation(line: 674, column: 2, scope: !342)
!351 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !269, file: !269, line: 1634, type: !352, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !373)
!352 = !DISubroutineType(types: !353)
!353 = !{!330, !354}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !269, line: 1439, size: 448, elements: !357)
!357 = !{!358, !359, !360, !365, !366, !371, !372}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !356, file: !269, line: 1445, baseType: !238, size: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !356, file: !269, line: 1448, baseType: !215, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !356, file: !269, line: 1451, baseType: !361, size: 32, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !364}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !356, file: !269, line: 1454, baseType: !361, size: 32, offset: 288)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !356, file: !269, line: 1457, baseType: !367, size: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !331, line: 67, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !331, line: 65, size: 64, elements: !369)
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !368, file: !331, line: 66, baseType: !330, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !356, file: !269, line: 1460, baseType: !104, size: 32, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !356, file: !269, line: 1463, baseType: !118, size: 32, offset: 416)
!373 = !{!374}
!374 = !DILocalVariable(name: "timer", arg: 1, scope: !351, file: !269, line: 1635, type: !354)
!375 = !DILocation(line: 1635, column: 34, scope: !351)
!376 = !DILocation(line: 1637, column: 28, scope: !351)
!377 = !DILocation(line: 1637, column: 35, scope: !351)
!378 = !DILocation(line: 1637, column: 9, scope: !351)
!379 = !DILocation(line: 1637, column: 2, scope: !351)
!380 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !269, file: !269, line: 1649, type: !352, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !381)
!381 = !{!382}
!382 = !DILocalVariable(name: "timer", arg: 1, scope: !380, file: !269, line: 1650, type: !354)
!383 = !DILocation(line: 1650, column: 34, scope: !380)
!384 = !DILocation(line: 1652, column: 30, scope: !380)
!385 = !DILocation(line: 1652, column: 37, scope: !380)
!386 = !DILocation(line: 1652, column: 9, scope: !380)
!387 = !DILocation(line: 1652, column: 2, scope: !380)
!388 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !269, file: !269, line: 1689, type: !389, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !391)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !364, !118}
!391 = !{!392, !393}
!392 = !DILocalVariable(name: "timer", arg: 1, scope: !388, file: !269, line: 1689, type: !364)
!393 = !DILocalVariable(name: "user_data", arg: 2, scope: !388, file: !269, line: 1690, type: !118)
!394 = !DILocation(line: 1689, column: 65, scope: !388)
!395 = !DILocation(line: 1690, column: 19, scope: !388)
!396 = !DILocation(line: 1692, column: 21, scope: !388)
!397 = !DILocation(line: 1692, column: 2, scope: !388)
!398 = !DILocation(line: 1692, column: 9, scope: !388)
!399 = !DILocation(line: 1692, column: 19, scope: !388)
!400 = !DILocation(line: 1693, column: 1, scope: !388)
!401 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !269, file: !269, line: 1704, type: !402, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !404)
!402 = !DISubroutineType(types: !403)
!403 = !{!118, !354}
!404 = !{!405}
!405 = !DILocalVariable(name: "timer", arg: 1, scope: !401, file: !269, line: 1704, type: !354)
!406 = !DILocation(line: 1704, column: 72, scope: !401)
!407 = !DILocation(line: 1706, column: 9, scope: !401)
!408 = !DILocation(line: 1706, column: 16, scope: !401)
!409 = !DILocation(line: 1706, column: 2, scope: !401)
!410 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !269, file: !269, line: 2071, type: !411, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !431)
!411 = !DISubroutineType(types: !412)
!412 = !{!119, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !269, line: 1830, size: 128, elements: !415)
!415 = !{!416, !429, !430}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !414, file: !269, line: 1831, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !418, line: 60, baseType: !419)
!418 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !418, line: 53, size: 64, elements: !420)
!420 = !{!421, !428}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !419, file: !418, line: 54, baseType: !422, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !418, line: 50, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !418, line: 44, size: 32, elements: !425)
!425 = !{!426}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !424, file: !418, line: 45, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !418, line: 40, baseType: !104)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !419, file: !418, line: 55, baseType: !422, size: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !414, file: !269, line: 1832, baseType: !284, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !414, file: !269, line: 1833, baseType: !215, size: 64, offset: 64)
!431 = !{!432}
!432 = !DILocalVariable(name: "queue", arg: 1, scope: !410, file: !269, line: 2071, type: !413)
!433 = !DILocation(line: 2071, column: 59, scope: !410)
!434 = !DILocation(line: 2073, column: 35, scope: !410)
!435 = !DILocation(line: 2073, column: 42, scope: !410)
!436 = !DILocation(line: 2073, column: 14, scope: !410)
!437 = !DILocation(line: 2073, column: 9, scope: !410)
!438 = !DILocation(line: 2073, column: 2, scope: !410)
!439 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !269, file: !269, line: 3209, type: !440, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !448)
!440 = !DISubroutineType(types: !441)
!441 = !{!106, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !269, line: 3092, size: 128, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !443, file: !269, line: 3093, baseType: !215, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !443, file: !269, line: 3094, baseType: !106, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !443, file: !269, line: 3095, baseType: !106, size: 32, offset: 96)
!448 = !{!449}
!449 = !DILocalVariable(name: "sem", arg: 1, scope: !439, file: !269, line: 3209, type: !442)
!450 = !DILocation(line: 3209, column: 65, scope: !439)
!451 = !DILocation(line: 3211, column: 9, scope: !439)
!452 = !DILocation(line: 3211, column: 14, scope: !439)
!453 = !DILocation(line: 3211, column: 2, scope: !439)
!454 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !269, file: !269, line: 4649, type: !455, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !472)
!455 = !DISubroutineType(types: !456)
!456 = !{!104, !457}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !269, line: 4390, size: 320, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !467, !468, !469, !470, !471}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !458, file: !269, line: 4392, baseType: !215, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !458, file: !269, line: 4394, baseType: !284, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !458, file: !269, line: 4396, baseType: !280, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !458, file: !269, line: 4398, baseType: !104, size: 32, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !458, file: !269, line: 4400, baseType: !465, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !458, file: !269, line: 4402, baseType: !465, size: 32, offset: 160)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !458, file: !269, line: 4404, baseType: !465, size: 32, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !458, file: !269, line: 4406, baseType: !465, size: 32, offset: 224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !458, file: !269, line: 4408, baseType: !104, size: 32, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !458, file: !269, line: 4413, baseType: !222, size: 8, offset: 288)
!472 = !{!473}
!473 = !DILocalVariable(name: "msgq", arg: 1, scope: !454, file: !269, line: 4649, type: !457)
!474 = !DILocation(line: 4649, column: 66, scope: !454)
!475 = !DILocation(line: 4651, column: 9, scope: !454)
!476 = !DILocation(line: 4651, column: 15, scope: !454)
!477 = !DILocation(line: 4651, column: 26, scope: !454)
!478 = !DILocation(line: 4651, column: 32, scope: !454)
!479 = !DILocation(line: 4651, column: 24, scope: !454)
!480 = !DILocation(line: 4651, column: 2, scope: !454)
!481 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !269, file: !269, line: 4665, type: !455, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !482)
!482 = !{!483}
!483 = !DILocalVariable(name: "msgq", arg: 1, scope: !481, file: !269, line: 4665, type: !457)
!484 = !DILocation(line: 4665, column: 66, scope: !481)
!485 = !DILocation(line: 4667, column: 9, scope: !481)
!486 = !DILocation(line: 4667, column: 15, scope: !481)
!487 = !DILocation(line: 4667, column: 2, scope: !481)
!488 = distinct !DISubprogram(name: "z_arm_fault", scope: !489, file: !489, line: 1092, type: !490, scopeLine: 1094, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !494)
!489 = !DIFile(filename: "arch/arm/core/cortex_m/fault.c", directory: "/home/sri/zephyrproject/zephyr")
!490 = !DISubroutineType(types: !491)
!491 = !{null, !104, !104, !104, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "_callee_saved_t", file: !252, line: 37, baseType: !251)
!494 = !{!495, !496, !497, !498, !499, !500, !501, !503, !504, !505}
!495 = !DILocalVariable(name: "msp", arg: 1, scope: !488, file: !489, line: 1092, type: !104)
!496 = !DILocalVariable(name: "psp", arg: 2, scope: !488, file: !489, line: 1092, type: !104)
!497 = !DILocalVariable(name: "exc_return", arg: 3, scope: !488, file: !489, line: 1092, type: !104)
!498 = !DILocalVariable(name: "callee_regs", arg: 4, scope: !488, file: !489, line: 1093, type: !492)
!499 = !DILocalVariable(name: "reason", scope: !488, file: !489, line: 1095, type: !104)
!500 = !DILocalVariable(name: "fault", scope: !488, file: !489, line: 1096, type: !119)
!501 = !DILocalVariable(name: "recoverable", scope: !488, file: !489, line: 1097, type: !502)
!502 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!503 = !DILocalVariable(name: "nested_exc", scope: !488, file: !489, line: 1097, type: !502)
!504 = !DILocalVariable(name: "esf", scope: !488, file: !489, line: 1098, type: !120)
!505 = !DILocalVariable(name: "esf_copy", scope: !488, file: !489, line: 1103, type: !121)
!506 = !DILocation(line: 1092, column: 27, scope: !488)
!507 = !DILocation(line: 1092, column: 41, scope: !488)
!508 = !DILocation(line: 1092, column: 55, scope: !488)
!509 = !DILocation(line: 1093, column: 19, scope: !488)
!510 = !DILocation(line: 1095, column: 2, scope: !488)
!511 = !DILocation(line: 1095, column: 11, scope: !488)
!512 = !DILocation(line: 1096, column: 2, scope: !488)
!513 = !DILocation(line: 1096, column: 6, scope: !488)
!514 = !DILocation(line: 1096, column: 59, scope: !488)
!515 = !DILocation(line: 1096, column: 64, scope: !488)
!516 = !DILocation(line: 1097, column: 2, scope: !488)
!517 = !DILocation(line: 1097, column: 8, scope: !488)
!518 = !DILocation(line: 1097, column: 21, scope: !488)
!519 = !DILocation(line: 1098, column: 2, scope: !488)
!520 = !DILocation(line: 1098, column: 16, scope: !488)
!521 = !DILocation(line: 1103, column: 2, scope: !488)
!522 = !DILocation(line: 1103, column: 15, scope: !488)
!523 = !DILocalVariable(name: "key", arg: 1, scope: !524, file: !525, line: 88, type: !106)
