; ModuleID = '../bc_files/fault.bc'
source_filename = "/home/sri/zephyrproject/zephyr/arch/arm/core/cortex_m/fault.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.log_source_const_data = type { ptr, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }
%struct.__esf = type { %struct.__basic_sf }

!21 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!22 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!23 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!24 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!25 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!26 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!27 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!28 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!29 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!30 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!31 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!32 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!33 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!34 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 17)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 18)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 19)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 20)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 23)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 24)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 25)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 26)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 27)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 28)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 29)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 30)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 31)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 32)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 33)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 34)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 35)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 36)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 37)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 38)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 39)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 40)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 41)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 42)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 43)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 44)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 45)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 46)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 47)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!96 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !98, line: 128, baseType: !7, size: 8, elements: !99)
!98 = !DIFile(filename: "include/zephyr/logging/log_msg.h", directory: "/home/sri/zephyrproject/zephyr")
!99 = !{!100, !101, !102}
!100 = !DIEnumerator(name: "Z_LOG_MSG_MODE_RUNTIME", value: 0)
!101 = !DIEnumerator(name: "Z_LOG_MSG_MODE_FROM_STACK", value: 1)
!102 = !DIEnumerator(name: "Z_LOG_MSG_MODE_ZERO_COPY", value: 2)
!103 = !{!104, !126, !127, !128, !130, !174, !175}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !106, line: 352, baseType: !107)
!106 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/sri/zephyrproject")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 341, size: 320, elements: !108)
!108 = !{!109, !115, !116, !117, !118, !119, !120, !121, !125}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !107, file: !106, line: 343, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !113, line: 64, baseType: !114)
!113 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!114 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !107, file: !106, line: 344, baseType: !111, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !107, file: !106, line: 345, baseType: !112, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !107, file: !106, line: 346, baseType: !111, size: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !107, file: !106, line: 347, baseType: !111, size: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !107, file: !106, line: 348, baseType: !111, size: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !107, file: !106, line: 349, baseType: !112, size: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !107, file: !106, line: 350, baseType: !122, size: 64, offset: 224)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 64, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 2)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !107, file: !106, line: 351, baseType: !111, size: 32, offset: 288)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!127 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !113, line: 62, baseType: !7)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_arch_esf_t", file: !132, line: 122, baseType: !133)
!132 = !DIFile(filename: "include/zephyr/arch/arm/cortex_m/exc.h", directory: "/home/sri/zephyrproject/zephyr")
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__esf", file: !132, line: 101, size: 256, elements: !134)
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !133, file: !132, line: 111, baseType: !136, size: 256)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__basic_sf", file: !132, line: 102, size: 256, elements: !137)
!137 = !{!138, !143, !148, !153, !158, !163, !168, !173}
!138 = !DIDerivedType(tag: DW_TAG_member, scope: !136, file: !132, line: 103, baseType: !139, size: 32)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !132, line: 103, size: 32, elements: !140)
!140 = !{!141, !142}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !139, file: !132, line: 103, baseType: !112, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "r0", scope: !139, file: !132, line: 103, baseType: !112, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !136, file: !132, line: 104, baseType: !144, size: 32, offset: 32)
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !132, line: 104, size: 32, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !144, file: !132, line: 104, baseType: !112, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !144, file: !132, line: 104, baseType: !112, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, scope: !136, file: !132, line: 105, baseType: !149, size: 32, offset: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !132, line: 105, size: 32, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "a3", scope: !149, file: !132, line: 105, baseType: !112, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "r2", scope: !149, file: !132, line: 105, baseType: !112, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, scope: !136, file: !132, line: 106, baseType: !154, size: 32, offset: 96)
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !132, line: 106, size: 32, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "a4", scope: !154, file: !132, line: 106, baseType: !112, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "r3", scope: !154, file: !132, line: 106, baseType: !112, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, scope: !136, file: !132, line: 107, baseType: !159, size: 32, offset: 128)
!159 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !132, line: 107, size: 32, elements: !160)
!160 = !{!161, !162}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !159, file: !132, line: 107, baseType: !112, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "r12", scope: !159, file: !132, line: 107, baseType: !112, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, scope: !136, file: !132, line: 108, baseType: !164, size: 32, offset: 160)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !132, line: 108, size: 32, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "lr", scope: !164, file: !132, line: 108, baseType: !112, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "r14", scope: !164, file: !132, line: 108, baseType: !112, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, scope: !136, file: !132, line: 109, baseType: !169, size: 32, offset: 192)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !132, line: 109, size: 32, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !169, file: !132, line: 109, baseType: !112, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "r15", scope: !169, file: !132, line: 109, baseType: !112, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "xpsr", scope: !136, file: !132, line: 110, baseType: !112, size: 32, offset: 224)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !113, line: 102, baseType: !114)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !113, line: 63, baseType: !177)
!177 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!178 = !{!179, !0, !186, !191, !196, !201, !206}
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !181, line: 1041, type: !182, isLocal: true, isDefinition: true)
!181 = !DIFile(filename: "arch/arm/core/cortex_m/fault.c", directory: "/home/sri/zephyrproject/zephyr")
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 344, elements: !184)
!183 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!184 = !{!185}
!185 = !DISubrange(count: 43)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !181, line: 769, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 184, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 23)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !181, line: 782, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 224, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 28)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !181, line: 836, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 152, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 19)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !181, line: 836, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 168, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 21)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !181, line: 836, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 200, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 25)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !214, line: 17, size: 64, elements: !215)
!214 = !DIFile(filename: "include/zephyr/logging/log_instance.h", directory: "/home/sri/zephyrproject/zephyr")
!215 = !{!216, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !213, file: !214, line: 18, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !213, file: !214, line: 19, baseType: !129, size: 8, offset: 32)
!220 = !{i32 7, !"Dwarf Version", i32 4}
!221 = !{i32 2, !"Debug Info Version", i32 3}
!222 = !{i32 1, !"wchar_size", i32 4}
!223 = !{i32 1, !"static_rwdata", i32 1}
!224 = !{i32 1, !"enumsize_buildattr", i32 1}
!225 = !{i32 1, !"armlib_unavailable", i32 0}
!226 = !{i32 8, !"PIC Level", i32 2}
!227 = !{i32 7, !"PIE Level", i32 2}
!228 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!229 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !16, file: !16, line: 223, type: !230, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !232, !234}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !236, line: 250, size: 896, elements: !237)
!236 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!237 = !{!238, !303, !316, !317, !318, !319, !340}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !235, file: !236, line: 252, baseType: !239, size: 384)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !236, line: 58, size: 384, elements: !240)
!240 = !{!241, !267, !275, !276, !277, !288, !289, !290}
!241 = !DIDerivedType(tag: DW_TAG_member, scope: !239, file: !236, line: 61, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !239, file: !236, line: 61, size: 64, elements: !243)
!243 = !{!244, !260}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !242, file: !236, line: 62, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !246, line: 55, baseType: !247)
!246 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !246, line: 37, size: 64, elements: !248)
!248 = !{!249, !255}
!249 = !DIDerivedType(tag: DW_TAG_member, scope: !247, file: !246, line: 38, baseType: !250, size: 32)
!250 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !247, file: !246, line: 38, size: 32, elements: !251)
!251 = !{!252, !254}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !250, file: !246, line: 39, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !246, line: 40, baseType: !253, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, scope: !247, file: !246, line: 42, baseType: !256, size: 32, offset: 32)
!256 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !247, file: !246, line: 42, size: 32, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !256, file: !246, line: 43, baseType: !253, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !256, file: !246, line: 44, baseType: !253, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !242, file: !236, line: 63, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !262, line: 58, size: 64, elements: !263)
!262 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!263 = !{!264}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !261, file: !262, line: 60, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 64, elements: !123)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !239, file: !236, line: 69, baseType: !268, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !270, line: 243, baseType: !271)
!270 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !270, line: 241, size: 64, elements: !272)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !271, file: !270, line: 242, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !246, line: 51, baseType: !247)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !239, file: !236, line: 72, baseType: !129, size: 8, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !239, file: !236, line: 75, baseType: !129, size: 8, offset: 104)
!277 = !DIDerivedType(tag: DW_TAG_member, scope: !239, file: !236, line: 91, baseType: !278, size: 16, offset: 112)
!278 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !239, file: !236, line: 91, size: 16, elements: !279)
!279 = !{!280, !287}
!280 = !DIDerivedType(tag: DW_TAG_member, scope: !278, file: !236, line: 92, baseType: !281, size: 16)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !278, file: !236, line: 92, size: 16, elements: !282)
!282 = !{!283, !286}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !281, file: !236, line: 97, baseType: !284, size: 8)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !113, line: 56, baseType: !285)
!285 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !281, file: !236, line: 98, baseType: !129, size: 8, offset: 8)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !278, file: !236, line: 101, baseType: !176, size: 16)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !239, file: !236, line: 108, baseType: !112, size: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !239, file: !236, line: 132, baseType: !126, size: 32, offset: 160)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !239, file: !236, line: 136, baseType: !291, size: 192, offset: 192)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !270, line: 254, size: 192, elements: !292)
!292 = !{!293, !294, !300}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !291, file: !270, line: 255, baseType: !245, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !291, file: !270, line: 256, baseType: !295, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !270, line: 252, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !291, file: !270, line: 259, baseType: !301, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !113, line: 59, baseType: !302)
!302 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !235, file: !236, line: 255, baseType: !304, size: 288, offset: 384)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !305, line: 25, size: 288, elements: !306)
!305 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !304, file: !305, line: 26, baseType: !112, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !304, file: !305, line: 27, baseType: !112, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !304, file: !305, line: 28, baseType: !112, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !304, file: !305, line: 29, baseType: !112, size: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !304, file: !305, line: 30, baseType: !112, size: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !304, file: !305, line: 31, baseType: !112, size: 32, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !304, file: !305, line: 32, baseType: !112, size: 32, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !304, file: !305, line: 33, baseType: !112, size: 32, offset: 224)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !304, file: !305, line: 34, baseType: !112, size: 32, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !235, file: !236, line: 258, baseType: !126, size: 32, offset: 672)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !235, file: !236, line: 261, baseType: !269, size: 64, offset: 704)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !235, file: !236, line: 302, baseType: !127, size: 32, offset: 768)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !235, file: !236, line: 333, baseType: !320, size: 32, offset: 800)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !322, line: 5291, size: 160, elements: !323)
!322 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!323 = !{!324, !335, !336}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !321, file: !322, line: 5292, baseType: !325, size: 96)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !326, line: 56, size: 96, elements: !327)
!326 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!327 = !{!328, !331, !332}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !325, file: !326, line: 57, baseType: !329, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !326, line: 57, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !325, file: !326, line: 58, baseType: !126, size: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !325, file: !326, line: 59, baseType: !333, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !334, line: 46, baseType: !114)
!334 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!335 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !321, file: !322, line: 5293, baseType: !269, size: 64, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !321, file: !322, line: 5294, baseType: !337, offset: 160)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !338, line: 45, elements: !339)
!338 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!339 = !{}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !235, file: !236, line: 355, baseType: !341, size: 64, offset: 832)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !305, line: 60, size: 64, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !341, file: !305, line: 63, baseType: !112, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !341, file: !305, line: 66, baseType: !112, size: 32, offset: 32)
!345 = !DILocalVariable(name: "object", arg: 1, scope: !229, file: !16, line: 223, type: !232)
!346 = !DILocation(line: 223, column: 61, scope: !229)
!347 = !DILocalVariable(name: "thread", arg: 2, scope: !229, file: !16, line: 224, type: !234)
!348 = !DILocation(line: 224, column: 24, scope: !229)
!349 = !DILocation(line: 226, column: 9, scope: !229)
!350 = !DILocation(line: 227, column: 9, scope: !229)
!351 = !DILocation(line: 228, column: 1, scope: !229)
!352 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !16, file: !16, line: 243, type: !353, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !232}
!355 = !DILocalVariable(name: "object", arg: 1, scope: !352, file: !16, line: 243, type: !232)
!356 = !DILocation(line: 243, column: 56, scope: !352)
!357 = !DILocation(line: 245, column: 9, scope: !352)
!358 = !DILocation(line: 246, column: 1, scope: !352)
!359 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !16, file: !16, line: 359, type: !360, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!360 = !DISubroutineType(types: !361)
!361 = !{!126, !15}
!362 = !DILocalVariable(name: "otype", arg: 1, scope: !359, file: !16, line: 359, type: !15)
!363 = !DILocation(line: 359, column: 58, scope: !359)
!364 = !DILocation(line: 361, column: 9, scope: !359)
!365 = !DILocation(line: 363, column: 2, scope: !359)
!366 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !16, file: !16, line: 366, type: !367, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!367 = !DISubroutineType(types: !368)
!368 = !{!126, !15, !333}
!369 = !DILocalVariable(name: "otype", arg: 1, scope: !366, file: !16, line: 366, type: !15)
!370 = !DILocation(line: 366, column: 63, scope: !366)
!371 = !DILocalVariable(name: "size", arg: 2, scope: !366, file: !16, line: 367, type: !333)
!372 = !DILocation(line: 367, column: 13, scope: !366)
!373 = !DILocation(line: 369, column: 9, scope: !366)
!374 = !DILocation(line: 370, column: 9, scope: !366)
!375 = !DILocation(line: 372, column: 2, scope: !366)
!376 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !322, file: !322, line: 656, type: !377, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!377 = !DISubroutineType(types: !378)
!378 = !{!379, !381}
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !380, line: 46, baseType: !301)
!380 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!383 = !DILocalVariable(name: "t", arg: 1, scope: !376, file: !322, line: 657, type: !381)
!384 = !DILocation(line: 657, column: 30, scope: !376)
!385 = !DILocation(line: 659, column: 28, scope: !376)
!386 = !DILocation(line: 659, column: 31, scope: !376)
!387 = !DILocation(line: 659, column: 36, scope: !376)
!388 = !DILocation(line: 659, column: 9, scope: !376)
!389 = !DILocation(line: 659, column: 2, scope: !376)
!390 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !322, file: !322, line: 671, type: !377, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!391 = !DILocalVariable(name: "t", arg: 1, scope: !390, file: !322, line: 672, type: !381)
!392 = !DILocation(line: 672, column: 30, scope: !390)
!393 = !DILocation(line: 674, column: 30, scope: !390)
!394 = !DILocation(line: 674, column: 33, scope: !390)
!395 = !DILocation(line: 674, column: 38, scope: !390)
!396 = !DILocation(line: 674, column: 9, scope: !390)
!397 = !DILocation(line: 674, column: 2, scope: !390)
!398 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !322, file: !322, line: 1634, type: !399, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!399 = !DISubroutineType(types: !400)
!400 = !{!379, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !322, line: 1439, size: 448, elements: !404)
!404 = !{!405, !406, !407, !412, !413, !418, !419}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !403, file: !322, line: 1445, baseType: !291, size: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !403, file: !322, line: 1448, baseType: !269, size: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !403, file: !322, line: 1451, baseType: !408, size: 32, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !403, file: !322, line: 1454, baseType: !408, size: 32, offset: 288)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !403, file: !322, line: 1457, baseType: !414, size: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !380, line: 67, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !380, line: 65, size: 64, elements: !416)
!416 = !{!417}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !415, file: !380, line: 66, baseType: !379, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !403, file: !322, line: 1460, baseType: !112, size: 32, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !403, file: !322, line: 1463, baseType: !126, size: 32, offset: 416)
!420 = !DILocalVariable(name: "timer", arg: 1, scope: !398, file: !322, line: 1635, type: !401)
!421 = !DILocation(line: 1635, column: 34, scope: !398)
!422 = !DILocation(line: 1637, column: 28, scope: !398)
!423 = !DILocation(line: 1637, column: 35, scope: !398)
!424 = !DILocation(line: 1637, column: 9, scope: !398)
!425 = !DILocation(line: 1637, column: 2, scope: !398)
!426 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !322, file: !322, line: 1649, type: !399, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!427 = !DILocalVariable(name: "timer", arg: 1, scope: !426, file: !322, line: 1650, type: !401)
!428 = !DILocation(line: 1650, column: 34, scope: !426)
!429 = !DILocation(line: 1652, column: 30, scope: !426)
!430 = !DILocation(line: 1652, column: 37, scope: !426)
!431 = !DILocation(line: 1652, column: 9, scope: !426)
!432 = !DILocation(line: 1652, column: 2, scope: !426)
!433 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !322, file: !322, line: 1689, type: !434, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !411, !126}
!436 = !DILocalVariable(name: "timer", arg: 1, scope: !433, file: !322, line: 1689, type: !411)
!437 = !DILocation(line: 1689, column: 65, scope: !433)
!438 = !DILocalVariable(name: "user_data", arg: 2, scope: !433, file: !322, line: 1690, type: !126)
!439 = !DILocation(line: 1690, column: 19, scope: !433)
!440 = !DILocation(line: 1692, column: 21, scope: !433)
!441 = !DILocation(line: 1692, column: 2, scope: !433)
!442 = !DILocation(line: 1692, column: 9, scope: !433)
!443 = !DILocation(line: 1692, column: 19, scope: !433)
!444 = !DILocation(line: 1693, column: 1, scope: !433)
!445 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !322, file: !322, line: 1704, type: !446, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!446 = !DISubroutineType(types: !447)
!447 = !{!126, !401}
!448 = !DILocalVariable(name: "timer", arg: 1, scope: !445, file: !322, line: 1704, type: !401)
!449 = !DILocation(line: 1704, column: 72, scope: !445)
!450 = !DILocation(line: 1706, column: 9, scope: !445)
!451 = !DILocation(line: 1706, column: 16, scope: !445)
!452 = !DILocation(line: 1706, column: 2, scope: !445)
!453 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !322, file: !322, line: 2071, type: !454, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!454 = !DISubroutineType(types: !455)
!455 = !{!127, !456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 32)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !322, line: 1830, size: 128, elements: !458)
!458 = !{!459, !472, !473}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !457, file: !322, line: 1831, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !461, line: 60, baseType: !462)
!461 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !461, line: 53, size: 64, elements: !463)
!463 = !{!464, !471}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !462, file: !461, line: 54, baseType: !465, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !461, line: 50, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !461, line: 44, size: 32, elements: !468)
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !467, file: !461, line: 45, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !461, line: 40, baseType: !112)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !462, file: !461, line: 55, baseType: !465, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !457, file: !322, line: 1832, baseType: !337, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !457, file: !322, line: 1833, baseType: !269, size: 64, offset: 64)
!474 = !DILocalVariable(name: "queue", arg: 1, scope: !453, file: !322, line: 2071, type: !456)
!475 = !DILocation(line: 2071, column: 59, scope: !453)
!476 = !DILocation(line: 2073, column: 35, scope: !453)
!477 = !DILocation(line: 2073, column: 42, scope: !453)
!478 = !DILocation(line: 2073, column: 14, scope: !453)
!479 = !DILocation(line: 2073, column: 9, scope: !453)
!480 = !DILocation(line: 2073, column: 2, scope: !453)
!481 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !322, file: !322, line: 3209, type: !482, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!482 = !DISubroutineType(types: !483)
!483 = !{!114, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !322, line: 3092, size: 128, elements: !486)
!486 = !{!487, !488, !489}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !485, file: !322, line: 3093, baseType: !269, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !485, file: !322, line: 3094, baseType: !114, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !485, file: !322, line: 3095, baseType: !114, size: 32, offset: 96)
!490 = !DILocalVariable(name: "sem", arg: 1, scope: !481, file: !322, line: 3209, type: !484)
!491 = !DILocation(line: 3209, column: 65, scope: !481)
!492 = !DILocation(line: 3211, column: 9, scope: !481)
!493 = !DILocation(line: 3211, column: 14, scope: !481)
!494 = !DILocation(line: 3211, column: 2, scope: !481)
!495 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !322, file: !322, line: 4649, type: !496, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!496 = !DISubroutineType(types: !497)
!497 = !{!112, !498}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !322, line: 4390, size: 320, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !507, !508, !509, !510, !511}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !499, file: !322, line: 4392, baseType: !269, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !499, file: !322, line: 4394, baseType: !337, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !499, file: !322, line: 4396, baseType: !333, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !499, file: !322, line: 4398, baseType: !112, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !499, file: !322, line: 4400, baseType: !506, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !499, file: !322, line: 4402, baseType: !506, size: 32, offset: 160)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !499, file: !322, line: 4404, baseType: !506, size: 32, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !499, file: !322, line: 4406, baseType: !506, size: 32, offset: 224)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !499, file: !322, line: 4408, baseType: !112, size: 32, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !499, file: !322, line: 4413, baseType: !129, size: 8, offset: 288)
!512 = !DILocalVariable(name: "msgq", arg: 1, scope: !495, file: !322, line: 4649, type: !498)
!513 = !DILocation(line: 4649, column: 66, scope: !495)
!514 = !DILocation(line: 4651, column: 9, scope: !495)
!515 = !DILocation(line: 4651, column: 15, scope: !495)
!516 = !DILocation(line: 4651, column: 26, scope: !495)
!517 = !DILocation(line: 4651, column: 32, scope: !495)
!518 = !DILocation(line: 4651, column: 24, scope: !495)
!519 = !DILocation(line: 4651, column: 2, scope: !495)
!520 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !322, file: !322, line: 4665, type: !496, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!521 = !DILocalVariable(name: "msgq", arg: 1, scope: !520, file: !322, line: 4665, type: !498)
!522 = !DILocation(line: 4665, column: 66, scope: !520)
!523 = !DILocation(line: 4667, column: 9, scope: !520)
!524 = !DILocation(line: 4667, column: 15, scope: !520)
!525 = !DILocation(line: 4667, column: 2, scope: !520)
!526 = distinct !DISubprogram(name: "z_arm_fault", scope: !181, file: !181, line: 1092, type: !527, scopeLine: 1094, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !339)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !112, !112, !112, !529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "_callee_saved_t", file: !305, line: 37, baseType: !304)
!531 = !DILocalVariable(name: "msp", arg: 1, scope: !526, file: !181, line: 1092, type: !112)
!532 = !DILocation(line: 1092, column: 27, scope: !526)
!533 = !DILocalVariable(name: "psp", arg: 2, scope: !526, file: !181, line: 1092, type: !112)
!534 = !DILocation(line: 1092, column: 41, scope: !526)
!535 = !DILocalVariable(name: "exc_return", arg: 3, scope: !526, file: !181, line: 1092, type: !112)
!536 = !DILocation(line: 1092, column: 55, scope: !526)
!537 = !DILocalVariable(name: "callee_regs", arg: 4, scope: !526, file: !181, line: 1093, type: !529)
!538 = !DILocation(line: 1093, column: 19, scope: !526)
!539 = !DILocalVariable(name: "reason", scope: !526, file: !181, line: 1095, type: !112)
!540 = !DILocation(line: 1095, column: 11, scope: !526)
!541 = !DILocalVariable(name: "fault", scope: !526, file: !181, line: 1096, type: !127)
!542 = !DILocation(line: 1096, column: 6, scope: !526)
!543 = !DILocation(line: 1096, column: 59, scope: !526)
!544 = !DILocation(line: 1096, column: 64, scope: !526)
!545 = !DILocalVariable(name: "recoverable", scope: !526, file: !181, line: 1097, type: !546)
!546 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!547 = !DILocation(line: 1097, column: 8, scope: !526)
!548 = !DILocalVariable(name: "nested_exc", scope: !526, file: !181, line: 1097, type: !546)
!549 = !DILocation(line: 1097, column: 21, scope: !526)
!550 = !DILocalVariable(name: "esf", scope: !526, file: !181, line: 1098, type: !130)
!551 = !DILocation(line: 1098, column: 16, scope: !526)
!552 = !DILocalVariable(name: "esf_copy", scope: !526, file: !181, line: 1103, type: !131)
!553 = !DILocation(line: 1103, column: 15, scope: !526)
!554 = !DILocalVariable(name: "key", arg: 1, scope: !555, file: !556, line: 88, type: !114)
!555 = distinct !DISubprogram(name: "arch_irq_unlock", scope: !556, file: !556, line: 88, type: !557, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !339)
!556 = !DIFile(filename: "include/zephyr/arch/arm/asm_inline_gcc.h", directory: "/home/sri/zephyrproject/zephyr")
!557 = !DISubroutineType(types: !558)
!558 = !{null, !114}
!559 = !DILocation(line: 88, column: 80, scope: !555, inlinedAt: !560)
!560 = distinct !DILocation(line: 1106, column: 2, scope: !526)
!561 = !DILocation(line: 91, column: 6, scope: !562, inlinedAt: !560)
