; ModuleID = '../bc_files/gpio_stm32.bc'
source_filename = "/home/sri/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.gpio_stm32_config = type { %struct.gpio_driver_config, ptr, i32, %struct.stm32_pclken }
%struct.gpio_driver_config = type { i32 }
%struct.stm32_pclken = type { i32, i32 }
%struct.gpio_driver_api = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.device_state = type { i8, i8 }
%struct.gpio_stm32_data = type { %struct.gpio_driver_data, ptr, %struct._slist }
%struct.gpio_driver_data = type { i32 }
%struct._slist = type { ptr, ptr }
%struct.device = type { ptr, ptr, ptr, ptr, ptr }
%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }

!54 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 38)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 39)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 40)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 41)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 42)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 43)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 44)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 45)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 46)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 47)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!94 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !96, line: 766, baseType: !97, size: 32, elements: !98)
!96 = !DIFile(filename: "include/zephyr/drivers/gpio.h", directory: "/home/sri/zephyrproject/zephyr")
!97 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!98 = !{!99, !100, !101}
!99 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!100 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!101 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !96, line: 776, baseType: !97, size: 32, elements: !103)
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!105 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!106 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !108, line: 45, baseType: !14, size: 8, elements: !109)
!108 = !DIFile(filename: "include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/sri/zephyrproject/zephyr")
!109 = !{!110, !111, !112, !113}
!110 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!111 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!112 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!113 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !115, line: 44, baseType: !14, size: 8, elements: !116)
!115 = !DIFile(filename: "include/zephyr/drivers/clock_control.h", directory: "/home/sri/zephyrproject/zephyr")
!116 = !{!117, !118, !119, !120}
!117 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!118 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!119 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!120 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!121 = !{!122, !123, !124, !202, !207, !167, !102, !95, !212, !213, !156, !232, !182, !251, !252, !253}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !96, line: 788, size: 288, elements: !127)
!127 = !{!128, !157, !163, !168, !172, !173, !174, !178, !198}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !126, file: !96, line: 789, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DISubroutineType(types: !131)
!131 = !{!123, !132, !154, !155}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !135, line: 381, size: 160, elements: !136)
!135 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!136 = !{!137, !140, !143, !144, !153}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !134, file: !135, line: 383, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !134, file: !135, line: 385, baseType: !141, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !134, file: !135, line: 387, baseType: !141, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !134, file: !135, line: 389, baseType: !145, size: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !135, line: 354, size: 16, elements: !147)
!147 = !{!148, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !146, file: !135, line: 362, baseType: !149, size: 8)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !150, line: 62, baseType: !14)
!150 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !146, file: !135, line: 367, baseType: !152, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!152 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !134, file: !135, line: 391, baseType: !122, size: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !96, line: 252, baseType: !149)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !96, line: 272, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !150, line: 64, baseType: !97)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !126, file: !96, line: 795, baseType: !158, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DISubroutineType(types: !160)
!160 = !{!123, !132, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !96, line: 244, baseType: !156)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !126, file: !96, line: 797, baseType: !164, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DISubroutineType(types: !166)
!166 = !{!123, !132, !167, !162}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !96, line: 231, baseType: !156)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !126, file: !96, line: 800, baseType: !169, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DISubroutineType(types: !171)
!171 = !{!123, !132, !167}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !126, file: !96, line: 802, baseType: !169, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !126, file: !96, line: 804, baseType: !169, size: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !126, file: !96, line: 806, baseType: !175, size: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DISubroutineType(types: !177)
!177 = !{!123, !132, !154, !95, !102}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !126, file: !96, line: 809, baseType: !179, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!123, !132, !182, !152}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !96, line: 738, size: 96, elements: !184)
!184 = !{!185, !192, !197}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !183, file: !96, line: 742, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !187, line: 39, baseType: !188)
!187 = !DIFile(filename: "include/zephyr/sys/slist.h", directory: "/home/sri/zephyrproject/zephyr")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !187, line: 33, size: 32, elements: !189)
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !187, line: 34, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !183, file: !96, line: 745, baseType: !193, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !96, line: 724, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !132, !182, !167}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !183, file: !96, line: 753, baseType: !167, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !126, file: !96, line: 812, baseType: !199, size: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!156, !132}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !96, line: 688, size: 32, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !204, file: !96, line: 694, baseType: !167, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !96, line: 701, size: 32, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !209, file: !96, line: 707, baseType: !167, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !215, line: 383, baseType: !216)
!215 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 371, size: 352, elements: !217)
!217 = !{!218, !220, !221, !222, !223, !224, !225, !226, !227, !231}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !216, file: !215, line: 373, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !156)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !216, file: !215, line: 374, baseType: !219, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !216, file: !215, line: 375, baseType: !219, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !216, file: !215, line: 376, baseType: !219, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !216, file: !215, line: 377, baseType: !219, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !216, file: !215, line: 378, baseType: !219, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !216, file: !215, line: 379, baseType: !219, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !216, file: !215, line: 380, baseType: !219, size: 32, offset: 224)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !216, file: !215, line: 381, baseType: !228, size: 64, offset: 256)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 64, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 2)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !216, file: !215, line: 382, baseType: !219, size: 32, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !215, line: 397, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 389, size: 2048, elements: !235)
!235 = !{!236, !237, !238, !242, !243, !247}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR1", scope: !234, file: !215, line: 391, baseType: !219, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !234, file: !215, line: 392, baseType: !156, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !234, file: !215, line: 393, baseType: !239, size: 128, offset: 64)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 128, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 4)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR2", scope: !234, file: !215, line: 394, baseType: !219, size: 32, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !234, file: !215, line: 395, baseType: !244, size: 800, offset: 224)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 800, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 25)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "IT_LINE_SR", scope: !234, file: !215, line: 396, baseType: !248, size: 1024, offset: 1024)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 1024, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 32)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !115, line: 56, baseType: !122)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !115, line: 100, size: 224, elements: !256)
!256 = !{!257, !262, !263, !272, !278, !283, !289}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !255, file: !115, line: 101, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !115, line: 76, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DISubroutineType(types: !261)
!261 = !{!123, !132, !252}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !255, file: !115, line: 102, baseType: !258, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !255, file: !115, line: 103, baseType: !264, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !115, line: 83, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DISubroutineType(types: !267)
!267 = !{!123, !132, !252, !268, !122}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !115, line: 72, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !132, !252, !122}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !255, file: !115, line: 104, baseType: !273, size: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !115, line: 79, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DISubroutineType(types: !276)
!276 = !{!123, !132, !252, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !255, file: !115, line: 105, baseType: !279, size: 32, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !115, line: 88, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DISubroutineType(types: !282)
!282 = !{!114, !132, !252}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !255, file: !115, line: 106, baseType: !284, size: 32, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !115, line: 92, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DISubroutineType(types: !287)
!287 = !{!123, !132, !252, !288}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !115, line: 64, baseType: !122)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !255, file: !115, line: 107, baseType: !290, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !115, line: 96, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DISubroutineType(types: !293)
!293 = !{!123, !132, !252, !122}
!294 = !{!0, !295, !297, !315, !317, !319, !321, !323, !325, !327, !329, !331, !333, !335, !337, !339, !341, !343, !345, !359, !361, !363, !365, !367, !369, !371, !373, !375, !377, !379, !7, !381, !383, !397, !399, !401, !403}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "__device_dts_ord_28", scope: !9, file: !2, line: 757, type: !133, isLocal: false, isDefinition: true, align: 32)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_28", scope: !9, file: !2, line: 757, type: !299, isLocal: true, isDefinition: true, align: 32)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !301, line: 92, size: 64, elements: !302)
!301 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!302 = !{!303, !314}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !300, file: !301, line: 94, baseType: !304, size: 32)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !301, line: 59, size: 32, elements: !305)
!305 = !{!306, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !304, file: !301, line: 66, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DISubroutineType(types: !309)
!309 = !{!123}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !304, file: !301, line: 75, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!123, !132}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !300, file: !301, line: 99, baseType: !132, size: 32, offset: 32)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !2, line: 761, type: !3, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "__device_dts_ord_81", scope: !9, file: !2, line: 761, type: !133, isLocal: false, isDefinition: true, align: 32)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_81", scope: !9, file: !2, line: 761, type: !299, isLocal: true, isDefinition: true, align: 32)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !2, line: 765, type: !3, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !9, file: !2, line: 765, type: !133, isLocal: false, isDefinition: true, align: 32)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !9, file: !2, line: 765, type: !299, isLocal: true, isDefinition: true, align: 32)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !2, line: 769, type: !3, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "__device_dts_ord_82", scope: !9, file: !2, line: 769, type: !133, isLocal: false, isDefinition: true, align: 32)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_82", scope: !9, file: !2, line: 769, type: !299, isLocal: true, isDefinition: true, align: 32)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !2, line: 773, type: !3, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "__device_dts_ord_83", scope: !9, file: !2, line: 773, type: !133, isLocal: false, isDefinition: true, align: 32)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_83", scope: !9, file: !2, line: 773, type: !299, isLocal: true, isDefinition: true, align: 32)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !2, line: 777, type: !3, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "__device_dts_ord_84", scope: !9, file: !2, line: 777, type: !133, isLocal: false, isDefinition: true, align: 32)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_84", scope: !9, file: !2, line: 777, type: !299, isLocal: true, isDefinition: true, align: 32)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "gpio_stm32_data_a", scope: !9, file: !2, line: 757, type: !347, isLocal: true, isDefinition: true)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_stm32_data", file: !348, line: 241, size: 128, elements: !349)
!348 = !DIFile(filename: "drivers/gpio/gpio_stm32.h", directory: "/home/sri/zephyrproject/zephyr")
!349 = !{!350, !351, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !347, file: !348, line: 243, baseType: !209, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !347, file: !348, line: 245, baseType: !132, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !347, file: !348, line: 247, baseType: !353, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !187, line: 49, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !187, line: 42, size: 64, elements: !355)
!355 = !{!356, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !354, file: !187, line: 43, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !354, file: !187, line: 44, baseType: !357, size: 32, offset: 32)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_28", scope: !9, file: !2, line: 757, type: !146, isLocal: true, isDefinition: true, align: 8)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "gpio_stm32_data_b", scope: !9, file: !2, line: 761, type: !347, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_81", scope: !9, file: !2, line: 761, type: !146, isLocal: true, isDefinition: true, align: 8)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "gpio_stm32_data_c", scope: !9, file: !2, line: 765, type: !347, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_25", scope: !9, file: !2, line: 765, type: !146, isLocal: true, isDefinition: true, align: 8)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "gpio_stm32_data_d", scope: !9, file: !2, line: 769, type: !347, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_82", scope: !9, file: !2, line: 769, type: !146, isLocal: true, isDefinition: true, align: 8)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "gpio_stm32_data_e", scope: !9, file: !2, line: 773, type: !347, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_83", scope: !9, file: !2, line: 773, type: !146, isLocal: true, isDefinition: true, align: 8)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "gpio_stm32_data_f", scope: !9, file: !2, line: 777, type: !347, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_84", scope: !9, file: !2, line: 777, type: !146, isLocal: true, isDefinition: true, align: 8)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "gpio_stm32_driver", scope: !9, file: !2, line: 655, type: !125, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_b", scope: !9, file: !2, line: 761, type: !385, isLocal: true, isDefinition: true)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_stm32_config", file: !348, line: 228, size: 160, elements: !387)
!387 = !{!388, !389, !390, !391}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !386, file: !348, line: 230, baseType: !204, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !386, file: !348, line: 232, baseType: !277, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !386, file: !348, line: 234, baseType: !123, size: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pclken", scope: !386, file: !348, line: 235, baseType: !392, size: 64, offset: 96)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !393, line: 396, size: 64, elements: !394)
!393 = !DIFile(filename: "include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/sri/zephyrproject/zephyr")
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !392, file: !393, line: 397, baseType: !156, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !392, file: !393, line: 398, baseType: !156, size: 32, offset: 32)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_c", scope: !9, file: !2, line: 765, type: !385, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_d", scope: !9, file: !2, line: 769, type: !385, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_e", scope: !9, file: !2, line: 773, type: !385, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_f", scope: !9, file: !2, line: 777, type: !385, isLocal: true, isDefinition: true)
!405 = !{i32 7, !"Dwarf Version", i32 4}
!406 = !{i32 2, !"Debug Info Version", i32 3}
!407 = !{i32 1, !"wchar_size", i32 4}
!408 = !{i32 1, !"static_rwdata", i32 1}
!409 = !{i32 1, !"enumsize_buildattr", i32 1}
!410 = !{i32 1, !"armlib_unavailable", i32 0}
!411 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!412 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !13, file: !13, line: 223, type: !413, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !528)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !141, !415}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !417, line: 250, size: 896, elements: !418)
!417 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!418 = !{!419, !486, !499, !500, !501, !502, !523}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !416, file: !417, line: 252, baseType: !420, size: 384)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !417, line: 58, size: 384, elements: !421)
!421 = !{!422, !448, !456, !457, !458, !471, !472, !473}
!422 = !DIDerivedType(tag: DW_TAG_member, scope: !420, file: !417, line: 61, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !420, file: !417, line: 61, size: 64, elements: !424)
!424 = !{!425, !441}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !423, file: !417, line: 62, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !427, line: 55, baseType: !428)
!427 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !427, line: 37, size: 64, elements: !429)
!429 = !{!430, !436}
!430 = !DIDerivedType(tag: DW_TAG_member, scope: !428, file: !427, line: 38, baseType: !431, size: 32)
!431 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !428, file: !427, line: 38, size: 32, elements: !432)
!432 = !{!433, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !431, file: !427, line: 39, baseType: !434, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !431, file: !427, line: 40, baseType: !434, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, scope: !428, file: !427, line: 42, baseType: !437, size: 32, offset: 32)
!437 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !428, file: !427, line: 42, size: 32, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !437, file: !427, line: 43, baseType: !434, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !437, file: !427, line: 44, baseType: !434, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !423, file: !417, line: 63, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !443, line: 58, size: 64, elements: !444)
!443 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!444 = !{!445}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !442, file: !443, line: 60, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 64, elements: !229)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !420, file: !417, line: 69, baseType: !449, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !451, line: 243, baseType: !452)
!451 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 241, size: 64, elements: !453)
!453 = !{!454}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !452, file: !451, line: 242, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !427, line: 51, baseType: !428)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !420, file: !417, line: 72, baseType: !149, size: 8, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !420, file: !417, line: 75, baseType: !149, size: 8, offset: 104)
!458 = !DIDerivedType(tag: DW_TAG_member, scope: !420, file: !417, line: 91, baseType: !459, size: 16, offset: 112)
!459 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !420, file: !417, line: 91, size: 16, elements: !460)
!460 = !{!461, !468}
!461 = !DIDerivedType(tag: DW_TAG_member, scope: !459, file: !417, line: 92, baseType: !462, size: 16)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !459, file: !417, line: 92, size: 16, elements: !463)
!463 = !{!464, !467}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !462, file: !417, line: 97, baseType: !465, size: 8)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !150, line: 56, baseType: !466)
!466 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !462, file: !417, line: 98, baseType: !149, size: 8, offset: 8)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !459, file: !417, line: 101, baseType: !469, size: 16)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !150, line: 63, baseType: !470)
!470 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !420, file: !417, line: 108, baseType: !156, size: 32, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !420, file: !417, line: 132, baseType: !122, size: 32, offset: 160)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !420, file: !417, line: 136, baseType: !474, size: 192, offset: 192)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !451, line: 254, size: 192, elements: !475)
!475 = !{!476, !477, !483}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !474, file: !451, line: 255, baseType: !426, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !474, file: !451, line: 256, baseType: !478, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !451, line: 252, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !482}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !474, file: !451, line: 259, baseType: !484, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !150, line: 59, baseType: !485)
!485 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !416, file: !417, line: 255, baseType: !487, size: 288, offset: 384)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !488, line: 25, size: 288, elements: !489)
!488 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !487, file: !488, line: 26, baseType: !156, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !487, file: !488, line: 27, baseType: !156, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !487, file: !488, line: 28, baseType: !156, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !487, file: !488, line: 29, baseType: !156, size: 32, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !487, file: !488, line: 30, baseType: !156, size: 32, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !487, file: !488, line: 31, baseType: !156, size: 32, offset: 160)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !487, file: !488, line: 32, baseType: !156, size: 32, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !487, file: !488, line: 33, baseType: !156, size: 32, offset: 224)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !487, file: !488, line: 34, baseType: !156, size: 32, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !416, file: !417, line: 258, baseType: !122, size: 32, offset: 672)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !416, file: !417, line: 261, baseType: !450, size: 64, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !416, file: !417, line: 302, baseType: !123, size: 32, offset: 768)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !416, file: !417, line: 333, baseType: !503, size: 32, offset: 800)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !505, line: 5291, size: 160, elements: !506)
!505 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!506 = !{!507, !518, !519}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !504, file: !505, line: 5292, baseType: !508, size: 96)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !509, line: 56, size: 96, elements: !510)
!509 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!510 = !{!511, !514, !515}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !508, file: !509, line: 57, baseType: !512, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !509, line: 57, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !508, file: !509, line: 58, baseType: !122, size: 32, offset: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !508, file: !509, line: 59, baseType: !516, size: 32, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !517, line: 46, baseType: !97)
!517 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!518 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !504, file: !505, line: 5293, baseType: !450, size: 64, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !504, file: !505, line: 5294, baseType: !520, offset: 160)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !521, line: 45, elements: !522)
!521 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!522 = !{}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !416, file: !417, line: 355, baseType: !524, size: 64, offset: 832)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !488, line: 60, size: 64, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !524, file: !488, line: 63, baseType: !156, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !524, file: !488, line: 66, baseType: !156, size: 32, offset: 32)
!528 = !{!529, !530}
!529 = !DILocalVariable(name: "object", arg: 1, scope: !412, file: !13, line: 223, type: !141)
!530 = !DILocalVariable(name: "thread", arg: 2, scope: !412, file: !13, line: 224, type: !415)
!531 = !DILocation(line: 223, column: 61, scope: !412)
!532 = !DILocation(line: 224, column: 24, scope: !412)
!533 = !DILocation(line: 226, column: 9, scope: !412)
!534 = !DILocation(line: 227, column: 9, scope: !412)
!535 = !DILocation(line: 228, column: 1, scope: !412)
!536 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !13, file: !13, line: 243, type: !537, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !141}
!539 = !{!540}
!540 = !DILocalVariable(name: "object", arg: 1, scope: !536, file: !13, line: 243, type: !141)
!541 = !DILocation(line: 243, column: 56, scope: !536)
!542 = !DILocation(line: 245, column: 9, scope: !536)
!543 = !DILocation(line: 246, column: 1, scope: !536)
!544 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !13, file: !13, line: 359, type: !545, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !547)
!545 = !DISubroutineType(types: !546)
!546 = !{!122, !12}
!547 = !{!548}
!548 = !DILocalVariable(name: "otype", arg: 1, scope: !544, file: !13, line: 359, type: !12)
!549 = !DILocation(line: 359, column: 58, scope: !544)
!550 = !DILocation(line: 361, column: 9, scope: !544)
!551 = !DILocation(line: 363, column: 2, scope: !544)
!552 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !13, file: !13, line: 366, type: !553, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !555)
!553 = !DISubroutineType(types: !554)
!554 = !{!122, !12, !516}
!555 = !{!556, !557}
!556 = !DILocalVariable(name: "otype", arg: 1, scope: !552, file: !13, line: 366, type: !12)
!557 = !DILocalVariable(name: "size", arg: 2, scope: !552, file: !13, line: 367, type: !516)
!558 = !DILocation(line: 366, column: 63, scope: !552)
!559 = !DILocation(line: 367, column: 13, scope: !552)
!560 = !DILocation(line: 369, column: 9, scope: !552)
!561 = !DILocation(line: 370, column: 9, scope: !552)
!562 = !DILocation(line: 372, column: 2, scope: !552)
!563 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !505, file: !505, line: 656, type: !564, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !570)
!564 = !DISubroutineType(types: !565)
!565 = !{!566, !568}
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !567, line: 46, baseType: !484)
!567 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!570 = !{!571}
!571 = !DILocalVariable(name: "t", arg: 1, scope: !563, file: !505, line: 657, type: !568)
!572 = !DILocation(line: 657, column: 30, scope: !563)
!573 = !DILocation(line: 659, column: 28, scope: !563)
!574 = !DILocation(line: 659, column: 31, scope: !563)
!575 = !DILocation(line: 659, column: 36, scope: !563)
!576 = !DILocation(line: 659, column: 9, scope: !563)
!577 = !DILocation(line: 659, column: 2, scope: !563)
!578 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !505, file: !505, line: 671, type: !564, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !579)
!579 = !{!580}
!580 = !DILocalVariable(name: "t", arg: 1, scope: !578, file: !505, line: 672, type: !568)
!581 = !DILocation(line: 672, column: 30, scope: !578)
!582 = !DILocation(line: 674, column: 30, scope: !578)
!583 = !DILocation(line: 674, column: 33, scope: !578)
!584 = !DILocation(line: 674, column: 38, scope: !578)
!585 = !DILocation(line: 674, column: 9, scope: !578)
!586 = !DILocation(line: 674, column: 2, scope: !578)
!587 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !505, file: !505, line: 1634, type: !588, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !609)
!588 = !DISubroutineType(types: !589)
!589 = !{!566, !590}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !505, line: 1439, size: 448, elements: !593)
!593 = !{!594, !595, !596, !601, !602, !607, !608}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !592, file: !505, line: 1445, baseType: !474, size: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !592, file: !505, line: 1448, baseType: !450, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !592, file: !505, line: 1451, baseType: !597, size: 32, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !600}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !592, file: !505, line: 1454, baseType: !597, size: 32, offset: 288)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !592, file: !505, line: 1457, baseType: !603, size: 64, offset: 320)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !567, line: 67, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 65, size: 64, elements: !605)
!605 = !{!606}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !604, file: !567, line: 66, baseType: !566, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !592, file: !505, line: 1460, baseType: !156, size: 32, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !592, file: !505, line: 1463, baseType: !122, size: 32, offset: 416)
!609 = !{!610}
!610 = !DILocalVariable(name: "timer", arg: 1, scope: !587, file: !505, line: 1635, type: !590)
!611 = !DILocation(line: 1635, column: 34, scope: !587)
!612 = !DILocation(line: 1637, column: 28, scope: !587)
!613 = !DILocation(line: 1637, column: 35, scope: !587)
!614 = !DILocation(line: 1637, column: 9, scope: !587)
!615 = !DILocation(line: 1637, column: 2, scope: !587)
!616 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !505, file: !505, line: 1649, type: !588, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !617)
!617 = !{!618}
!618 = !DILocalVariable(name: "timer", arg: 1, scope: !616, file: !505, line: 1650, type: !590)
!619 = !DILocation(line: 1650, column: 34, scope: !616)
!620 = !DILocation(line: 1652, column: 30, scope: !616)
!621 = !DILocation(line: 1652, column: 37, scope: !616)
!622 = !DILocation(line: 1652, column: 9, scope: !616)
!623 = !DILocation(line: 1652, column: 2, scope: !616)
!624 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !505, file: !505, line: 1689, type: !625, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !627)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !600, !122}
!627 = !{!628, !629}
!628 = !DILocalVariable(name: "timer", arg: 1, scope: !624, file: !505, line: 1689, type: !600)
!629 = !DILocalVariable(name: "user_data", arg: 2, scope: !624, file: !505, line: 1690, type: !122)
!630 = !DILocation(line: 1689, column: 65, scope: !624)
!631 = !DILocation(line: 1690, column: 19, scope: !624)
!632 = !DILocation(line: 1692, column: 21, scope: !624)
!633 = !DILocation(line: 1692, column: 2, scope: !624)
!634 = !DILocation(line: 1692, column: 9, scope: !624)
!635 = !DILocation(line: 1692, column: 19, scope: !624)
!636 = !DILocation(line: 1693, column: 1, scope: !624)
!637 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !505, file: !505, line: 1704, type: !638, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !640)
!638 = !DISubroutineType(types: !639)
!639 = !{!122, !590}
!640 = !{!641}
!641 = !DILocalVariable(name: "timer", arg: 1, scope: !637, file: !505, line: 1704, type: !590)
!642 = !DILocation(line: 1704, column: 72, scope: !637)
!643 = !DILocation(line: 1706, column: 9, scope: !637)
!644 = !DILocation(line: 1706, column: 16, scope: !637)
!645 = !DILocation(line: 1706, column: 2, scope: !637)
!646 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !505, file: !505, line: 2071, type: !647, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !667)
!647 = !DISubroutineType(types: !648)
!648 = !{!123, !649}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !505, line: 1830, size: 128, elements: !651)
!651 = !{!652, !665, !666}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !650, file: !505, line: 1831, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !654, line: 60, baseType: !655)
!654 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !654, line: 53, size: 64, elements: !656)
!656 = !{!657, !664}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !655, file: !654, line: 54, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !654, line: 50, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !654, line: 44, size: 32, elements: !661)
!661 = !{!662}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !660, file: !654, line: 45, baseType: !663, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !654, line: 40, baseType: !156)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !655, file: !654, line: 55, baseType: !658, size: 32, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !650, file: !505, line: 1832, baseType: !520, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !650, file: !505, line: 1833, baseType: !450, size: 64, offset: 64)
!667 = !{!668}
!668 = !DILocalVariable(name: "queue", arg: 1, scope: !646, file: !505, line: 2071, type: !649)
!669 = !DILocation(line: 2071, column: 59, scope: !646)
!670 = !DILocation(line: 2073, column: 35, scope: !646)
!671 = !DILocation(line: 2073, column: 42, scope: !646)
!672 = !DILocation(line: 2073, column: 14, scope: !646)
!673 = !DILocation(line: 2073, column: 9, scope: !646)
!674 = !DILocation(line: 2073, column: 2, scope: !646)
!675 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !505, file: !505, line: 3209, type: !676, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !684)
!676 = !DISubroutineType(types: !677)
!677 = !{!97, !678}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !505, line: 3092, size: 128, elements: !680)
!680 = !{!681, !682, !683}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !679, file: !505, line: 3093, baseType: !450, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !679, file: !505, line: 3094, baseType: !97, size: 32, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !679, file: !505, line: 3095, baseType: !97, size: 32, offset: 96)
!684 = !{!685}
!685 = !DILocalVariable(name: "sem", arg: 1, scope: !675, file: !505, line: 3209, type: !678)
!686 = !DILocation(line: 3209, column: 65, scope: !675)
!687 = !DILocation(line: 3211, column: 9, scope: !675)
!688 = !DILocation(line: 3211, column: 14, scope: !675)
!689 = !DILocation(line: 3211, column: 2, scope: !675)
!690 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !505, file: !505, line: 4649, type: !691, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !706)
!691 = !DISubroutineType(types: !692)
!692 = !{!156, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !505, line: 4390, size: 320, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !694, file: !505, line: 4392, baseType: !450, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !694, file: !505, line: 4394, baseType: !520, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !694, file: !505, line: 4396, baseType: !516, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !694, file: !505, line: 4398, baseType: !156, size: 32, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !694, file: !505, line: 4400, baseType: !251, size: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !694, file: !505, line: 4402, baseType: !251, size: 32, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !694, file: !505, line: 4404, baseType: !251, size: 32, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !694, file: !505, line: 4406, baseType: !251, size: 32, offset: 224)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !694, file: !505, line: 4408, baseType: !156, size: 32, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !694, file: !505, line: 4413, baseType: !149, size: 8, offset: 288)
!706 = !{!707}
!707 = !DILocalVariable(name: "msgq", arg: 1, scope: !690, file: !505, line: 4649, type: !693)
!708 = !DILocation(line: 4649, column: 66, scope: !690)
!709 = !DILocation(line: 4651, column: 9, scope: !690)
!710 = !DILocation(line: 4651, column: 15, scope: !690)
!711 = !DILocation(line: 4651, column: 26, scope: !690)
!712 = !DILocation(line: 4651, column: 32, scope: !690)
!713 = !DILocation(line: 4651, column: 24, scope: !690)
!714 = !DILocation(line: 4651, column: 2, scope: !690)
!715 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !505, file: !505, line: 4665, type: !691, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !716)
!716 = !{!717}
!717 = !DILocalVariable(name: "msgq", arg: 1, scope: !715, file: !505, line: 4665, type: !693)
!718 = !DILocation(line: 4665, column: 66, scope: !715)
!719 = !DILocation(line: 4667, column: 9, scope: !715)
!720 = !DILocation(line: 4667, column: 15, scope: !715)
!721 = !DILocation(line: 4667, column: 2, scope: !715)
!722 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !135, file: !135, line: 744, type: !723, scopeLine: 745, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !725)
!723 = !DISubroutineType(types: !724)
!724 = !{!152, !132}
!725 = !{!726}
!726 = !DILocalVariable(name: "dev", arg: 1, scope: !722, file: !135, line: 744, type: !132)
!727 = !DILocation(line: 744, column: 65, scope: !722)
!728 = !DILocation(line: 746, column: 27, scope: !722)
!729 = !DILocation(line: 746, column: 9, scope: !722)
!730 = !DILocation(line: 746, column: 2, scope: !722)
!731 = distinct !DISubprogram(name: "z_impl_gpio_pin_interrupt_configure", scope: !96, file: !96, line: 862, type: !130, scopeLine: 865, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !732)
!732 = !{!733, !734, !735, !736, !737, !739, !741, !742}
!733 = !DILocalVariable(name: "port", arg: 1, scope: !731, file: !96, line: 862, type: !132)
!734 = !DILocalVariable(name: "pin", arg: 2, scope: !731, file: !96, line: 863, type: !154)
!735 = !DILocalVariable(name: "flags", arg: 3, scope: !731, file: !96, line: 864, type: !155)
!736 = !DILocalVariable(name: "api", scope: !731, file: !96, line: 866, type: !124)
!737 = !DILocalVariable(name: "cfg", scope: !731, file: !96, line: 868, type: !738)
!738 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!739 = !DILocalVariable(name: "data", scope: !731, file: !96, line: 870, type: !740)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!741 = !DILocalVariable(name: "trig", scope: !731, file: !96, line: 872, type: !102)
!742 = !DILocalVariable(name: "mode", scope: !731, file: !96, line: 873, type: !95)
!743 = !DILocation(line: 862, column: 76, scope: !731)
!744 = !DILocation(line: 863, column: 24, scope: !731)
!745 = !DILocation(line: 864, column: 26, scope: !731)
!746 = !DILocation(line: 866, column: 2, scope: !731)
!747 = !DILocation(line: 866, column: 32, scope: !731)
!748 = !DILocation(line: 867, column: 35, scope: !731)
!749 = !DILocation(line: 867, column: 41, scope: !731)
!750 = !DILocation(line: 868, column: 2, scope: !731)
!751 = !DILocation(line: 868, column: 69, scope: !731)
!752 = !DILocation(line: 869, column: 38, scope: !731)
!753 = !DILocation(line: 869, column: 44, scope: !731)
!754 = !DILocation(line: 870, column: 2, scope: !731)
!755 = !DILocation(line: 870, column: 39, scope: !731)
!756 = !DILocation(line: 871, column: 36, scope: !731)
!757 = !DILocation(line: 871, column: 42, scope: !731)
!758 = !DILocation(line: 872, column: 2, scope: !731)
!759 = !DILocation(line: 872, column: 21, scope: !731)
