; ModuleID = '../bc_files/gpio_stm32.bc'
source_filename = "/home/sri/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.gpio_stm32_config = type { %struct.gpio_driver_config, ptr, i32, %struct.stm32_pclken }
%struct.gpio_driver_config = type { i32 }
%struct.stm32_pclken = type { i32, i32 }
%struct.gpio_driver_api = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.device_state = type { i8, i8 }
%struct.gpio_stm32_data = type { %struct.gpio_driver_data, ptr, %struct._slist }
%struct.gpio_driver_data = type { i32 }
%struct._slist = type { ptr, ptr }
%struct.device = type { ptr, ptr, ptr, ptr, ptr }
%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }

!54 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 38)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 39)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 40)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 41)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 42)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 43)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 44)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 45)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 46)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 47)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!94 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !96, line: 766, baseType: !97, size: 32, elements: !98)
!96 = !DIFile(filename: "include/zephyr/drivers/gpio.h", directory: "/home/sri/zephyrproject/zephyr")
!97 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!98 = !{!99, !100, !101}
!99 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!100 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!101 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !96, line: 776, baseType: !97, size: 32, elements: !103)
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!105 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!106 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !108, line: 45, baseType: !14, size: 8, elements: !109)
!108 = !DIFile(filename: "include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/sri/zephyrproject/zephyr")
!109 = !{!110, !111, !112, !113}
!110 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!111 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!112 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!113 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !115, line: 44, baseType: !14, size: 8, elements: !116)
!115 = !DIFile(filename: "include/zephyr/drivers/clock_control.h", directory: "/home/sri/zephyrproject/zephyr")
!116 = !{!117, !118, !119, !120}
!117 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!118 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!119 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!120 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!121 = !{!122, !123, !124, !202, !207, !167, !102, !95, !212, !213, !156, !232, !182, !251, !252, !253}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !96, line: 788, size: 288, elements: !127)
!127 = !{!128, !157, !163, !168, !172, !173, !174, !178, !198}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !126, file: !96, line: 789, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DISubroutineType(types: !131)
!131 = !{!123, !132, !154, !155}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !135, line: 381, size: 160, elements: !136)
!135 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!136 = !{!137, !140, !143, !144, !153}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !134, file: !135, line: 383, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !134, file: !135, line: 385, baseType: !141, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !134, file: !135, line: 387, baseType: !141, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !134, file: !135, line: 389, baseType: !145, size: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !135, line: 354, size: 16, elements: !147)
!147 = !{!148, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !146, file: !135, line: 362, baseType: !149, size: 8)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !150, line: 62, baseType: !14)
!150 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !146, file: !135, line: 367, baseType: !152, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!152 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !134, file: !135, line: 391, baseType: !122, size: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !96, line: 252, baseType: !149)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !96, line: 272, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !150, line: 64, baseType: !97)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !126, file: !96, line: 795, baseType: !158, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DISubroutineType(types: !160)
!160 = !{!123, !132, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !96, line: 244, baseType: !156)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !126, file: !96, line: 797, baseType: !164, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DISubroutineType(types: !166)
!166 = !{!123, !132, !167, !162}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !96, line: 231, baseType: !156)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !126, file: !96, line: 800, baseType: !169, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DISubroutineType(types: !171)
!171 = !{!123, !132, !167}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !126, file: !96, line: 802, baseType: !169, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !126, file: !96, line: 804, baseType: !169, size: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !126, file: !96, line: 806, baseType: !175, size: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DISubroutineType(types: !177)
!177 = !{!123, !132, !154, !95, !102}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !126, file: !96, line: 809, baseType: !179, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!123, !132, !182, !152}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !96, line: 738, size: 96, elements: !184)
!184 = !{!185, !192, !197}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !183, file: !96, line: 742, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !187, line: 39, baseType: !188)
!187 = !DIFile(filename: "include/zephyr/sys/slist.h", directory: "/home/sri/zephyrproject/zephyr")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !187, line: 33, size: 32, elements: !189)
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !187, line: 34, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !183, file: !96, line: 745, baseType: !193, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !96, line: 724, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !132, !182, !167}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !183, file: !96, line: 753, baseType: !167, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !126, file: !96, line: 812, baseType: !199, size: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!156, !132}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !96, line: 688, size: 32, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !204, file: !96, line: 694, baseType: !167, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !96, line: 701, size: 32, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !209, file: !96, line: 707, baseType: !167, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !215, line: 383, baseType: !216)
!215 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 371, size: 352, elements: !217)
!217 = !{!218, !220, !221, !222, !223, !224, !225, !226, !227, !231}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !216, file: !215, line: 373, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !156)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !216, file: !215, line: 374, baseType: !219, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !216, file: !215, line: 375, baseType: !219, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !216, file: !215, line: 376, baseType: !219, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !216, file: !215, line: 377, baseType: !219, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !216, file: !215, line: 378, baseType: !219, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !216, file: !215, line: 379, baseType: !219, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !216, file: !215, line: 380, baseType: !219, size: 32, offset: 224)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !216, file: !215, line: 381, baseType: !228, size: 64, offset: 256)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 64, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 2)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !216, file: !215, line: 382, baseType: !219, size: 32, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !215, line: 397, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 389, size: 2048, elements: !235)
!235 = !{!236, !237, !238, !242, !243, !247}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR1", scope: !234, file: !215, line: 391, baseType: !219, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !234, file: !215, line: 392, baseType: !156, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !234, file: !215, line: 393, baseType: !239, size: 128, offset: 64)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 128, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 4)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR2", scope: !234, file: !215, line: 394, baseType: !219, size: 32, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !234, file: !215, line: 395, baseType: !244, size: 800, offset: 224)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 800, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 25)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "IT_LINE_SR", scope: !234, file: !215, line: 396, baseType: !248, size: 1024, offset: 1024)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 1024, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 32)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !115, line: 56, baseType: !122)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !115, line: 100, size: 224, elements: !256)
!256 = !{!257, !262, !263, !272, !278, !283, !289}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !255, file: !115, line: 101, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !115, line: 76, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DISubroutineType(types: !261)
!261 = !{!123, !132, !252}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !255, file: !115, line: 102, baseType: !258, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !255, file: !115, line: 103, baseType: !264, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !115, line: 83, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DISubroutineType(types: !267)
!267 = !{!123, !132, !252, !268, !122}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !115, line: 72, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !132, !252, !122}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !255, file: !115, line: 104, baseType: !273, size: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !115, line: 79, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DISubroutineType(types: !276)
!276 = !{!123, !132, !252, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !255, file: !115, line: 105, baseType: !279, size: 32, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !115, line: 88, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DISubroutineType(types: !282)
!282 = !{!114, !132, !252}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !255, file: !115, line: 106, baseType: !284, size: 32, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !115, line: 92, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DISubroutineType(types: !287)
!287 = !{!123, !132, !252, !288}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !115, line: 64, baseType: !122)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !255, file: !115, line: 107, baseType: !290, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !115, line: 96, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DISubroutineType(types: !293)
!293 = !{!123, !132, !252, !122}
!294 = !{!0, !295, !297, !315, !317, !319, !321, !323, !325, !327, !329, !331, !333, !335, !337, !339, !341, !343, !345, !359, !361, !363, !365, !367, !369, !371, !373, !375, !377, !379, !7, !381, !383, !397, !399, !401, !403}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "__device_dts_ord_28", scope: !9, file: !2, line: 757, type: !133, isLocal: false, isDefinition: true, align: 32)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_28", scope: !9, file: !2, line: 757, type: !299, isLocal: true, isDefinition: true, align: 32)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !301, line: 92, size: 64, elements: !302)
!301 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!302 = !{!303, !314}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !300, file: !301, line: 94, baseType: !304, size: 32)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !301, line: 59, size: 32, elements: !305)
!305 = !{!306, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !304, file: !301, line: 66, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DISubroutineType(types: !309)
!309 = !{!123}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !304, file: !301, line: 75, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!123, !132}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !300, file: !301, line: 99, baseType: !132, size: 32, offset: 32)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !2, line: 761, type: !3, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "__device_dts_ord_81", scope: !9, file: !2, line: 761, type: !133, isLocal: false, isDefinition: true, align: 32)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_81", scope: !9, file: !2, line: 761, type: !299, isLocal: true, isDefinition: true, align: 32)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !2, line: 765, type: !3, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !9, file: !2, line: 765, type: !133, isLocal: false, isDefinition: true, align: 32)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !9, file: !2, line: 765, type: !299, isLocal: true, isDefinition: true, align: 32)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !2, line: 769, type: !3, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "__device_dts_ord_82", scope: !9, file: !2, line: 769, type: !133, isLocal: false, isDefinition: true, align: 32)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_82", scope: !9, file: !2, line: 769, type: !299, isLocal: true, isDefinition: true, align: 32)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !2, line: 773, type: !3, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "__device_dts_ord_83", scope: !9, file: !2, line: 773, type: !133, isLocal: false, isDefinition: true, align: 32)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_83", scope: !9, file: !2, line: 773, type: !299, isLocal: true, isDefinition: true, align: 32)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !2, line: 777, type: !3, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "__device_dts_ord_84", scope: !9, file: !2, line: 777, type: !133, isLocal: false, isDefinition: true, align: 32)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_84", scope: !9, file: !2, line: 777, type: !299, isLocal: true, isDefinition: true, align: 32)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "gpio_stm32_data_a", scope: !9, file: !2, line: 757, type: !347, isLocal: true, isDefinition: true)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_stm32_data", file: !348, line: 241, size: 128, elements: !349)
!348 = !DIFile(filename: "drivers/gpio/gpio_stm32.h", directory: "/home/sri/zephyrproject/zephyr")
!349 = !{!350, !351, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !347, file: !348, line: 243, baseType: !209, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !347, file: !348, line: 245, baseType: !132, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !347, file: !348, line: 247, baseType: !353, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !187, line: 49, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !187, line: 42, size: 64, elements: !355)
!355 = !{!356, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !354, file: !187, line: 43, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !354, file: !187, line: 44, baseType: !357, size: 32, offset: 32)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_28", scope: !9, file: !2, line: 757, type: !146, isLocal: true, isDefinition: true, align: 8)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "gpio_stm32_data_b", scope: !9, file: !2, line: 761, type: !347, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_81", scope: !9, file: !2, line: 761, type: !146, isLocal: true, isDefinition: true, align: 8)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "gpio_stm32_data_c", scope: !9, file: !2, line: 765, type: !347, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_25", scope: !9, file: !2, line: 765, type: !146, isLocal: true, isDefinition: true, align: 8)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "gpio_stm32_data_d", scope: !9, file: !2, line: 769, type: !347, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_82", scope: !9, file: !2, line: 769, type: !146, isLocal: true, isDefinition: true, align: 8)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "gpio_stm32_data_e", scope: !9, file: !2, line: 773, type: !347, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_83", scope: !9, file: !2, line: 773, type: !146, isLocal: true, isDefinition: true, align: 8)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "gpio_stm32_data_f", scope: !9, file: !2, line: 777, type: !347, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_84", scope: !9, file: !2, line: 777, type: !146, isLocal: true, isDefinition: true, align: 8)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "gpio_stm32_driver", scope: !9, file: !2, line: 655, type: !125, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_b", scope: !9, file: !2, line: 761, type: !385, isLocal: true, isDefinition: true)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_stm32_config", file: !348, line: 228, size: 160, elements: !387)
!387 = !{!388, !389, !390, !391}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !386, file: !348, line: 230, baseType: !204, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !386, file: !348, line: 232, baseType: !277, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !386, file: !348, line: 234, baseType: !123, size: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pclken", scope: !386, file: !348, line: 235, baseType: !392, size: 64, offset: 96)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !393, line: 396, size: 64, elements: !394)
!393 = !DIFile(filename: "include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/sri/zephyrproject/zephyr")
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !392, file: !393, line: 397, baseType: !156, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !392, file: !393, line: 398, baseType: !156, size: 32, offset: 32)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_c", scope: !9, file: !2, line: 765, type: !385, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_d", scope: !9, file: !2, line: 769, type: !385, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_e", scope: !9, file: !2, line: 773, type: !385, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_f", scope: !9, file: !2, line: 777, type: !385, isLocal: true, isDefinition: true)
!405 = !{i32 7, !"Dwarf Version", i32 4}
!406 = !{i32 2, !"Debug Info Version", i32 3}
!407 = !{i32 1, !"wchar_size", i32 4}
!408 = !{i32 1, !"static_rwdata", i32 1}
!409 = !{i32 1, !"enumsize_buildattr", i32 1}
!410 = !{i32 1, !"armlib_unavailable", i32 0}
!411 = !{i32 8, !"PIC Level", i32 2}
!412 = !{i32 7, !"PIE Level", i32 2}
!413 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!414 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !13, file: !13, line: 223, type: !415, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !141, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !419, line: 250, size: 896, elements: !420)
!419 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!420 = !{!421, !488, !501, !502, !503, !504, !525}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !418, file: !419, line: 252, baseType: !422, size: 384)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !419, line: 58, size: 384, elements: !423)
!423 = !{!424, !450, !458, !459, !460, !473, !474, !475}
!424 = !DIDerivedType(tag: DW_TAG_member, scope: !422, file: !419, line: 61, baseType: !425, size: 64)
!425 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !422, file: !419, line: 61, size: 64, elements: !426)
!426 = !{!427, !443}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !425, file: !419, line: 62, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !429, line: 55, baseType: !430)
!429 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !429, line: 37, size: 64, elements: !431)
!431 = !{!432, !438}
!432 = !DIDerivedType(tag: DW_TAG_member, scope: !430, file: !429, line: 38, baseType: !433, size: 32)
!433 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !430, file: !429, line: 38, size: 32, elements: !434)
!434 = !{!435, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !433, file: !429, line: 39, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !433, file: !429, line: 40, baseType: !436, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, scope: !430, file: !429, line: 42, baseType: !439, size: 32, offset: 32)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !430, file: !429, line: 42, size: 32, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !439, file: !429, line: 43, baseType: !436, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !439, file: !429, line: 44, baseType: !436, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !425, file: !419, line: 63, baseType: !444, size: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !445, line: 58, size: 64, elements: !446)
!445 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !444, file: !445, line: 60, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 64, elements: !229)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !422, file: !419, line: 69, baseType: !451, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !453, line: 243, baseType: !454)
!453 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 241, size: 64, elements: !455)
!455 = !{!456}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !454, file: !453, line: 242, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !429, line: 51, baseType: !430)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !422, file: !419, line: 72, baseType: !149, size: 8, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !422, file: !419, line: 75, baseType: !149, size: 8, offset: 104)
!460 = !DIDerivedType(tag: DW_TAG_member, scope: !422, file: !419, line: 91, baseType: !461, size: 16, offset: 112)
!461 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !422, file: !419, line: 91, size: 16, elements: !462)
!462 = !{!463, !470}
!463 = !DIDerivedType(tag: DW_TAG_member, scope: !461, file: !419, line: 92, baseType: !464, size: 16)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !461, file: !419, line: 92, size: 16, elements: !465)
!465 = !{!466, !469}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !464, file: !419, line: 97, baseType: !467, size: 8)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !150, line: 56, baseType: !468)
!468 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !464, file: !419, line: 98, baseType: !149, size: 8, offset: 8)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !461, file: !419, line: 101, baseType: !471, size: 16)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !150, line: 63, baseType: !472)
!472 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !422, file: !419, line: 108, baseType: !156, size: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !422, file: !419, line: 132, baseType: !122, size: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !422, file: !419, line: 136, baseType: !476, size: 192, offset: 192)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !453, line: 254, size: 192, elements: !477)
!477 = !{!478, !479, !485}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !476, file: !453, line: 255, baseType: !428, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !476, file: !453, line: 256, baseType: !480, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !453, line: 252, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !476, file: !453, line: 259, baseType: !486, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !150, line: 59, baseType: !487)
!487 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !418, file: !419, line: 255, baseType: !489, size: 288, offset: 384)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !490, line: 25, size: 288, elements: !491)
!490 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !489, file: !490, line: 26, baseType: !156, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !489, file: !490, line: 27, baseType: !156, size: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !489, file: !490, line: 28, baseType: !156, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !489, file: !490, line: 29, baseType: !156, size: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !489, file: !490, line: 30, baseType: !156, size: 32, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !489, file: !490, line: 31, baseType: !156, size: 32, offset: 160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !489, file: !490, line: 32, baseType: !156, size: 32, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !489, file: !490, line: 33, baseType: !156, size: 32, offset: 224)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !489, file: !490, line: 34, baseType: !156, size: 32, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !418, file: !419, line: 258, baseType: !122, size: 32, offset: 672)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !418, file: !419, line: 261, baseType: !452, size: 64, offset: 704)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !418, file: !419, line: 302, baseType: !123, size: 32, offset: 768)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !418, file: !419, line: 333, baseType: !505, size: 32, offset: 800)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !507, line: 5291, size: 160, elements: !508)
!507 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!508 = !{!509, !520, !521}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !506, file: !507, line: 5292, baseType: !510, size: 96)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !511, line: 56, size: 96, elements: !512)
!511 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!512 = !{!513, !516, !517}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !510, file: !511, line: 57, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !511, line: 57, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !510, file: !511, line: 58, baseType: !122, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !510, file: !511, line: 59, baseType: !518, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !519, line: 46, baseType: !97)
!519 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!520 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !506, file: !507, line: 5293, baseType: !452, size: 64, offset: 96)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !506, file: !507, line: 5294, baseType: !522, offset: 160)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !523, line: 45, elements: !524)
!523 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!524 = !{}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !418, file: !419, line: 355, baseType: !526, size: 64, offset: 832)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !490, line: 60, size: 64, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !526, file: !490, line: 63, baseType: !156, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !526, file: !490, line: 66, baseType: !156, size: 32, offset: 32)
!530 = !DILocalVariable(name: "object", arg: 1, scope: !414, file: !13, line: 223, type: !141)
!531 = !DILocation(line: 223, column: 61, scope: !414)
!532 = !DILocalVariable(name: "thread", arg: 2, scope: !414, file: !13, line: 224, type: !417)
!533 = !DILocation(line: 224, column: 24, scope: !414)
!534 = !DILocation(line: 226, column: 9, scope: !414)
!535 = !DILocation(line: 227, column: 9, scope: !414)
!536 = !DILocation(line: 228, column: 1, scope: !414)
!537 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !13, file: !13, line: 243, type: !538, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !141}
!540 = !DILocalVariable(name: "object", arg: 1, scope: !537, file: !13, line: 243, type: !141)
!541 = !DILocation(line: 243, column: 56, scope: !537)
!542 = !DILocation(line: 245, column: 9, scope: !537)
!543 = !DILocation(line: 246, column: 1, scope: !537)
!544 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !13, file: !13, line: 359, type: !545, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!545 = !DISubroutineType(types: !546)
!546 = !{!122, !12}
!547 = !DILocalVariable(name: "otype", arg: 1, scope: !544, file: !13, line: 359, type: !12)
!548 = !DILocation(line: 359, column: 58, scope: !544)
!549 = !DILocation(line: 361, column: 9, scope: !544)
!550 = !DILocation(line: 363, column: 2, scope: !544)
!551 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !13, file: !13, line: 366, type: !552, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!552 = !DISubroutineType(types: !553)
!553 = !{!122, !12, !518}
!554 = !DILocalVariable(name: "otype", arg: 1, scope: !551, file: !13, line: 366, type: !12)
!555 = !DILocation(line: 366, column: 63, scope: !551)
!556 = !DILocalVariable(name: "size", arg: 2, scope: !551, file: !13, line: 367, type: !518)
!557 = !DILocation(line: 367, column: 13, scope: !551)
!558 = !DILocation(line: 369, column: 9, scope: !551)
!559 = !DILocation(line: 370, column: 9, scope: !551)
!560 = !DILocation(line: 372, column: 2, scope: !551)
!561 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !507, file: !507, line: 656, type: !562, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!562 = !DISubroutineType(types: !563)
!563 = !{!564, !566}
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !565, line: 46, baseType: !486)
!565 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!568 = !DILocalVariable(name: "t", arg: 1, scope: !561, file: !507, line: 657, type: !566)
!569 = !DILocation(line: 657, column: 30, scope: !561)
!570 = !DILocation(line: 659, column: 28, scope: !561)
!571 = !DILocation(line: 659, column: 31, scope: !561)
!572 = !DILocation(line: 659, column: 36, scope: !561)
!573 = !DILocation(line: 659, column: 9, scope: !561)
!574 = !DILocation(line: 659, column: 2, scope: !561)
!575 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !507, file: !507, line: 671, type: !562, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!576 = !DILocalVariable(name: "t", arg: 1, scope: !575, file: !507, line: 672, type: !566)
!577 = !DILocation(line: 672, column: 30, scope: !575)
!578 = !DILocation(line: 674, column: 30, scope: !575)
!579 = !DILocation(line: 674, column: 33, scope: !575)
!580 = !DILocation(line: 674, column: 38, scope: !575)
!581 = !DILocation(line: 674, column: 9, scope: !575)
!582 = !DILocation(line: 674, column: 2, scope: !575)
!583 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !507, file: !507, line: 1634, type: !584, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!584 = !DISubroutineType(types: !585)
!585 = !{!564, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !507, line: 1439, size: 448, elements: !589)
!589 = !{!590, !591, !592, !597, !598, !603, !604}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !588, file: !507, line: 1445, baseType: !476, size: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !588, file: !507, line: 1448, baseType: !452, size: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !588, file: !507, line: 1451, baseType: !593, size: 32, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !596}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !588, file: !507, line: 1454, baseType: !593, size: 32, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !588, file: !507, line: 1457, baseType: !599, size: 64, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !565, line: 67, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 65, size: 64, elements: !601)
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !600, file: !565, line: 66, baseType: !564, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !588, file: !507, line: 1460, baseType: !156, size: 32, offset: 384)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !588, file: !507, line: 1463, baseType: !122, size: 32, offset: 416)
!605 = !DILocalVariable(name: "timer", arg: 1, scope: !583, file: !507, line: 1635, type: !586)
!606 = !DILocation(line: 1635, column: 34, scope: !583)
!607 = !DILocation(line: 1637, column: 28, scope: !583)
!608 = !DILocation(line: 1637, column: 35, scope: !583)
!609 = !DILocation(line: 1637, column: 9, scope: !583)
!610 = !DILocation(line: 1637, column: 2, scope: !583)
!611 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !507, file: !507, line: 1649, type: !584, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!612 = !DILocalVariable(name: "timer", arg: 1, scope: !611, file: !507, line: 1650, type: !586)
!613 = !DILocation(line: 1650, column: 34, scope: !611)
!614 = !DILocation(line: 1652, column: 30, scope: !611)
!615 = !DILocation(line: 1652, column: 37, scope: !611)
!616 = !DILocation(line: 1652, column: 9, scope: !611)
!617 = !DILocation(line: 1652, column: 2, scope: !611)
!618 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !507, file: !507, line: 1689, type: !619, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !596, !122}
!621 = !DILocalVariable(name: "timer", arg: 1, scope: !618, file: !507, line: 1689, type: !596)
!622 = !DILocation(line: 1689, column: 65, scope: !618)
!623 = !DILocalVariable(name: "user_data", arg: 2, scope: !618, file: !507, line: 1690, type: !122)
!624 = !DILocation(line: 1690, column: 19, scope: !618)
!625 = !DILocation(line: 1692, column: 21, scope: !618)
!626 = !DILocation(line: 1692, column: 2, scope: !618)
!627 = !DILocation(line: 1692, column: 9, scope: !618)
!628 = !DILocation(line: 1692, column: 19, scope: !618)
!629 = !DILocation(line: 1693, column: 1, scope: !618)
!630 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !507, file: !507, line: 1704, type: !631, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!631 = !DISubroutineType(types: !632)
!632 = !{!122, !586}
!633 = !DILocalVariable(name: "timer", arg: 1, scope: !630, file: !507, line: 1704, type: !586)
!634 = !DILocation(line: 1704, column: 72, scope: !630)
!635 = !DILocation(line: 1706, column: 9, scope: !630)
!636 = !DILocation(line: 1706, column: 16, scope: !630)
!637 = !DILocation(line: 1706, column: 2, scope: !630)
!638 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !507, file: !507, line: 2071, type: !639, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!639 = !DISubroutineType(types: !640)
!640 = !{!123, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !507, line: 1830, size: 128, elements: !643)
!643 = !{!644, !657, !658}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !642, file: !507, line: 1831, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !646, line: 60, baseType: !647)
!646 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !646, line: 53, size: 64, elements: !648)
!648 = !{!649, !656}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !647, file: !646, line: 54, baseType: !650, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !646, line: 50, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !646, line: 44, size: 32, elements: !653)
!653 = !{!654}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !652, file: !646, line: 45, baseType: !655, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !646, line: 40, baseType: !156)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !647, file: !646, line: 55, baseType: !650, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !642, file: !507, line: 1832, baseType: !522, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !642, file: !507, line: 1833, baseType: !452, size: 64, offset: 64)
!659 = !DILocalVariable(name: "queue", arg: 1, scope: !638, file: !507, line: 2071, type: !641)
!660 = !DILocation(line: 2071, column: 59, scope: !638)
!661 = !DILocation(line: 2073, column: 35, scope: !638)
!662 = !DILocation(line: 2073, column: 42, scope: !638)
!663 = !DILocation(line: 2073, column: 14, scope: !638)
!664 = !DILocation(line: 2073, column: 9, scope: !638)
!665 = !DILocation(line: 2073, column: 2, scope: !638)
!666 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !507, file: !507, line: 3209, type: !667, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!667 = !DISubroutineType(types: !668)
!668 = !{!97, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !507, line: 3092, size: 128, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !670, file: !507, line: 3093, baseType: !452, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !670, file: !507, line: 3094, baseType: !97, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !670, file: !507, line: 3095, baseType: !97, size: 32, offset: 96)
!675 = !DILocalVariable(name: "sem", arg: 1, scope: !666, file: !507, line: 3209, type: !669)
!676 = !DILocation(line: 3209, column: 65, scope: !666)
!677 = !DILocation(line: 3211, column: 9, scope: !666)
!678 = !DILocation(line: 3211, column: 14, scope: !666)
!679 = !DILocation(line: 3211, column: 2, scope: !666)
!680 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !507, file: !507, line: 4649, type: !681, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!681 = !DISubroutineType(types: !682)
!682 = !{!156, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !507, line: 4390, size: 320, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !684, file: !507, line: 4392, baseType: !452, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !684, file: !507, line: 4394, baseType: !522, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !684, file: !507, line: 4396, baseType: !518, size: 32, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !684, file: !507, line: 4398, baseType: !156, size: 32, offset: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !684, file: !507, line: 4400, baseType: !251, size: 32, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !684, file: !507, line: 4402, baseType: !251, size: 32, offset: 160)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !684, file: !507, line: 4404, baseType: !251, size: 32, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !684, file: !507, line: 4406, baseType: !251, size: 32, offset: 224)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !684, file: !507, line: 4408, baseType: !156, size: 32, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !684, file: !507, line: 4413, baseType: !149, size: 8, offset: 288)
!696 = !DILocalVariable(name: "msgq", arg: 1, scope: !680, file: !507, line: 4649, type: !683)
!697 = !DILocation(line: 4649, column: 66, scope: !680)
!698 = !DILocation(line: 4651, column: 9, scope: !680)
!699 = !DILocation(line: 4651, column: 15, scope: !680)
!700 = !DILocation(line: 4651, column: 26, scope: !680)
!701 = !DILocation(line: 4651, column: 32, scope: !680)
!702 = !DILocation(line: 4651, column: 24, scope: !680)
!703 = !DILocation(line: 4651, column: 2, scope: !680)
!704 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !507, file: !507, line: 4665, type: !681, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!705 = !DILocalVariable(name: "msgq", arg: 1, scope: !704, file: !507, line: 4665, type: !683)
!706 = !DILocation(line: 4665, column: 66, scope: !704)
!707 = !DILocation(line: 4667, column: 9, scope: !704)
!708 = !DILocation(line: 4667, column: 15, scope: !704)
!709 = !DILocation(line: 4667, column: 2, scope: !704)
!710 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !135, file: !135, line: 744, type: !711, scopeLine: 745, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!711 = !DISubroutineType(types: !712)
!712 = !{!152, !132}
!713 = !DILocalVariable(name: "dev", arg: 1, scope: !710, file: !135, line: 744, type: !132)
!714 = !DILocation(line: 744, column: 65, scope: !710)
!715 = !DILocation(line: 746, column: 27, scope: !710)
!716 = !DILocation(line: 746, column: 9, scope: !710)
!717 = !DILocation(line: 746, column: 2, scope: !710)
!718 = distinct !DISubprogram(name: "z_impl_gpio_pin_interrupt_configure", scope: !96, file: !96, line: 862, type: !130, scopeLine: 865, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !524)
!719 = !DILocalVariable(name: "port", arg: 1, scope: !718, file: !96, line: 862, type: !132)
!720 = !DILocation(line: 862, column: 76, scope: !718)
!721 = !DILocalVariable(name: "pin", arg: 2, scope: !718, file: !96, line: 863, type: !154)
!722 = !DILocation(line: 863, column: 24, scope: !718)
!723 = !DILocalVariable(name: "flags", arg: 3, scope: !718, file: !96, line: 864, type: !155)
!724 = !DILocation(line: 864, column: 26, scope: !718)
!725 = !DILocalVariable(name: "api", scope: !718, file: !96, line: 866, type: !124)
!726 = !DILocation(line: 866, column: 32, scope: !718)
!727 = !DILocation(line: 867, column: 35, scope: !718)
!728 = !DILocation(line: 867, column: 41, scope: !718)
!729 = !DILocalVariable(name: "cfg", scope: !718, file: !96, line: 868, type: !730)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!731 = !DILocation(line: 868, column: 69, scope: !718)
!732 = !DILocation(line: 869, column: 38, scope: !718)
!733 = !DILocation(line: 869, column: 44, scope: !718)
!734 = !DILocalVariable(name: "data", scope: !718, file: !96, line: 870, type: !735)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!736 = !DILocation(line: 870, column: 39, scope: !718)
!737 = !DILocation(line: 871, column: 36, scope: !718)
!738 = !DILocation(line: 871, column: 42, scope: !718)
!739 = !DILocalVariable(name: "trig", scope: !718, file: !96, line: 872, type: !102)
!740 = !DILocation(line: 872, column: 21, scope: !718)
!741 = !DILocalVariable(name: "mode", scope: !718, file: !96, line: 873, type: !95)
!742 = !DILocation(line: 873, column: 21, scope: !718)
!743 = !DILocation(line: 875, column: 6, scope: !744)
!744 = distinct !DILexicalBlock(scope: !718, file: !96, line: 875, column: 6)
!745 = !DILocation(line: 875, column: 11, scope: !744)
!746 = !DILocation(line: 875, column: 35, scope: !744)
!747 = !DILocation(line: 875, column: 6, scope: !718)
!748 = !DILocation(line: 876, column: 3, scope: !749)
