; ModuleID = '../bc_files/heap-validate.bc'
source_filename = "/home/sri/zephyrproject/zephyr/lib/os/heap-validate.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }
%struct.sys_heap = type { ptr, ptr, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.chunk_unit_t = type { [8 x i8] }

!121 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!122 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!123 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!124 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!125 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chunk_fields", file: !127, line: 54, baseType: !45, size: 8, elements: !128)
!127 = !DIFile(filename: "lib/os/heap.h", directory: "/home/sri/zephyrproject/zephyr")
!128 = !{!129, !130, !131, !132}
!129 = !DIEnumerator(name: "LEFT_SIZE", value: 0)
!130 = !DIEnumerator(name: "SIZE_AND_USED", value: 1)
!131 = !DIEnumerator(name: "FREE_PREV", value: 2)
!132 = !DIEnumerator(name: "FREE_NEXT", value: 3)
!133 = !{!134, !135, !136, !137, !37, !140}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!135 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !38, line: 63, baseType: !139)
!139 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_unit_t", file: !127, line: 58, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 58, size: 64, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !142, file: !127, line: 58, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 8)
!148 = !{!0, !7, !12, !17, !22, !27, !32}
!149 = !{}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !38, line: 65, baseType: !151)
!151 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!152 = !{i32 7, !"Dwarf Version", i32 4}
!153 = !{i32 2, !"Debug Info Version", i32 3}
!154 = !{i32 1, !"wchar_size", i32 4}
!155 = !{i32 1, !"static_rwdata", i32 1}
!156 = !{i32 1, !"enumsize_buildattr", i32 1}
!157 = !{i32 1, !"armlib_unavailable", i32 0}
!158 = !{i32 8, !"PIC Level", i32 2}
!159 = !{i32 7, !"PIE Level", i32 2}
!160 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!161 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !44, file: !44, line: 223, type: !162, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !164, !166}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !168, line: 250, size: 896, elements: !169)
!168 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!169 = !{!170, !238, !251, !252, !253, !254, !287}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !167, file: !168, line: 252, baseType: !171, size: 384)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !168, line: 58, size: 384, elements: !172)
!172 = !{!173, !201, !209, !211, !212, !223, !224, !225}
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 61, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 61, size: 64, elements: !175)
!175 = !{!176, !192}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !174, file: !168, line: 62, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !178, line: 55, baseType: !179)
!178 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !178, line: 37, size: 64, elements: !180)
!180 = !{!181, !187}
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !179, file: !178, line: 38, baseType: !182, size: 32)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !179, file: !178, line: 38, size: 32, elements: !183)
!183 = !{!184, !186}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !182, file: !178, line: 39, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !182, file: !178, line: 40, baseType: !185, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, scope: !179, file: !178, line: 42, baseType: !188, size: 32, offset: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !179, file: !178, line: 42, size: 32, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !188, file: !178, line: 43, baseType: !185, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !188, file: !178, line: 44, baseType: !185, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !174, file: !168, line: 63, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !194, line: 58, size: 64, elements: !195)
!194 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !193, file: !194, line: 60, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 64, elements: !199)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!199 = !{!200}
!200 = !DISubrange(count: 2)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !171, file: !168, line: 69, baseType: !202, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !204, line: 243, baseType: !205)
!204 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !204, line: 241, size: 64, elements: !206)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !205, file: !204, line: 242, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !178, line: 51, baseType: !179)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !171, file: !168, line: 72, baseType: !210, size: 8, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !38, line: 62, baseType: !45)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !171, file: !168, line: 75, baseType: !210, size: 8, offset: 104)
!212 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 91, baseType: !213, size: 16, offset: 112)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 91, size: 16, elements: !214)
!214 = !{!215, !222}
!215 = !DIDerivedType(tag: DW_TAG_member, scope: !213, file: !168, line: 92, baseType: !216, size: 16)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !213, file: !168, line: 92, size: 16, elements: !217)
!217 = !{!218, !221}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !216, file: !168, line: 97, baseType: !219, size: 8)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !38, line: 56, baseType: !220)
!220 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !216, file: !168, line: 98, baseType: !210, size: 8, offset: 8)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !213, file: !168, line: 101, baseType: !138, size: 16)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !171, file: !168, line: 108, baseType: !37, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !171, file: !168, line: 132, baseType: !134, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !171, file: !168, line: 136, baseType: !226, size: 192, offset: 192)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !204, line: 254, size: 192, elements: !227)
!227 = !{!228, !229, !235}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !226, file: !204, line: 255, baseType: !177, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !226, file: !204, line: 256, baseType: !230, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !204, line: 252, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !226, file: !204, line: 259, baseType: !236, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !38, line: 59, baseType: !237)
!237 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !167, file: !168, line: 255, baseType: !239, size: 288, offset: 384)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !240, line: 25, size: 288, elements: !241)
!240 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !239, file: !240, line: 26, baseType: !37, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !239, file: !240, line: 27, baseType: !37, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !239, file: !240, line: 28, baseType: !37, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !239, file: !240, line: 29, baseType: !37, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !239, file: !240, line: 30, baseType: !37, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !239, file: !240, line: 31, baseType: !37, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !239, file: !240, line: 32, baseType: !37, size: 32, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !239, file: !240, line: 33, baseType: !37, size: 32, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !239, file: !240, line: 34, baseType: !37, size: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !167, file: !168, line: 258, baseType: !134, size: 32, offset: 672)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !167, file: !168, line: 261, baseType: !203, size: 64, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !167, file: !168, line: 302, baseType: !135, size: 32, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !167, file: !168, line: 333, baseType: !255, size: 32, offset: 800)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !257, line: 5291, size: 160, elements: !258)
!257 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!258 = !{!259, !283, !284}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !256, file: !257, line: 5292, baseType: !260, size: 96)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !261, line: 56, size: 96, elements: !262)
!261 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!262 = !{!263, !279, !280}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !260, file: !261, line: 57, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !127, line: 68, size: 128, elements: !266)
!266 = !{!267, !270, !271, !272}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "chunk0_hdr", scope: !265, file: !127, line: 69, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 64, elements: !199)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunkid_t", file: !127, line: 61, baseType: !37)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "end_chunk", scope: !265, file: !127, line: 70, baseType: !269, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "avail_buckets", scope: !265, file: !127, line: 71, baseType: !37, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !265, file: !127, line: 77, baseType: !273, offset: 128)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, elements: !277)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap_bucket", file: !127, line: 64, size: 32, elements: !275)
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !127, line: 65, baseType: !269, size: 32)
!277 = !{!278}
!278 = !DISubrange(count: 0)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !260, file: !261, line: 58, baseType: !134, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !260, file: !261, line: 59, baseType: !281, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !282, line: 46, baseType: !39)
!282 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!283 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !256, file: !257, line: 5293, baseType: !203, size: 64, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !256, file: !257, line: 5294, baseType: !285, offset: 160)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !286, line: 45, elements: !149)
!286 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!287 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !167, file: !168, line: 355, baseType: !288, size: 64, offset: 832)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !240, line: 60, size: 64, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !288, file: !240, line: 63, baseType: !37, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !288, file: !240, line: 66, baseType: !37, size: 32, offset: 32)
!292 = !DILocalVariable(name: "object", arg: 1, scope: !161, file: !44, line: 223, type: !164)
!293 = !DILocation(line: 223, column: 61, scope: !161)
!294 = !DILocalVariable(name: "thread", arg: 2, scope: !161, file: !44, line: 224, type: !166)
!295 = !DILocation(line: 224, column: 24, scope: !161)
!296 = !DILocation(line: 226, column: 9, scope: !161)
!297 = !DILocation(line: 227, column: 9, scope: !161)
!298 = !DILocation(line: 228, column: 1, scope: !161)
!299 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !44, file: !44, line: 243, type: !300, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !164}
!302 = !DILocalVariable(name: "object", arg: 1, scope: !299, file: !44, line: 243, type: !164)
!303 = !DILocation(line: 243, column: 56, scope: !299)
!304 = !DILocation(line: 245, column: 9, scope: !299)
!305 = !DILocation(line: 246, column: 1, scope: !299)
!306 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !44, file: !44, line: 359, type: !307, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!307 = !DISubroutineType(types: !308)
!308 = !{!134, !43}
!309 = !DILocalVariable(name: "otype", arg: 1, scope: !306, file: !44, line: 359, type: !43)
!310 = !DILocation(line: 359, column: 58, scope: !306)
!311 = !DILocation(line: 361, column: 9, scope: !306)
!312 = !DILocation(line: 363, column: 2, scope: !306)
!313 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !44, file: !44, line: 366, type: !314, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!314 = !DISubroutineType(types: !315)
!315 = !{!134, !43, !281}
!316 = !DILocalVariable(name: "otype", arg: 1, scope: !313, file: !44, line: 366, type: !43)
!317 = !DILocation(line: 366, column: 63, scope: !313)
!318 = !DILocalVariable(name: "size", arg: 2, scope: !313, file: !44, line: 367, type: !281)
!319 = !DILocation(line: 367, column: 13, scope: !313)
!320 = !DILocation(line: 369, column: 9, scope: !313)
!321 = !DILocation(line: 370, column: 9, scope: !313)
!322 = !DILocation(line: 372, column: 2, scope: !313)
!323 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !257, file: !257, line: 656, type: !324, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!324 = !DISubroutineType(types: !325)
!325 = !{!326, !328}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !327, line: 46, baseType: !236)
!327 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!330 = !DILocalVariable(name: "t", arg: 1, scope: !323, file: !257, line: 657, type: !328)
!331 = !DILocation(line: 657, column: 30, scope: !323)
!332 = !DILocation(line: 659, column: 28, scope: !323)
!333 = !DILocation(line: 659, column: 31, scope: !323)
!334 = !DILocation(line: 659, column: 36, scope: !323)
!335 = !DILocation(line: 659, column: 9, scope: !323)
!336 = !DILocation(line: 659, column: 2, scope: !323)
!337 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !257, file: !257, line: 671, type: !324, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!338 = !DILocalVariable(name: "t", arg: 1, scope: !337, file: !257, line: 672, type: !328)
!339 = !DILocation(line: 672, column: 30, scope: !337)
!340 = !DILocation(line: 674, column: 30, scope: !337)
!341 = !DILocation(line: 674, column: 33, scope: !337)
!342 = !DILocation(line: 674, column: 38, scope: !337)
!343 = !DILocation(line: 674, column: 9, scope: !337)
!344 = !DILocation(line: 674, column: 2, scope: !337)
!345 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !257, file: !257, line: 1634, type: !346, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!346 = !DISubroutineType(types: !347)
!347 = !{!326, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !257, line: 1439, size: 448, elements: !351)
!351 = !{!352, !353, !354, !359, !360, !365, !366}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !350, file: !257, line: 1445, baseType: !226, size: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !350, file: !257, line: 1448, baseType: !203, size: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !350, file: !257, line: 1451, baseType: !355, size: 32, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !350, file: !257, line: 1454, baseType: !355, size: 32, offset: 288)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !350, file: !257, line: 1457, baseType: !361, size: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !327, line: 67, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 65, size: 64, elements: !363)
!363 = !{!364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !362, file: !327, line: 66, baseType: !326, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !350, file: !257, line: 1460, baseType: !37, size: 32, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !350, file: !257, line: 1463, baseType: !134, size: 32, offset: 416)
!367 = !DILocalVariable(name: "timer", arg: 1, scope: !345, file: !257, line: 1635, type: !348)
!368 = !DILocation(line: 1635, column: 34, scope: !345)
!369 = !DILocation(line: 1637, column: 28, scope: !345)
!370 = !DILocation(line: 1637, column: 35, scope: !345)
!371 = !DILocation(line: 1637, column: 9, scope: !345)
!372 = !DILocation(line: 1637, column: 2, scope: !345)
!373 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !257, file: !257, line: 1649, type: !346, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!374 = !DILocalVariable(name: "timer", arg: 1, scope: !373, file: !257, line: 1650, type: !348)
!375 = !DILocation(line: 1650, column: 34, scope: !373)
!376 = !DILocation(line: 1652, column: 30, scope: !373)
!377 = !DILocation(line: 1652, column: 37, scope: !373)
!378 = !DILocation(line: 1652, column: 9, scope: !373)
!379 = !DILocation(line: 1652, column: 2, scope: !373)
!380 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !257, file: !257, line: 1689, type: !381, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !358, !134}
!383 = !DILocalVariable(name: "timer", arg: 1, scope: !380, file: !257, line: 1689, type: !358)
!384 = !DILocation(line: 1689, column: 65, scope: !380)
!385 = !DILocalVariable(name: "user_data", arg: 2, scope: !380, file: !257, line: 1690, type: !134)
!386 = !DILocation(line: 1690, column: 19, scope: !380)
!387 = !DILocation(line: 1692, column: 21, scope: !380)
!388 = !DILocation(line: 1692, column: 2, scope: !380)
!389 = !DILocation(line: 1692, column: 9, scope: !380)
!390 = !DILocation(line: 1692, column: 19, scope: !380)
!391 = !DILocation(line: 1693, column: 1, scope: !380)
!392 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !257, file: !257, line: 1704, type: !393, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!393 = !DISubroutineType(types: !394)
!394 = !{!134, !348}
!395 = !DILocalVariable(name: "timer", arg: 1, scope: !392, file: !257, line: 1704, type: !348)
!396 = !DILocation(line: 1704, column: 72, scope: !392)
!397 = !DILocation(line: 1706, column: 9, scope: !392)
!398 = !DILocation(line: 1706, column: 16, scope: !392)
!399 = !DILocation(line: 1706, column: 2, scope: !392)
!400 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !257, file: !257, line: 2071, type: !401, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!401 = !DISubroutineType(types: !402)
!402 = !{!135, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !257, line: 1830, size: 128, elements: !405)
!405 = !{!406, !419, !420}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !404, file: !257, line: 1831, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !408, line: 60, baseType: !409)
!408 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !408, line: 53, size: 64, elements: !410)
!410 = !{!411, !418}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !409, file: !408, line: 54, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !408, line: 50, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !408, line: 44, size: 32, elements: !415)
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !414, file: !408, line: 45, baseType: !417, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !408, line: 40, baseType: !37)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !409, file: !408, line: 55, baseType: !412, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !404, file: !257, line: 1832, baseType: !285, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !404, file: !257, line: 1833, baseType: !203, size: 64, offset: 64)
!421 = !DILocalVariable(name: "queue", arg: 1, scope: !400, file: !257, line: 2071, type: !403)
!422 = !DILocation(line: 2071, column: 59, scope: !400)
!423 = !DILocation(line: 2073, column: 35, scope: !400)
!424 = !DILocation(line: 2073, column: 42, scope: !400)
!425 = !DILocation(line: 2073, column: 14, scope: !400)
!426 = !DILocation(line: 2073, column: 9, scope: !400)
!427 = !DILocation(line: 2073, column: 2, scope: !400)
!428 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !257, file: !257, line: 3209, type: !429, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!429 = !DISubroutineType(types: !430)
!430 = !{!39, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !257, line: 3092, size: 128, elements: !433)
!433 = !{!434, !435, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !432, file: !257, line: 3093, baseType: !203, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !432, file: !257, line: 3094, baseType: !39, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !432, file: !257, line: 3095, baseType: !39, size: 32, offset: 96)
!437 = !DILocalVariable(name: "sem", arg: 1, scope: !428, file: !257, line: 3209, type: !431)
!438 = !DILocation(line: 3209, column: 65, scope: !428)
!439 = !DILocation(line: 3211, column: 9, scope: !428)
!440 = !DILocation(line: 3211, column: 14, scope: !428)
!441 = !DILocation(line: 3211, column: 2, scope: !428)
!442 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !257, file: !257, line: 4649, type: !443, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!443 = !DISubroutineType(types: !444)
!444 = !{!37, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !257, line: 4390, size: 320, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !454, !455, !456, !457, !458}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !446, file: !257, line: 4392, baseType: !203, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !446, file: !257, line: 4394, baseType: !285, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !446, file: !257, line: 4396, baseType: !281, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !446, file: !257, line: 4398, baseType: !37, size: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !446, file: !257, line: 4400, baseType: !453, size: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !446, file: !257, line: 4402, baseType: !453, size: 32, offset: 160)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !446, file: !257, line: 4404, baseType: !453, size: 32, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !446, file: !257, line: 4406, baseType: !453, size: 32, offset: 224)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !446, file: !257, line: 4408, baseType: !37, size: 32, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !446, file: !257, line: 4413, baseType: !210, size: 8, offset: 288)
!459 = !DILocalVariable(name: "msgq", arg: 1, scope: !442, file: !257, line: 4649, type: !445)
!460 = !DILocation(line: 4649, column: 66, scope: !442)
!461 = !DILocation(line: 4651, column: 9, scope: !442)
!462 = !DILocation(line: 4651, column: 15, scope: !442)
!463 = !DILocation(line: 4651, column: 26, scope: !442)
!464 = !DILocation(line: 4651, column: 32, scope: !442)
!465 = !DILocation(line: 4651, column: 24, scope: !442)
!466 = !DILocation(line: 4651, column: 2, scope: !442)
!467 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !257, file: !257, line: 4665, type: !443, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!468 = !DILocalVariable(name: "msgq", arg: 1, scope: !467, file: !257, line: 4665, type: !445)
!469 = !DILocation(line: 4665, column: 66, scope: !467)
!470 = !DILocation(line: 4667, column: 9, scope: !467)
!471 = !DILocation(line: 4667, column: 15, scope: !467)
!472 = !DILocation(line: 4667, column: 2, scope: !467)
!473 = distinct !DISubprogram(name: "sys_heap_validate", scope: !2, file: !2, line: 88, type: !474, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !149)
!474 = !DISubroutineType(types: !475)
!475 = !{!476, !477}
!476 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!478 = !DILocalVariable(name: "heap", arg: 1, scope: !473, file: !2, line: 88, type: !477)
!479 = !DILocation(line: 88, column: 42, scope: !473)
!480 = !DILocalVariable(name: "h", scope: !473, file: !2, line: 90, type: !264)
!481 = !DILocation(line: 90, column: 17, scope: !473)
!482 = !DILocation(line: 90, column: 21, scope: !473)
!483 = !DILocation(line: 90, column: 27, scope: !473)
!484 = !DILocalVariable(name: "c", scope: !473, file: !2, line: 91, type: !269)
!485 = !DILocation(line: 91, column: 12, scope: !473)
!486 = !DILocation(line: 96, column: 23, scope: !487)
!487 = distinct !DILexicalBlock(scope: !473, file: !2, line: 96, column: 2)
!488 = !DILocation(line: 96, column: 11, scope: !487)
!489 = !DILocation(line: 96, column: 9, scope: !487)
!490 = !DILocation(line: 96, column: 7, scope: !487)
!491 = !DILocation(line: 96, column: 30, scope: !492)
!492 = distinct !DILexicalBlock(scope: !487, file: !2, line: 96, column: 2)
!493 = !DILocation(line: 96, column: 34, scope: !492)
!494 = !DILocation(line: 96, column: 37, scope: !492)
!495 = !DILocation(line: 96, column: 32, scope: !492)
!496 = !DILocation(line: 96, column: 2, scope: !487)
!497 = !DILocation(line: 97, column: 20, scope: !498)
!498 = distinct !DILexicalBlock(scope: !499, file: !2, line: 97, column: 7)
!499 = distinct !DILexicalBlock(scope: !492, file: !2, line: 96, column: 71)
!500 = !DILocation(line: 97, column: 23, scope: !498)
!501 = !DILocation(line: 97, column: 8, scope: !498)
!502 = !DILocation(line: 97, column: 7, scope: !499)
!503 = !DILocation(line: 98, column: 4, scope: !504)
!504 = distinct !DILexicalBlock(scope: !498, file: !2, line: 97, column: 27)
!505 = !DILocation(line: 100, column: 2, scope: !499)
!506 = !DILocation(line: 96, column: 64, scope: !492)
!507 = !DILocation(line: 96, column: 67, scope: !492)
!508 = !DILocation(line: 96, column: 52, scope: !492)
!509 = !DILocation(line: 96, column: 50, scope: !492)
!510 = !DILocation(line: 96, column: 2, scope: !492)
!511 = distinct !{!511, !496, !512}
!512 = !DILocation(line: 100, column: 2, scope: !487)
!513 = !DILocation(line: 101, column: 6, scope: !514)
!514 = distinct !DILexicalBlock(scope: !473, file: !2, line: 101, column: 6)
!515 = !DILocation(line: 101, column: 11, scope: !514)
!516 = !DILocation(line: 101, column: 14, scope: !514)
!517 = !DILocation(line: 101, column: 8, scope: !514)
!518 = !DILocation(line: 101, column: 6, scope: !473)
!519 = !DILocation(line: 102, column: 3, scope: !520)
!520 = distinct !DILexicalBlock(scope: !514, file: !2, line: 101, column: 25)
!521 = !DILocalVariable(name: "b", scope: !522, file: !2, line: 127, type: !135)
!522 = distinct !DILexicalBlock(scope: !473, file: !2, line: 127, column: 2)
!523 = !DILocation(line: 127, column: 11, scope: !522)
!524 = !DILocation(line: 127, column: 7, scope: !522)
!525 = !DILocation(line: 127, column: 18, scope: !526)
!526 = distinct !DILexicalBlock(scope: !522, file: !2, line: 127, column: 2)
!527 = !DILocation(line: 127, column: 34, scope: !526)
!528 = !DILocation(line: 127, column: 37, scope: !526)
!529 = !DILocation(line: 127, column: 40, scope: !526)
!530 = !DILocation(line: 127, column: 23, scope: !526)
!531 = !DILocation(line: 127, column: 20, scope: !526)
!532 = !DILocation(line: 127, column: 2, scope: !522)
!533 = !DILocalVariable(name: "c0", scope: !534, file: !2, line: 128, type: !269)
!534 = distinct !DILexicalBlock(scope: !526, file: !2, line: 127, column: 57)
!535 = !DILocation(line: 128, column: 13, scope: !534)
!536 = !DILocation(line: 128, column: 18, scope: !534)
!537 = !DILocation(line: 128, column: 21, scope: !534)
!538 = !DILocation(line: 128, column: 29, scope: !534)
!539 = !DILocation(line: 128, column: 32, scope: !534)
!540 = !DILocalVariable(name: "n", scope: !534, file: !2, line: 129, type: !37)
!541 = !DILocation(line: 129, column: 12, scope: !534)
!542 = !DILocation(line: 131, column: 15, scope: !534)
!543 = !DILocation(line: 131, column: 18, scope: !534)
!544 = !DILocation(line: 131, column: 3, scope: !534)
!545 = !DILocation(line: 133, column: 12, scope: !546)
!546 = distinct !DILexicalBlock(scope: !534, file: !2, line: 133, column: 3)
!547 = !DILocation(line: 133, column: 10, scope: !546)
!548 = !DILocation(line: 133, column: 8, scope: !546)
!549 = !DILocation(line: 133, column: 16, scope: !550)
!550 = distinct !DILexicalBlock(scope: !546, file: !2, line: 133, column: 3)
!551 = !DILocation(line: 133, column: 18, scope: !550)
!552 = !DILocation(line: 133, column: 23, scope: !550)
!553 = !DILocation(line: 133, column: 27, scope: !550)
!554 = !DILocation(line: 133, column: 29, scope: !550)
!555 = !DILocation(line: 133, column: 34, scope: !550)
!556 = !DILocation(line: 133, column: 37, scope: !550)
!557 = !DILocation(line: 133, column: 42, scope: !550)
!558 = !DILocation(line: 133, column: 39, scope: !550)
!559 = !DILocation(line: 0, scope: !550)
!560 = !DILocation(line: 133, column: 3, scope: !546)
!561 = !DILocation(line: 135, column: 21, scope: !562)
!562 = distinct !DILexicalBlock(scope: !563, file: !2, line: 135, column: 8)
!563 = distinct !DILexicalBlock(scope: !550, file: !2, line: 134, column: 40)
!564 = !DILocation(line: 135, column: 24, scope: !562)
!565 = !DILocation(line: 135, column: 9, scope: !562)
!566 = !DILocation(line: 135, column: 8, scope: !563)
!567 = !DILocation(line: 136, column: 5, scope: !568)
!568 = distinct !DILexicalBlock(scope: !562, file: !2, line: 135, column: 28)
!569 = !DILocation(line: 138, column: 19, scope: !563)
!570 = !DILocation(line: 138, column: 22, scope: !563)
!571 = !DILocation(line: 138, column: 4, scope: !563)
!572 = !DILocation(line: 139, column: 3, scope: !563)
!573 = !DILocation(line: 134, column: 9, scope: !550)
!574 = !DILocation(line: 134, column: 33, scope: !550)
!575 = !DILocation(line: 134, column: 36, scope: !550)
!576 = !DILocation(line: 134, column: 17, scope: !550)
!577 = !DILocation(line: 134, column: 15, scope: !550)
!578 = !DILocation(line: 133, column: 3, scope: !550)
!579 = distinct !{!579, !560, !580}
!580 = !DILocation(line: 139, column: 3, scope: !546)
!581 = !DILocalVariable(name: "empty", scope: !534, file: !2, line: 141, type: !476)
!582 = !DILocation(line: 141, column: 9, scope: !534)
!583 = !DILocation(line: 141, column: 18, scope: !534)
!584 = !DILocation(line: 141, column: 21, scope: !534)
!585 = !DILocation(line: 141, column: 46, scope: !534)
!586 = !DILocation(line: 141, column: 42, scope: !534)
!587 = !DILocation(line: 141, column: 35, scope: !534)
!588 = !DILocation(line: 141, column: 51, scope: !534)
!589 = !DILocalVariable(name: "zero", scope: !534, file: !2, line: 142, type: !476)
!590 = !DILocation(line: 142, column: 9, scope: !534)
!591 = !DILocation(line: 142, column: 16, scope: !534)
!592 = !DILocation(line: 142, column: 18, scope: !534)
!593 = !DILocation(line: 144, column: 7, scope: !594)
!594 = distinct !DILexicalBlock(scope: !534, file: !2, line: 144, column: 7)
!595 = !DILocation(line: 144, column: 16, scope: !594)
!596 = !DILocation(line: 144, column: 13, scope: !594)
!597 = !DILocation(line: 144, column: 7, scope: !534)
!598 = !DILocation(line: 145, column: 4, scope: !599)
!599 = distinct !DILexicalBlock(scope: !594, file: !2, line: 144, column: 22)
!600 = !DILocation(line: 148, column: 7, scope: !601)
!601 = distinct !DILexicalBlock(scope: !534, file: !2, line: 148, column: 7)
!602 = !DILocation(line: 148, column: 13, scope: !601)
!603 = !DILocation(line: 148, column: 16, scope: !601)
!604 = !DILocation(line: 148, column: 19, scope: !601)
!605 = !DILocation(line: 148, column: 27, scope: !601)
!606 = !DILocation(line: 148, column: 30, scope: !601)
!607 = !DILocation(line: 148, column: 35, scope: !601)
!608 = !DILocation(line: 148, column: 7, scope: !534)
!609 = !DILocation(line: 149, column: 4, scope: !610)
!610 = distinct !DILexicalBlock(scope: !601, file: !2, line: 148, column: 41)
!611 = !DILocation(line: 151, column: 2, scope: !534)
!612 = !DILocation(line: 127, column: 53, scope: !526)
!613 = !DILocation(line: 127, column: 2, scope: !526)
!614 = distinct !{!614, !532, !615}
!615 = !DILocation(line: 151, column: 2, scope: !522)
!616 = !DILocalVariable(name: "prev_chunk", scope: !473, file: !2, line: 159, type: !269)
!617 = !DILocation(line: 159, column: 12, scope: !473)
!618 = !DILocation(line: 160, column: 23, scope: !619)
!619 = distinct !DILexicalBlock(scope: !473, file: !2, line: 160, column: 2)
!620 = !DILocation(line: 160, column: 11, scope: !619)
!621 = !DILocation(line: 160, column: 9, scope: !619)
!622 = !DILocation(line: 160, column: 7, scope: !619)
!623 = !DILocation(line: 160, column: 30, scope: !624)
!624 = distinct !DILexicalBlock(scope: !619, file: !2, line: 160, column: 2)
!625 = !DILocation(line: 160, column: 34, scope: !624)
!626 = !DILocation(line: 160, column: 37, scope: !624)
!627 = !DILocation(line: 160, column: 32, scope: !624)
!628 = !DILocation(line: 160, column: 2, scope: !619)
!629 = !DILocation(line: 161, column: 19, scope: !630)
!630 = distinct !DILexicalBlock(scope: !631, file: !2, line: 161, column: 7)
!631 = distinct !DILexicalBlock(scope: !624, file: !2, line: 160, column: 71)
!632 = !DILocation(line: 161, column: 22, scope: !630)
!633 = !DILocation(line: 161, column: 8, scope: !630)
!634 = !DILocation(line: 161, column: 25, scope: !630)
!635 = !DILocation(line: 161, column: 46, scope: !630)
!636 = !DILocation(line: 161, column: 49, scope: !630)
!637 = !DILocation(line: 161, column: 29, scope: !630)
!638 = !DILocation(line: 161, column: 7, scope: !631)
!639 = !DILocation(line: 162, column: 4, scope: !640)
!640 = distinct !DILexicalBlock(scope: !630, file: !2, line: 161, column: 53)
!641 = !DILocation(line: 164, column: 18, scope: !642)
!642 = distinct !DILexicalBlock(scope: !631, file: !2, line: 164, column: 7)
!643 = !DILocation(line: 164, column: 21, scope: !642)
!644 = !DILocation(line: 164, column: 7, scope: !642)
!645 = !DILocation(line: 164, column: 27, scope: !642)
!646 = !DILocation(line: 164, column: 24, scope: !642)
!647 = !DILocation(line: 164, column: 7, scope: !631)
!648 = !DILocation(line: 165, column: 4, scope: !649)
!649 = distinct !DILexicalBlock(scope: !642, file: !2, line: 164, column: 39)
!650 = !DILocation(line: 167, column: 16, scope: !631)
!651 = !DILocation(line: 167, column: 14, scope: !631)
!652 = !DILocation(line: 169, column: 18, scope: !631)
!653 = !DILocation(line: 169, column: 21, scope: !631)
!654 = !DILocation(line: 169, column: 41, scope: !631)
!655 = !DILocation(line: 169, column: 44, scope: !631)
!656 = !DILocation(line: 169, column: 24, scope: !631)
!657 = !DILocation(line: 169, column: 3, scope: !631)
!658 = !DILocation(line: 170, column: 2, scope: !631)
!659 = !DILocation(line: 160, column: 64, scope: !624)
!660 = !DILocation(line: 160, column: 67, scope: !624)
!661 = !DILocation(line: 160, column: 52, scope: !624)
!662 = !DILocation(line: 160, column: 50, scope: !624)
!663 = !DILocation(line: 160, column: 2, scope: !624)
!664 = distinct !{!664, !628, !665}
!665 = !DILocation(line: 170, column: 2, scope: !619)
!666 = !DILocation(line: 171, column: 6, scope: !667)
!667 = distinct !DILexicalBlock(scope: !473, file: !2, line: 171, column: 6)
!668 = !DILocation(line: 171, column: 11, scope: !667)
!669 = !DILocation(line: 171, column: 14, scope: !667)
!670 = !DILocation(line: 171, column: 8, scope: !667)
!671 = !DILocation(line: 171, column: 6, scope: !473)
!672 = !DILocation(line: 172, column: 3, scope: !673)
!673 = distinct !DILexicalBlock(scope: !667, file: !2, line: 171, column: 25)
!674 = !DILocalVariable(name: "b", scope: !675, file: !2, line: 179, type: !135)
!675 = distinct !DILexicalBlock(scope: !473, file: !2, line: 179, column: 2)
!676 = !DILocation(line: 179, column: 11, scope: !675)
!677 = !DILocation(line: 179, column: 7, scope: !675)
!678 = !DILocation(line: 179, column: 18, scope: !679)
!679 = distinct !DILexicalBlock(scope: !675, file: !2, line: 179, column: 2)
!680 = !DILocation(line: 179, column: 34, scope: !679)
!681 = !DILocation(line: 179, column: 37, scope: !679)
!682 = !DILocation(line: 179, column: 40, scope: !679)
!683 = !DILocation(line: 179, column: 23, scope: !679)
!684 = !DILocation(line: 179, column: 20, scope: !679)
!685 = !DILocation(line: 179, column: 2, scope: !675)
!686 = !DILocalVariable(name: "c0", scope: !687, file: !2, line: 180, type: !269)
!687 = distinct !DILexicalBlock(scope: !679, file: !2, line: 179, column: 57)
!688 = !DILocation(line: 180, column: 13, scope: !687)
!689 = !DILocation(line: 180, column: 18, scope: !687)
!690 = !DILocation(line: 180, column: 21, scope: !687)
!691 = !DILocation(line: 180, column: 29, scope: !687)
!692 = !DILocation(line: 180, column: 32, scope: !687)
!693 = !DILocalVariable(name: "n", scope: !687, file: !2, line: 181, type: !135)
!694 = !DILocation(line: 181, column: 7, scope: !687)
!695 = !DILocation(line: 183, column: 7, scope: !696)
!696 = distinct !DILexicalBlock(scope: !687, file: !2, line: 183, column: 7)
!697 = !DILocation(line: 183, column: 10, scope: !696)
!698 = !DILocation(line: 183, column: 7, scope: !687)
!699 = !DILocation(line: 184, column: 4, scope: !700)
!700 = distinct !DILexicalBlock(scope: !696, file: !2, line: 183, column: 16)
!701 = !DILocation(line: 187, column: 12, scope: !702)
!702 = distinct !DILexicalBlock(scope: !687, file: !2, line: 187, column: 3)
!703 = !DILocation(line: 187, column: 10, scope: !702)
!704 = !DILocation(line: 187, column: 8, scope: !702)
!705 = !DILocation(line: 187, column: 16, scope: !706)
!706 = distinct !DILexicalBlock(scope: !702, file: !2, line: 187, column: 3)
!707 = !DILocation(line: 187, column: 18, scope: !706)
!708 = !DILocation(line: 187, column: 23, scope: !706)
!709 = !DILocation(line: 187, column: 26, scope: !706)
!710 = !DILocation(line: 187, column: 31, scope: !706)
!711 = !DILocation(line: 187, column: 28, scope: !706)
!712 = !DILocation(line: 187, column: 3, scope: !702)
!713 = !DILocation(line: 188, column: 19, scope: !714)
!714 = distinct !DILexicalBlock(scope: !715, file: !2, line: 188, column: 8)
!715 = distinct !DILexicalBlock(scope: !706, file: !2, line: 187, column: 67)
!716 = !DILocation(line: 188, column: 22, scope: !714)
!717 = !DILocation(line: 188, column: 8, scope: !714)
!718 = !DILocation(line: 188, column: 8, scope: !715)
!719 = !DILocation(line: 189, column: 5, scope: !720)
!720 = distinct !DILexicalBlock(scope: !714, file: !2, line: 188, column: 26)
!721 = !DILocation(line: 191, column: 19, scope: !715)
!722 = !DILocation(line: 191, column: 22, scope: !715)
!723 = !DILocation(line: 191, column: 4, scope: !715)
!724 = !DILocation(line: 192, column: 3, scope: !715)
!725 = !DILocation(line: 187, column: 36, scope: !706)
!726 = !DILocation(line: 187, column: 60, scope: !706)
!727 = !DILocation(line: 187, column: 63, scope: !706)
!728 = !DILocation(line: 187, column: 44, scope: !706)
!729 = !DILocation(line: 187, column: 42, scope: !706)
!730 = !DILocation(line: 187, column: 3, scope: !706)
!731 = distinct !{!731, !712, !732}
!732 = !DILocation(line: 192, column: 3, scope: !702)
!733 = !DILocation(line: 193, column: 2, scope: !687)
!734 = !DILocation(line: 179, column: 53, scope: !679)
!735 = !DILocation(line: 179, column: 2, scope: !679)
!736 = distinct !{!736, !685, !737}
!737 = !DILocation(line: 193, column: 2, scope: !675)
!738 = !DILocation(line: 198, column: 23, scope: !739)
!739 = distinct !DILexicalBlock(scope: !473, file: !2, line: 198, column: 2)
!740 = !DILocation(line: 198, column: 11, scope: !739)
!741 = !DILocation(line: 198, column: 9, scope: !739)
!742 = !DILocation(line: 198, column: 7, scope: !739)
!743 = !DILocation(line: 198, column: 30, scope: !744)
!744 = distinct !DILexicalBlock(scope: !739, file: !2, line: 198, column: 2)
!745 = !DILocation(line: 198, column: 34, scope: !744)
!746 = !DILocation(line: 198, column: 37, scope: !744)
!747 = !DILocation(line: 198, column: 32, scope: !744)
!748 = !DILocation(line: 198, column: 2, scope: !739)
!749 = !DILocation(line: 199, column: 18, scope: !750)
!750 = distinct !DILexicalBlock(scope: !744, file: !2, line: 198, column: 71)
!751 = !DILocation(line: 199, column: 21, scope: !750)
!752 = !DILocation(line: 199, column: 36, scope: !750)
!753 = !DILocation(line: 199, column: 39, scope: !750)
!754 = !DILocation(line: 199, column: 25, scope: !750)
!755 = !DILocation(line: 199, column: 24, scope: !750)
!756 = !DILocation(line: 199, column: 3, scope: !750)
!757 = !DILocation(line: 200, column: 2, scope: !750)
!758 = !DILocation(line: 198, column: 64, scope: !744)
!759 = !DILocation(line: 198, column: 67, scope: !744)
!760 = !DILocation(line: 198, column: 52, scope: !744)
!761 = !DILocation(line: 198, column: 50, scope: !744)
!762 = !DILocation(line: 198, column: 2, scope: !744)
!763 = distinct !{!763, !748, !764}
!764 = !DILocation(line: 200, column: 2, scope: !739)
!765 = !DILocation(line: 201, column: 2, scope: !473)
!766 = !DILocation(line: 202, column: 1, scope: !473)
!767 = distinct !DISubprogram(name: "right_chunk", scope: !127, file: !127, line: 204, type: !768, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!768 = !DISubroutineType(types: !769)
!769 = !{!269, !264, !269}
!770 = !DILocalVariable(name: "h", arg: 1, scope: !767, file: !127, line: 204, type: !264)
!771 = !DILocation(line: 204, column: 52, scope: !767)
!772 = !DILocalVariable(name: "c", arg: 2, scope: !767, file: !127, line: 204, type: !269)
!773 = !DILocation(line: 204, column: 65, scope: !767)
!774 = !DILocation(line: 206, column: 9, scope: !767)
!775 = !DILocation(line: 206, column: 24, scope: !767)
!776 = !DILocation(line: 206, column: 27, scope: !767)
!777 = !DILocation(line: 206, column: 13, scope: !767)
!778 = !DILocation(line: 206, column: 11, scope: !767)
!779 = !DILocation(line: 206, column: 2, scope: !767)
!780 = distinct !DISubprogram(name: "valid_chunk", scope: !2, file: !2, line: 31, type: !781, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!781 = !DISubroutineType(types: !782)
!782 = !{!476, !264, !269}
!783 = !DILocalVariable(name: "h", arg: 1, scope: !780, file: !2, line: 31, type: !264)
!784 = !DILocation(line: 31, column: 41, scope: !780)
!785 = !DILocalVariable(name: "c", arg: 2, scope: !780, file: !2, line: 31, type: !269)
!786 = !DILocation(line: 31, column: 54, scope: !780)
!787 = !DILocation(line: 33, column: 2, scope: !780)
!788 = !DILocation(line: 33, column: 24, scope: !789)
!789 = distinct !DILexicalBlock(scope: !790, file: !2, line: 33, column: 11)
!790 = distinct !DILexicalBlock(scope: !780, file: !2, line: 33, column: 5)
!791 = !DILocation(line: 33, column: 27, scope: !789)
!792 = !DILocation(line: 33, column: 13, scope: !789)
!793 = !DILocation(line: 33, column: 30, scope: !789)
!794 = !DILocation(line: 33, column: 11, scope: !790)
!795 = !DILocation(line: 33, column: 38, scope: !796)
!796 = distinct !DILexicalBlock(scope: !789, file: !2, line: 33, column: 36)
!797 = !DILocation(line: 33, column: 50, scope: !790)
!798 = !DILocation(line: 34, column: 2, scope: !780)
!799 = !DILocation(line: 34, column: 13, scope: !800)
!800 = distinct !DILexicalBlock(scope: !801, file: !2, line: 34, column: 11)
!801 = distinct !DILexicalBlock(scope: !780, file: !2, line: 34, column: 5)
!802 = !DILocation(line: 34, column: 28, scope: !800)
!803 = !DILocation(line: 34, column: 31, scope: !800)
!804 = !DILocation(line: 34, column: 17, scope: !800)
!805 = !DILocation(line: 34, column: 15, scope: !800)
!806 = !DILocation(line: 34, column: 37, scope: !800)
!807 = !DILocation(line: 34, column: 40, scope: !800)
!808 = !DILocation(line: 34, column: 34, scope: !800)
!809 = !DILocation(line: 34, column: 11, scope: !801)
!810 = !DILocation(line: 34, column: 54, scope: !811)
!811 = distinct !DILexicalBlock(scope: !800, file: !2, line: 34, column: 52)
!812 = !DILocation(line: 34, column: 66, scope: !801)
!813 = !DILocation(line: 35, column: 2, scope: !780)
!814 = !DILocation(line: 35, column: 23, scope: !815)
!815 = distinct !DILexicalBlock(scope: !816, file: !2, line: 35, column: 11)
!816 = distinct !DILexicalBlock(scope: !780, file: !2, line: 35, column: 5)
!817 = !DILocation(line: 35, column: 26, scope: !815)
!818 = !DILocation(line: 35, column: 13, scope: !815)
!819 = !DILocation(line: 35, column: 11, scope: !816)
!820 = !DILocation(line: 35, column: 33, scope: !821)
!821 = distinct !DILexicalBlock(scope: !815, file: !2, line: 35, column: 31)
!822 = !DILocation(line: 35, column: 45, scope: !816)
!823 = !DILocation(line: 36, column: 2, scope: !780)
!824 = !DILocation(line: 36, column: 25, scope: !825)
!825 = distinct !DILexicalBlock(scope: !826, file: !2, line: 36, column: 11)
!826 = distinct !DILexicalBlock(scope: !780, file: !2, line: 36, column: 5)
!827 = !DILocation(line: 36, column: 39, scope: !825)
!828 = !DILocation(line: 36, column: 42, scope: !825)
!829 = !DILocation(line: 36, column: 28, scope: !825)
!830 = !DILocation(line: 36, column: 13, scope: !825)
!831 = !DILocation(line: 36, column: 49, scope: !825)
!832 = !DILocation(line: 36, column: 46, scope: !825)
!833 = !DILocation(line: 36, column: 11, scope: !826)
!834 = !DILocation(line: 36, column: 55, scope: !835)
!835 = distinct !DILexicalBlock(scope: !825, file: !2, line: 36, column: 53)
!836 = !DILocation(line: 36, column: 67, scope: !826)
!837 = !DILocation(line: 37, column: 2, scope: !780)
!838 = !DILocation(line: 37, column: 24, scope: !839)
!839 = distinct !DILexicalBlock(scope: !840, file: !2, line: 37, column: 11)
!840 = distinct !DILexicalBlock(scope: !780, file: !2, line: 37, column: 5)
!841 = !DILocation(line: 37, column: 39, scope: !839)
!842 = !DILocation(line: 37, column: 42, scope: !839)
!843 = !DILocation(line: 37, column: 27, scope: !839)
!844 = !DILocation(line: 37, column: 13, scope: !839)
!845 = !DILocation(line: 37, column: 49, scope: !839)
!846 = !DILocation(line: 37, column: 46, scope: !839)
!847 = !DILocation(line: 37, column: 11, scope: !840)
!848 = !DILocation(line: 37, column: 55, scope: !849)
!849 = distinct !DILexicalBlock(scope: !839, file: !2, line: 37, column: 53)
!850 = !DILocation(line: 37, column: 67, scope: !840)
!851 = !DILocation(line: 38, column: 17, scope: !852)
!852 = distinct !DILexicalBlock(scope: !780, file: !2, line: 38, column: 6)
!853 = !DILocation(line: 38, column: 20, scope: !852)
!854 = !DILocation(line: 38, column: 6, scope: !852)
!855 = !DILocation(line: 38, column: 6, scope: !780)
!856 = !DILocation(line: 39, column: 3, scope: !857)
!857 = distinct !DILexicalBlock(scope: !852, file: !2, line: 38, column: 24)
!858 = !DILocation(line: 39, column: 32, scope: !859)
!859 = distinct !DILexicalBlock(scope: !860, file: !2, line: 39, column: 12)
!860 = distinct !DILexicalBlock(scope: !857, file: !2, line: 39, column: 6)
!861 = !DILocation(line: 39, column: 35, scope: !859)
!862 = !DILocation(line: 39, column: 15, scope: !859)
!863 = !DILocation(line: 39, column: 12, scope: !860)
!864 = !DILocation(line: 39, column: 42, scope: !865)
!865 = distinct !DILexicalBlock(scope: !859, file: !2, line: 39, column: 40)
!866 = !DILocation(line: 39, column: 54, scope: !860)
!867 = !DILocation(line: 40, column: 2, scope: !857)
!868 = !DILocation(line: 41, column: 3, scope: !869)
!869 = distinct !DILexicalBlock(scope: !852, file: !2, line: 40, column: 9)
!870 = !DILocation(line: 41, column: 25, scope: !871)
!871 = distinct !DILexicalBlock(scope: !872, file: !2, line: 41, column: 12)
!872 = distinct !DILexicalBlock(scope: !869, file: !2, line: 41, column: 6)
!873 = !DILocation(line: 41, column: 39, scope: !871)
!874 = !DILocation(line: 41, column: 42, scope: !871)
!875 = !DILocation(line: 41, column: 28, scope: !871)
!876 = !DILocation(line: 41, column: 14, scope: !871)
!877 = !DILocation(line: 41, column: 12, scope: !872)
!878 = !DILocation(line: 41, column: 50, scope: !879)
!879 = distinct !DILexicalBlock(scope: !871, file: !2, line: 41, column: 48)
!880 = !DILocation(line: 41, column: 62, scope: !872)
!881 = !DILocation(line: 42, column: 3, scope: !869)
!882 = !DILocation(line: 42, column: 25, scope: !883)
!883 = distinct !DILexicalBlock(scope: !884, file: !2, line: 42, column: 12)
!884 = distinct !DILexicalBlock(scope: !869, file: !2, line: 42, column: 6)
!885 = !DILocation(line: 42, column: 40, scope: !883)
!886 = !DILocation(line: 42, column: 43, scope: !883)
!887 = !DILocation(line: 42, column: 28, scope: !883)
!888 = !DILocation(line: 42, column: 14, scope: !883)
!889 = !DILocation(line: 42, column: 12, scope: !884)
!890 = !DILocation(line: 42, column: 51, scope: !891)
!891 = distinct !DILexicalBlock(scope: !883, file: !2, line: 42, column: 49)
!892 = !DILocation(line: 42, column: 63, scope: !884)
!893 = !DILocation(line: 43, column: 25, scope: !894)
!894 = distinct !DILexicalBlock(scope: !869, file: !2, line: 43, column: 7)
!895 = !DILocation(line: 43, column: 28, scope: !894)
!896 = !DILocation(line: 43, column: 8, scope: !894)
!897 = !DILocation(line: 43, column: 7, scope: !869)
!898 = !DILocation(line: 44, column: 4, scope: !899)
!899 = distinct !DILexicalBlock(scope: !894, file: !2, line: 43, column: 32)
!900 = !DILocation(line: 44, column: 25, scope: !901)
!901 = distinct !DILexicalBlock(scope: !902, file: !2, line: 44, column: 13)
!902 = distinct !DILexicalBlock(scope: !899, file: !2, line: 44, column: 7)
!903 = !DILocation(line: 44, column: 44, scope: !901)
!904 = !DILocation(line: 44, column: 47, scope: !901)
!905 = !DILocation(line: 44, column: 28, scope: !901)
!906 = !DILocation(line: 44, column: 15, scope: !901)
!907 = !DILocation(line: 44, column: 13, scope: !902)
!908 = !DILocation(line: 44, column: 55, scope: !909)
!909 = distinct !DILexicalBlock(scope: !901, file: !2, line: 44, column: 53)
!910 = !DILocation(line: 44, column: 67, scope: !902)
!911 = !DILocation(line: 45, column: 4, scope: !899)
!912 = !DILocation(line: 45, column: 25, scope: !913)
!913 = distinct !DILexicalBlock(scope: !914, file: !2, line: 45, column: 13)
!914 = distinct !DILexicalBlock(scope: !899, file: !2, line: 45, column: 7)
!915 = !DILocation(line: 45, column: 44, scope: !913)
!916 = !DILocation(line: 45, column: 47, scope: !913)
!917 = !DILocation(line: 45, column: 28, scope: !913)
!918 = !DILocation(line: 45, column: 15, scope: !913)
!919 = !DILocation(line: 45, column: 13, scope: !914)
!920 = !DILocation(line: 45, column: 55, scope: !921)
!921 = distinct !DILexicalBlock(scope: !913, file: !2, line: 45, column: 53)
!922 = !DILocation(line: 45, column: 67, scope: !914)
!923 = !DILocation(line: 46, column: 3, scope: !899)
!924 = !DILocation(line: 48, column: 2, scope: !780)
!925 = !DILocation(line: 49, column: 1, scope: !780)
!926 = distinct !DISubprogram(name: "bucket_idx", scope: !127, file: !127, line: 250, type: !927, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!927 = !DISubroutineType(types: !928)
!928 = !{!135, !264, !929}
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunksz_t", file: !127, line: 62, baseType: !37)
!930 = !DILocalVariable(name: "h", arg: 1, scope: !926, file: !127, line: 250, type: !264)
!931 = !DILocation(line: 250, column: 45, scope: !926)
!932 = !DILocalVariable(name: "sz", arg: 2, scope: !926, file: !127, line: 250, type: !929)
!933 = !DILocation(line: 250, column: 58, scope: !926)
!934 = !DILocalVariable(name: "usable_sz", scope: !926, file: !127, line: 252, type: !39)
!935 = !DILocation(line: 252, column: 15, scope: !926)
!936 = !DILocation(line: 252, column: 27, scope: !926)
!937 = !DILocation(line: 252, column: 47, scope: !926)
!938 = !DILocation(line: 252, column: 32, scope: !926)
!939 = !DILocation(line: 252, column: 30, scope: !926)
!940 = !DILocation(line: 252, column: 50, scope: !926)
!941 = !DILocation(line: 253, column: 28, scope: !926)
!942 = !DILocation(line: 253, column: 14, scope: !926)
!943 = !DILocation(line: 253, column: 12, scope: !926)
!944 = !DILocation(line: 253, column: 2, scope: !926)
!945 = distinct !DISubprogram(name: "check_nexts", scope: !2, file: !2, line: 55, type: !946, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !264, !135}
!948 = !DILocalVariable(name: "h", arg: 1, scope: !945, file: !2, line: 55, type: !264)
!949 = !DILocation(line: 55, column: 47, scope: !945)
!950 = !DILocalVariable(name: "bidx", arg: 2, scope: !945, file: !2, line: 55, type: !135)
!951 = !DILocation(line: 55, column: 54, scope: !945)
!952 = !DILocalVariable(name: "b", scope: !945, file: !2, line: 57, type: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!954 = !DILocation(line: 57, column: 24, scope: !945)
!955 = !DILocation(line: 57, column: 29, scope: !945)
!956 = !DILocation(line: 57, column: 32, scope: !945)
!957 = !DILocation(line: 57, column: 40, scope: !945)
!958 = !DILocalVariable(name: "emptybit", scope: !945, file: !2, line: 59, type: !476)
!959 = !DILocation(line: 59, column: 8, scope: !945)
!960 = !DILocation(line: 59, column: 20, scope: !945)
!961 = !DILocation(line: 59, column: 23, scope: !945)
!962 = !DILocation(line: 59, column: 48, scope: !945)
!963 = !DILocation(line: 59, column: 44, scope: !945)
!964 = !DILocation(line: 59, column: 37, scope: !945)
!965 = !DILocation(line: 59, column: 56, scope: !945)
!966 = !DILocalVariable(name: "emptylist", scope: !945, file: !2, line: 60, type: !476)
!967 = !DILocation(line: 60, column: 8, scope: !945)
!968 = !DILocation(line: 60, column: 20, scope: !945)
!969 = !DILocation(line: 60, column: 23, scope: !945)
!970 = !DILocation(line: 60, column: 28, scope: !945)
!971 = !DILocalVariable(name: "empties_match", scope: !945, file: !2, line: 61, type: !476)
!972 = !DILocation(line: 61, column: 8, scope: !945)
!973 = !DILocation(line: 61, column: 24, scope: !945)
!974 = !DILocation(line: 61, column: 36, scope: !945)
!975 = !DILocation(line: 61, column: 33, scope: !945)
!976 = !DILocation(line: 63, column: 8, scope: !945)
!977 = !DILocation(line: 66, column: 6, scope: !978)
!978 = distinct !DILexicalBlock(scope: !945, file: !2, line: 66, column: 6)
!979 = !DILocation(line: 66, column: 9, scope: !978)
!980 = !DILocation(line: 66, column: 14, scope: !978)
!981 = !DILocation(line: 66, column: 6, scope: !945)
!982 = !DILocation(line: 68, column: 2, scope: !983)
!983 = distinct !DILexicalBlock(scope: !978, file: !2, line: 66, column: 20)
!984 = !DILocation(line: 69, column: 1, scope: !945)
!985 = distinct !DISubprogram(name: "set_chunk_used", scope: !127, file: !127, line: 147, type: !986, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!986 = !DISubroutineType(types: !987)
!987 = !{null, !264, !269, !476}
!988 = !DILocalVariable(name: "h", arg: 1, scope: !985, file: !127, line: 147, type: !264)
!989 = !DILocation(line: 147, column: 50, scope: !985)
!990 = !DILocalVariable(name: "c", arg: 2, scope: !985, file: !127, line: 147, type: !269)
!991 = !DILocation(line: 147, column: 63, scope: !985)
!992 = !DILocalVariable(name: "used", arg: 3, scope: !985, file: !127, line: 147, type: !476)
!993 = !DILocation(line: 147, column: 72, scope: !985)
!994 = !DILocalVariable(name: "buf", scope: !985, file: !127, line: 149, type: !140)
!995 = !DILocation(line: 149, column: 16, scope: !985)
!996 = !DILocation(line: 149, column: 32, scope: !985)
!997 = !DILocation(line: 149, column: 22, scope: !985)
!998 = !DILocalVariable(name: "cmem", scope: !985, file: !127, line: 150, type: !134)
!999 = !DILocation(line: 150, column: 8, scope: !985)
!1000 = !DILocation(line: 150, column: 16, scope: !985)
!1001 = !DILocation(line: 150, column: 20, scope: !985)
!1002 = !DILocation(line: 152, column: 15, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !985, file: !127, line: 152, column: 6)
!1004 = !DILocation(line: 152, column: 6, scope: !1003)
!1005 = !DILocation(line: 152, column: 6, scope: !985)
!1006 = !DILocation(line: 153, column: 7, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !127, line: 153, column: 7)
!1008 = distinct !DILexicalBlock(scope: !1003, file: !127, line: 152, column: 19)
!1009 = !DILocation(line: 153, column: 7, scope: !1008)
!1010 = !DILocation(line: 154, column: 17, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1007, file: !127, line: 153, column: 13)
!1012 = !DILocation(line: 154, column: 4, scope: !1011)
!1013 = !DILocation(line: 154, column: 38, scope: !1011)
!1014 = !DILocation(line: 155, column: 3, scope: !1011)
!1015 = !DILocation(line: 156, column: 17, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1007, file: !127, line: 155, column: 10)
!1017 = !DILocation(line: 156, column: 4, scope: !1016)
!1018 = !DILocation(line: 156, column: 38, scope: !1016)
!1019 = !DILocation(line: 158, column: 2, scope: !1008)
!1020 = !DILocation(line: 159, column: 7, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !127, line: 159, column: 7)
!1022 = distinct !DILexicalBlock(scope: !1003, file: !127, line: 158, column: 9)
!1023 = !DILocation(line: 159, column: 7, scope: !1022)
!1024 = !DILocation(line: 160, column: 17, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1021, file: !127, line: 159, column: 13)
!1026 = !DILocation(line: 160, column: 4, scope: !1025)
!1027 = !DILocation(line: 160, column: 38, scope: !1025)
!1028 = !DILocation(line: 161, column: 3, scope: !1025)
!1029 = !DILocation(line: 162, column: 17, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1021, file: !127, line: 161, column: 10)
!1031 = !DILocation(line: 162, column: 4, scope: !1030)
!1032 = !DILocation(line: 162, column: 38, scope: !1030)
!1033 = !DILocation(line: 165, column: 1, scope: !985)
!1034 = distinct !DISubprogram(name: "next_free_chunk", scope: !127, file: !127, line: 182, type: !768, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!1035 = !DILocalVariable(name: "h", arg: 1, scope: !1034, file: !127, line: 182, type: !264)
!1036 = !DILocation(line: 182, column: 56, scope: !1034)
!1037 = !DILocalVariable(name: "c", arg: 2, scope: !1034, file: !127, line: 182, type: !269)
!1038 = !DILocation(line: 182, column: 69, scope: !1034)
!1039 = !DILocation(line: 184, column: 21, scope: !1034)
!1040 = !DILocation(line: 184, column: 24, scope: !1034)
!1041 = !DILocation(line: 184, column: 9, scope: !1034)
!1042 = !DILocation(line: 184, column: 2, scope: !1034)
!1043 = distinct !DISubprogram(name: "chunk_used", scope: !127, file: !127, line: 137, type: !781, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!1044 = !DILocalVariable(name: "h", arg: 1, scope: !1043, file: !127, line: 137, type: !264)
!1045 = !DILocation(line: 137, column: 47, scope: !1043)
!1046 = !DILocalVariable(name: "c", arg: 2, scope: !1043, file: !127, line: 137, type: !269)
!1047 = !DILocation(line: 137, column: 60, scope: !1043)
!1048 = !DILocation(line: 139, column: 21, scope: !1043)
!1049 = !DILocation(line: 139, column: 24, scope: !1043)
!1050 = !DILocation(line: 139, column: 9, scope: !1043)
!1051 = !DILocation(line: 139, column: 42, scope: !1043)
!1052 = !DILocation(line: 139, column: 2, scope: !1043)
!1053 = distinct !DISubprogram(name: "solo_free_header", scope: !127, file: !127, line: 215, type: !781, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!1054 = !DILocalVariable(name: "h", arg: 1, scope: !1053, file: !127, line: 215, type: !264)
!1055 = !DILocation(line: 215, column: 53, scope: !1053)
!1056 = !DILocalVariable(name: "c", arg: 2, scope: !1053, file: !127, line: 215, type: !269)
!1057 = !DILocation(line: 215, column: 66, scope: !1053)
!1058 = !DILocation(line: 217, column: 18, scope: !1053)
!1059 = !DILocation(line: 217, column: 9, scope: !1053)
!1060 = !DILocation(line: 217, column: 21, scope: !1053)
!1061 = !DILocation(line: 217, column: 35, scope: !1053)
!1062 = !DILocation(line: 217, column: 38, scope: !1053)
!1063 = !DILocation(line: 217, column: 24, scope: !1053)
!1064 = !DILocation(line: 217, column: 41, scope: !1053)
!1065 = !DILocation(line: 0, scope: !1053)
!1066 = !DILocation(line: 217, column: 2, scope: !1053)
!1067 = distinct !DISubprogram(name: "left_chunk", scope: !127, file: !127, line: 199, type: !768, scopeLine: 200, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !40, retainedNodes: !149)
!1068 = !DILocalVariable(name: "h", arg: 1, scope: !1067, file: !127, line: 199, type: !264)
!1069 = !DILocation(line: 199, column: 51, scope: !1067)
!1070 = !DILocalVariable(name: "c", arg: 2, scope: !1067, file: !127, line: 199, type: !269)
!1071 = !DILocation(line: 199, column: 64, scope: !1067)
!1072 = !DILocation(line: 201, column: 9, scope: !1067)
!1073 = !DILocation(line: 201, column: 25, scope: !1067)
!1074 = !DILocation(line: 201, column: 28, scope: !1067)
!1075 = !DILocation(line: 201, column: 13, scope: !1067)
!1076 = !DILocation(line: 201, column: 11, scope: !1067)
!1077 = !DILocation(line: 201, column: 2, scope: !1067)
!1078 = distinct !DISubprogram(name: "sys_heap_stress", scope: !2, file: !2, line: 300, type: !1079, scopeLine: 307, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !40, retainedNodes: !149)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{null, !1081, !1084, !134, !281, !37, !134, !281, !135, !1087}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 32)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!134, !134, !281}
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 32)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{null, !134, !134}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 32)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap_stress_result", file: !261, line: 62, size: 192, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "total_allocs", scope: !1088, file: !261, line: 63, baseType: !37, size: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "successful_allocs", scope: !1088, file: !261, line: 64, baseType: !37, size: 32, offset: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "total_frees", scope: !1088, file: !261, line: 65, baseType: !37, size: 32, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "accumulated_in_use_bytes", scope: !1088, file: !261, line: 66, baseType: !150, size: 64, offset: 128)
!1094 = !DILocalVariable(name: "alloc_fn", arg: 1, scope: !1078, file: !2, line: 300, type: !1081)
!1095 = !DILocation(line: 300, column: 30, scope: !1078)
!1096 = !DILocalVariable(name: "free_fn", arg: 2, scope: !1078, file: !2, line: 301, type: !1084)
!1097 = !DILocation(line: 301, column: 15, scope: !1078)
!1098 = !DILocalVariable(name: "arg", arg: 3, scope: !1078, file: !2, line: 302, type: !134)
!1099 = !DILocation(line: 302, column: 14, scope: !1078)
!1100 = !DILocalVariable(name: "total_bytes", arg: 4, scope: !1078, file: !2, line: 302, type: !281)
!1101 = !DILocation(line: 302, column: 26, scope: !1078)
!1102 = !DILocalVariable(name: "op_count", arg: 5, scope: !1078, file: !2, line: 303, type: !37)
!1103 = !DILocation(line: 303, column: 17, scope: !1078)
!1104 = !DILocalVariable(name: "scratch_mem", arg: 6, scope: !1078, file: !2, line: 304, type: !134)
!1105 = !DILocation(line: 304, column: 14, scope: !1078)
!1106 = !DILocalVariable(name: "scratch_bytes", arg: 7, scope: !1078, file: !2, line: 304, type: !281)
!1107 = !DILocation(line: 304, column: 34, scope: !1078)
!1108 = !DILocalVariable(name: "target_percent", arg: 8, scope: !1078, file: !2, line: 305, type: !135)
!1109 = !DILocation(line: 305, column: 12, scope: !1078)
!1110 = !DILocalVariable(name: "result", arg: 9, scope: !1078, file: !2, line: 306, type: !1087)
!1111 = !DILocation(line: 306, column: 37, scope: !1078)
!1112 = !DILocalVariable(name: "sr", scope: !1078, file: !2, line: 308, type: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap_stress_rec", file: !2, line: 204, size: 288, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1125, !1126, !1127, !1128}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_fn", scope: !1113, file: !2, line: 205, baseType: !1081, size: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "free_fn", scope: !1113, file: !2, line: 206, baseType: !1084, size: 32, offset: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1113, file: !2, line: 207, baseType: !134, size: 32, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "total_bytes", scope: !1113, file: !2, line: 208, baseType: !281, size: 32, offset: 96)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !1113, file: !2, line: 209, baseType: !1120, size: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 32)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap_stress_block", file: !2, line: 216, size: 64, elements: !1122)
!1122 = !{!1123, !1124}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1121, file: !2, line: 217, baseType: !134, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !1121, file: !2, line: 218, baseType: !281, size: 32, offset: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "nblocks", scope: !1113, file: !2, line: 210, baseType: !281, size: 32, offset: 160)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_alloced", scope: !1113, file: !2, line: 211, baseType: !281, size: 32, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_alloced", scope: !1113, file: !2, line: 212, baseType: !281, size: 32, offset: 224)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "target_percent", scope: !1113, file: !2, line: 213, baseType: !37, size: 32, offset: 256)
!1129 = !DILocation(line: 308, column: 27, scope: !1078)
!1130 = !DILocation(line: 308, column: 32, scope: !1078)
!1131 = !DILocation(line: 309, column: 21, scope: !1078)
!1132 = !DILocation(line: 310, column: 20, scope: !1078)
!1133 = !DILocation(line: 311, column: 16, scope: !1078)
!1134 = !DILocation(line: 312, column: 24, scope: !1078)
!1135 = !DILocation(line: 313, column: 19, scope: !1078)
!1136 = !DILocation(line: 314, column: 20, scope: !1078)
!1137 = !DILocation(line: 314, column: 34, scope: !1078)
!1138 = !DILocation(line: 315, column: 27, scope: !1078)
!1139 = !DILocation(line: 318, column: 3, scope: !1078)
!1140 = !DILocation(line: 318, column: 12, scope: !1078)
!1141 = !DILocalVariable(name: "i", scope: !1142, file: !2, line: 320, type: !37)
!1142 = distinct !DILexicalBlock(scope: !1078, file: !2, line: 320, column: 2)
!1143 = !DILocation(line: 320, column: 16, scope: !1142)
!1144 = !DILocation(line: 320, column: 7, scope: !1142)
!1145 = !DILocation(line: 320, column: 23, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1142, file: !2, line: 320, column: 2)
!1147 = !DILocation(line: 320, column: 27, scope: !1146)
!1148 = !DILocation(line: 320, column: 25, scope: !1146)
!1149 = !DILocation(line: 320, column: 2, scope: !1142)
!1150 = !DILocation(line: 321, column: 7, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !2, line: 321, column: 7)
!1152 = distinct !DILexicalBlock(scope: !1146, file: !2, line: 320, column: 42)
!1153 = !DILocation(line: 321, column: 7, scope: !1152)
!1154 = !DILocalVariable(name: "sz", scope: !1155, file: !2, line: 322, type: !281)
!1155 = distinct !DILexicalBlock(scope: !1151, file: !2, line: 321, column: 31)
!1156 = !DILocation(line: 322, column: 11, scope: !1155)
!1157 = !DILocation(line: 322, column: 16, scope: !1155)
!1158 = !DILocalVariable(name: "p", scope: !1155, file: !2, line: 323, type: !134)
!1159 = !DILocation(line: 323, column: 10, scope: !1155)
!1160 = !DILocation(line: 323, column: 17, scope: !1155)
!1161 = !DILocation(line: 323, column: 29, scope: !1155)
!1162 = !DILocation(line: 323, column: 34, scope: !1155)
!1163 = !DILocation(line: 323, column: 14, scope: !1155)
!1164 = !DILocation(line: 325, column: 4, scope: !1155)
!1165 = !DILocation(line: 325, column: 12, scope: !1155)
!1166 = !DILocation(line: 325, column: 24, scope: !1155)
!1167 = !DILocation(line: 326, column: 8, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 326, column: 8)
!1169 = !DILocation(line: 326, column: 10, scope: !1168)
!1170 = !DILocation(line: 326, column: 8, scope: !1155)
!1171 = !DILocation(line: 327, column: 5, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1168, file: !2, line: 326, column: 25)
!1173 = !DILocation(line: 327, column: 13, scope: !1172)
!1174 = !DILocation(line: 327, column: 30, scope: !1172)
!1175 = !DILocation(line: 328, column: 40, scope: !1172)
!1176 = !DILocation(line: 328, column: 8, scope: !1172)
!1177 = !DILocation(line: 328, column: 18, scope: !1172)
!1178 = !DILocation(line: 328, column: 5, scope: !1172)
!1179 = !DILocation(line: 328, column: 34, scope: !1172)
!1180 = !DILocation(line: 328, column: 38, scope: !1172)
!1181 = !DILocation(line: 329, column: 39, scope: !1172)
!1182 = !DILocation(line: 329, column: 8, scope: !1172)
!1183 = !DILocation(line: 329, column: 18, scope: !1172)
!1184 = !DILocation(line: 329, column: 5, scope: !1172)
!1185 = !DILocation(line: 329, column: 34, scope: !1172)
!1186 = !DILocation(line: 329, column: 37, scope: !1172)
!1187 = !DILocation(line: 330, column: 8, scope: !1172)
!1188 = !DILocation(line: 330, column: 22, scope: !1172)
!1189 = !DILocation(line: 331, column: 25, scope: !1172)
!1190 = !DILocation(line: 331, column: 8, scope: !1172)
!1191 = !DILocation(line: 331, column: 22, scope: !1172)
!1192 = !DILocation(line: 332, column: 4, scope: !1172)
