; ModuleID = '../bc_files/heap.bc'
source_filename = "/home/sri/zephyrproject/zephyr/lib/os/heap.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }
%struct.sys_heap = type { ptr, ptr, i32 }
%struct.chunk_unit_t = type { [8 x i8] }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }


!29 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!30 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 23)
!31 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 24)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 25)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 26)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 27)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 28)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 29)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 30)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 31)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 32)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 33)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 34)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 35)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 36)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 37)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 38)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 39)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 40)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 41)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 42)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 43)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 44)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 45)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 46)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 47)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!85 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chunk_fields", file: !87, line: 54, baseType: !5, size: 8, elements: !88)
!87 = !DIFile(filename: "lib/os/heap.h", directory: "/home/sri/zephyrproject/zephyr")
!88 = !{!89, !90, !91, !92}
!89 = !DIEnumerator(name: "LEFT_SIZE", value: 0)
!90 = !DIEnumerator(name: "SIZE_AND_USED", value: 1)
!91 = !DIEnumerator(name: "FREE_PREV", value: 2)
!92 = !DIEnumerator(name: "FREE_NEXT", value: 3)
!93 = !{!94, !97, !100, !101, !110, !111, !129, !130, !131, !132}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 51, baseType: !96)
!95 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/string.h", directory: "")
!96 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !99, line: 62, baseType: !5)
!99 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!100 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_unit_t", file: !87, line: 58, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 58, size: 64, elements: !104)
!104 = !{!105}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !103, file: !87, line: 58, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 64, elements: !108)
!107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!108 = !{!109}
!109 = !DISubrange(count: 8)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !99, line: 102, baseType: !96)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !87, line: 68, size: 128, elements: !113)
!113 = !{!114, !120, !121, !122}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "chunk0_hdr", scope: !112, file: !87, line: 69, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !118)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunkid_t", file: !87, line: 61, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !99, line: 64, baseType: !96)
!118 = !{!119}
!119 = !DISubrange(count: 2)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "end_chunk", scope: !112, file: !87, line: 70, baseType: !116, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "avail_buckets", scope: !112, file: !87, line: 71, baseType: !117, size: 32, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !112, file: !87, line: 77, baseType: !123, offset: 128)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, elements: !127)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap_bucket", file: !87, line: 64, size: 32, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !124, file: !87, line: 65, baseType: !116, size: 32)
!127 = !{!128}
!128 = !DISubrange(count: 0)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!130 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !99, line: 63, baseType: !134)
!134 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!135 = !{i32 7, !"Dwarf Version", i32 4}
!136 = !{i32 2, !"Debug Info Version", i32 3}
!137 = !{i32 1, !"wchar_size", i32 4}
!138 = !{i32 1, !"static_rwdata", i32 1}
!139 = !{i32 1, !"enumsize_buildattr", i32 1}
!140 = !{i32 1, !"armlib_unavailable", i32 0}
!141 = !{i32 8, !"PIC Level", i32 2}
!142 = !{i32 7, !"PIE Level", i32 2}
!143 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!144 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !4, file: !4, line: 223, type: !145, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !147, !149}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !151, line: 250, size: 896, elements: !152)
!151 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!152 = !{!153, !218, !231, !232, !233, !234, !253}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !150, file: !151, line: 252, baseType: !154, size: 384)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !151, line: 58, size: 384, elements: !155)
!155 = !{!156, !182, !190, !191, !192, !203, !204, !205}
!156 = !DIDerivedType(tag: DW_TAG_member, scope: !154, file: !151, line: 61, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !154, file: !151, line: 61, size: 64, elements: !158)
!158 = !{!159, !175}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !157, file: !151, line: 62, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !161, line: 55, baseType: !162)
!161 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !161, line: 37, size: 64, elements: !163)
!163 = !{!164, !170}
!164 = !DIDerivedType(tag: DW_TAG_member, scope: !162, file: !161, line: 38, baseType: !165, size: 32)
!165 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !162, file: !161, line: 38, size: 32, elements: !166)
!166 = !{!167, !169}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !165, file: !161, line: 39, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !165, file: !161, line: 40, baseType: !168, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, scope: !162, file: !161, line: 42, baseType: !171, size: 32, offset: 32)
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !162, file: !161, line: 42, size: 32, elements: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !171, file: !161, line: 43, baseType: !168, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !171, file: !161, line: 44, baseType: !168, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !157, file: !151, line: 63, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !177, line: 58, size: 64, elements: !178)
!177 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!178 = !{!179}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !176, file: !177, line: 60, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 64, elements: !118)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !154, file: !151, line: 69, baseType: !183, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !185, line: 243, baseType: !186)
!185 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !185, line: 241, size: 64, elements: !187)
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !186, file: !185, line: 242, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !161, line: 51, baseType: !162)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !154, file: !151, line: 72, baseType: !98, size: 8, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !154, file: !151, line: 75, baseType: !98, size: 8, offset: 104)
!192 = !DIDerivedType(tag: DW_TAG_member, scope: !154, file: !151, line: 91, baseType: !193, size: 16, offset: 112)
!193 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !154, file: !151, line: 91, size: 16, elements: !194)
!194 = !{!195, !202}
!195 = !DIDerivedType(tag: DW_TAG_member, scope: !193, file: !151, line: 92, baseType: !196, size: 16)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !193, file: !151, line: 92, size: 16, elements: !197)
!197 = !{!198, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !196, file: !151, line: 97, baseType: !199, size: 8)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !99, line: 56, baseType: !200)
!200 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !196, file: !151, line: 98, baseType: !98, size: 8, offset: 8)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !193, file: !151, line: 101, baseType: !133, size: 16)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !154, file: !151, line: 108, baseType: !117, size: 32, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !154, file: !151, line: 132, baseType: !129, size: 32, offset: 160)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !154, file: !151, line: 136, baseType: !206, size: 192, offset: 192)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !185, line: 254, size: 192, elements: !207)
!207 = !{!208, !209, !215}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !206, file: !185, line: 255, baseType: !160, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !206, file: !185, line: 256, baseType: !210, size: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !185, line: 252, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !206, file: !185, line: 259, baseType: !216, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !99, line: 59, baseType: !217)
!217 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !150, file: !151, line: 255, baseType: !219, size: 288, offset: 384)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !220, line: 25, size: 288, elements: !221)
!220 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !219, file: !220, line: 26, baseType: !117, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !219, file: !220, line: 27, baseType: !117, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !219, file: !220, line: 28, baseType: !117, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !219, file: !220, line: 29, baseType: !117, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !219, file: !220, line: 30, baseType: !117, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !219, file: !220, line: 31, baseType: !117, size: 32, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !219, file: !220, line: 32, baseType: !117, size: 32, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !219, file: !220, line: 33, baseType: !117, size: 32, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !219, file: !220, line: 34, baseType: !117, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !150, file: !151, line: 258, baseType: !129, size: 32, offset: 672)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !150, file: !151, line: 261, baseType: !184, size: 64, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !150, file: !151, line: 302, baseType: !130, size: 32, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !150, file: !151, line: 333, baseType: !235, size: 32, offset: 800)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !237, line: 5291, size: 160, elements: !238)
!237 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!238 = !{!239, !248, !249}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !236, file: !237, line: 5292, baseType: !240, size: 96)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !241, line: 56, size: 96, elements: !242)
!241 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!242 = !{!243, !244, !245}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !240, file: !241, line: 57, baseType: !111, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !240, file: !241, line: 58, baseType: !129, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !240, file: !241, line: 59, baseType: !246, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !247, line: 46, baseType: !96)
!247 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!248 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !236, file: !237, line: 5293, baseType: !184, size: 64, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !236, file: !237, line: 5294, baseType: !250, offset: 160)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !251, line: 45, elements: !252)
!251 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!252 = !{}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !150, file: !151, line: 355, baseType: !254, size: 64, offset: 832)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !220, line: 60, size: 64, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !254, file: !220, line: 63, baseType: !117, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !254, file: !220, line: 66, baseType: !117, size: 32, offset: 32)
!258 = !DILocalVariable(name: "object", arg: 1, scope: !144, file: !4, line: 223, type: !147)
!259 = !DILocation(line: 223, column: 61, scope: !144)
!260 = !DILocalVariable(name: "thread", arg: 2, scope: !144, file: !4, line: 224, type: !149)
!261 = !DILocation(line: 224, column: 24, scope: !144)
!262 = !DILocation(line: 226, column: 9, scope: !144)
!263 = !DILocation(line: 227, column: 9, scope: !144)
!264 = !DILocation(line: 228, column: 1, scope: !144)
!265 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !4, file: !4, line: 243, type: !266, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !147}
!268 = !DILocalVariable(name: "object", arg: 1, scope: !265, file: !4, line: 243, type: !147)
!269 = !DILocation(line: 243, column: 56, scope: !265)
!270 = !DILocation(line: 245, column: 9, scope: !265)
!271 = !DILocation(line: 246, column: 1, scope: !265)
!272 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !4, file: !4, line: 359, type: !273, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!273 = !DISubroutineType(types: !274)
!274 = !{!129, !3}
!275 = !DILocalVariable(name: "otype", arg: 1, scope: !272, file: !4, line: 359, type: !3)
!276 = !DILocation(line: 359, column: 58, scope: !272)
!277 = !DILocation(line: 361, column: 9, scope: !272)
!278 = !DILocation(line: 363, column: 2, scope: !272)
!279 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !4, file: !4, line: 366, type: !280, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!280 = !DISubroutineType(types: !281)
!281 = !{!129, !3, !246}
!282 = !DILocalVariable(name: "otype", arg: 1, scope: !279, file: !4, line: 366, type: !3)
!283 = !DILocation(line: 366, column: 63, scope: !279)
!284 = !DILocalVariable(name: "size", arg: 2, scope: !279, file: !4, line: 367, type: !246)
!285 = !DILocation(line: 367, column: 13, scope: !279)
!286 = !DILocation(line: 369, column: 9, scope: !279)
!287 = !DILocation(line: 370, column: 9, scope: !279)
!288 = !DILocation(line: 372, column: 2, scope: !279)
!289 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !237, file: !237, line: 656, type: !290, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!290 = !DISubroutineType(types: !291)
!291 = !{!292, !294}
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !293, line: 46, baseType: !216)
!293 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!296 = !DILocalVariable(name: "t", arg: 1, scope: !289, file: !237, line: 657, type: !294)
!297 = !DILocation(line: 657, column: 30, scope: !289)
!298 = !DILocation(line: 659, column: 28, scope: !289)
!299 = !DILocation(line: 659, column: 31, scope: !289)
!300 = !DILocation(line: 659, column: 36, scope: !289)
!301 = !DILocation(line: 659, column: 9, scope: !289)
!302 = !DILocation(line: 659, column: 2, scope: !289)
!303 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !237, file: !237, line: 671, type: !290, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!304 = !DILocalVariable(name: "t", arg: 1, scope: !303, file: !237, line: 672, type: !294)
!305 = !DILocation(line: 672, column: 30, scope: !303)
!306 = !DILocation(line: 674, column: 30, scope: !303)
!307 = !DILocation(line: 674, column: 33, scope: !303)
!308 = !DILocation(line: 674, column: 38, scope: !303)
!309 = !DILocation(line: 674, column: 9, scope: !303)
!310 = !DILocation(line: 674, column: 2, scope: !303)
!311 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !237, file: !237, line: 1634, type: !312, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!312 = !DISubroutineType(types: !313)
!313 = !{!292, !314}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !237, line: 1439, size: 448, elements: !317)
!317 = !{!318, !319, !320, !325, !326, !331, !332}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !316, file: !237, line: 1445, baseType: !206, size: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !316, file: !237, line: 1448, baseType: !184, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !316, file: !237, line: 1451, baseType: !321, size: 32, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !324}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !316, file: !237, line: 1454, baseType: !321, size: 32, offset: 288)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !316, file: !237, line: 1457, baseType: !327, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !293, line: 67, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 65, size: 64, elements: !329)
!329 = !{!330}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !328, file: !293, line: 66, baseType: !292, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !316, file: !237, line: 1460, baseType: !117, size: 32, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !316, file: !237, line: 1463, baseType: !129, size: 32, offset: 416)
!333 = !DILocalVariable(name: "timer", arg: 1, scope: !311, file: !237, line: 1635, type: !314)
!334 = !DILocation(line: 1635, column: 34, scope: !311)
!335 = !DILocation(line: 1637, column: 28, scope: !311)
!336 = !DILocation(line: 1637, column: 35, scope: !311)
!337 = !DILocation(line: 1637, column: 9, scope: !311)
!338 = !DILocation(line: 1637, column: 2, scope: !311)
!339 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !237, file: !237, line: 1649, type: !312, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!340 = !DILocalVariable(name: "timer", arg: 1, scope: !339, file: !237, line: 1650, type: !314)
!341 = !DILocation(line: 1650, column: 34, scope: !339)
!342 = !DILocation(line: 1652, column: 30, scope: !339)
!343 = !DILocation(line: 1652, column: 37, scope: !339)
!344 = !DILocation(line: 1652, column: 9, scope: !339)
!345 = !DILocation(line: 1652, column: 2, scope: !339)
!346 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !237, file: !237, line: 1689, type: !347, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !324, !129}
!349 = !DILocalVariable(name: "timer", arg: 1, scope: !346, file: !237, line: 1689, type: !324)
!350 = !DILocation(line: 1689, column: 65, scope: !346)
!351 = !DILocalVariable(name: "user_data", arg: 2, scope: !346, file: !237, line: 1690, type: !129)
!352 = !DILocation(line: 1690, column: 19, scope: !346)
!353 = !DILocation(line: 1692, column: 21, scope: !346)
!354 = !DILocation(line: 1692, column: 2, scope: !346)
!355 = !DILocation(line: 1692, column: 9, scope: !346)
!356 = !DILocation(line: 1692, column: 19, scope: !346)
!357 = !DILocation(line: 1693, column: 1, scope: !346)
!358 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !237, file: !237, line: 1704, type: !359, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!359 = !DISubroutineType(types: !360)
!360 = !{!129, !314}
!361 = !DILocalVariable(name: "timer", arg: 1, scope: !358, file: !237, line: 1704, type: !314)
!362 = !DILocation(line: 1704, column: 72, scope: !358)
!363 = !DILocation(line: 1706, column: 9, scope: !358)
!364 = !DILocation(line: 1706, column: 16, scope: !358)
!365 = !DILocation(line: 1706, column: 2, scope: !358)
!366 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !237, file: !237, line: 2071, type: !367, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!367 = !DISubroutineType(types: !368)
!368 = !{!130, !369}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !237, line: 1830, size: 128, elements: !371)
!371 = !{!372, !385, !386}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !370, file: !237, line: 1831, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !374, line: 60, baseType: !375)
!374 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !374, line: 53, size: 64, elements: !376)
!376 = !{!377, !384}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !375, file: !374, line: 54, baseType: !378, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !374, line: 50, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !374, line: 44, size: 32, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !380, file: !374, line: 45, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !374, line: 40, baseType: !117)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !375, file: !374, line: 55, baseType: !378, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !370, file: !237, line: 1832, baseType: !250, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !370, file: !237, line: 1833, baseType: !184, size: 64, offset: 64)
!387 = !DILocalVariable(name: "queue", arg: 1, scope: !366, file: !237, line: 2071, type: !369)
!388 = !DILocation(line: 2071, column: 59, scope: !366)
!389 = !DILocation(line: 2073, column: 35, scope: !366)
!390 = !DILocation(line: 2073, column: 42, scope: !366)
!391 = !DILocation(line: 2073, column: 14, scope: !366)
!392 = !DILocation(line: 2073, column: 9, scope: !366)
!393 = !DILocation(line: 2073, column: 2, scope: !366)
!394 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !237, file: !237, line: 3209, type: !395, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!395 = !DISubroutineType(types: !396)
!396 = !{!96, !397}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !237, line: 3092, size: 128, elements: !399)
!399 = !{!400, !401, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !398, file: !237, line: 3093, baseType: !184, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !398, file: !237, line: 3094, baseType: !96, size: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !398, file: !237, line: 3095, baseType: !96, size: 32, offset: 96)
!403 = !DILocalVariable(name: "sem", arg: 1, scope: !394, file: !237, line: 3209, type: !397)
!404 = !DILocation(line: 3209, column: 65, scope: !394)
!405 = !DILocation(line: 3211, column: 9, scope: !394)
!406 = !DILocation(line: 3211, column: 14, scope: !394)
!407 = !DILocation(line: 3211, column: 2, scope: !394)
!408 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !237, file: !237, line: 4649, type: !409, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!409 = !DISubroutineType(types: !410)
!410 = !{!117, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !237, line: 4390, size: 320, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !420, !421, !422, !423, !424}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !412, file: !237, line: 4392, baseType: !184, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !412, file: !237, line: 4394, baseType: !250, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !412, file: !237, line: 4396, baseType: !246, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !412, file: !237, line: 4398, baseType: !117, size: 32, offset: 96)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !412, file: !237, line: 4400, baseType: !419, size: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !412, file: !237, line: 4402, baseType: !419, size: 32, offset: 160)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !412, file: !237, line: 4404, baseType: !419, size: 32, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !412, file: !237, line: 4406, baseType: !419, size: 32, offset: 224)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !412, file: !237, line: 4408, baseType: !117, size: 32, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !412, file: !237, line: 4413, baseType: !98, size: 8, offset: 288)
!425 = !DILocalVariable(name: "msgq", arg: 1, scope: !408, file: !237, line: 4649, type: !411)
!426 = !DILocation(line: 4649, column: 66, scope: !408)
!427 = !DILocation(line: 4651, column: 9, scope: !408)
!428 = !DILocation(line: 4651, column: 15, scope: !408)
!429 = !DILocation(line: 4651, column: 26, scope: !408)
!430 = !DILocation(line: 4651, column: 32, scope: !408)
!431 = !DILocation(line: 4651, column: 24, scope: !408)
!432 = !DILocation(line: 4651, column: 2, scope: !408)
!433 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !237, file: !237, line: 4665, type: !409, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!434 = !DILocalVariable(name: "msgq", arg: 1, scope: !433, file: !237, line: 4665, type: !411)
!435 = !DILocation(line: 4665, column: 66, scope: !433)
!436 = !DILocation(line: 4667, column: 9, scope: !433)
!437 = !DILocation(line: 4667, column: 15, scope: !433)
!438 = !DILocation(line: 4667, column: 2, scope: !433)
!439 = distinct !DISubprogram(name: "sys_heap_free", scope: !440, file: !440, line: 163, type: !441, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !252)
!440 = !DIFile(filename: "lib/os/heap.c", directory: "/home/sri/zephyrproject/zephyr")
!441 = !DISubroutineType(types: !442)
!442 = !{null, !443, !129}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!444 = !DILocalVariable(name: "heap", arg: 1, scope: !439, file: !440, line: 163, type: !443)
!445 = !DILocation(line: 163, column: 37, scope: !439)
!446 = !DILocalVariable(name: "mem", arg: 2, scope: !439, file: !440, line: 163, type: !129)
!447 = !DILocation(line: 163, column: 49, scope: !439)
!448 = !DILocation(line: 165, column: 6, scope: !449)
!449 = distinct !DILexicalBlock(scope: !439, file: !440, line: 165, column: 6)
!450 = !DILocation(line: 165, column: 10, scope: !449)
!451 = !DILocation(line: 165, column: 6, scope: !439)
!452 = !DILocation(line: 166, column: 3, scope: !453)
!453 = distinct !DILexicalBlock(scope: !449, file: !440, line: 165, column: 16)
!454 = !DILocalVariable(name: "h", scope: !439, file: !440, line: 168, type: !111)
!455 = !DILocation(line: 168, column: 17, scope: !439)
!456 = !DILocation(line: 168, column: 21, scope: !439)
!457 = !DILocation(line: 168, column: 27, scope: !439)
!458 = !DILocalVariable(name: "c", scope: !439, file: !440, line: 169, type: !116)
!459 = !DILocation(line: 169, column: 12, scope: !439)
!460 = !DILocation(line: 169, column: 31, scope: !439)
!461 = !DILocation(line: 169, column: 34, scope: !439)
!462 = !DILocation(line: 169, column: 16, scope: !439)
!463 = !DILocation(line: 187, column: 17, scope: !439)
!464 = !DILocation(line: 187, column: 20, scope: !439)
!465 = !DILocation(line: 187, column: 2, scope: !439)
!466 = !DILocation(line: 197, column: 13, scope: !439)
!467 = !DILocation(line: 197, column: 16, scope: !439)
!468 = !DILocation(line: 197, column: 2, scope: !439)
!469 = !DILocation(line: 198, column: 1, scope: !439)
!470 = distinct !DISubprogram(name: "mem_to_chunkid", scope: !440, file: !440, line: 157, type: !471, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !252)
!471 = !DISubroutineType(types: !472)
!472 = !{!116, !111, !129}
!473 = !DILocalVariable(name: "h", arg: 1, scope: !470, file: !440, line: 157, type: !111)
!474 = !DILocation(line: 157, column: 48, scope: !470)
!475 = !DILocalVariable(name: "p", arg: 2, scope: !470, file: !440, line: 157, type: !129)
!476 = !DILocation(line: 157, column: 57, scope: !470)
!477 = !DILocalVariable(name: "mem", scope: !470, file: !440, line: 159, type: !97)
!478 = !DILocation(line: 159, column: 11, scope: !470)
!479 = !DILocation(line: 159, column: 17, scope: !470)
