; ModuleID = '../bc_files/heap.bc'
source_filename = "/home/sri/zephyrproject/zephyr/lib/os/heap.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }
%struct.sys_heap = type { ptr, ptr, i32 }
%struct.chunk_unit_t = type { [8 x i8] }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }


!29 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 22)
!30 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!31 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 25)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 26)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 27)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 28)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 29)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 30)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 31)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 32)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 33)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 34)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 35)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 36)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 37)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 38)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 39)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 40)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 41)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 42)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 43)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 44)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 45)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 46)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 47)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!85 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chunk_fields", file: !87, line: 54, baseType: !5, size: 8, elements: !88)
!87 = !DIFile(filename: "lib/os/heap.h", directory: "/home/sri/zephyrproject/zephyr")
!88 = !{!89, !90, !91, !92}
!89 = !DIEnumerator(name: "LEFT_SIZE", value: 0)
!90 = !DIEnumerator(name: "SIZE_AND_USED", value: 1)
!91 = !DIEnumerator(name: "FREE_PREV", value: 2)
!92 = !DIEnumerator(name: "FREE_NEXT", value: 3)
!93 = !{!94, !97, !100, !101, !110, !111, !129, !130, !131, !132}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 51, baseType: !96)
!95 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/string.h", directory: "")
!96 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !99, line: 62, baseType: !5)
!99 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!100 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_unit_t", file: !87, line: 58, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !87, line: 58, size: 64, elements: !104)
!104 = !{!105}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !103, file: !87, line: 58, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 64, elements: !108)
!107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!108 = !{!109}
!109 = !DISubrange(count: 8)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !99, line: 102, baseType: !96)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !87, line: 68, size: 128, elements: !113)
!113 = !{!114, !120, !121, !122}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "chunk0_hdr", scope: !112, file: !87, line: 69, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !118)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunkid_t", file: !87, line: 61, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !99, line: 64, baseType: !96)
!118 = !{!119}
!119 = !DISubrange(count: 2)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "end_chunk", scope: !112, file: !87, line: 70, baseType: !116, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "avail_buckets", scope: !112, file: !87, line: 71, baseType: !117, size: 32, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !112, file: !87, line: 77, baseType: !123, offset: 128)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, elements: !127)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap_bucket", file: !87, line: 64, size: 32, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !124, file: !87, line: 65, baseType: !116, size: 32)
!127 = !{!128}
!128 = !DISubrange(count: 0)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!130 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !99, line: 63, baseType: !134)
!134 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!135 = !{i32 7, !"Dwarf Version", i32 4}
!136 = !{i32 2, !"Debug Info Version", i32 3}
!137 = !{i32 1, !"wchar_size", i32 4}
!138 = !{i32 1, !"static_rwdata", i32 1}
!139 = !{i32 1, !"enumsize_buildattr", i32 1}
!140 = !{i32 1, !"armlib_unavailable", i32 0}
!141 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!142 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !4, file: !4, line: 223, type: !143, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !256)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !145, !147}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !149, line: 250, size: 896, elements: !150)
!149 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!150 = !{!151, !216, !229, !230, !231, !232, !251}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !148, file: !149, line: 252, baseType: !152, size: 384)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !149, line: 58, size: 384, elements: !153)
!153 = !{!154, !180, !188, !189, !190, !201, !202, !203}
!154 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !149, line: 61, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !149, line: 61, size: 64, elements: !156)
!156 = !{!157, !173}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !155, file: !149, line: 62, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !159, line: 55, baseType: !160)
!159 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !159, line: 37, size: 64, elements: !161)
!161 = !{!162, !168}
!162 = !DIDerivedType(tag: DW_TAG_member, scope: !160, file: !159, line: 38, baseType: !163, size: 32)
!163 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !160, file: !159, line: 38, size: 32, elements: !164)
!164 = !{!165, !167}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !163, file: !159, line: 39, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !163, file: !159, line: 40, baseType: !166, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, scope: !160, file: !159, line: 42, baseType: !169, size: 32, offset: 32)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !160, file: !159, line: 42, size: 32, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !169, file: !159, line: 43, baseType: !166, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !169, file: !159, line: 44, baseType: !166, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !155, file: !149, line: 63, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !175, line: 58, size: 64, elements: !176)
!175 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !174, file: !175, line: 60, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 64, elements: !118)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !152, file: !149, line: 69, baseType: !181, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !183, line: 243, baseType: !184)
!183 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 241, size: 64, elements: !185)
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !184, file: !183, line: 242, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !159, line: 51, baseType: !160)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !152, file: !149, line: 72, baseType: !98, size: 8, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !152, file: !149, line: 75, baseType: !98, size: 8, offset: 104)
!190 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !149, line: 91, baseType: !191, size: 16, offset: 112)
!191 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !149, line: 91, size: 16, elements: !192)
!192 = !{!193, !200}
!193 = !DIDerivedType(tag: DW_TAG_member, scope: !191, file: !149, line: 92, baseType: !194, size: 16)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !191, file: !149, line: 92, size: 16, elements: !195)
!195 = !{!196, !199}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !194, file: !149, line: 97, baseType: !197, size: 8)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !99, line: 56, baseType: !198)
!198 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !194, file: !149, line: 98, baseType: !98, size: 8, offset: 8)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !191, file: !149, line: 101, baseType: !133, size: 16)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !152, file: !149, line: 108, baseType: !117, size: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !152, file: !149, line: 132, baseType: !129, size: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !152, file: !149, line: 136, baseType: !204, size: 192, offset: 192)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !183, line: 254, size: 192, elements: !205)
!205 = !{!206, !207, !213}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !204, file: !183, line: 255, baseType: !158, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !204, file: !183, line: 256, baseType: !208, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !183, line: 252, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !204, file: !183, line: 259, baseType: !214, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !99, line: 59, baseType: !215)
!215 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !148, file: !149, line: 255, baseType: !217, size: 288, offset: 384)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !218, line: 25, size: 288, elements: !219)
!218 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !228}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !217, file: !218, line: 26, baseType: !117, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !217, file: !218, line: 27, baseType: !117, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !217, file: !218, line: 28, baseType: !117, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !217, file: !218, line: 29, baseType: !117, size: 32, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !217, file: !218, line: 30, baseType: !117, size: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !217, file: !218, line: 31, baseType: !117, size: 32, offset: 160)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !217, file: !218, line: 32, baseType: !117, size: 32, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !217, file: !218, line: 33, baseType: !117, size: 32, offset: 224)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !217, file: !218, line: 34, baseType: !117, size: 32, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !148, file: !149, line: 258, baseType: !129, size: 32, offset: 672)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !148, file: !149, line: 261, baseType: !182, size: 64, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !148, file: !149, line: 302, baseType: !130, size: 32, offset: 768)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !148, file: !149, line: 333, baseType: !233, size: 32, offset: 800)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !235, line: 5291, size: 160, elements: !236)
!235 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!236 = !{!237, !246, !247}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !234, file: !235, line: 5292, baseType: !238, size: 96)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !239, line: 56, size: 96, elements: !240)
!239 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!240 = !{!241, !242, !243}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !238, file: !239, line: 57, baseType: !111, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !238, file: !239, line: 58, baseType: !129, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !238, file: !239, line: 59, baseType: !244, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !245, line: 46, baseType: !96)
!245 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!246 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !234, file: !235, line: 5293, baseType: !182, size: 64, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !234, file: !235, line: 5294, baseType: !248, offset: 160)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 45, elements: !250)
!249 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!250 = !{}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !148, file: !149, line: 355, baseType: !252, size: 64, offset: 832)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !218, line: 60, size: 64, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !252, file: !218, line: 63, baseType: !117, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !252, file: !218, line: 66, baseType: !117, size: 32, offset: 32)
!256 = !{!257, !258}
!257 = !DILocalVariable(name: "object", arg: 1, scope: !142, file: !4, line: 223, type: !145)
!258 = !DILocalVariable(name: "thread", arg: 2, scope: !142, file: !4, line: 224, type: !147)
!259 = !DILocation(line: 223, column: 61, scope: !142)
!260 = !DILocation(line: 224, column: 24, scope: !142)
!261 = !DILocation(line: 226, column: 9, scope: !142)
!262 = !DILocation(line: 227, column: 9, scope: !142)
!263 = !DILocation(line: 228, column: 1, scope: !142)
!264 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !4, file: !4, line: 243, type: !265, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !267)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !145}
!267 = !{!268}
!268 = !DILocalVariable(name: "object", arg: 1, scope: !264, file: !4, line: 243, type: !145)
!269 = !DILocation(line: 243, column: 56, scope: !264)
!270 = !DILocation(line: 245, column: 9, scope: !264)
!271 = !DILocation(line: 246, column: 1, scope: !264)
!272 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !4, file: !4, line: 359, type: !273, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !275)
!273 = !DISubroutineType(types: !274)
!274 = !{!129, !3}
!275 = !{!276}
!276 = !DILocalVariable(name: "otype", arg: 1, scope: !272, file: !4, line: 359, type: !3)
!277 = !DILocation(line: 359, column: 58, scope: !272)
!278 = !DILocation(line: 361, column: 9, scope: !272)
!279 = !DILocation(line: 363, column: 2, scope: !272)
!280 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !4, file: !4, line: 366, type: !281, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !283)
!281 = !DISubroutineType(types: !282)
!282 = !{!129, !3, !244}
!283 = !{!284, !285}
!284 = !DILocalVariable(name: "otype", arg: 1, scope: !280, file: !4, line: 366, type: !3)
!285 = !DILocalVariable(name: "size", arg: 2, scope: !280, file: !4, line: 367, type: !244)
!286 = !DILocation(line: 366, column: 63, scope: !280)
!287 = !DILocation(line: 367, column: 13, scope: !280)
!288 = !DILocation(line: 369, column: 9, scope: !280)
!289 = !DILocation(line: 370, column: 9, scope: !280)
!290 = !DILocation(line: 372, column: 2, scope: !280)
!291 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !235, file: !235, line: 656, type: !292, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !298)
!292 = !DISubroutineType(types: !293)
!293 = !{!294, !296}
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !295, line: 46, baseType: !214)
!295 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!298 = !{!299}
!299 = !DILocalVariable(name: "t", arg: 1, scope: !291, file: !235, line: 657, type: !296)
!300 = !DILocation(line: 657, column: 30, scope: !291)
!301 = !DILocation(line: 659, column: 28, scope: !291)
!302 = !DILocation(line: 659, column: 31, scope: !291)
!303 = !DILocation(line: 659, column: 36, scope: !291)
!304 = !DILocation(line: 659, column: 9, scope: !291)
!305 = !DILocation(line: 659, column: 2, scope: !291)
!306 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !235, file: !235, line: 671, type: !292, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !307)
!307 = !{!308}
!308 = !DILocalVariable(name: "t", arg: 1, scope: !306, file: !235, line: 672, type: !296)
!309 = !DILocation(line: 672, column: 30, scope: !306)
!310 = !DILocation(line: 674, column: 30, scope: !306)
!311 = !DILocation(line: 674, column: 33, scope: !306)
!312 = !DILocation(line: 674, column: 38, scope: !306)
!313 = !DILocation(line: 674, column: 9, scope: !306)
!314 = !DILocation(line: 674, column: 2, scope: !306)
!315 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !235, file: !235, line: 1634, type: !316, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !337)
!316 = !DISubroutineType(types: !317)
!317 = !{!294, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !235, line: 1439, size: 448, elements: !321)
!321 = !{!322, !323, !324, !329, !330, !335, !336}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !320, file: !235, line: 1445, baseType: !204, size: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !320, file: !235, line: 1448, baseType: !182, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !320, file: !235, line: 1451, baseType: !325, size: 32, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !320, file: !235, line: 1454, baseType: !325, size: 32, offset: 288)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !320, file: !235, line: 1457, baseType: !331, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !295, line: 67, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !295, line: 65, size: 64, elements: !333)
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !332, file: !295, line: 66, baseType: !294, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !320, file: !235, line: 1460, baseType: !117, size: 32, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !320, file: !235, line: 1463, baseType: !129, size: 32, offset: 416)
!337 = !{!338}
!338 = !DILocalVariable(name: "timer", arg: 1, scope: !315, file: !235, line: 1635, type: !318)
!339 = !DILocation(line: 1635, column: 34, scope: !315)
!340 = !DILocation(line: 1637, column: 28, scope: !315)
!341 = !DILocation(line: 1637, column: 35, scope: !315)
!342 = !DILocation(line: 1637, column: 9, scope: !315)
!343 = !DILocation(line: 1637, column: 2, scope: !315)
!344 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !235, file: !235, line: 1649, type: !316, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !345)
!345 = !{!346}
!346 = !DILocalVariable(name: "timer", arg: 1, scope: !344, file: !235, line: 1650, type: !318)
!347 = !DILocation(line: 1650, column: 34, scope: !344)
!348 = !DILocation(line: 1652, column: 30, scope: !344)
!349 = !DILocation(line: 1652, column: 37, scope: !344)
!350 = !DILocation(line: 1652, column: 9, scope: !344)
!351 = !DILocation(line: 1652, column: 2, scope: !344)
!352 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !235, file: !235, line: 1689, type: !353, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !355)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !328, !129}
!355 = !{!356, !357}
!356 = !DILocalVariable(name: "timer", arg: 1, scope: !352, file: !235, line: 1689, type: !328)
!357 = !DILocalVariable(name: "user_data", arg: 2, scope: !352, file: !235, line: 1690, type: !129)
!358 = !DILocation(line: 1689, column: 65, scope: !352)
!359 = !DILocation(line: 1690, column: 19, scope: !352)
!360 = !DILocation(line: 1692, column: 21, scope: !352)
!361 = !DILocation(line: 1692, column: 2, scope: !352)
!362 = !DILocation(line: 1692, column: 9, scope: !352)
!363 = !DILocation(line: 1692, column: 19, scope: !352)
!364 = !DILocation(line: 1693, column: 1, scope: !352)
!365 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !235, file: !235, line: 1704, type: !366, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !368)
!366 = !DISubroutineType(types: !367)
!367 = !{!129, !318}
!368 = !{!369}
!369 = !DILocalVariable(name: "timer", arg: 1, scope: !365, file: !235, line: 1704, type: !318)
!370 = !DILocation(line: 1704, column: 72, scope: !365)
!371 = !DILocation(line: 1706, column: 9, scope: !365)
!372 = !DILocation(line: 1706, column: 16, scope: !365)
!373 = !DILocation(line: 1706, column: 2, scope: !365)
!374 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !235, file: !235, line: 2071, type: !375, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !395)
!375 = !DISubroutineType(types: !376)
!376 = !{!130, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !235, line: 1830, size: 128, elements: !379)
!379 = !{!380, !393, !394}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !378, file: !235, line: 1831, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !382, line: 60, baseType: !383)
!382 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !382, line: 53, size: 64, elements: !384)
!384 = !{!385, !392}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !383, file: !382, line: 54, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !382, line: 50, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !382, line: 44, size: 32, elements: !389)
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !388, file: !382, line: 45, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !382, line: 40, baseType: !117)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !383, file: !382, line: 55, baseType: !386, size: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !378, file: !235, line: 1832, baseType: !248, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !378, file: !235, line: 1833, baseType: !182, size: 64, offset: 64)
!395 = !{!396}
!396 = !DILocalVariable(name: "queue", arg: 1, scope: !374, file: !235, line: 2071, type: !377)
!397 = !DILocation(line: 2071, column: 59, scope: !374)
!398 = !DILocation(line: 2073, column: 35, scope: !374)
!399 = !DILocation(line: 2073, column: 42, scope: !374)
!400 = !DILocation(line: 2073, column: 14, scope: !374)
!401 = !DILocation(line: 2073, column: 9, scope: !374)
!402 = !DILocation(line: 2073, column: 2, scope: !374)
!403 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !235, file: !235, line: 3209, type: !404, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !412)
!404 = !DISubroutineType(types: !405)
!405 = !{!96, !406}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !235, line: 3092, size: 128, elements: !408)
!408 = !{!409, !410, !411}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !407, file: !235, line: 3093, baseType: !182, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !407, file: !235, line: 3094, baseType: !96, size: 32, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !407, file: !235, line: 3095, baseType: !96, size: 32, offset: 96)
!412 = !{!413}
!413 = !DILocalVariable(name: "sem", arg: 1, scope: !403, file: !235, line: 3209, type: !406)
!414 = !DILocation(line: 3209, column: 65, scope: !403)
!415 = !DILocation(line: 3211, column: 9, scope: !403)
!416 = !DILocation(line: 3211, column: 14, scope: !403)
!417 = !DILocation(line: 3211, column: 2, scope: !403)
!418 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !235, file: !235, line: 4649, type: !419, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !435)
!419 = !DISubroutineType(types: !420)
!420 = !{!117, !421}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !235, line: 4390, size: 320, elements: !423)
!423 = !{!424, !425, !426, !427, !428, !430, !431, !432, !433, !434}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !422, file: !235, line: 4392, baseType: !182, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !422, file: !235, line: 4394, baseType: !248, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !422, file: !235, line: 4396, baseType: !244, size: 32, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !422, file: !235, line: 4398, baseType: !117, size: 32, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !422, file: !235, line: 4400, baseType: !429, size: 32, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !422, file: !235, line: 4402, baseType: !429, size: 32, offset: 160)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !422, file: !235, line: 4404, baseType: !429, size: 32, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !422, file: !235, line: 4406, baseType: !429, size: 32, offset: 224)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !422, file: !235, line: 4408, baseType: !117, size: 32, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !422, file: !235, line: 4413, baseType: !98, size: 8, offset: 288)
!435 = !{!436}
!436 = !DILocalVariable(name: "msgq", arg: 1, scope: !418, file: !235, line: 4649, type: !421)
!437 = !DILocation(line: 4649, column: 66, scope: !418)
!438 = !DILocation(line: 4651, column: 9, scope: !418)
!439 = !DILocation(line: 4651, column: 15, scope: !418)
!440 = !DILocation(line: 4651, column: 26, scope: !418)
!441 = !DILocation(line: 4651, column: 32, scope: !418)
!442 = !DILocation(line: 4651, column: 24, scope: !418)
!443 = !DILocation(line: 4651, column: 2, scope: !418)
!444 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !235, file: !235, line: 4665, type: !419, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !445)
!445 = !{!446}
!446 = !DILocalVariable(name: "msgq", arg: 1, scope: !444, file: !235, line: 4665, type: !421)
!447 = !DILocation(line: 4665, column: 66, scope: !444)
!448 = !DILocation(line: 4667, column: 9, scope: !444)
!449 = !DILocation(line: 4667, column: 15, scope: !444)
!450 = !DILocation(line: 4667, column: 2, scope: !444)
!451 = distinct !DISubprogram(name: "sys_heap_free", scope: !452, file: !452, line: 163, type: !453, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !456)
!452 = !DIFile(filename: "lib/os/heap.c", directory: "/home/sri/zephyrproject/zephyr")
!453 = !DISubroutineType(types: !454)
!454 = !{null, !455, !129}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!456 = !{!457, !458, !459, !460}
!457 = !DILocalVariable(name: "heap", arg: 1, scope: !451, file: !452, line: 163, type: !455)
!458 = !DILocalVariable(name: "mem", arg: 2, scope: !451, file: !452, line: 163, type: !129)
!459 = !DILocalVariable(name: "h", scope: !451, file: !452, line: 168, type: !111)
!460 = !DILocalVariable(name: "c", scope: !451, file: !452, line: 169, type: !116)
!461 = !DILocation(line: 163, column: 37, scope: !451)
!462 = !DILocation(line: 163, column: 49, scope: !451)
!463 = !DILocation(line: 165, column: 6, scope: !464)
!464 = distinct !DILexicalBlock(scope: !451, file: !452, line: 165, column: 6)
!465 = !DILocation(line: 165, column: 10, scope: !464)
!466 = !DILocation(line: 165, column: 6, scope: !451)
!467 = !DILocation(line: 166, column: 3, scope: !468)
!468 = distinct !DILexicalBlock(scope: !464, file: !452, line: 165, column: 16)
!469 = !DILocation(line: 168, column: 2, scope: !451)
!470 = !DILocation(line: 168, column: 17, scope: !451)
!471 = !DILocation(line: 168, column: 21, scope: !451)
!472 = !DILocation(line: 168, column: 27, scope: !451)
!473 = !DILocation(line: 169, column: 2, scope: !451)
!474 = !DILocation(line: 169, column: 12, scope: !451)
!475 = !DILocation(line: 169, column: 31, scope: !451)
!476 = !DILocation(line: 169, column: 34, scope: !451)
!477 = !DILocation(line: 169, column: 16, scope: !451)
!478 = !DILocation(line: 187, column: 17, scope: !451)
!479 = !DILocation(line: 187, column: 20, scope: !451)
!480 = !DILocation(line: 187, column: 2, scope: !451)
!481 = !DILocation(line: 197, column: 13, scope: !451)
!482 = !DILocation(line: 197, column: 16, scope: !451)
!483 = !DILocation(line: 197, column: 2, scope: !451)
!484 = !DILocation(line: 198, column: 1, scope: !451)
!485 = distinct !DISubprogram(name: "mem_to_chunkid", scope: !452, file: !452, line: 157, type: !486, scopeLine: 158, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !488)
!486 = !DISubroutineType(types: !487)
!487 = !{!116, !111, !129}
!488 = !{!489, !490, !491, !492}
!489 = !DILocalVariable(name: "h", arg: 1, scope: !485, file: !452, line: 157, type: !111)
!490 = !DILocalVariable(name: "p", arg: 2, scope: !485, file: !452, line: 157, type: !129)
