; ModuleID = '../bc_files/init.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/init.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.log_source_const_data = type { ptr, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.z_kernel = type { [1 x %struct._cpu], %struct._ready_q }
%struct._cpu = type { i32, ptr, ptr, ptr, i8, %struct._cpu_arch }
%struct._cpu_arch = type {}
%struct._ready_q = type { ptr, %struct._dnode }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }

!76 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!101 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !103, line: 66, baseType: !104, size: 8, elements: !105)
!103 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!104 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!106 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!107 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!108 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!109 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!110 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!111 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!112 = !DIEnumerator(name: "PVD_VDDIO2_IRQn", value: 1)
!113 = !DIEnumerator(name: "RTC_IRQn", value: 2)
!114 = !DIEnumerator(name: "FLASH_IRQn", value: 3)
!115 = !DIEnumerator(name: "RCC_CRS_IRQn", value: 4)
!116 = !DIEnumerator(name: "EXTI0_1_IRQn", value: 5)
!117 = !DIEnumerator(name: "EXTI2_3_IRQn", value: 6)
!118 = !DIEnumerator(name: "EXTI4_15_IRQn", value: 7)
!119 = !DIEnumerator(name: "TSC_IRQn", value: 8)
!120 = !DIEnumerator(name: "DMA1_Ch1_IRQn", value: 9)
!121 = !DIEnumerator(name: "DMA1_Ch2_3_DMA2_Ch1_2_IRQn", value: 10)
!122 = !DIEnumerator(name: "DMA1_Ch4_7_DMA2_Ch3_5_IRQn", value: 11)
!123 = !DIEnumerator(name: "ADC1_COMP_IRQn", value: 12)
!124 = !DIEnumerator(name: "TIM1_BRK_UP_TRG_COM_IRQn", value: 13)
!125 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 14)
!126 = !DIEnumerator(name: "TIM2_IRQn", value: 15)
!127 = !DIEnumerator(name: "TIM3_IRQn", value: 16)
!128 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 17)
!129 = !DIEnumerator(name: "TIM7_IRQn", value: 18)
!130 = !DIEnumerator(name: "TIM14_IRQn", value: 19)
!131 = !DIEnumerator(name: "TIM15_IRQn", value: 20)
!132 = !DIEnumerator(name: "TIM16_IRQn", value: 21)
!133 = !DIEnumerator(name: "TIM17_IRQn", value: 22)
!134 = !DIEnumerator(name: "I2C1_IRQn", value: 23)
!135 = !DIEnumerator(name: "I2C2_IRQn", value: 24)
!136 = !DIEnumerator(name: "SPI1_IRQn", value: 25)
!137 = !DIEnumerator(name: "SPI2_IRQn", value: 26)
!138 = !DIEnumerator(name: "USART1_IRQn", value: 27)
!139 = !DIEnumerator(name: "USART2_IRQn", value: 28)
!140 = !DIEnumerator(name: "USART3_8_IRQn", value: 29)
!141 = !DIEnumerator(name: "CEC_CAN_IRQn", value: 30)
!142 = !{!143, !146, !147, !148, !189, !190, !188, !192, !193, !221}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !144, line: 51, baseType: !145)
!144 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/string.h", directory: "")
!145 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!147 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "entropy_driver_api", file: !151, line: 54, size: 64, elements: !152)
!151 = !DIFile(filename: "include/zephyr/drivers/entropy.h", directory: "/home/sri/zephyrproject/zephyr")
!152 = !{!153, !183}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "get_entropy", scope: !150, file: !151, line: 55, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "entropy_get_entropy_t", file: !151, line: 41, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!156 = !DISubroutineType(types: !157)
!157 = !{!147, !158, !180, !181}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !161, line: 381, size: 160, elements: !162)
!161 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!162 = !{!163, !166, !169, !170, !179}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !161, line: 383, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !160, file: !161, line: 385, baseType: !167, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !160, file: !161, line: 387, baseType: !167, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !160, file: !161, line: 389, baseType: !171, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !161, line: 354, size: 16, elements: !173)
!173 = !{!174, !177}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !172, file: !161, line: 362, baseType: !175, size: 8)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !176, line: 62, baseType: !13)
!176 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!177 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !172, file: !161, line: 367, baseType: !178, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!178 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !161, line: 391, baseType: !146, size: 32, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !176, line: 63, baseType: !182)
!182 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "get_entropy_isr", scope: !150, file: !151, line: 56, baseType: !184, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "entropy_get_entropy_isr_t", file: !151, line: 50, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{!147, !158, !180, !181, !188}
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !176, line: 64, baseType: !145)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !191, line: 46, baseType: !145)
!191 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !176, line: 58, baseType: !147)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !195, line: 326, baseType: !196)
!195 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/sri/zephyrproject")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 314, size: 6400, elements: !197)
!197 = !{!198, !203, !207, !208, !209, !210, !211, !212, !213, !217}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !196, file: !195, line: 316, baseType: !199, size: 32)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 32, elements: !201)
!200 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !188)
!201 = !{!202}
!202 = !DISubrange(count: 1)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !196, file: !195, line: 317, baseType: !204, size: 992, offset: 32)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 992, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 31)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !196, file: !195, line: 318, baseType: !199, size: 32, offset: 1024)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !196, file: !195, line: 319, baseType: !204, size: 992, offset: 1056)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !196, file: !195, line: 320, baseType: !199, size: 32, offset: 2048)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !196, file: !195, line: 321, baseType: !204, size: 992, offset: 2080)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !196, file: !195, line: 322, baseType: !199, size: 32, offset: 3072)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !196, file: !195, line: 323, baseType: !204, size: 992, offset: 3104)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !196, file: !195, line: 324, baseType: !214, size: 2048, offset: 4096)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 2048, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !196, file: !195, line: 325, baseType: !218, size: 256, offset: 6144)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 256, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 8)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !195, line: 352, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 341, size: 320, elements: !224)
!224 = !{!225, !227, !228, !229, !230, !231, !232, !233, !237}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !223, file: !195, line: 343, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !223, file: !195, line: 344, baseType: !200, size: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !223, file: !195, line: 345, baseType: !188, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !223, file: !195, line: 346, baseType: !200, size: 32, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !223, file: !195, line: 347, baseType: !200, size: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !223, file: !195, line: 348, baseType: !200, size: 32, offset: 160)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !223, file: !195, line: 349, baseType: !188, size: 32, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !223, file: !195, line: 350, baseType: !234, size: 64, offset: 224)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 64, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 2)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !223, file: !195, line: 351, baseType: !200, size: 32, offset: 288)
!238 = !{!0, !7, !239, !368, !373, !382, !384, !387, !392, !394, !399, !424}
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "_kernel", scope: !9, file: !2, line: 45, type: !241, isLocal: false, isDefinition: true)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_kernel", file: !242, line: 159, size: 256, elements: !243)
!242 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!243 = !{!244, !363}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cpus", scope: !241, file: !242, line: 160, baseType: !245, size: 160)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 160, elements: !201)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpu", file: !242, line: 101, size: 160, elements: !247)
!247 = !{!248, !249, !250, !358, !359, !360}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !246, file: !242, line: 103, baseType: !188, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "irq_stack", scope: !246, file: !242, line: 106, baseType: !189, size: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !246, file: !242, line: 109, baseType: !251, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !253, line: 250, size: 896, elements: !254)
!253 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!254 = !{!255, !318, !331, !332, !333, !334, !353}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !252, file: !253, line: 252, baseType: !256, size: 384)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !253, line: 58, size: 384, elements: !257)
!257 = !{!258, !284, !291, !292, !293, !303, !304, !305}
!258 = !DIDerivedType(tag: DW_TAG_member, scope: !256, file: !253, line: 61, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !253, line: 61, size: 64, elements: !260)
!260 = !{!261, !277}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !259, file: !253, line: 62, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !263, line: 55, baseType: !264)
!263 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !263, line: 37, size: 64, elements: !265)
!265 = !{!266, !272}
!266 = !DIDerivedType(tag: DW_TAG_member, scope: !264, file: !263, line: 38, baseType: !267, size: 32)
!267 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !264, file: !263, line: 38, size: 32, elements: !268)
!268 = !{!269, !271}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !267, file: !263, line: 39, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !263, line: 40, baseType: !270, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, scope: !264, file: !263, line: 42, baseType: !273, size: 32, offset: 32)
!273 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !264, file: !263, line: 42, size: 32, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !273, file: !263, line: 43, baseType: !270, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !273, file: !263, line: 44, baseType: !270, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !259, file: !253, line: 63, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !279, line: 58, size: 64, elements: !280)
!279 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !278, file: !279, line: 60, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 64, elements: !235)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !256, file: !253, line: 69, baseType: !285, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !242, line: 243, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 241, size: 64, elements: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !287, file: !242, line: 242, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !263, line: 51, baseType: !264)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !256, file: !253, line: 72, baseType: !175, size: 8, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !256, file: !253, line: 75, baseType: !175, size: 8, offset: 104)
!293 = !DIDerivedType(tag: DW_TAG_member, scope: !256, file: !253, line: 91, baseType: !294, size: 16, offset: 112)
!294 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !253, line: 91, size: 16, elements: !295)
!295 = !{!296, !302}
!296 = !DIDerivedType(tag: DW_TAG_member, scope: !294, file: !253, line: 92, baseType: !297, size: 16)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !294, file: !253, line: 92, size: 16, elements: !298)
!298 = !{!299, !301}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !297, file: !253, line: 97, baseType: !300, size: 8)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !176, line: 56, baseType: !104)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !297, file: !253, line: 98, baseType: !175, size: 8, offset: 8)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !294, file: !253, line: 101, baseType: !181, size: 16)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !256, file: !253, line: 108, baseType: !188, size: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !256, file: !253, line: 132, baseType: !146, size: 32, offset: 160)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !256, file: !253, line: 136, baseType: !306, size: 192, offset: 192)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !242, line: 254, size: 192, elements: !307)
!307 = !{!308, !309, !315}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !306, file: !242, line: 255, baseType: !262, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !306, file: !242, line: 256, baseType: !310, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !242, line: 252, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !314}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !306, file: !242, line: 259, baseType: !316, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !176, line: 59, baseType: !317)
!317 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !252, file: !253, line: 255, baseType: !319, size: 288, offset: 384)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !320, line: 25, size: 288, elements: !321)
!320 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !319, file: !320, line: 26, baseType: !188, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !319, file: !320, line: 27, baseType: !188, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !319, file: !320, line: 28, baseType: !188, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !319, file: !320, line: 29, baseType: !188, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !319, file: !320, line: 30, baseType: !188, size: 32, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !319, file: !320, line: 31, baseType: !188, size: 32, offset: 160)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !319, file: !320, line: 32, baseType: !188, size: 32, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !319, file: !320, line: 33, baseType: !188, size: 32, offset: 224)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !319, file: !320, line: 34, baseType: !188, size: 32, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !252, file: !253, line: 258, baseType: !146, size: 32, offset: 672)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !252, file: !253, line: 261, baseType: !286, size: 64, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !252, file: !253, line: 302, baseType: !147, size: 32, offset: 768)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !252, file: !253, line: 333, baseType: !335, size: 32, offset: 800)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !337, line: 5291, size: 160, elements: !338)
!337 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!338 = !{!339, !348, !349}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !336, file: !337, line: 5292, baseType: !340, size: 96)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !341, line: 56, size: 96, elements: !342)
!341 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!342 = !{!343, !346, !347}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !340, file: !341, line: 57, baseType: !344, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !341, line: 57, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !340, file: !341, line: 58, baseType: !146, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !340, file: !341, line: 59, baseType: !190, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !336, file: !337, line: 5293, baseType: !286, size: 64, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !336, file: !337, line: 5294, baseType: !350, offset: 160)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !351, line: 45, elements: !352)
!351 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!352 = !{}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !252, file: !253, line: 355, baseType: !354, size: 64, offset: 832)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !320, line: 60, size: 64, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !354, file: !320, line: 63, baseType: !188, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !354, file: !320, line: 66, baseType: !188, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "idle_thread", scope: !246, file: !242, line: 112, baseType: !251, size: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !246, file: !242, line: 124, baseType: !175, size: 8, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !246, file: !242, line: 154, baseType: !361, offset: 136)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpu_arch", file: !362, line: 35, elements: !352)
!362 = !DIFile(filename: "include/zephyr/arch/structs.h", directory: "/home/sri/zephyrproject/zephyr")
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ready_q", scope: !241, file: !242, line: 171, baseType: !364, size: 96, offset: 160)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ready_q", file: !242, line: 84, size: 96, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !364, file: !242, line: 87, baseType: !251, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "runq", scope: !364, file: !242, line: 91, baseType: !290, size: 64, offset: 32)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "_cpus_active", scope: !9, file: !2, line: 48, type: !370, isLocal: false, isDefinition: true)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !371, line: 22, baseType: !372)
!371 = !DIFile(filename: "include/zephyr/sys/atomic.h", directory: "/home/sri/zephyrproject/zephyr")
!372 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "z_main_stack", scope: !9, file: !2, line: 51, type: !375, isLocal: false, isDefinition: true, align: 64)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 8192, elements: !380)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !377, line: 47, size: 8, elements: !378)
!377 = !DIFile(filename: "include/zephyr/kernel/thread_stack.h", directory: "/home/sri/zephyrproject/zephyr")
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !376, file: !377, line: 48, baseType: !4, size: 8)
!380 = !{!381}
!381 = !DISubrange(count: 1024)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "z_main_thread", scope: !9, file: !2, line: 52, type: !252, isLocal: false, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "z_idle_threads", scope: !9, file: !2, line: 56, type: !386, isLocal: false, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 896, elements: !201)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "z_interrupt_stacks", scope: !9, file: !2, line: 94, type: !389, isLocal: false, isDefinition: true, align: 64)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 16384, elements: !390)
!390 = !{!202, !391}
!391 = !DISubrange(count: 2048)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "z_sys_post_kernel", scope: !9, file: !2, line: 255, type: !178, isLocal: false, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "z_idle_stacks", scope: !9, file: !2, line: 58, type: !396, isLocal: true, isDefinition: true, align: 64)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 2048, elements: !397)
!397 = !{!202, !398}
!398 = !DISubrange(count: 256)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "levels", scope: !401, file: !2, line: 270, type: !404, isLocal: true, isDefinition: true)
!401 = distinct !DISubprogram(name: "z_sys_init_run_level", scope: !2, file: !2, line: 268, type: !402, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !12}
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 192, elements: !422)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !408, line: 92, size: 64, elements: !409)
!408 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!409 = !{!410, !421}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !407, file: !408, line: 94, baseType: !411, size: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !408, line: 59, size: 32, elements: !412)
!412 = !{!413, !417}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !411, file: !408, line: 66, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!415 = !DISubroutineType(types: !416)
!416 = !{!147}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !411, file: !408, line: 75, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 32)
!419 = !DISubroutineType(types: !420)
!420 = !{!147, !158}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !407, file: !408, line: 99, baseType: !158, size: 32, offset: 32)
!422 = !{!423}
!423 = !DISubrange(count: 6)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 484, type: !426, isLocal: true, isDefinition: true)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 5)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !431, line: 17, size: 64, elements: !432)
!431 = !DIFile(filename: "include/zephyr/logging/log_instance.h", directory: "/home/sri/zephyrproject/zephyr")
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !430, file: !431, line: 18, baseType: !164, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !430, file: !431, line: 19, baseType: !175, size: 8, offset: 32)
!435 = !{i32 7, !"Dwarf Version", i32 4}
!436 = !{i32 2, !"Debug Info Version", i32 3}
!437 = !{i32 1, !"wchar_size", i32 4}
!438 = !{i32 1, !"static_rwdata", i32 1}
!439 = !{i32 1, !"enumsize_buildattr", i32 1}
!440 = !{i32 1, !"armlib_unavailable", i32 0}
!441 = !{i32 8, !"PIC Level", i32 2}
!442 = !{i32 7, !"PIE Level", i32 2}
!443 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!444 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !21, file: !21, line: 223, type: !445, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !167, !251}
!447 = !DILocalVariable(name: "object", arg: 1, scope: !444, file: !21, line: 223, type: !167)
!448 = !DILocation(line: 223, column: 61, scope: !444)
!449 = !DILocalVariable(name: "thread", arg: 2, scope: !444, file: !21, line: 224, type: !251)
!450 = !DILocation(line: 224, column: 24, scope: !444)
!451 = !DILocation(line: 226, column: 9, scope: !444)
!452 = !DILocation(line: 227, column: 9, scope: !444)
!453 = !DILocation(line: 228, column: 1, scope: !444)
!454 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !21, file: !21, line: 243, type: !455, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !167}
!457 = !DILocalVariable(name: "object", arg: 1, scope: !454, file: !21, line: 243, type: !167)
!458 = !DILocation(line: 243, column: 56, scope: !454)
!459 = !DILocation(line: 245, column: 9, scope: !454)
!460 = !DILocation(line: 246, column: 1, scope: !454)
!461 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !21, file: !21, line: 359, type: !462, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!462 = !DISubroutineType(types: !463)
!463 = !{!146, !20}
!464 = !DILocalVariable(name: "otype", arg: 1, scope: !461, file: !21, line: 359, type: !20)
!465 = !DILocation(line: 359, column: 58, scope: !461)
!466 = !DILocation(line: 361, column: 9, scope: !461)
!467 = !DILocation(line: 363, column: 2, scope: !461)
!468 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !21, file: !21, line: 366, type: !469, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!469 = !DISubroutineType(types: !470)
!470 = !{!146, !20, !190}
!471 = !DILocalVariable(name: "otype", arg: 1, scope: !468, file: !21, line: 366, type: !20)
!472 = !DILocation(line: 366, column: 63, scope: !468)
!473 = !DILocalVariable(name: "size", arg: 2, scope: !468, file: !21, line: 367, type: !190)
!474 = !DILocation(line: 367, column: 13, scope: !468)
!475 = !DILocation(line: 369, column: 9, scope: !468)
!476 = !DILocation(line: 370, column: 9, scope: !468)
!477 = !DILocation(line: 372, column: 2, scope: !468)
!478 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !337, file: !337, line: 656, type: !479, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!479 = !DISubroutineType(types: !480)
!480 = !{!481, !483}
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !482, line: 46, baseType: !316)
!482 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!485 = !DILocalVariable(name: "t", arg: 1, scope: !478, file: !337, line: 657, type: !483)
!486 = !DILocation(line: 657, column: 30, scope: !478)
!487 = !DILocation(line: 659, column: 28, scope: !478)
!488 = !DILocation(line: 659, column: 31, scope: !478)
!489 = !DILocation(line: 659, column: 36, scope: !478)
!490 = !DILocation(line: 659, column: 9, scope: !478)
!491 = !DILocation(line: 659, column: 2, scope: !478)
!492 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !337, file: !337, line: 671, type: !479, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!493 = !DILocalVariable(name: "t", arg: 1, scope: !492, file: !337, line: 672, type: !483)
!494 = !DILocation(line: 672, column: 30, scope: !492)
!495 = !DILocation(line: 674, column: 30, scope: !492)
!496 = !DILocation(line: 674, column: 33, scope: !492)
!497 = !DILocation(line: 674, column: 38, scope: !492)
!498 = !DILocation(line: 674, column: 9, scope: !492)
!499 = !DILocation(line: 674, column: 2, scope: !492)
!500 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !337, file: !337, line: 1634, type: !501, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!501 = !DISubroutineType(types: !502)
!502 = !{!481, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !337, line: 1439, size: 448, elements: !506)
!506 = !{!507, !508, !509, !514, !515, !520, !521}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !505, file: !337, line: 1445, baseType: !306, size: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !505, file: !337, line: 1448, baseType: !286, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !505, file: !337, line: 1451, baseType: !510, size: 32, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !505, file: !337, line: 1454, baseType: !510, size: 32, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !505, file: !337, line: 1457, baseType: !516, size: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !482, line: 67, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 65, size: 64, elements: !518)
!518 = !{!519}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !517, file: !482, line: 66, baseType: !481, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !505, file: !337, line: 1460, baseType: !188, size: 32, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !505, file: !337, line: 1463, baseType: !146, size: 32, offset: 416)
!522 = !DILocalVariable(name: "timer", arg: 1, scope: !500, file: !337, line: 1635, type: !503)
!523 = !DILocation(line: 1635, column: 34, scope: !500)
!524 = !DILocation(line: 1637, column: 28, scope: !500)
!525 = !DILocation(line: 1637, column: 35, scope: !500)
!526 = !DILocation(line: 1637, column: 9, scope: !500)
!527 = !DILocation(line: 1637, column: 2, scope: !500)
!528 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !337, file: !337, line: 1649, type: !501, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!529 = !DILocalVariable(name: "timer", arg: 1, scope: !528, file: !337, line: 1650, type: !503)
!530 = !DILocation(line: 1650, column: 34, scope: !528)
!531 = !DILocation(line: 1652, column: 30, scope: !528)
!532 = !DILocation(line: 1652, column: 37, scope: !528)
!533 = !DILocation(line: 1652, column: 9, scope: !528)
!534 = !DILocation(line: 1652, column: 2, scope: !528)
!535 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !337, file: !337, line: 1689, type: !536, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !513, !146}
!538 = !DILocalVariable(name: "timer", arg: 1, scope: !535, file: !337, line: 1689, type: !513)
!539 = !DILocation(line: 1689, column: 65, scope: !535)
!540 = !DILocalVariable(name: "user_data", arg: 2, scope: !535, file: !337, line: 1690, type: !146)
!541 = !DILocation(line: 1690, column: 19, scope: !535)
!542 = !DILocation(line: 1692, column: 21, scope: !535)
!543 = !DILocation(line: 1692, column: 2, scope: !535)
!544 = !DILocation(line: 1692, column: 9, scope: !535)
!545 = !DILocation(line: 1692, column: 19, scope: !535)
!546 = !DILocation(line: 1693, column: 1, scope: !535)
!547 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !337, file: !337, line: 1704, type: !548, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!548 = !DISubroutineType(types: !549)
!549 = !{!146, !503}
!550 = !DILocalVariable(name: "timer", arg: 1, scope: !547, file: !337, line: 1704, type: !503)
!551 = !DILocation(line: 1704, column: 72, scope: !547)
!552 = !DILocation(line: 1706, column: 9, scope: !547)
!553 = !DILocation(line: 1706, column: 16, scope: !547)
!554 = !DILocation(line: 1706, column: 2, scope: !547)
!555 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !337, file: !337, line: 2071, type: !556, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!556 = !DISubroutineType(types: !557)
!557 = !{!147, !558}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !337, line: 1830, size: 128, elements: !560)
!560 = !{!561, !574, !575}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !559, file: !337, line: 1831, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !563, line: 60, baseType: !564)
!563 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !563, line: 53, size: 64, elements: !565)
!565 = !{!566, !573}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !564, file: !563, line: 54, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !563, line: 50, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !563, line: 44, size: 32, elements: !570)
!570 = !{!571}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !569, file: !563, line: 45, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !563, line: 40, baseType: !188)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !564, file: !563, line: 55, baseType: !567, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !559, file: !337, line: 1832, baseType: !350, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !559, file: !337, line: 1833, baseType: !286, size: 64, offset: 64)
!576 = !DILocalVariable(name: "queue", arg: 1, scope: !555, file: !337, line: 2071, type: !558)
!577 = !DILocation(line: 2071, column: 59, scope: !555)
!578 = !DILocation(line: 2073, column: 35, scope: !555)
!579 = !DILocation(line: 2073, column: 42, scope: !555)
!580 = !DILocation(line: 2073, column: 14, scope: !555)
!581 = !DILocation(line: 2073, column: 9, scope: !555)
!582 = !DILocation(line: 2073, column: 2, scope: !555)
!583 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !337, file: !337, line: 3209, type: !584, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!584 = !DISubroutineType(types: !585)
!585 = !{!145, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !337, line: 3092, size: 128, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !587, file: !337, line: 3093, baseType: !286, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !587, file: !337, line: 3094, baseType: !145, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !587, file: !337, line: 3095, baseType: !145, size: 32, offset: 96)
!592 = !DILocalVariable(name: "sem", arg: 1, scope: !583, file: !337, line: 3209, type: !586)
!593 = !DILocation(line: 3209, column: 65, scope: !583)
!594 = !DILocation(line: 3211, column: 9, scope: !583)
!595 = !DILocation(line: 3211, column: 14, scope: !583)
!596 = !DILocation(line: 3211, column: 2, scope: !583)
!597 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !337, file: !337, line: 4649, type: !598, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!598 = !DISubroutineType(types: !599)
!599 = !{!188, !600}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !337, line: 4390, size: 320, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !601, file: !337, line: 4392, baseType: !286, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !601, file: !337, line: 4394, baseType: !350, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !601, file: !337, line: 4396, baseType: !190, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !601, file: !337, line: 4398, baseType: !188, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !601, file: !337, line: 4400, baseType: !189, size: 32, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !601, file: !337, line: 4402, baseType: !189, size: 32, offset: 160)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !601, file: !337, line: 4404, baseType: !189, size: 32, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !601, file: !337, line: 4406, baseType: !189, size: 32, offset: 224)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !601, file: !337, line: 4408, baseType: !188, size: 32, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !601, file: !337, line: 4413, baseType: !175, size: 8, offset: 288)
!613 = !DILocalVariable(name: "msgq", arg: 1, scope: !597, file: !337, line: 4649, type: !600)
!614 = !DILocation(line: 4649, column: 66, scope: !597)
!615 = !DILocation(line: 4651, column: 9, scope: !597)
!616 = !DILocation(line: 4651, column: 15, scope: !597)
!617 = !DILocation(line: 4651, column: 26, scope: !597)
!618 = !DILocation(line: 4651, column: 32, scope: !597)
!619 = !DILocation(line: 4651, column: 24, scope: !597)
!620 = !DILocation(line: 4651, column: 2, scope: !597)
!621 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !337, file: !337, line: 4665, type: !598, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!622 = !DILocalVariable(name: "msgq", arg: 1, scope: !621, file: !337, line: 4665, type: !600)
!623 = !DILocation(line: 4665, column: 66, scope: !621)
!624 = !DILocation(line: 4667, column: 9, scope: !621)
!625 = !DILocation(line: 4667, column: 15, scope: !621)
!626 = !DILocation(line: 4667, column: 2, scope: !621)
!627 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !161, file: !161, line: 744, type: !628, scopeLine: 745, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!628 = !DISubroutineType(types: !629)
!629 = !{!178, !158}
!630 = !DILocalVariable(name: "dev", arg: 1, scope: !627, file: !161, line: 744, type: !158)
!631 = !DILocation(line: 744, column: 65, scope: !627)
!632 = !DILocation(line: 746, column: 27, scope: !627)
!633 = !DILocation(line: 746, column: 9, scope: !627)
!634 = !DILocation(line: 746, column: 2, scope: !627)
!635 = distinct !DISubprogram(name: "z_impl_entropy_get_entropy", scope: !151, file: !151, line: 73, type: !156, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !352)
!636 = !DILocalVariable(name: "dev", arg: 1, scope: !635, file: !151, line: 73, type: !158)
!637 = !DILocation(line: 73, column: 67, scope: !635)
!638 = !DILocalVariable(name: "buffer", arg: 2, scope: !635, file: !151, line: 74, type: !180)
!639 = !DILocation(line: 74, column: 20, scope: !635)
!640 = !DILocalVariable(name: "length", arg: 3, scope: !635, file: !151, line: 75, type: !181)
!641 = !DILocation(line: 75, column: 20, scope: !635)
!642 = !DILocalVariable(name: "api", scope: !635, file: !151, line: 77, type: !148)
!643 = !DILocation(line: 77, column: 35, scope: !635)
!644 = !DILocation(line: 78, column: 38, scope: !635)
!645 = !DILocation(line: 78, column: 43, scope: !635)
!646 = !DILocation(line: 82, column: 9, scope: !635)
!647 = !DILocation(line: 82, column: 14, scope: !635)
!648 = !DILocation(line: 82, column: 26, scope: !635)
!649 = !DILocation(line: 82, column: 31, scope: !635)
!650 = !DILocation(line: 82, column: 39, scope: !635)
!651 = !DILocation(line: 82, column: 2, scope: !635)
!652 = distinct !DISubprogram(name: "z_early_memset", scope: !2, file: !2, line: 142, type: !653, scopeLine: 143, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !352)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !146, !147, !143}
!655 = !DILocalVariable(name: "dst", arg: 1, scope: !652, file: !2, line: 142, type: !146)
!656 = !DILocation(line: 142, column: 53, scope: !652)
!657 = !DILocalVariable(name: "c", arg: 2, scope: !652, file: !2, line: 142, type: !147)
!658 = !DILocation(line: 142, column: 62, scope: !652)
!659 = !DILocalVariable(name: "n", arg: 3, scope: !652, file: !2, line: 142, type: !143)
!660 = !DILocation(line: 142, column: 72, scope: !652)
!661 = !DILocation(line: 144, column: 16, scope: !652)
!662 = !DILocation(line: 144, column: 21, scope: !652)
!663 = !DILocation(line: 144, column: 9, scope: !652)
!664 = !DILocation(line: 144, column: 24, scope: !652)
!665 = !DILocation(line: 145, column: 1, scope: !652)
