; ModuleID = '../bc_files/init.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/init.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.z_kernel = type { [1 x %struct._cpu], %struct._ready_q }
%struct._cpu = type { i32, ptr, ptr, ptr, i8, %struct._cpu_arch }
%struct._cpu_arch = type {}
%struct._ready_q = type { ptr, %struct._dnode }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}

!71 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!95 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !97, line: 66, baseType: !98, size: 8, elements: !99)
!97 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!98 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!100 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!101 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!102 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!103 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!104 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!105 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!106 = !DIEnumerator(name: "PVD_VDDIO2_IRQn", value: 1)
!107 = !DIEnumerator(name: "RTC_IRQn", value: 2)
!108 = !DIEnumerator(name: "FLASH_IRQn", value: 3)
!109 = !DIEnumerator(name: "RCC_CRS_IRQn", value: 4)
!110 = !DIEnumerator(name: "EXTI0_1_IRQn", value: 5)
!111 = !DIEnumerator(name: "EXTI2_3_IRQn", value: 6)
!112 = !DIEnumerator(name: "EXTI4_15_IRQn", value: 7)
!113 = !DIEnumerator(name: "TSC_IRQn", value: 8)
!114 = !DIEnumerator(name: "DMA1_Ch1_IRQn", value: 9)
!115 = !DIEnumerator(name: "DMA1_Ch2_3_DMA2_Ch1_2_IRQn", value: 10)
!116 = !DIEnumerator(name: "DMA1_Ch4_7_DMA2_Ch3_5_IRQn", value: 11)
!117 = !DIEnumerator(name: "ADC1_COMP_IRQn", value: 12)
!118 = !DIEnumerator(name: "TIM1_BRK_UP_TRG_COM_IRQn", value: 13)
!119 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 14)
!120 = !DIEnumerator(name: "TIM2_IRQn", value: 15)
!121 = !DIEnumerator(name: "TIM3_IRQn", value: 16)
!122 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 17)
!123 = !DIEnumerator(name: "TIM7_IRQn", value: 18)
!124 = !DIEnumerator(name: "TIM14_IRQn", value: 19)
!125 = !DIEnumerator(name: "TIM15_IRQn", value: 20)
!126 = !DIEnumerator(name: "TIM16_IRQn", value: 21)
!127 = !DIEnumerator(name: "TIM17_IRQn", value: 22)
!128 = !DIEnumerator(name: "I2C1_IRQn", value: 23)
!129 = !DIEnumerator(name: "I2C2_IRQn", value: 24)
!130 = !DIEnumerator(name: "SPI1_IRQn", value: 25)
!131 = !DIEnumerator(name: "SPI2_IRQn", value: 26)
!132 = !DIEnumerator(name: "USART1_IRQn", value: 27)
!133 = !DIEnumerator(name: "USART2_IRQn", value: 28)
!134 = !DIEnumerator(name: "USART3_8_IRQn", value: 29)
!135 = !DIEnumerator(name: "CEC_CAN_IRQn", value: 30)
!136 = !{!137, !140, !141, !142, !184, !185, !183, !187, !188, !216}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !138, line: 51, baseType: !139)
!138 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/string.h", directory: "")
!139 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!141 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "entropy_driver_api", file: !145, line: 54, size: 64, elements: !146)
!145 = !DIFile(filename: "include/zephyr/drivers/entropy.h", directory: "/home/sri/zephyrproject/zephyr")
!146 = !{!147, !178}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "get_entropy", scope: !144, file: !145, line: 55, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "entropy_get_entropy_t", file: !145, line: 41, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{!141, !152, !175, !176}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !155, line: 381, size: 160, elements: !156)
!155 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!156 = !{!157, !161, !164, !165, !174}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !155, line: 383, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !154, file: !155, line: 385, baseType: !162, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !154, file: !155, line: 387, baseType: !162, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !154, file: !155, line: 389, baseType: !166, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !155, line: 354, size: 16, elements: !168)
!168 = !{!169, !172}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !167, file: !155, line: 362, baseType: !170, size: 8)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !171, line: 62, baseType: !7)
!171 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!172 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !167, file: !155, line: 367, baseType: !173, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!173 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !154, file: !155, line: 391, baseType: !140, size: 32, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !171, line: 63, baseType: !177)
!177 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "get_entropy_isr", scope: !144, file: !145, line: 56, baseType: !179, size: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "entropy_get_entropy_isr_t", file: !145, line: 50, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DISubroutineType(types: !182)
!182 = !{!141, !152, !175, !176, !183}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !171, line: 64, baseType: !139)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 46, baseType: !139)
!186 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !171, line: 58, baseType: !141)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !190, line: 326, baseType: !191)
!190 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/sri/zephyrproject")
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !190, line: 314, size: 6400, elements: !192)
!192 = !{!193, !198, !202, !203, !204, !205, !206, !207, !208, !212}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !191, file: !190, line: 316, baseType: !194, size: 32)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 32, elements: !196)
!195 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !183)
!196 = !{!197}
!197 = !DISubrange(count: 1)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !191, file: !190, line: 317, baseType: !199, size: 992, offset: 32)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 992, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 31)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !191, file: !190, line: 318, baseType: !194, size: 32, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !191, file: !190, line: 319, baseType: !199, size: 992, offset: 1056)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !191, file: !190, line: 320, baseType: !194, size: 32, offset: 2048)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !191, file: !190, line: 321, baseType: !199, size: 992, offset: 2080)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !191, file: !190, line: 322, baseType: !194, size: 32, offset: 3072)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !191, file: !190, line: 323, baseType: !199, size: 992, offset: 3104)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !191, file: !190, line: 324, baseType: !209, size: 2048, offset: 4096)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 2048, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !191, file: !190, line: 325, baseType: !213, size: 256, offset: 6144)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 256, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 8)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !190, line: 352, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !190, line: 341, size: 320, elements: !219)
!219 = !{!220, !222, !223, !224, !225, !226, !227, !228, !232}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !218, file: !190, line: 343, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !218, file: !190, line: 344, baseType: !195, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !218, file: !190, line: 345, baseType: !183, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !218, file: !190, line: 346, baseType: !195, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !218, file: !190, line: 347, baseType: !195, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !218, file: !190, line: 348, baseType: !195, size: 32, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !218, file: !190, line: 349, baseType: !183, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !218, file: !190, line: 350, baseType: !229, size: 64, offset: 224)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 64, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 2)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !218, file: !190, line: 351, baseType: !195, size: 32, offset: 288)
!233 = !{!234, !363, !368, !377, !0, !379, !384, !386, !391, !426}
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "_kernel", scope: !2, file: !6, line: 45, type: !236, isLocal: false, isDefinition: true)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_kernel", file: !237, line: 159, size: 256, elements: !238)
!237 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!238 = !{!239, !358}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "cpus", scope: !236, file: !237, line: 160, baseType: !240, size: 160)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 160, elements: !196)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpu", file: !237, line: 101, size: 160, elements: !242)
!242 = !{!243, !244, !245, !353, !354, !355}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !241, file: !237, line: 103, baseType: !183, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "irq_stack", scope: !241, file: !237, line: 106, baseType: !184, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !241, file: !237, line: 109, baseType: !246, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !248, line: 250, size: 896, elements: !249)
!248 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!249 = !{!250, !313, !326, !327, !328, !329, !348}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !247, file: !248, line: 252, baseType: !251, size: 384)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !248, line: 58, size: 384, elements: !252)
!252 = !{!253, !279, !286, !287, !288, !298, !299, !300}
!253 = !DIDerivedType(tag: DW_TAG_member, scope: !251, file: !248, line: 61, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !251, file: !248, line: 61, size: 64, elements: !255)
!255 = !{!256, !272}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !254, file: !248, line: 62, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !258, line: 55, baseType: !259)
!258 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !258, line: 37, size: 64, elements: !260)
!260 = !{!261, !267}
!261 = !DIDerivedType(tag: DW_TAG_member, scope: !259, file: !258, line: 38, baseType: !262, size: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !259, file: !258, line: 38, size: 32, elements: !263)
!263 = !{!264, !266}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !262, file: !258, line: 39, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !262, file: !258, line: 40, baseType: !265, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, scope: !259, file: !258, line: 42, baseType: !268, size: 32, offset: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !259, file: !258, line: 42, size: 32, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !268, file: !258, line: 43, baseType: !265, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !268, file: !258, line: 44, baseType: !265, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !254, file: !248, line: 63, baseType: !273, size: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !274, line: 58, size: 64, elements: !275)
!274 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!275 = !{!276}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !273, file: !274, line: 60, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 64, elements: !230)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !251, file: !248, line: 69, baseType: !280, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !237, line: 243, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 241, size: 64, elements: !283)
!283 = !{!284}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !282, file: !237, line: 242, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !258, line: 51, baseType: !259)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !251, file: !248, line: 72, baseType: !170, size: 8, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !251, file: !248, line: 75, baseType: !170, size: 8, offset: 104)
!288 = !DIDerivedType(tag: DW_TAG_member, scope: !251, file: !248, line: 91, baseType: !289, size: 16, offset: 112)
!289 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !251, file: !248, line: 91, size: 16, elements: !290)
!290 = !{!291, !297}
!291 = !DIDerivedType(tag: DW_TAG_member, scope: !289, file: !248, line: 92, baseType: !292, size: 16)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !289, file: !248, line: 92, size: 16, elements: !293)
!293 = !{!294, !296}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !292, file: !248, line: 97, baseType: !295, size: 8)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !171, line: 56, baseType: !98)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !292, file: !248, line: 98, baseType: !170, size: 8, offset: 8)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !289, file: !248, line: 101, baseType: !176, size: 16)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !251, file: !248, line: 108, baseType: !183, size: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !251, file: !248, line: 132, baseType: !140, size: 32, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !251, file: !248, line: 136, baseType: !301, size: 192, offset: 192)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !237, line: 254, size: 192, elements: !302)
!302 = !{!303, !304, !310}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !301, file: !237, line: 255, baseType: !257, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !301, file: !237, line: 256, baseType: !305, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !237, line: 252, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !301, file: !237, line: 259, baseType: !311, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !171, line: 59, baseType: !312)
!312 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !247, file: !248, line: 255, baseType: !314, size: 288, offset: 384)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !315, line: 25, size: 288, elements: !316)
!315 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !314, file: !315, line: 26, baseType: !183, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !314, file: !315, line: 27, baseType: !183, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !314, file: !315, line: 28, baseType: !183, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !314, file: !315, line: 29, baseType: !183, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !314, file: !315, line: 30, baseType: !183, size: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !314, file: !315, line: 31, baseType: !183, size: 32, offset: 160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !314, file: !315, line: 32, baseType: !183, size: 32, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !314, file: !315, line: 33, baseType: !183, size: 32, offset: 224)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !314, file: !315, line: 34, baseType: !183, size: 32, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !247, file: !248, line: 258, baseType: !140, size: 32, offset: 672)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !247, file: !248, line: 261, baseType: !281, size: 64, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !247, file: !248, line: 302, baseType: !141, size: 32, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !247, file: !248, line: 333, baseType: !330, size: 32, offset: 800)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !332, line: 5291, size: 160, elements: !333)
!332 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!333 = !{!334, !343, !344}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !331, file: !332, line: 5292, baseType: !335, size: 96)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !336, line: 56, size: 96, elements: !337)
!336 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!337 = !{!338, !341, !342}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !335, file: !336, line: 57, baseType: !339, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !336, line: 57, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !335, file: !336, line: 58, baseType: !140, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !335, file: !336, line: 59, baseType: !185, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !331, file: !332, line: 5293, baseType: !281, size: 64, offset: 96)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !331, file: !332, line: 5294, baseType: !345, offset: 160)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !346, line: 45, elements: !347)
!346 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!347 = !{}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !247, file: !248, line: 355, baseType: !349, size: 64, offset: 832)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !315, line: 60, size: 64, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !349, file: !315, line: 63, baseType: !183, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !349, file: !315, line: 66, baseType: !183, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "idle_thread", scope: !241, file: !237, line: 112, baseType: !246, size: 32, offset: 96)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !241, file: !237, line: 124, baseType: !170, size: 8, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !241, file: !237, line: 154, baseType: !356, offset: 136)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_cpu_arch", file: !357, line: 35, elements: !347)
!357 = !DIFile(filename: "include/zephyr/arch/structs.h", directory: "/home/sri/zephyrproject/zephyr")
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ready_q", scope: !236, file: !237, line: 171, baseType: !359, size: 96, offset: 160)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ready_q", file: !237, line: 84, size: 96, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !359, file: !237, line: 87, baseType: !246, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "runq", scope: !359, file: !237, line: 91, baseType: !285, size: 64, offset: 32)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "_cpus_active", scope: !2, file: !6, line: 48, type: !365, isLocal: false, isDefinition: true)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !366, line: 22, baseType: !367)
!366 = !DIFile(filename: "include/zephyr/sys/atomic.h", directory: "/home/sri/zephyrproject/zephyr")
!367 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "z_main_stack", scope: !2, file: !6, line: 51, type: !370, isLocal: false, isDefinition: true, align: 64)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 8192, elements: !375)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !372, line: 47, size: 8, elements: !373)
!372 = !DIFile(filename: "include/zephyr/kernel/thread_stack.h", directory: "/home/sri/zephyrproject/zephyr")
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !371, file: !372, line: 48, baseType: !160, size: 8)
!375 = !{!376}
!376 = !DISubrange(count: 1024)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "z_main_thread", scope: !2, file: !6, line: 52, type: !247, isLocal: false, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "z_interrupt_stacks", scope: !2, file: !6, line: 94, type: !381, isLocal: false, isDefinition: true, align: 64)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 16384, elements: !382)
!382 = !{!197, !383}
!383 = !DISubrange(count: 2048)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "z_sys_post_kernel", scope: !2, file: !6, line: 255, type: !173, isLocal: false, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "z_idle_stacks", scope: !2, file: !6, line: 58, type: !388, isLocal: true, isDefinition: true, align: 64)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 2048, elements: !389)
!389 = !{!197, !390}
!390 = !DISubrange(count: 256)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "levels", scope: !393, file: !6, line: 270, type: !423, isLocal: true, isDefinition: true)
!393 = distinct !DISubprogram(name: "z_sys_init_run_level", scope: !6, file: !6, line: 268, type: !394, scopeLine: 269, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !396)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !5}
!396 = !{!397, !398, !416, !420}
!397 = !DILocalVariable(name: "level", arg: 1, scope: !393, file: !6, line: 268, type: !5)
!398 = !DILocalVariable(name: "entry", scope: !393, file: !6, line: 282, type: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !402, line: 92, size: 64, elements: !403)
!402 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!403 = !{!404, !415}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !401, file: !402, line: 94, baseType: !405, size: 32)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !402, line: 59, size: 32, elements: !406)
!406 = !{!407, !411}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !405, file: !402, line: 66, baseType: !408, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DISubroutineType(types: !410)
!410 = !{!141}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !405, file: !402, line: 75, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!413 = !DISubroutineType(types: !414)
!414 = !{!141, !152}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !401, file: !402, line: 99, baseType: !152, size: 32, offset: 32)
!416 = !DILocalVariable(name: "dev", scope: !417, file: !6, line: 285, type: !152)
!417 = distinct !DILexicalBlock(scope: !418, file: !6, line: 284, column: 64)
!418 = distinct !DILexicalBlock(scope: !419, file: !6, line: 284, column: 2)
!419 = distinct !DILexicalBlock(scope: !393, file: !6, line: 284, column: 2)
!420 = !DILocalVariable(name: "rc", scope: !421, file: !6, line: 288, type: !141)
!421 = distinct !DILexicalBlock(scope: !422, file: !6, line: 287, column: 17)
!422 = distinct !DILexicalBlock(scope: !417, file: !6, line: 287, column: 7)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 192, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 6)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !6, line: 484, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 40, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 5)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 896, elements: !196)
!432 = !{i32 7, !"Dwarf Version", i32 4}
!433 = !{i32 2, !"Debug Info Version", i32 3}
!434 = !{i32 1, !"wchar_size", i32 4}
!435 = !{i32 1, !"static_rwdata", i32 1}
!436 = !{i32 1, !"enumsize_buildattr", i32 1}
!437 = !{i32 1, !"armlib_unavailable", i32 0}
!438 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!439 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !15, file: !15, line: 223, type: !440, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !442)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !162, !246}
!442 = !{!443, !444}
!443 = !DILocalVariable(name: "object", arg: 1, scope: !439, file: !15, line: 223, type: !162)
!444 = !DILocalVariable(name: "thread", arg: 2, scope: !439, file: !15, line: 224, type: !246)
!445 = !DILocation(line: 223, column: 61, scope: !439)
!446 = !DILocation(line: 224, column: 24, scope: !439)
!447 = !DILocation(line: 226, column: 9, scope: !439)
!448 = !DILocation(line: 227, column: 9, scope: !439)
!449 = !DILocation(line: 228, column: 1, scope: !439)
!450 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !15, file: !15, line: 243, type: !451, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !453)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !162}
!453 = !{!454}
!454 = !DILocalVariable(name: "object", arg: 1, scope: !450, file: !15, line: 243, type: !162)
!455 = !DILocation(line: 243, column: 56, scope: !450)
!456 = !DILocation(line: 245, column: 9, scope: !450)
!457 = !DILocation(line: 246, column: 1, scope: !450)
!458 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !15, file: !15, line: 359, type: !459, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !461)
!459 = !DISubroutineType(types: !460)
!460 = !{!140, !14}
!461 = !{!462}
!462 = !DILocalVariable(name: "otype", arg: 1, scope: !458, file: !15, line: 359, type: !14)
!463 = !DILocation(line: 359, column: 58, scope: !458)
!464 = !DILocation(line: 361, column: 9, scope: !458)
!465 = !DILocation(line: 363, column: 2, scope: !458)
!466 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !15, file: !15, line: 366, type: !467, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !469)
!467 = !DISubroutineType(types: !468)
!468 = !{!140, !14, !185}
!469 = !{!470, !471}
!470 = !DILocalVariable(name: "otype", arg: 1, scope: !466, file: !15, line: 366, type: !14)
!471 = !DILocalVariable(name: "size", arg: 2, scope: !466, file: !15, line: 367, type: !185)
!472 = !DILocation(line: 366, column: 63, scope: !466)
!473 = !DILocation(line: 367, column: 13, scope: !466)
!474 = !DILocation(line: 369, column: 9, scope: !466)
!475 = !DILocation(line: 370, column: 9, scope: !466)
!476 = !DILocation(line: 372, column: 2, scope: !466)
!477 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !332, file: !332, line: 656, type: !478, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !484)
!478 = !DISubroutineType(types: !479)
!479 = !{!480, !482}
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !481, line: 46, baseType: !311)
!481 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!484 = !{!485}
!485 = !DILocalVariable(name: "t", arg: 1, scope: !477, file: !332, line: 657, type: !482)
!486 = !DILocation(line: 657, column: 30, scope: !477)
!487 = !DILocation(line: 659, column: 28, scope: !477)
!488 = !DILocation(line: 659, column: 31, scope: !477)
!489 = !DILocation(line: 659, column: 36, scope: !477)
!490 = !DILocation(line: 659, column: 9, scope: !477)
!491 = !DILocation(line: 659, column: 2, scope: !477)
!492 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !332, file: !332, line: 671, type: !478, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !493)
!493 = !{!494}
!494 = !DILocalVariable(name: "t", arg: 1, scope: !492, file: !332, line: 672, type: !482)
!495 = !DILocation(line: 672, column: 30, scope: !492)
!496 = !DILocation(line: 674, column: 30, scope: !492)
!497 = !DILocation(line: 674, column: 33, scope: !492)
!498 = !DILocation(line: 674, column: 38, scope: !492)
!499 = !DILocation(line: 674, column: 9, scope: !492)
!500 = !DILocation(line: 674, column: 2, scope: !492)
!501 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !332, file: !332, line: 1634, type: !502, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !523)
!502 = !DISubroutineType(types: !503)
!503 = !{!480, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !332, line: 1439, size: 448, elements: !507)
!507 = !{!508, !509, !510, !515, !516, !521, !522}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !506, file: !332, line: 1445, baseType: !301, size: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !506, file: !332, line: 1448, baseType: !281, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !506, file: !332, line: 1451, baseType: !511, size: 32, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 32)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !506, file: !332, line: 1454, baseType: !511, size: 32, offset: 288)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !506, file: !332, line: 1457, baseType: !517, size: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !481, line: 67, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !481, line: 65, size: 64, elements: !519)
!519 = !{!520}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !518, file: !481, line: 66, baseType: !480, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !506, file: !332, line: 1460, baseType: !183, size: 32, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !506, file: !332, line: 1463, baseType: !140, size: 32, offset: 416)
!523 = !{!524}
!524 = !DILocalVariable(name: "timer", arg: 1, scope: !501, file: !332, line: 1635, type: !504)
!525 = !DILocation(line: 1635, column: 34, scope: !501)
!526 = !DILocation(line: 1637, column: 28, scope: !501)
!527 = !DILocation(line: 1637, column: 35, scope: !501)
!528 = !DILocation(line: 1637, column: 9, scope: !501)
!529 = !DILocation(line: 1637, column: 2, scope: !501)
!530 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !332, file: !332, line: 1649, type: !502, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !531)
!531 = !{!532}
!532 = !DILocalVariable(name: "timer", arg: 1, scope: !530, file: !332, line: 1650, type: !504)
!533 = !DILocation(line: 1650, column: 34, scope: !530)
!534 = !DILocation(line: 1652, column: 30, scope: !530)
!535 = !DILocation(line: 1652, column: 37, scope: !530)
!536 = !DILocation(line: 1652, column: 9, scope: !530)
!537 = !DILocation(line: 1652, column: 2, scope: !530)
!538 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !332, file: !332, line: 1689, type: !539, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !541)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !514, !140}
!541 = !{!542, !543}
!542 = !DILocalVariable(name: "timer", arg: 1, scope: !538, file: !332, line: 1689, type: !514)
!543 = !DILocalVariable(name: "user_data", arg: 2, scope: !538, file: !332, line: 1690, type: !140)
!544 = !DILocation(line: 1689, column: 65, scope: !538)
!545 = !DILocation(line: 1690, column: 19, scope: !538)
!546 = !DILocation(line: 1692, column: 21, scope: !538)
!547 = !DILocation(line: 1692, column: 2, scope: !538)
!548 = !DILocation(line: 1692, column: 9, scope: !538)
!549 = !DILocation(line: 1692, column: 19, scope: !538)
!550 = !DILocation(line: 1693, column: 1, scope: !538)
!551 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !332, file: !332, line: 1704, type: !552, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !554)
!552 = !DISubroutineType(types: !553)
!553 = !{!140, !504}
!554 = !{!555}
!555 = !DILocalVariable(name: "timer", arg: 1, scope: !551, file: !332, line: 1704, type: !504)
!556 = !DILocation(line: 1704, column: 72, scope: !551)
!557 = !DILocation(line: 1706, column: 9, scope: !551)
!558 = !DILocation(line: 1706, column: 16, scope: !551)
!559 = !DILocation(line: 1706, column: 2, scope: !551)
!560 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !332, file: !332, line: 2071, type: !561, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !581)
!561 = !DISubroutineType(types: !562)
!562 = !{!141, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !332, line: 1830, size: 128, elements: !565)
!565 = !{!566, !579, !580}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !564, file: !332, line: 1831, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !568, line: 60, baseType: !569)
!568 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !568, line: 53, size: 64, elements: !570)
!570 = !{!571, !578}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !569, file: !568, line: 54, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !568, line: 50, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !568, line: 44, size: 32, elements: !575)
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !574, file: !568, line: 45, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !568, line: 40, baseType: !183)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !569, file: !568, line: 55, baseType: !572, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !564, file: !332, line: 1832, baseType: !345, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !564, file: !332, line: 1833, baseType: !281, size: 64, offset: 64)
!581 = !{!582}
!582 = !DILocalVariable(name: "queue", arg: 1, scope: !560, file: !332, line: 2071, type: !563)
!583 = !DILocation(line: 2071, column: 59, scope: !560)
!584 = !DILocation(line: 2073, column: 35, scope: !560)
!585 = !DILocation(line: 2073, column: 42, scope: !560)
!586 = !DILocation(line: 2073, column: 14, scope: !560)
!587 = !DILocation(line: 2073, column: 9, scope: !560)
!588 = !DILocation(line: 2073, column: 2, scope: !560)
!589 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !332, file: !332, line: 3209, type: !590, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !598)
!590 = !DISubroutineType(types: !591)
!591 = !{!139, !592}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !332, line: 3092, size: 128, elements: !594)
!594 = !{!595, !596, !597}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !593, file: !332, line: 3093, baseType: !281, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !593, file: !332, line: 3094, baseType: !139, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !593, file: !332, line: 3095, baseType: !139, size: 32, offset: 96)
!598 = !{!599}
!599 = !DILocalVariable(name: "sem", arg: 1, scope: !589, file: !332, line: 3209, type: !592)
!600 = !DILocation(line: 3209, column: 65, scope: !589)
!601 = !DILocation(line: 3211, column: 9, scope: !589)
!602 = !DILocation(line: 3211, column: 14, scope: !589)
!603 = !DILocation(line: 3211, column: 2, scope: !589)
!604 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !332, file: !332, line: 4649, type: !605, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !620)
!605 = !DISubroutineType(types: !606)
!606 = !{!183, !607}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !332, line: 4390, size: 320, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !608, file: !332, line: 4392, baseType: !281, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !608, file: !332, line: 4394, baseType: !345, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !608, file: !332, line: 4396, baseType: !185, size: 32, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !608, file: !332, line: 4398, baseType: !183, size: 32, offset: 96)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !608, file: !332, line: 4400, baseType: !184, size: 32, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !608, file: !332, line: 4402, baseType: !184, size: 32, offset: 160)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !608, file: !332, line: 4404, baseType: !184, size: 32, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !608, file: !332, line: 4406, baseType: !184, size: 32, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !608, file: !332, line: 4408, baseType: !183, size: 32, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !608, file: !332, line: 4413, baseType: !170, size: 8, offset: 288)
!620 = !{!621}
!621 = !DILocalVariable(name: "msgq", arg: 1, scope: !604, file: !332, line: 4649, type: !607)
!622 = !DILocation(line: 4649, column: 66, scope: !604)
!623 = !DILocation(line: 4651, column: 9, scope: !604)
!624 = !DILocation(line: 4651, column: 15, scope: !604)
!625 = !DILocation(line: 4651, column: 26, scope: !604)
!626 = !DILocation(line: 4651, column: 32, scope: !604)
!627 = !DILocation(line: 4651, column: 24, scope: !604)
!628 = !DILocation(line: 4651, column: 2, scope: !604)
!629 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !332, file: !332, line: 4665, type: !605, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !630)
!630 = !{!631}
!631 = !DILocalVariable(name: "msgq", arg: 1, scope: !629, file: !332, line: 4665, type: !607)
!632 = !DILocation(line: 4665, column: 66, scope: !629)
!633 = !DILocation(line: 4667, column: 9, scope: !629)
!634 = !DILocation(line: 4667, column: 15, scope: !629)
!635 = !DILocation(line: 4667, column: 2, scope: !629)
!636 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !155, file: !155, line: 744, type: !637, scopeLine: 745, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !639)
!637 = !DISubroutineType(types: !638)
!638 = !{!173, !152}
!639 = !{!640}
!640 = !DILocalVariable(name: "dev", arg: 1, scope: !636, file: !155, line: 744, type: !152)
!641 = !DILocation(line: 744, column: 65, scope: !636)
!642 = !DILocation(line: 746, column: 27, scope: !636)
!643 = !DILocation(line: 746, column: 9, scope: !636)
!644 = !DILocation(line: 746, column: 2, scope: !636)
!645 = distinct !DISubprogram(name: "z_impl_entropy_get_entropy", scope: !145, file: !145, line: 73, type: !150, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !646)
!646 = !{!647, !648, !649, !650}
!647 = !DILocalVariable(name: "dev", arg: 1, scope: !645, file: !145, line: 73, type: !152)
!648 = !DILocalVariable(name: "buffer", arg: 2, scope: !645, file: !145, line: 74, type: !175)
!649 = !DILocalVariable(name: "length", arg: 3, scope: !645, file: !145, line: 75, type: !176)
!650 = !DILocalVariable(name: "api", scope: !645, file: !145, line: 77, type: !142)
!651 = !DILocation(line: 73, column: 67, scope: !645)
!652 = !DILocation(line: 74, column: 20, scope: !645)
!653 = !DILocation(line: 75, column: 20, scope: !645)
!654 = !DILocation(line: 77, column: 2, scope: !645)
!655 = !DILocation(line: 77, column: 35, scope: !645)
!656 = !DILocation(line: 78, column: 38, scope: !645)
!657 = !DILocation(line: 78, column: 43, scope: !645)
!658 = !DILocation(line: 82, column: 9, scope: !645)
!659 = !DILocation(line: 82, column: 14, scope: !645)
!660 = !DILocation(line: 82, column: 26, scope: !645)
!661 = !DILocation(line: 82, column: 31, scope: !645)
!662 = !DILocation(line: 82, column: 39, scope: !645)
!663 = !DILocation(line: 83, column: 1, scope: !645)
!664 = !DILocation(line: 82, column: 2, scope: !645)
!665 = distinct !DISubprogram(name: "z_early_memset", scope: !6, file: !6, line: 142, type: !666, scopeLine: 143, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !668)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !140, !141, !137}
!668 = !{!669, !670, !671}
!669 = !DILocalVariable(name: "dst", arg: 1, scope: !665, file: !6, line: 142, type: !140)
!670 = !DILocalVariable(name: "c", arg: 2, scope: !665, file: !6, line: 142, type: !141)
!671 = !DILocalVariable(name: "n", arg: 3, scope: !665, file: !6, line: 142, type: !137)
!672 = !DILocation(line: 142, column: 53, scope: !665)
