; ModuleID = '../bc_files/intc_exti_stm32.bc'
source_filename = "/home/sri/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.device_state = type { i8, i8 }
%struct.stm32_exti_data = type { [16 x %struct.__exti_cb] }
%struct.__exti_cb = type { ptr, ptr }
%struct.device = type { ptr, ptr, ptr, ptr, ptr }
%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.stm32_exti_range = type { i8, i8 }
%struct._isr_list = type { i32, i32, ptr, ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }

!53 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 37)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 38)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 39)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 40)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 41)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 42)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 43)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 44)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 45)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 46)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 47)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!94 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 66, baseType: !97, size: 8, elements: !98)
!96 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!97 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!99 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!100 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!101 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!102 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!103 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!104 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!105 = !DIEnumerator(name: "PVD_VDDIO2_IRQn", value: 1)
!106 = !DIEnumerator(name: "RTC_IRQn", value: 2)
!107 = !DIEnumerator(name: "FLASH_IRQn", value: 3)
!108 = !DIEnumerator(name: "RCC_CRS_IRQn", value: 4)
!109 = !DIEnumerator(name: "EXTI0_1_IRQn", value: 5)
!110 = !DIEnumerator(name: "EXTI2_3_IRQn", value: 6)
!111 = !DIEnumerator(name: "EXTI4_15_IRQn", value: 7)
!112 = !DIEnumerator(name: "TSC_IRQn", value: 8)
!113 = !DIEnumerator(name: "DMA1_Ch1_IRQn", value: 9)
!114 = !DIEnumerator(name: "DMA1_Ch2_3_DMA2_Ch1_2_IRQn", value: 10)
!115 = !DIEnumerator(name: "DMA1_Ch4_7_DMA2_Ch3_5_IRQn", value: 11)
!116 = !DIEnumerator(name: "ADC1_COMP_IRQn", value: 12)
!117 = !DIEnumerator(name: "TIM1_BRK_UP_TRG_COM_IRQn", value: 13)
!118 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 14)
!119 = !DIEnumerator(name: "TIM2_IRQn", value: 15)
!120 = !DIEnumerator(name: "TIM3_IRQn", value: 16)
!121 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 17)
!122 = !DIEnumerator(name: "TIM7_IRQn", value: 18)
!123 = !DIEnumerator(name: "TIM14_IRQn", value: 19)
!124 = !DIEnumerator(name: "TIM15_IRQn", value: 20)
!125 = !DIEnumerator(name: "TIM16_IRQn", value: 21)
!126 = !DIEnumerator(name: "TIM17_IRQn", value: 22)
!127 = !DIEnumerator(name: "I2C1_IRQn", value: 23)
!128 = !DIEnumerator(name: "I2C2_IRQn", value: 24)
!129 = !DIEnumerator(name: "SPI1_IRQn", value: 25)
!130 = !DIEnumerator(name: "SPI2_IRQn", value: 26)
!131 = !DIEnumerator(name: "USART1_IRQn", value: 27)
!132 = !DIEnumerator(name: "USART2_IRQn", value: 28)
!133 = !DIEnumerator(name: "USART3_8_IRQn", value: 29)
!134 = !DIEnumerator(name: "CEC_CAN_IRQn", value: 30)
!135 = !{!136, !139, !140, !141}
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !137, line: 64, baseType: !138)
!137 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!138 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!140 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !96, line: 334, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 326, size: 192, elements: !144)
!144 = !{!145, !147, !148, !149, !150, !151}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !143, file: !96, line: 328, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !136)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !143, file: !96, line: 329, baseType: !146, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !143, file: !96, line: 330, baseType: !146, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !143, file: !96, line: 331, baseType: !146, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !143, file: !96, line: 332, baseType: !146, size: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !143, file: !96, line: 333, baseType: !146, size: 32, offset: 160)
!152 = !{!153, !160, !182, !201, !217, !0, !219, !229, !239, !241, !243, !245}
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !155, line: 239, type: !156, isLocal: true, isDefinition: true)
!155 = !DIFile(filename: "drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/sri/zephyrproject/zephyr")
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 240, elements: !158)
!157 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!158 = !{!159}
!159 = !DISubrange(count: 30)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "__device_dts_ord_49", scope: !2, file: !155, line: 239, type: !162, isLocal: false, isDefinition: true, align: 32)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !164, line: 381, size: 160, elements: !165)
!164 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!165 = !{!166, !169, !172, !173, !181}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !163, file: !164, line: 383, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !163, file: !164, line: 385, baseType: !170, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !163, file: !164, line: 387, baseType: !170, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !163, file: !164, line: 389, baseType: !174, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !164, line: 354, size: 16, elements: !176)
!176 = !{!177, !179}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !175, file: !164, line: 362, baseType: !178, size: 8)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !137, line: 62, baseType: !7)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !175, file: !164, line: 367, baseType: !180, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!180 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !164, line: 391, baseType: !139, size: 32, offset: 128)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_49", scope: !2, file: !155, line: 239, type: !184, isLocal: true, isDefinition: true, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !186, line: 92, size: 64, elements: !187)
!186 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!187 = !{!188, !200}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !185, file: !186, line: 94, baseType: !189, size: 32)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !186, line: 59, size: 32, elements: !190)
!190 = !{!191, !195}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !189, file: !186, line: 66, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DISubroutineType(types: !194)
!194 = !{!140}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !189, file: !186, line: 75, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DISubroutineType(types: !198)
!198 = !{!140, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !185, file: !186, line: 99, baseType: !199, size: 32, offset: 32)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "exti_data", scope: !2, file: !155, line: 238, type: !203, isLocal: true, isDefinition: true)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !155, line: 44, size: 1024, elements: !204)
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !203, file: !155, line: 46, baseType: !206, size: 1024)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 1024, elements: !215)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !155, line: 38, size: 64, elements: !208)
!208 = !{!209, !214}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !207, file: !155, line: 39, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !6, line: 65, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !140, !139}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !155, line: 40, baseType: !139, size: 32, offset: 32)
!215 = !{!216}
!216 = !DISubrange(count: 16)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_49", scope: !2, file: !155, line: 239, type: !175, isLocal: true, isDefinition: true, align: 8)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "line_range_0", scope: !221, file: !155, line: 231, type: !224, isLocal: true, isDefinition: true)
!221 = distinct !DISubprogram(name: "stm32_exti_init", scope: !155, file: !155, line: 227, type: !197, scopeLine: 228, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !222)
!222 = !{!223}
!223 = !DILocalVariable(name: "dev", arg: 1, scope: !221, file: !155, line: 227, type: !199)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_range", file: !155, line: 26, size: 16, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !225, file: !155, line: 28, baseType: !178, size: 8)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !225, file: !155, line: 30, baseType: !178, size: 8, offset: 8)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "__isr_stm32_exti_isr_irq_0", scope: !221, file: !155, line: 231, type: !231, isLocal: true, isDefinition: true, align: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !232, line: 53, size: 128, elements: !233)
!232 = !DIFile(filename: "include/zephyr/sw_isr_table.h", directory: "/home/sri/zephyrproject/zephyr")
!233 = !{!234, !236, !237, !238}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !231, file: !232, line: 55, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !137, line: 58, baseType: !140)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !231, file: !232, line: 57, baseType: !235, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !231, file: !232, line: 59, baseType: !139, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !231, file: !232, line: 61, baseType: !170, size: 32, offset: 96)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "line_range_1", scope: !221, file: !155, line: 231, type: !224, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "__isr_stm32_exti_isr_irq_1", scope: !221, file: !155, line: 231, type: !231, isLocal: true, isDefinition: true, align: 32)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "line_range_2", scope: !221, file: !155, line: 231, type: !224, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "__isr_stm32_exti_isr_irq_2", scope: !221, file: !155, line: 231, type: !231, isLocal: true, isDefinition: true, align: 32)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 128, elements: !215)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !96, line: 107, baseType: !95)
!249 = !{i32 7, !"Dwarf Version", i32 4}
!250 = !{i32 2, !"Debug Info Version", i32 3}
!251 = !{i32 1, !"wchar_size", i32 4}
!252 = !{i32 1, !"static_rwdata", i32 1}
!253 = !{i32 1, !"enumsize_buildattr", i32 1}
!254 = !{i32 1, !"armlib_unavailable", i32 0}
!255 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!256 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !164, file: !164, line: 744, type: !257, scopeLine: 745, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !259)
!257 = !DISubroutineType(types: !258)
!258 = !{!180, !199}
!259 = !{!260}
!260 = !DILocalVariable(name: "dev", arg: 1, scope: !256, file: !164, line: 744, type: !199)
!261 = !DILocation(line: 744, column: 65, scope: !256)
!262 = !DILocation(line: 746, column: 27, scope: !256)
!263 = !DILocation(line: 746, column: 9, scope: !256)
!264 = !DILocation(line: 746, column: 2, scope: !256)
!265 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !14, file: !14, line: 223, type: !266, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !382)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !170, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !270, line: 250, size: 896, elements: !271)
!270 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!271 = !{!272, !340, !353, !354, !355, !356, !377}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !269, file: !270, line: 252, baseType: !273, size: 384)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !270, line: 58, size: 384, elements: !274)
!274 = !{!275, !303, !311, !312, !313, !325, !326, !327}
!275 = !DIDerivedType(tag: DW_TAG_member, scope: !273, file: !270, line: 61, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !273, file: !270, line: 61, size: 64, elements: !277)
!277 = !{!278, !294}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !276, file: !270, line: 62, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !280, line: 55, baseType: !281)
!280 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !280, line: 37, size: 64, elements: !282)
!282 = !{!283, !289}
!283 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !280, line: 38, baseType: !284, size: 32)
!284 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !280, line: 38, size: 32, elements: !285)
!285 = !{!286, !288}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !284, file: !280, line: 39, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !280, line: 40, baseType: !287, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !280, line: 42, baseType: !290, size: 32, offset: 32)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !280, line: 42, size: 32, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !290, file: !280, line: 43, baseType: !287, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !290, file: !280, line: 44, baseType: !287, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !276, file: !270, line: 63, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !296, line: 58, size: 64, elements: !297)
!296 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !295, file: !296, line: 60, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 64, elements: !301)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!301 = !{!302}
!302 = !DISubrange(count: 2)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !273, file: !270, line: 69, baseType: !304, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !306, line: 243, baseType: !307)
!306 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 241, size: 64, elements: !308)
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !307, file: !306, line: 242, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !280, line: 51, baseType: !281)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !273, file: !270, line: 72, baseType: !178, size: 8, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !273, file: !270, line: 75, baseType: !178, size: 8, offset: 104)
!313 = !DIDerivedType(tag: DW_TAG_member, scope: !273, file: !270, line: 91, baseType: !314, size: 16, offset: 112)
!314 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !273, file: !270, line: 91, size: 16, elements: !315)
!315 = !{!316, !322}
!316 = !DIDerivedType(tag: DW_TAG_member, scope: !314, file: !270, line: 92, baseType: !317, size: 16)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !314, file: !270, line: 92, size: 16, elements: !318)
!318 = !{!319, !321}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !317, file: !270, line: 97, baseType: !320, size: 8)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !137, line: 56, baseType: !97)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !317, file: !270, line: 98, baseType: !178, size: 8, offset: 8)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !314, file: !270, line: 101, baseType: !323, size: 16)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !137, line: 63, baseType: !324)
!324 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !273, file: !270, line: 108, baseType: !136, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !273, file: !270, line: 132, baseType: !139, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !273, file: !270, line: 136, baseType: !328, size: 192, offset: 192)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !306, line: 254, size: 192, elements: !329)
!329 = !{!330, !331, !337}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !328, file: !306, line: 255, baseType: !279, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !328, file: !306, line: 256, baseType: !332, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !306, line: 252, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !336}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !328, file: !306, line: 259, baseType: !338, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !137, line: 59, baseType: !339)
!339 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !269, file: !270, line: 255, baseType: !341, size: 288, offset: 384)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !342, line: 25, size: 288, elements: !343)
!342 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !341, file: !342, line: 26, baseType: !136, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !341, file: !342, line: 27, baseType: !136, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !341, file: !342, line: 28, baseType: !136, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !341, file: !342, line: 29, baseType: !136, size: 32, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !341, file: !342, line: 30, baseType: !136, size: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !341, file: !342, line: 31, baseType: !136, size: 32, offset: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !341, file: !342, line: 32, baseType: !136, size: 32, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !341, file: !342, line: 33, baseType: !136, size: 32, offset: 224)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !341, file: !342, line: 34, baseType: !136, size: 32, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !269, file: !270, line: 258, baseType: !139, size: 32, offset: 672)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !269, file: !270, line: 261, baseType: !305, size: 64, offset: 704)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !269, file: !270, line: 302, baseType: !140, size: 32, offset: 768)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !269, file: !270, line: 333, baseType: !357, size: 32, offset: 800)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !359, line: 5291, size: 160, elements: !360)
!359 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!360 = !{!361, !372, !373}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !358, file: !359, line: 5292, baseType: !362, size: 96)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !363, line: 56, size: 96, elements: !364)
!363 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!364 = !{!365, !368, !369}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !362, file: !363, line: 57, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !363, line: 57, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !362, file: !363, line: 58, baseType: !139, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !362, file: !363, line: 59, baseType: !370, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !371, line: 46, baseType: !138)
!371 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!372 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !358, file: !359, line: 5293, baseType: !305, size: 64, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !358, file: !359, line: 5294, baseType: !374, offset: 160)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !375, line: 45, elements: !376)
!375 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!376 = !{}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !269, file: !270, line: 355, baseType: !378, size: 64, offset: 832)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !342, line: 60, size: 64, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !378, file: !342, line: 63, baseType: !136, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !378, file: !342, line: 66, baseType: !136, size: 32, offset: 32)
!382 = !{!383, !384}
!383 = !DILocalVariable(name: "object", arg: 1, scope: !265, file: !14, line: 223, type: !170)
!384 = !DILocalVariable(name: "thread", arg: 2, scope: !265, file: !14, line: 224, type: !268)
!385 = !DILocation(line: 223, column: 61, scope: !265)
!386 = !DILocation(line: 224, column: 24, scope: !265)
!387 = !DILocation(line: 226, column: 9, scope: !265)
!388 = !DILocation(line: 227, column: 9, scope: !265)
!389 = !DILocation(line: 228, column: 1, scope: !265)
!390 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !14, file: !14, line: 243, type: !391, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !393)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !170}
!393 = !{!394}
!394 = !DILocalVariable(name: "object", arg: 1, scope: !390, file: !14, line: 243, type: !170)
!395 = !DILocation(line: 243, column: 56, scope: !390)
!396 = !DILocation(line: 245, column: 9, scope: !390)
!397 = !DILocation(line: 246, column: 1, scope: !390)
!398 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !14, file: !14, line: 359, type: !399, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !401)
!399 = !DISubroutineType(types: !400)
!400 = !{!139, !13}
!401 = !{!402}
!402 = !DILocalVariable(name: "otype", arg: 1, scope: !398, file: !14, line: 359, type: !13)
!403 = !DILocation(line: 359, column: 58, scope: !398)
!404 = !DILocation(line: 361, column: 9, scope: !398)
!405 = !DILocation(line: 363, column: 2, scope: !398)
!406 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !14, file: !14, line: 366, type: !407, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !409)
!407 = !DISubroutineType(types: !408)
!408 = !{!139, !13, !370}
!409 = !{!410, !411}
!410 = !DILocalVariable(name: "otype", arg: 1, scope: !406, file: !14, line: 366, type: !13)
!411 = !DILocalVariable(name: "size", arg: 2, scope: !406, file: !14, line: 367, type: !370)
!412 = !DILocation(line: 366, column: 63, scope: !406)
!413 = !DILocation(line: 367, column: 13, scope: !406)
!414 = !DILocation(line: 369, column: 9, scope: !406)
!415 = !DILocation(line: 370, column: 9, scope: !406)
!416 = !DILocation(line: 372, column: 2, scope: !406)
!417 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !359, file: !359, line: 656, type: !418, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !424)
!418 = !DISubroutineType(types: !419)
!419 = !{!420, !422}
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !421, line: 46, baseType: !338)
!421 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!424 = !{!425}
!425 = !DILocalVariable(name: "t", arg: 1, scope: !417, file: !359, line: 657, type: !422)
!426 = !DILocation(line: 657, column: 30, scope: !417)
!427 = !DILocation(line: 659, column: 28, scope: !417)
!428 = !DILocation(line: 659, column: 31, scope: !417)
!429 = !DILocation(line: 659, column: 36, scope: !417)
!430 = !DILocation(line: 659, column: 9, scope: !417)
!431 = !DILocation(line: 659, column: 2, scope: !417)
!432 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !359, file: !359, line: 671, type: !418, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !433)
!433 = !{!434}
!434 = !DILocalVariable(name: "t", arg: 1, scope: !432, file: !359, line: 672, type: !422)
!435 = !DILocation(line: 672, column: 30, scope: !432)
!436 = !DILocation(line: 674, column: 30, scope: !432)
!437 = !DILocation(line: 674, column: 33, scope: !432)
!438 = !DILocation(line: 674, column: 38, scope: !432)
!439 = !DILocation(line: 674, column: 9, scope: !432)
!440 = !DILocation(line: 674, column: 2, scope: !432)
!441 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !359, file: !359, line: 1634, type: !442, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !463)
!442 = !DISubroutineType(types: !443)
!443 = !{!420, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !359, line: 1439, size: 448, elements: !447)
!447 = !{!448, !449, !450, !455, !456, !461, !462}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !446, file: !359, line: 1445, baseType: !328, size: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !446, file: !359, line: 1448, baseType: !305, size: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !446, file: !359, line: 1451, baseType: !451, size: 32, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !454}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !446, file: !359, line: 1454, baseType: !451, size: 32, offset: 288)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !446, file: !359, line: 1457, baseType: !457, size: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !421, line: 67, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 65, size: 64, elements: !459)
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !458, file: !421, line: 66, baseType: !420, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !446, file: !359, line: 1460, baseType: !136, size: 32, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !446, file: !359, line: 1463, baseType: !139, size: 32, offset: 416)
!463 = !{!464}
!464 = !DILocalVariable(name: "timer", arg: 1, scope: !441, file: !359, line: 1635, type: !444)
!465 = !DILocation(line: 1635, column: 34, scope: !441)
!466 = !DILocation(line: 1637, column: 28, scope: !441)
!467 = !DILocation(line: 1637, column: 35, scope: !441)
!468 = !DILocation(line: 1637, column: 9, scope: !441)
!469 = !DILocation(line: 1637, column: 2, scope: !441)
!470 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !359, file: !359, line: 1649, type: !442, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !471)
!471 = !{!472}
!472 = !DILocalVariable(name: "timer", arg: 1, scope: !470, file: !359, line: 1650, type: !444)
!473 = !DILocation(line: 1650, column: 34, scope: !470)
!474 = !DILocation(line: 1652, column: 30, scope: !470)
!475 = !DILocation(line: 1652, column: 37, scope: !470)
!476 = !DILocation(line: 1652, column: 9, scope: !470)
!477 = !DILocation(line: 1652, column: 2, scope: !470)
!478 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !359, file: !359, line: 1689, type: !479, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !481)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !454, !139}
!481 = !{!482, !483}
!482 = !DILocalVariable(name: "timer", arg: 1, scope: !478, file: !359, line: 1689, type: !454)
!483 = !DILocalVariable(name: "user_data", arg: 2, scope: !478, file: !359, line: 1690, type: !139)
!484 = !DILocation(line: 1689, column: 65, scope: !478)
!485 = !DILocation(line: 1690, column: 19, scope: !478)
!486 = !DILocation(line: 1692, column: 21, scope: !478)
!487 = !DILocation(line: 1692, column: 2, scope: !478)
!488 = !DILocation(line: 1692, column: 9, scope: !478)
!489 = !DILocation(line: 1692, column: 19, scope: !478)
!490 = !DILocation(line: 1693, column: 1, scope: !478)
!491 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !359, file: !359, line: 1704, type: !492, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !494)
!492 = !DISubroutineType(types: !493)
!493 = !{!139, !444}
!494 = !{!495}
!495 = !DILocalVariable(name: "timer", arg: 1, scope: !491, file: !359, line: 1704, type: !444)
!496 = !DILocation(line: 1704, column: 72, scope: !491)
!497 = !DILocation(line: 1706, column: 9, scope: !491)
!498 = !DILocation(line: 1706, column: 16, scope: !491)
!499 = !DILocation(line: 1706, column: 2, scope: !491)
!500 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !359, file: !359, line: 2071, type: !501, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !521)
!501 = !DISubroutineType(types: !502)
!502 = !{!140, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !359, line: 1830, size: 128, elements: !505)
!505 = !{!506, !519, !520}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !504, file: !359, line: 1831, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !508, line: 60, baseType: !509)
!508 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !508, line: 53, size: 64, elements: !510)
!510 = !{!511, !518}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !509, file: !508, line: 54, baseType: !512, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !508, line: 50, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !508, line: 44, size: 32, elements: !515)
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !514, file: !508, line: 45, baseType: !517, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !508, line: 40, baseType: !136)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !509, file: !508, line: 55, baseType: !512, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !504, file: !359, line: 1832, baseType: !374, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !504, file: !359, line: 1833, baseType: !305, size: 64, offset: 64)
!521 = !{!522}
!522 = !DILocalVariable(name: "queue", arg: 1, scope: !500, file: !359, line: 2071, type: !503)
!523 = !DILocation(line: 2071, column: 59, scope: !500)
!524 = !DILocation(line: 2073, column: 35, scope: !500)
!525 = !DILocation(line: 2073, column: 42, scope: !500)
!526 = !DILocation(line: 2073, column: 14, scope: !500)
!527 = !DILocation(line: 2073, column: 9, scope: !500)
!528 = !DILocation(line: 2073, column: 2, scope: !500)
!529 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !359, file: !359, line: 3209, type: !530, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !538)
!530 = !DISubroutineType(types: !531)
!531 = !{!138, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !359, line: 3092, size: 128, elements: !534)
!534 = !{!535, !536, !537}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !533, file: !359, line: 3093, baseType: !305, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !533, file: !359, line: 3094, baseType: !138, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !533, file: !359, line: 3095, baseType: !138, size: 32, offset: 96)
!538 = !{!539}
!539 = !DILocalVariable(name: "sem", arg: 1, scope: !529, file: !359, line: 3209, type: !532)
!540 = !DILocation(line: 3209, column: 65, scope: !529)
!541 = !DILocation(line: 3211, column: 9, scope: !529)
!542 = !DILocation(line: 3211, column: 14, scope: !529)
!543 = !DILocation(line: 3211, column: 2, scope: !529)
!544 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !359, file: !359, line: 4649, type: !545, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !561)
!545 = !DISubroutineType(types: !546)
!546 = !{!136, !547}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !359, line: 4390, size: 320, elements: !549)
!549 = !{!550, !551, !552, !553, !554, !556, !557, !558, !559, !560}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !548, file: !359, line: 4392, baseType: !305, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !548, file: !359, line: 4394, baseType: !374, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !548, file: !359, line: 4396, baseType: !370, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !548, file: !359, line: 4398, baseType: !136, size: 32, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !548, file: !359, line: 4400, baseType: !555, size: 32, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !548, file: !359, line: 4402, baseType: !555, size: 32, offset: 160)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !548, file: !359, line: 4404, baseType: !555, size: 32, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !548, file: !359, line: 4406, baseType: !555, size: 32, offset: 224)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !548, file: !359, line: 4408, baseType: !136, size: 32, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !548, file: !359, line: 4413, baseType: !178, size: 8, offset: 288)
!561 = !{!562}
!562 = !DILocalVariable(name: "msgq", arg: 1, scope: !544, file: !359, line: 4649, type: !547)
!563 = !DILocation(line: 4649, column: 66, scope: !544)
!564 = !DILocation(line: 4651, column: 9, scope: !544)
!565 = !DILocation(line: 4651, column: 15, scope: !544)
!566 = !DILocation(line: 4651, column: 26, scope: !544)
!567 = !DILocation(line: 4651, column: 32, scope: !544)
!568 = !DILocation(line: 4651, column: 24, scope: !544)
!569 = !DILocation(line: 4651, column: 2, scope: !544)
!570 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !359, file: !359, line: 4665, type: !545, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !571)
!571 = !{!572}
!572 = !DILocalVariable(name: "msgq", arg: 1, scope: !570, file: !359, line: 4665, type: !547)
!573 = !DILocation(line: 4665, column: 66, scope: !570)
!574 = !DILocation(line: 4667, column: 9, scope: !570)
!575 = !DILocation(line: 4667, column: 15, scope: !570)
!576 = !DILocation(line: 4667, column: 2, scope: !570)
!577 = distinct !DISubprogram(name: "stm32_exti_enable", scope: !155, file: !155, line: 49, type: !578, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !580)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !140}
!580 = !{!581, !582}
!581 = !DILocalVariable(name: "line", arg: 1, scope: !577, file: !155, line: 49, type: !140)
!582 = !DILocalVariable(name: "irqnum", scope: !577, file: !155, line: 51, type: !140)
!583 = !DILocation(line: 49, column: 28, scope: !577)
!584 = !DILocation(line: 51, column: 2, scope: !577)
!585 = !DILocation(line: 51, column: 6, scope: !577)
!586 = !DILocation(line: 53, column: 6, scope: !587)
!587 = distinct !DILexicalBlock(scope: !577, file: !155, line: 53, column: 6)
!588 = !DILocation(line: 53, column: 11, scope: !587)
!589 = !DILocation(line: 53, column: 6, scope: !577)
!590 = !DILocation(line: 55, column: 2, scope: !591)
!591 = distinct !DILexicalBlock(scope: !587, file: !155, line: 53, column: 18)
!592 = !DILocation(line: 58, column: 26, scope: !577)
!593 = !DILocation(line: 58, column: 11, scope: !577)
!594 = !DILocation(line: 58, column: 9, scope: !577)
!595 = !DILocation(line: 59, column: 6, scope: !596)
!596 = distinct !DILexicalBlock(scope: !577, file: !155, line: 59, column: 6)
!597 = !DILocation(line: 59, column: 13, scope: !596)
!598 = !DILocation(line: 59, column: 6, scope: !577)
!599 = !DILocation(line: 61, column: 2, scope: !600)
!600 = distinct !DILexicalBlock(scope: !596, file: !155, line: 59, column: 22)
!601 = !DILocation(line: 67, column: 43, scope: !577)
!602 = !DILocation(line: 67, column: 29, scope: !577)
!603 = !DILocation(line: 67, column: 2, scope: !577)
!604 = !DILocation(line: 71, column: 18, scope: !577)
!605 = !DILocation(line: 71, column: 2, scope: !577)
!606 = !DILocation(line: 72, column: 1, scope: !577)
!607 = distinct !DISubprogram(name: "LL_EXTI_EnableIT_0_31", scope: !608, file: !608, line: 273, type: !609, scopeLine: 274, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !611)
!608 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_ll_exti.h", directory: "/home/sri/zephyrproject")
!609 = !DISubroutineType(types: !610)
!610 = !{null, !136}
!611 = !{!612}
!612 = !DILocalVariable(name: "ExtiLine", arg: 1, scope: !607, file: !608, line: 273, type: !136)
!613 = !DILocation(line: 273, column: 53, scope: !607)
!614 = !DILocation(line: 275, column: 64, scope: !607)
!615 = !DILocation(line: 275, column: 60, scope: !607)
!616 = !DILocation(line: 276, column: 1, scope: !607)
