; ModuleID = '../bc_files/intc_exti_stm32.bc'
source_filename = "/home/sri/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.device_state = type { i8, i8 }
%struct.stm32_exti_data = type { [16 x %struct.__exti_cb] }
%struct.__exti_cb = type { ptr, ptr }
%struct.device = type { ptr, ptr, ptr, ptr, ptr }
%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.stm32_exti_range = type { i8, i8 }
%struct._isr_list = type { i32, i32, ptr, ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }

!53 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 37)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 38)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 39)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 40)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 41)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 42)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 43)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 44)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 45)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 46)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 47)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!94 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 66, baseType: !97, size: 8, elements: !98)
!96 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!97 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!99 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!100 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!101 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!102 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!103 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!104 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!105 = !DIEnumerator(name: "PVD_VDDIO2_IRQn", value: 1)
!106 = !DIEnumerator(name: "RTC_IRQn", value: 2)
!107 = !DIEnumerator(name: "FLASH_IRQn", value: 3)
!108 = !DIEnumerator(name: "RCC_CRS_IRQn", value: 4)
!109 = !DIEnumerator(name: "EXTI0_1_IRQn", value: 5)
!110 = !DIEnumerator(name: "EXTI2_3_IRQn", value: 6)
!111 = !DIEnumerator(name: "EXTI4_15_IRQn", value: 7)
!112 = !DIEnumerator(name: "TSC_IRQn", value: 8)
!113 = !DIEnumerator(name: "DMA1_Ch1_IRQn", value: 9)
!114 = !DIEnumerator(name: "DMA1_Ch2_3_DMA2_Ch1_2_IRQn", value: 10)
!115 = !DIEnumerator(name: "DMA1_Ch4_7_DMA2_Ch3_5_IRQn", value: 11)
!116 = !DIEnumerator(name: "ADC1_COMP_IRQn", value: 12)
!117 = !DIEnumerator(name: "TIM1_BRK_UP_TRG_COM_IRQn", value: 13)
!118 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 14)
!119 = !DIEnumerator(name: "TIM2_IRQn", value: 15)
!120 = !DIEnumerator(name: "TIM3_IRQn", value: 16)
!121 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 17)
!122 = !DIEnumerator(name: "TIM7_IRQn", value: 18)
!123 = !DIEnumerator(name: "TIM14_IRQn", value: 19)
!124 = !DIEnumerator(name: "TIM15_IRQn", value: 20)
!125 = !DIEnumerator(name: "TIM16_IRQn", value: 21)
!126 = !DIEnumerator(name: "TIM17_IRQn", value: 22)
!127 = !DIEnumerator(name: "I2C1_IRQn", value: 23)
!128 = !DIEnumerator(name: "I2C2_IRQn", value: 24)
!129 = !DIEnumerator(name: "SPI1_IRQn", value: 25)
!130 = !DIEnumerator(name: "SPI2_IRQn", value: 26)
!131 = !DIEnumerator(name: "USART1_IRQn", value: 27)
!132 = !DIEnumerator(name: "USART2_IRQn", value: 28)
!133 = !DIEnumerator(name: "USART3_8_IRQn", value: 29)
!134 = !DIEnumerator(name: "CEC_CAN_IRQn", value: 30)
!135 = !{!136, !139, !140, !141}
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !137, line: 64, baseType: !138)
!137 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!138 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!140 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !96, line: 334, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 326, size: 192, elements: !144)
!144 = !{!145, !147, !148, !149, !150, !151}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !143, file: !96, line: 328, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !136)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !143, file: !96, line: 329, baseType: !146, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !143, file: !96, line: 330, baseType: !146, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !143, file: !96, line: 331, baseType: !146, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !143, file: !96, line: 332, baseType: !146, size: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !143, file: !96, line: 333, baseType: !146, size: 32, offset: 160)
!152 = !{!153, !160, !182, !201, !217, !0, !219, !228, !238, !240, !242, !244}
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !155, line: 239, type: !156, isLocal: true, isDefinition: true)
!155 = !DIFile(filename: "drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/sri/zephyrproject/zephyr")
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 240, elements: !158)
!157 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!158 = !{!159}
!159 = !DISubrange(count: 30)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "__device_dts_ord_49", scope: !2, file: !155, line: 239, type: !162, isLocal: false, isDefinition: true, align: 32)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !164, line: 381, size: 160, elements: !165)
!164 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!165 = !{!166, !169, !172, !173, !181}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !163, file: !164, line: 383, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !163, file: !164, line: 385, baseType: !170, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !163, file: !164, line: 387, baseType: !170, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !163, file: !164, line: 389, baseType: !174, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !164, line: 354, size: 16, elements: !176)
!176 = !{!177, !179}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !175, file: !164, line: 362, baseType: !178, size: 8)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !137, line: 62, baseType: !7)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !175, file: !164, line: 367, baseType: !180, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!180 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !164, line: 391, baseType: !139, size: 32, offset: 128)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_49", scope: !2, file: !155, line: 239, type: !184, isLocal: true, isDefinition: true, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !186, line: 92, size: 64, elements: !187)
!186 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!187 = !{!188, !200}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !185, file: !186, line: 94, baseType: !189, size: 32)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !186, line: 59, size: 32, elements: !190)
!190 = !{!191, !195}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !189, file: !186, line: 66, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DISubroutineType(types: !194)
!194 = !{!140}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !189, file: !186, line: 75, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DISubroutineType(types: !198)
!198 = !{!140, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !185, file: !186, line: 99, baseType: !199, size: 32, offset: 32)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "exti_data", scope: !2, file: !155, line: 238, type: !203, isLocal: true, isDefinition: true)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !155, line: 44, size: 1024, elements: !204)
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !203, file: !155, line: 46, baseType: !206, size: 1024)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 1024, elements: !215)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !155, line: 38, size: 64, elements: !208)
!208 = !{!209, !214}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !207, file: !155, line: 39, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !6, line: 65, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !140, !139}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !155, line: 40, baseType: !139, size: 32, offset: 32)
!215 = !{!216}
!216 = !DISubrange(count: 16)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_49", scope: !2, file: !155, line: 239, type: !175, isLocal: true, isDefinition: true, align: 8)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "line_range_0", scope: !221, file: !155, line: 231, type: !223, isLocal: true, isDefinition: true)
!221 = distinct !DISubprogram(name: "stm32_exti_init", scope: !155, file: !155, line: 227, type: !197, scopeLine: 228, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!222 = !{}
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_range", file: !155, line: 26, size: 16, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !224, file: !155, line: 28, baseType: !178, size: 8)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !224, file: !155, line: 30, baseType: !178, size: 8, offset: 8)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "__isr_stm32_exti_isr_irq_0", scope: !221, file: !155, line: 231, type: !230, isLocal: true, isDefinition: true, align: 32)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !231, line: 53, size: 128, elements: !232)
!231 = !DIFile(filename: "include/zephyr/sw_isr_table.h", directory: "/home/sri/zephyrproject/zephyr")
!232 = !{!233, !235, !236, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !230, file: !231, line: 55, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !137, line: 58, baseType: !140)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !230, file: !231, line: 57, baseType: !234, size: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !230, file: !231, line: 59, baseType: !139, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !230, file: !231, line: 61, baseType: !170, size: 32, offset: 96)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "line_range_1", scope: !221, file: !155, line: 231, type: !223, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "__isr_stm32_exti_isr_irq_1", scope: !221, file: !155, line: 231, type: !230, isLocal: true, isDefinition: true, align: 32)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "line_range_2", scope: !221, file: !155, line: 231, type: !223, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "__isr_stm32_exti_isr_irq_2", scope: !221, file: !155, line: 231, type: !230, isLocal: true, isDefinition: true, align: 32)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 128, elements: !215)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !96, line: 107, baseType: !95)
!248 = !{i32 7, !"Dwarf Version", i32 4}
!249 = !{i32 2, !"Debug Info Version", i32 3}
!250 = !{i32 1, !"wchar_size", i32 4}
!251 = !{i32 1, !"static_rwdata", i32 1}
!252 = !{i32 1, !"enumsize_buildattr", i32 1}
!253 = !{i32 1, !"armlib_unavailable", i32 0}
!254 = !{i32 8, !"PIC Level", i32 2}
!255 = !{i32 7, !"PIE Level", i32 2}
!256 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!257 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !164, file: !164, line: 744, type: !258, scopeLine: 745, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!258 = !DISubroutineType(types: !259)
!259 = !{!180, !199}
!260 = !DILocalVariable(name: "dev", arg: 1, scope: !257, file: !164, line: 744, type: !199)
!261 = !DILocation(line: 744, column: 65, scope: !257)
!262 = !DILocation(line: 746, column: 27, scope: !257)
!263 = !DILocation(line: 746, column: 9, scope: !257)
!264 = !DILocation(line: 746, column: 2, scope: !257)
!265 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !14, file: !14, line: 223, type: !266, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !170, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !270, line: 250, size: 896, elements: !271)
!270 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!271 = !{!272, !340, !353, !354, !355, !356, !376}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !269, file: !270, line: 252, baseType: !273, size: 384)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !270, line: 58, size: 384, elements: !274)
!274 = !{!275, !303, !311, !312, !313, !325, !326, !327}
!275 = !DIDerivedType(tag: DW_TAG_member, scope: !273, file: !270, line: 61, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !273, file: !270, line: 61, size: 64, elements: !277)
!277 = !{!278, !294}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !276, file: !270, line: 62, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !280, line: 55, baseType: !281)
!280 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !280, line: 37, size: 64, elements: !282)
!282 = !{!283, !289}
!283 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !280, line: 38, baseType: !284, size: 32)
!284 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !280, line: 38, size: 32, elements: !285)
!285 = !{!286, !288}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !284, file: !280, line: 39, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !280, line: 40, baseType: !287, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !280, line: 42, baseType: !290, size: 32, offset: 32)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !280, line: 42, size: 32, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !290, file: !280, line: 43, baseType: !287, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !290, file: !280, line: 44, baseType: !287, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !276, file: !270, line: 63, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !296, line: 58, size: 64, elements: !297)
!296 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !295, file: !296, line: 60, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 64, elements: !301)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!301 = !{!302}
!302 = !DISubrange(count: 2)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !273, file: !270, line: 69, baseType: !304, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !306, line: 243, baseType: !307)
!306 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 241, size: 64, elements: !308)
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !307, file: !306, line: 242, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !280, line: 51, baseType: !281)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !273, file: !270, line: 72, baseType: !178, size: 8, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !273, file: !270, line: 75, baseType: !178, size: 8, offset: 104)
!313 = !DIDerivedType(tag: DW_TAG_member, scope: !273, file: !270, line: 91, baseType: !314, size: 16, offset: 112)
!314 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !273, file: !270, line: 91, size: 16, elements: !315)
!315 = !{!316, !322}
!316 = !DIDerivedType(tag: DW_TAG_member, scope: !314, file: !270, line: 92, baseType: !317, size: 16)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !314, file: !270, line: 92, size: 16, elements: !318)
!318 = !{!319, !321}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !317, file: !270, line: 97, baseType: !320, size: 8)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !137, line: 56, baseType: !97)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !317, file: !270, line: 98, baseType: !178, size: 8, offset: 8)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !314, file: !270, line: 101, baseType: !323, size: 16)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !137, line: 63, baseType: !324)
!324 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !273, file: !270, line: 108, baseType: !136, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !273, file: !270, line: 132, baseType: !139, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !273, file: !270, line: 136, baseType: !328, size: 192, offset: 192)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !306, line: 254, size: 192, elements: !329)
!329 = !{!330, !331, !337}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !328, file: !306, line: 255, baseType: !279, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !328, file: !306, line: 256, baseType: !332, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !306, line: 252, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !336}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !328, file: !306, line: 259, baseType: !338, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !137, line: 59, baseType: !339)
!339 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !269, file: !270, line: 255, baseType: !341, size: 288, offset: 384)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !342, line: 25, size: 288, elements: !343)
!342 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !341, file: !342, line: 26, baseType: !136, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !341, file: !342, line: 27, baseType: !136, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !341, file: !342, line: 28, baseType: !136, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !341, file: !342, line: 29, baseType: !136, size: 32, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !341, file: !342, line: 30, baseType: !136, size: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !341, file: !342, line: 31, baseType: !136, size: 32, offset: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !341, file: !342, line: 32, baseType: !136, size: 32, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !341, file: !342, line: 33, baseType: !136, size: 32, offset: 224)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !341, file: !342, line: 34, baseType: !136, size: 32, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !269, file: !270, line: 258, baseType: !139, size: 32, offset: 672)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !269, file: !270, line: 261, baseType: !305, size: 64, offset: 704)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !269, file: !270, line: 302, baseType: !140, size: 32, offset: 768)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !269, file: !270, line: 333, baseType: !357, size: 32, offset: 800)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !359, line: 5291, size: 160, elements: !360)
!359 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!360 = !{!361, !372, !373}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !358, file: !359, line: 5292, baseType: !362, size: 96)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !363, line: 56, size: 96, elements: !364)
!363 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!364 = !{!365, !368, !369}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !362, file: !363, line: 57, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !363, line: 57, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !362, file: !363, line: 58, baseType: !139, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !362, file: !363, line: 59, baseType: !370, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !371, line: 46, baseType: !138)
!371 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!372 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !358, file: !359, line: 5293, baseType: !305, size: 64, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !358, file: !359, line: 5294, baseType: !374, offset: 160)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !375, line: 45, elements: !222)
!375 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!376 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !269, file: !270, line: 355, baseType: !377, size: 64, offset: 832)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !342, line: 60, size: 64, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !377, file: !342, line: 63, baseType: !136, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !377, file: !342, line: 66, baseType: !136, size: 32, offset: 32)
!381 = !DILocalVariable(name: "object", arg: 1, scope: !265, file: !14, line: 223, type: !170)
!382 = !DILocation(line: 223, column: 61, scope: !265)
!383 = !DILocalVariable(name: "thread", arg: 2, scope: !265, file: !14, line: 224, type: !268)
!384 = !DILocation(line: 224, column: 24, scope: !265)
!385 = !DILocation(line: 226, column: 9, scope: !265)
!386 = !DILocation(line: 227, column: 9, scope: !265)
!387 = !DILocation(line: 228, column: 1, scope: !265)
!388 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !14, file: !14, line: 243, type: !389, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !170}
!391 = !DILocalVariable(name: "object", arg: 1, scope: !388, file: !14, line: 243, type: !170)
!392 = !DILocation(line: 243, column: 56, scope: !388)
!393 = !DILocation(line: 245, column: 9, scope: !388)
!394 = !DILocation(line: 246, column: 1, scope: !388)
!395 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !14, file: !14, line: 359, type: !396, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!396 = !DISubroutineType(types: !397)
!397 = !{!139, !13}
!398 = !DILocalVariable(name: "otype", arg: 1, scope: !395, file: !14, line: 359, type: !13)
!399 = !DILocation(line: 359, column: 58, scope: !395)
!400 = !DILocation(line: 361, column: 9, scope: !395)
!401 = !DILocation(line: 363, column: 2, scope: !395)
!402 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !14, file: !14, line: 366, type: !403, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!403 = !DISubroutineType(types: !404)
!404 = !{!139, !13, !370}
!405 = !DILocalVariable(name: "otype", arg: 1, scope: !402, file: !14, line: 366, type: !13)
!406 = !DILocation(line: 366, column: 63, scope: !402)
!407 = !DILocalVariable(name: "size", arg: 2, scope: !402, file: !14, line: 367, type: !370)
!408 = !DILocation(line: 367, column: 13, scope: !402)
!409 = !DILocation(line: 369, column: 9, scope: !402)
!410 = !DILocation(line: 370, column: 9, scope: !402)
!411 = !DILocation(line: 372, column: 2, scope: !402)
!412 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !359, file: !359, line: 656, type: !413, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!413 = !DISubroutineType(types: !414)
!414 = !{!415, !417}
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !416, line: 46, baseType: !338)
!416 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!419 = !DILocalVariable(name: "t", arg: 1, scope: !412, file: !359, line: 657, type: !417)
!420 = !DILocation(line: 657, column: 30, scope: !412)
!421 = !DILocation(line: 659, column: 28, scope: !412)
!422 = !DILocation(line: 659, column: 31, scope: !412)
!423 = !DILocation(line: 659, column: 36, scope: !412)
!424 = !DILocation(line: 659, column: 9, scope: !412)
!425 = !DILocation(line: 659, column: 2, scope: !412)
!426 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !359, file: !359, line: 671, type: !413, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!427 = !DILocalVariable(name: "t", arg: 1, scope: !426, file: !359, line: 672, type: !417)
!428 = !DILocation(line: 672, column: 30, scope: !426)
!429 = !DILocation(line: 674, column: 30, scope: !426)
!430 = !DILocation(line: 674, column: 33, scope: !426)
!431 = !DILocation(line: 674, column: 38, scope: !426)
!432 = !DILocation(line: 674, column: 9, scope: !426)
!433 = !DILocation(line: 674, column: 2, scope: !426)
!434 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !359, file: !359, line: 1634, type: !435, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!435 = !DISubroutineType(types: !436)
!436 = !{!415, !437}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !359, line: 1439, size: 448, elements: !440)
!440 = !{!441, !442, !443, !448, !449, !454, !455}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !439, file: !359, line: 1445, baseType: !328, size: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !439, file: !359, line: 1448, baseType: !305, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !439, file: !359, line: 1451, baseType: !444, size: 32, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !439, file: !359, line: 1454, baseType: !444, size: 32, offset: 288)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !439, file: !359, line: 1457, baseType: !450, size: 64, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !416, line: 67, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 65, size: 64, elements: !452)
!452 = !{!453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !451, file: !416, line: 66, baseType: !415, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !439, file: !359, line: 1460, baseType: !136, size: 32, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !439, file: !359, line: 1463, baseType: !139, size: 32, offset: 416)
!456 = !DILocalVariable(name: "timer", arg: 1, scope: !434, file: !359, line: 1635, type: !437)
!457 = !DILocation(line: 1635, column: 34, scope: !434)
!458 = !DILocation(line: 1637, column: 28, scope: !434)
!459 = !DILocation(line: 1637, column: 35, scope: !434)
!460 = !DILocation(line: 1637, column: 9, scope: !434)
!461 = !DILocation(line: 1637, column: 2, scope: !434)
!462 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !359, file: !359, line: 1649, type: !435, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!463 = !DILocalVariable(name: "timer", arg: 1, scope: !462, file: !359, line: 1650, type: !437)
!464 = !DILocation(line: 1650, column: 34, scope: !462)
!465 = !DILocation(line: 1652, column: 30, scope: !462)
!466 = !DILocation(line: 1652, column: 37, scope: !462)
!467 = !DILocation(line: 1652, column: 9, scope: !462)
!468 = !DILocation(line: 1652, column: 2, scope: !462)
!469 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !359, file: !359, line: 1689, type: !470, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !447, !139}
!472 = !DILocalVariable(name: "timer", arg: 1, scope: !469, file: !359, line: 1689, type: !447)
!473 = !DILocation(line: 1689, column: 65, scope: !469)
!474 = !DILocalVariable(name: "user_data", arg: 2, scope: !469, file: !359, line: 1690, type: !139)
!475 = !DILocation(line: 1690, column: 19, scope: !469)
!476 = !DILocation(line: 1692, column: 21, scope: !469)
!477 = !DILocation(line: 1692, column: 2, scope: !469)
!478 = !DILocation(line: 1692, column: 9, scope: !469)
!479 = !DILocation(line: 1692, column: 19, scope: !469)
!480 = !DILocation(line: 1693, column: 1, scope: !469)
!481 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !359, file: !359, line: 1704, type: !482, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!482 = !DISubroutineType(types: !483)
!483 = !{!139, !437}
!484 = !DILocalVariable(name: "timer", arg: 1, scope: !481, file: !359, line: 1704, type: !437)
!485 = !DILocation(line: 1704, column: 72, scope: !481)
!486 = !DILocation(line: 1706, column: 9, scope: !481)
!487 = !DILocation(line: 1706, column: 16, scope: !481)
!488 = !DILocation(line: 1706, column: 2, scope: !481)
!489 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !359, file: !359, line: 2071, type: !490, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!490 = !DISubroutineType(types: !491)
!491 = !{!140, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !359, line: 1830, size: 128, elements: !494)
!494 = !{!495, !508, !509}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !493, file: !359, line: 1831, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !497, line: 60, baseType: !498)
!497 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !497, line: 53, size: 64, elements: !499)
!499 = !{!500, !507}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !498, file: !497, line: 54, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !497, line: 50, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !497, line: 44, size: 32, elements: !504)
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !503, file: !497, line: 45, baseType: !506, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !497, line: 40, baseType: !136)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !498, file: !497, line: 55, baseType: !501, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !493, file: !359, line: 1832, baseType: !374, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !493, file: !359, line: 1833, baseType: !305, size: 64, offset: 64)
!510 = !DILocalVariable(name: "queue", arg: 1, scope: !489, file: !359, line: 2071, type: !492)
!511 = !DILocation(line: 2071, column: 59, scope: !489)
!512 = !DILocation(line: 2073, column: 35, scope: !489)
!513 = !DILocation(line: 2073, column: 42, scope: !489)
!514 = !DILocation(line: 2073, column: 14, scope: !489)
!515 = !DILocation(line: 2073, column: 9, scope: !489)
!516 = !DILocation(line: 2073, column: 2, scope: !489)
!517 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !359, file: !359, line: 3209, type: !518, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!518 = !DISubroutineType(types: !519)
!519 = !{!138, !520}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !359, line: 3092, size: 128, elements: !522)
!522 = !{!523, !524, !525}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !521, file: !359, line: 3093, baseType: !305, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !521, file: !359, line: 3094, baseType: !138, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !521, file: !359, line: 3095, baseType: !138, size: 32, offset: 96)
!526 = !DILocalVariable(name: "sem", arg: 1, scope: !517, file: !359, line: 3209, type: !520)
!527 = !DILocation(line: 3209, column: 65, scope: !517)
!528 = !DILocation(line: 3211, column: 9, scope: !517)
!529 = !DILocation(line: 3211, column: 14, scope: !517)
!530 = !DILocation(line: 3211, column: 2, scope: !517)
!531 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !359, file: !359, line: 4649, type: !532, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!532 = !DISubroutineType(types: !533)
!533 = !{!136, !534}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !359, line: 4390, size: 320, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !543, !544, !545, !546, !547}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !535, file: !359, line: 4392, baseType: !305, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !535, file: !359, line: 4394, baseType: !374, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !535, file: !359, line: 4396, baseType: !370, size: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !535, file: !359, line: 4398, baseType: !136, size: 32, offset: 96)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !535, file: !359, line: 4400, baseType: !542, size: 32, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !535, file: !359, line: 4402, baseType: !542, size: 32, offset: 160)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !535, file: !359, line: 4404, baseType: !542, size: 32, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !535, file: !359, line: 4406, baseType: !542, size: 32, offset: 224)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !535, file: !359, line: 4408, baseType: !136, size: 32, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !535, file: !359, line: 4413, baseType: !178, size: 8, offset: 288)
!548 = !DILocalVariable(name: "msgq", arg: 1, scope: !531, file: !359, line: 4649, type: !534)
!549 = !DILocation(line: 4649, column: 66, scope: !531)
!550 = !DILocation(line: 4651, column: 9, scope: !531)
!551 = !DILocation(line: 4651, column: 15, scope: !531)
!552 = !DILocation(line: 4651, column: 26, scope: !531)
!553 = !DILocation(line: 4651, column: 32, scope: !531)
!554 = !DILocation(line: 4651, column: 24, scope: !531)
!555 = !DILocation(line: 4651, column: 2, scope: !531)
!556 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !359, file: !359, line: 4665, type: !532, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!557 = !DILocalVariable(name: "msgq", arg: 1, scope: !556, file: !359, line: 4665, type: !534)
!558 = !DILocation(line: 4665, column: 66, scope: !556)
!559 = !DILocation(line: 4667, column: 9, scope: !556)
!560 = !DILocation(line: 4667, column: 15, scope: !556)
!561 = !DILocation(line: 4667, column: 2, scope: !556)
!562 = distinct !DISubprogram(name: "stm32_exti_enable", scope: !155, file: !155, line: 49, type: !563, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !222)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !140}
!565 = !DILocalVariable(name: "line", arg: 1, scope: !562, file: !155, line: 49, type: !140)
!566 = !DILocation(line: 49, column: 28, scope: !562)
!567 = !DILocalVariable(name: "irqnum", scope: !562, file: !155, line: 51, type: !140)
!568 = !DILocation(line: 51, column: 6, scope: !562)
!569 = !DILocation(line: 53, column: 6, scope: !570)
!570 = distinct !DILexicalBlock(scope: !562, file: !155, line: 53, column: 6)
!571 = !DILocation(line: 53, column: 11, scope: !570)
!572 = !DILocation(line: 53, column: 6, scope: !562)
!573 = !DILocation(line: 55, column: 2, scope: !574)
!574 = distinct !DILexicalBlock(scope: !570, file: !155, line: 53, column: 18)
!575 = !DILocation(line: 58, column: 26, scope: !562)
!576 = !DILocation(line: 58, column: 11, scope: !562)
!577 = !DILocation(line: 58, column: 9, scope: !562)
!578 = !DILocation(line: 59, column: 6, scope: !579)
!579 = distinct !DILexicalBlock(scope: !562, file: !155, line: 59, column: 6)
!580 = !DILocation(line: 59, column: 13, scope: !579)
!581 = !DILocation(line: 59, column: 6, scope: !562)
!582 = !DILocation(line: 61, column: 2, scope: !583)
!583 = distinct !DILexicalBlock(scope: !579, file: !155, line: 59, column: 22)
!584 = !DILocation(line: 67, column: 43, scope: !562)
!585 = !DILocation(line: 67, column: 29, scope: !562)
!586 = !DILocation(line: 67, column: 2, scope: !562)
!587 = !DILocation(line: 71, column: 18, scope: !562)
!588 = !DILocation(line: 71, column: 2, scope: !562)
!589 = !DILocation(line: 72, column: 1, scope: !562)
!590 = distinct !DISubprogram(name: "LL_EXTI_EnableIT_0_31", scope: !591, file: !591, line: 273, type: !592, scopeLine: 274, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !222)
!591 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_ll_exti.h", directory: "/home/sri/zephyrproject")
!592 = !DISubroutineType(types: !593)
!593 = !{null, !136}
!594 = !DILocalVariable(name: "ExtiLine", arg: 1, scope: !590, file: !591, line: 273, type: !136)
!595 = !DILocation(line: 273, column: 53, scope: !590)
!596 = !DILocation(line: 275, column: 64, scope: !590)
!597 = !DILocation(line: 275, column: 60, scope: !590)
!598 = !DILocation(line: 276, column: 1, scope: !590)
!599 = distinct !DISubprogram(name: "stm32_exti_disable", scope: !155, file: !155, line: 74, type: !563, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !222)
!600 = !DILocalVariable(name: "line", arg: 1, scope: !599, file: !155, line: 74, type: !140)
