; ModuleID = '../bc_files/kheap.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/kheap.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { ptr, ptr, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%struct.k_spinlock = type {}
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }

!38 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 29)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 30)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 31)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 32)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 33)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 34)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 35)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 36)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 37)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 38)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 39)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 40)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 41)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 42)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 43)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 44)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 45)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 46)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 47)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!87 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!88 = !{!89, !90, !91}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !93, line: 55, baseType: !94)
!93 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !93, line: 37, size: 64, elements: !95)
!95 = !{!96, !102}
!96 = !DIDerivedType(tag: DW_TAG_member, scope: !94, file: !93, line: 38, baseType: !97, size: 32)
!97 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !94, file: !93, line: 38, size: 32, elements: !98)
!98 = !{!99, !101}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !97, file: !93, line: 39, baseType: !100, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !97, file: !93, line: 40, baseType: !100, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, scope: !94, file: !93, line: 42, baseType: !103, size: 32, offset: 32)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !94, file: !93, line: 42, size: 32, elements: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !103, file: !93, line: 43, baseType: !100, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !103, file: !93, line: 44, baseType: !100, size: 32)
!107 = !{!0}
!108 = !DIFile(filename: "kernel/kheap.c", directory: "/home/sri/zephyrproject/zephyr")
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !111, line: 92, size: 64, elements: !112)
!111 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!112 = !{!113, !127}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !110, file: !111, line: 94, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !111, line: 59, size: 32, elements: !115)
!115 = !{!116, !120}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !114, file: !111, line: 66, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DISubroutineType(types: !119)
!119 = !{!90}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !114, file: !111, line: 75, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DISubroutineType(types: !123)
!123 = !{!90, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !111, line: 50, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !110, file: !111, line: 99, baseType: !124, size: 32, offset: 32)
!128 = !{i32 7, !"Dwarf Version", i32 4}
!129 = !{i32 2, !"Debug Info Version", i32 3}
!130 = !{i32 1, !"wchar_size", i32 4}
!131 = !{i32 1, !"static_rwdata", i32 1}
!132 = !{i32 1, !"enumsize_buildattr", i32 1}
!133 = !{i32 1, !"armlib_unavailable", i32 0}
!134 = !{i32 8, !"PIC Level", i32 2}
!135 = !{i32 7, !"PIE Level", i32 2}
!136 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!137 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !6, file: !6, line: 223, type: !138, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !140, !142}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !144, line: 250, size: 896, elements: !145)
!144 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!145 = !{!146, !204, !217, !218, !219, !220, !241}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !143, file: !144, line: 252, baseType: !147, size: 384)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !144, line: 58, size: 384, elements: !148)
!148 = !{!149, !162, !170, !173, !174, !187, !190, !191}
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !144, line: 61, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !144, line: 61, size: 64, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !150, file: !144, line: 62, baseType: !92, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !150, file: !144, line: 63, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !155, line: 58, size: 64, elements: !156)
!155 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !154, file: !155, line: 60, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 64, elements: !160)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!160 = !{!161}
!161 = !DISubrange(count: 2)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !147, file: !144, line: 69, baseType: !163, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !165, line: 243, baseType: !166)
!165 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 241, size: 64, elements: !167)
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !166, file: !165, line: 242, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !93, line: 51, baseType: !94)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !147, file: !144, line: 72, baseType: !171, size: 8, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !172, line: 62, baseType: !7)
!172 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!173 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !147, file: !144, line: 75, baseType: !171, size: 8, offset: 104)
!174 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !144, line: 91, baseType: !175, size: 16, offset: 112)
!175 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !144, line: 91, size: 16, elements: !176)
!176 = !{!177, !184}
!177 = !DIDerivedType(tag: DW_TAG_member, scope: !175, file: !144, line: 92, baseType: !178, size: 16)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !175, file: !144, line: 92, size: 16, elements: !179)
!179 = !{!180, !183}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !178, file: !144, line: 97, baseType: !181, size: 8)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !172, line: 56, baseType: !182)
!182 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !178, file: !144, line: 98, baseType: !171, size: 8, offset: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !175, file: !144, line: 101, baseType: !185, size: 16)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !172, line: 63, baseType: !186)
!186 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !147, file: !144, line: 108, baseType: !188, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !172, line: 64, baseType: !189)
!189 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !147, file: !144, line: 132, baseType: !89, size: 32, offset: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !147, file: !144, line: 136, baseType: !192, size: 192, offset: 192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !165, line: 254, size: 192, elements: !193)
!193 = !{!194, !195, !201}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !192, file: !165, line: 255, baseType: !92, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !192, file: !165, line: 256, baseType: !196, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !165, line: 252, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !192, file: !165, line: 259, baseType: !202, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !172, line: 59, baseType: !203)
!203 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !143, file: !144, line: 255, baseType: !205, size: 288, offset: 384)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !206, line: 25, size: 288, elements: !207)
!206 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !205, file: !206, line: 26, baseType: !188, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !205, file: !206, line: 27, baseType: !188, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !205, file: !206, line: 28, baseType: !188, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !205, file: !206, line: 29, baseType: !188, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !205, file: !206, line: 30, baseType: !188, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !205, file: !206, line: 31, baseType: !188, size: 32, offset: 160)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !205, file: !206, line: 32, baseType: !188, size: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !205, file: !206, line: 33, baseType: !188, size: 32, offset: 224)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !205, file: !206, line: 34, baseType: !188, size: 32, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !143, file: !144, line: 258, baseType: !89, size: 32, offset: 672)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !143, file: !144, line: 261, baseType: !164, size: 64, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !143, file: !144, line: 302, baseType: !90, size: 32, offset: 768)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !143, file: !144, line: 333, baseType: !221, size: 32, offset: 800)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !223, line: 5291, size: 160, elements: !224)
!223 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!224 = !{!225, !236, !237}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !222, file: !223, line: 5292, baseType: !226, size: 96)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !227, line: 56, size: 96, elements: !228)
!227 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!228 = !{!229, !232, !233}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !226, file: !227, line: 57, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !227, line: 57, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !226, file: !227, line: 58, baseType: !89, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !226, file: !227, line: 59, baseType: !234, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !235, line: 46, baseType: !189)
!235 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!236 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !222, file: !223, line: 5293, baseType: !164, size: 64, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !222, file: !223, line: 5294, baseType: !238, offset: 160)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !239, line: 45, elements: !240)
!239 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!240 = !{}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !143, file: !144, line: 355, baseType: !242, size: 64, offset: 832)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !206, line: 60, size: 64, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !242, file: !206, line: 63, baseType: !188, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !242, file: !206, line: 66, baseType: !188, size: 32, offset: 32)
!246 = !DILocalVariable(name: "object", arg: 1, scope: !137, file: !6, line: 223, type: !140)
!247 = !DILocation(line: 223, column: 61, scope: !137)
!248 = !DILocalVariable(name: "thread", arg: 2, scope: !137, file: !6, line: 224, type: !142)
!249 = !DILocation(line: 224, column: 24, scope: !137)
!250 = !DILocation(line: 226, column: 9, scope: !137)
!251 = !DILocation(line: 227, column: 9, scope: !137)
!252 = !DILocation(line: 228, column: 1, scope: !137)
!253 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !6, file: !6, line: 243, type: !254, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !140}
!256 = !DILocalVariable(name: "object", arg: 1, scope: !253, file: !6, line: 243, type: !140)
!257 = !DILocation(line: 243, column: 56, scope: !253)
!258 = !DILocation(line: 245, column: 9, scope: !253)
!259 = !DILocation(line: 246, column: 1, scope: !253)
!260 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !6, file: !6, line: 359, type: !261, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!261 = !DISubroutineType(types: !262)
!262 = !{!89, !5}
!263 = !DILocalVariable(name: "otype", arg: 1, scope: !260, file: !6, line: 359, type: !5)
!264 = !DILocation(line: 359, column: 58, scope: !260)
!265 = !DILocation(line: 361, column: 9, scope: !260)
!266 = !DILocation(line: 363, column: 2, scope: !260)
!267 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !6, file: !6, line: 366, type: !268, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!268 = !DISubroutineType(types: !269)
!269 = !{!89, !5, !234}
!270 = !DILocalVariable(name: "otype", arg: 1, scope: !267, file: !6, line: 366, type: !5)
!271 = !DILocation(line: 366, column: 63, scope: !267)
!272 = !DILocalVariable(name: "size", arg: 2, scope: !267, file: !6, line: 367, type: !234)
!273 = !DILocation(line: 367, column: 13, scope: !267)
!274 = !DILocation(line: 369, column: 9, scope: !267)
!275 = !DILocation(line: 370, column: 9, scope: !267)
!276 = !DILocation(line: 372, column: 2, scope: !267)
!277 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !223, file: !223, line: 656, type: !278, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!278 = !DISubroutineType(types: !279)
!279 = !{!280, !282}
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !281, line: 46, baseType: !202)
!281 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!284 = !DILocalVariable(name: "t", arg: 1, scope: !277, file: !223, line: 657, type: !282)
!285 = !DILocation(line: 657, column: 30, scope: !277)
!286 = !DILocation(line: 659, column: 28, scope: !277)
!287 = !DILocation(line: 659, column: 31, scope: !277)
!288 = !DILocation(line: 659, column: 36, scope: !277)
!289 = !DILocation(line: 659, column: 9, scope: !277)
!290 = !DILocation(line: 659, column: 2, scope: !277)
!291 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !223, file: !223, line: 671, type: !278, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!292 = !DILocalVariable(name: "t", arg: 1, scope: !291, file: !223, line: 672, type: !282)
!293 = !DILocation(line: 672, column: 30, scope: !291)
!294 = !DILocation(line: 674, column: 30, scope: !291)
!295 = !DILocation(line: 674, column: 33, scope: !291)
!296 = !DILocation(line: 674, column: 38, scope: !291)
!297 = !DILocation(line: 674, column: 9, scope: !291)
!298 = !DILocation(line: 674, column: 2, scope: !291)
!299 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !223, file: !223, line: 1634, type: !300, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!300 = !DISubroutineType(types: !301)
!301 = !{!280, !302}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !223, line: 1439, size: 448, elements: !305)
!305 = !{!306, !307, !308, !313, !314, !319, !320}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !304, file: !223, line: 1445, baseType: !192, size: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !304, file: !223, line: 1448, baseType: !164, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !304, file: !223, line: 1451, baseType: !309, size: 32, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !312}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !304, file: !223, line: 1454, baseType: !309, size: 32, offset: 288)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !304, file: !223, line: 1457, baseType: !315, size: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !281, line: 67, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !281, line: 65, size: 64, elements: !317)
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !316, file: !281, line: 66, baseType: !280, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !304, file: !223, line: 1460, baseType: !188, size: 32, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !304, file: !223, line: 1463, baseType: !89, size: 32, offset: 416)
!321 = !DILocalVariable(name: "timer", arg: 1, scope: !299, file: !223, line: 1635, type: !302)
!322 = !DILocation(line: 1635, column: 34, scope: !299)
!323 = !DILocation(line: 1637, column: 28, scope: !299)
!324 = !DILocation(line: 1637, column: 35, scope: !299)
!325 = !DILocation(line: 1637, column: 9, scope: !299)
!326 = !DILocation(line: 1637, column: 2, scope: !299)
!327 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !223, file: !223, line: 1649, type: !300, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!328 = !DILocalVariable(name: "timer", arg: 1, scope: !327, file: !223, line: 1650, type: !302)
!329 = !DILocation(line: 1650, column: 34, scope: !327)
!330 = !DILocation(line: 1652, column: 30, scope: !327)
!331 = !DILocation(line: 1652, column: 37, scope: !327)
!332 = !DILocation(line: 1652, column: 9, scope: !327)
!333 = !DILocation(line: 1652, column: 2, scope: !327)
!334 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !223, file: !223, line: 1689, type: !335, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !312, !89}
!337 = !DILocalVariable(name: "timer", arg: 1, scope: !334, file: !223, line: 1689, type: !312)
!338 = !DILocation(line: 1689, column: 65, scope: !334)
!339 = !DILocalVariable(name: "user_data", arg: 2, scope: !334, file: !223, line: 1690, type: !89)
!340 = !DILocation(line: 1690, column: 19, scope: !334)
!341 = !DILocation(line: 1692, column: 21, scope: !334)
!342 = !DILocation(line: 1692, column: 2, scope: !334)
!343 = !DILocation(line: 1692, column: 9, scope: !334)
!344 = !DILocation(line: 1692, column: 19, scope: !334)
!345 = !DILocation(line: 1693, column: 1, scope: !334)
!346 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !223, file: !223, line: 1704, type: !347, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!347 = !DISubroutineType(types: !348)
!348 = !{!89, !302}
!349 = !DILocalVariable(name: "timer", arg: 1, scope: !346, file: !223, line: 1704, type: !302)
!350 = !DILocation(line: 1704, column: 72, scope: !346)
!351 = !DILocation(line: 1706, column: 9, scope: !346)
!352 = !DILocation(line: 1706, column: 16, scope: !346)
!353 = !DILocation(line: 1706, column: 2, scope: !346)
!354 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !223, file: !223, line: 2071, type: !355, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!355 = !DISubroutineType(types: !356)
!356 = !{!90, !357}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !223, line: 1830, size: 128, elements: !359)
!359 = !{!360, !373, !374}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !358, file: !223, line: 1831, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !362, line: 60, baseType: !363)
!362 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !362, line: 53, size: 64, elements: !364)
!364 = !{!365, !372}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !363, file: !362, line: 54, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !362, line: 50, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !362, line: 44, size: 32, elements: !369)
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !368, file: !362, line: 45, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !362, line: 40, baseType: !188)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !363, file: !362, line: 55, baseType: !366, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !358, file: !223, line: 1832, baseType: !238, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !358, file: !223, line: 1833, baseType: !164, size: 64, offset: 64)
!375 = !DILocalVariable(name: "queue", arg: 1, scope: !354, file: !223, line: 2071, type: !357)
!376 = !DILocation(line: 2071, column: 59, scope: !354)
!377 = !DILocation(line: 2073, column: 35, scope: !354)
!378 = !DILocation(line: 2073, column: 42, scope: !354)
!379 = !DILocation(line: 2073, column: 14, scope: !354)
!380 = !DILocation(line: 2073, column: 9, scope: !354)
!381 = !DILocation(line: 2073, column: 2, scope: !354)
!382 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !223, file: !223, line: 3209, type: !383, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!383 = !DISubroutineType(types: !384)
!384 = !{!189, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !223, line: 3092, size: 128, elements: !387)
!387 = !{!388, !389, !390}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !386, file: !223, line: 3093, baseType: !164, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !386, file: !223, line: 3094, baseType: !189, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !386, file: !223, line: 3095, baseType: !189, size: 32, offset: 96)
!391 = !DILocalVariable(name: "sem", arg: 1, scope: !382, file: !223, line: 3209, type: !385)
!392 = !DILocation(line: 3209, column: 65, scope: !382)
!393 = !DILocation(line: 3211, column: 9, scope: !382)
!394 = !DILocation(line: 3211, column: 14, scope: !382)
!395 = !DILocation(line: 3211, column: 2, scope: !382)
!396 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !223, file: !223, line: 4649, type: !397, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!397 = !DISubroutineType(types: !398)
!398 = !{!188, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !223, line: 4390, size: 320, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !409, !410, !411, !412, !413}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !400, file: !223, line: 4392, baseType: !164, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !400, file: !223, line: 4394, baseType: !238, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !400, file: !223, line: 4396, baseType: !234, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !400, file: !223, line: 4398, baseType: !188, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !400, file: !223, line: 4400, baseType: !407, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!408 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !400, file: !223, line: 4402, baseType: !407, size: 32, offset: 160)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !400, file: !223, line: 4404, baseType: !407, size: 32, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !400, file: !223, line: 4406, baseType: !407, size: 32, offset: 224)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !400, file: !223, line: 4408, baseType: !188, size: 32, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !400, file: !223, line: 4413, baseType: !171, size: 8, offset: 288)
!414 = !DILocalVariable(name: "msgq", arg: 1, scope: !396, file: !223, line: 4649, type: !399)
!415 = !DILocation(line: 4649, column: 66, scope: !396)
!416 = !DILocation(line: 4651, column: 9, scope: !396)
!417 = !DILocation(line: 4651, column: 15, scope: !396)
!418 = !DILocation(line: 4651, column: 26, scope: !396)
!419 = !DILocation(line: 4651, column: 32, scope: !396)
!420 = !DILocation(line: 4651, column: 24, scope: !396)
!421 = !DILocation(line: 4651, column: 2, scope: !396)
!422 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !223, file: !223, line: 4665, type: !397, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!423 = !DILocalVariable(name: "msgq", arg: 1, scope: !422, file: !223, line: 4665, type: !399)
!424 = !DILocation(line: 4665, column: 66, scope: !422)
!425 = !DILocation(line: 4667, column: 9, scope: !422)
!426 = !DILocation(line: 4667, column: 15, scope: !422)
!427 = !DILocation(line: 4667, column: 2, scope: !422)
!428 = distinct !DISubprogram(name: "k_heap_init", scope: !108, file: !108, line: 15, type: !429, scopeLine: 16, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !240)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !221, !89, !431}
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !432, line: 51, baseType: !189)
!432 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/string.h", directory: "")
!433 = !DILocalVariable(name: "h", arg: 1, scope: !428, file: !108, line: 15, type: !221)
!434 = !DILocation(line: 15, column: 33, scope: !428)
!435 = !DILocalVariable(name: "mem", arg: 2, scope: !428, file: !108, line: 15, type: !89)
!436 = !DILocation(line: 15, column: 42, scope: !428)
!437 = !DILocalVariable(name: "bytes", arg: 3, scope: !428, file: !108, line: 15, type: !431)
!438 = !DILocation(line: 15, column: 54, scope: !428)
!439 = !DILocation(line: 17, column: 16, scope: !428)
!440 = !DILocation(line: 17, column: 19, scope: !428)
!441 = !DILocation(line: 17, column: 2, scope: !428)
!442 = !DILocation(line: 18, column: 17, scope: !428)
!443 = !DILocation(line: 18, column: 20, scope: !428)
!444 = !DILocation(line: 18, column: 26, scope: !428)
!445 = !DILocation(line: 18, column: 31, scope: !428)
!446 = !DILocation(line: 18, column: 2, scope: !428)
!447 = !DILocation(line: 20, column: 2, scope: !428)
!448 = !DILocation(line: 20, column: 7, scope: !449)
!449 = distinct !DILexicalBlock(scope: !428, file: !108, line: 20, column: 5)
!450 = !DILocation(line: 21, column: 1, scope: !428)
!451 = distinct !DISubprogram(name: "z_waitq_init", scope: !452, file: !452, line: 47, type: !453, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!452 = !DIFile(filename: "kernel/include/wait_q.h", directory: "/home/sri/zephyrproject/zephyr")
!453 = !DISubroutineType(types: !454)
!454 = !{null, !163}
!455 = !DILocalVariable(name: "w", arg: 1, scope: !451, file: !452, line: 47, type: !163)
!456 = !DILocation(line: 47, column: 44, scope: !451)
!457 = !DILocation(line: 49, column: 18, scope: !451)
!458 = !DILocation(line: 49, column: 21, scope: !451)
!459 = !DILocation(line: 49, column: 2, scope: !451)
!460 = !DILocation(line: 50, column: 1, scope: !451)
!461 = distinct !DISubprogram(name: "statics_init", scope: !108, file: !108, line: 23, type: !118, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !240)
!462 = !DILocalVariable(name: "h", scope: !463, file: !108, line: 25, type: !221)
!463 = distinct !DILexicalBlock(scope: !461, file: !108, line: 25, column: 86)
!464 = !DILocation(line: 25, column: 107, scope: !463)
!465 = !DILocation(line: 25, column: 91, scope: !463)
