; ModuleID = '../bc_files/kheap.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/kheap.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { ptr, ptr, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%struct.k_spinlock = type {}
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }

!38 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 29)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 30)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 31)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 32)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 33)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 34)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 35)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 36)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 37)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 38)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 39)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 40)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 41)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 42)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 43)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 44)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 45)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 46)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 47)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!87 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!88 = !{!89, !90, !91}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !93, line: 55, baseType: !94)
!93 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !93, line: 37, size: 64, elements: !95)
!95 = !{!96, !102}
!96 = !DIDerivedType(tag: DW_TAG_member, scope: !94, file: !93, line: 38, baseType: !97, size: 32)
!97 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !94, file: !93, line: 38, size: 32, elements: !98)
!98 = !{!99, !101}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !97, file: !93, line: 39, baseType: !100, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !97, file: !93, line: 40, baseType: !100, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, scope: !94, file: !93, line: 42, baseType: !103, size: 32, offset: 32)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !94, file: !93, line: 42, size: 32, elements: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !103, file: !93, line: 43, baseType: !100, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !103, file: !93, line: 44, baseType: !100, size: 32)
!107 = !{!0}
!108 = !DIFile(filename: "kernel/kheap.c", directory: "/home/sri/zephyrproject/zephyr")
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !111, line: 92, size: 64, elements: !112)
!111 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!112 = !{!113, !127}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !110, file: !111, line: 94, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !111, line: 59, size: 32, elements: !115)
!115 = !{!116, !120}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !114, file: !111, line: 66, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DISubroutineType(types: !119)
!119 = !{!90}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !114, file: !111, line: 75, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DISubroutineType(types: !123)
!123 = !{!90, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !111, line: 50, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !110, file: !111, line: 99, baseType: !124, size: 32, offset: 32)
!128 = !{i32 7, !"Dwarf Version", i32 4}
!129 = !{i32 2, !"Debug Info Version", i32 3}
!130 = !{i32 1, !"wchar_size", i32 4}
!131 = !{i32 1, !"static_rwdata", i32 1}
!132 = !{i32 1, !"enumsize_buildattr", i32 1}
!133 = !{i32 1, !"armlib_unavailable", i32 0}
!134 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!135 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !6, file: !6, line: 223, type: !136, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !244)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !138, !140}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !142, line: 250, size: 896, elements: !143)
!142 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!143 = !{!144, !202, !215, !216, !217, !218, !239}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !141, file: !142, line: 252, baseType: !145, size: 384)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !142, line: 58, size: 384, elements: !146)
!146 = !{!147, !160, !168, !171, !172, !185, !188, !189}
!147 = !DIDerivedType(tag: DW_TAG_member, scope: !145, file: !142, line: 61, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !145, file: !142, line: 61, size: 64, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !148, file: !142, line: 62, baseType: !92, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !148, file: !142, line: 63, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !153, line: 58, size: 64, elements: !154)
!153 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !152, file: !153, line: 60, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 64, elements: !158)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!158 = !{!159}
!159 = !DISubrange(count: 2)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !145, file: !142, line: 69, baseType: !161, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 243, baseType: !164)
!163 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 241, size: 64, elements: !165)
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !164, file: !163, line: 242, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !93, line: 51, baseType: !94)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !145, file: !142, line: 72, baseType: !169, size: 8, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !170, line: 62, baseType: !7)
!170 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!171 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !145, file: !142, line: 75, baseType: !169, size: 8, offset: 104)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !145, file: !142, line: 91, baseType: !173, size: 16, offset: 112)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !145, file: !142, line: 91, size: 16, elements: !174)
!174 = !{!175, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, scope: !173, file: !142, line: 92, baseType: !176, size: 16)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !173, file: !142, line: 92, size: 16, elements: !177)
!177 = !{!178, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !176, file: !142, line: 97, baseType: !179, size: 8)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !170, line: 56, baseType: !180)
!180 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !176, file: !142, line: 98, baseType: !169, size: 8, offset: 8)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !173, file: !142, line: 101, baseType: !183, size: 16)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !170, line: 63, baseType: !184)
!184 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !145, file: !142, line: 108, baseType: !186, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !170, line: 64, baseType: !187)
!187 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !145, file: !142, line: 132, baseType: !89, size: 32, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !145, file: !142, line: 136, baseType: !190, size: 192, offset: 192)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 254, size: 192, elements: !191)
!191 = !{!192, !193, !199}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !190, file: !163, line: 255, baseType: !92, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !190, file: !163, line: 256, baseType: !194, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 252, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !190, file: !163, line: 259, baseType: !200, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !170, line: 59, baseType: !201)
!201 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !141, file: !142, line: 255, baseType: !203, size: 288, offset: 384)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !204, line: 25, size: 288, elements: !205)
!204 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !203, file: !204, line: 26, baseType: !186, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !203, file: !204, line: 27, baseType: !186, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !203, file: !204, line: 28, baseType: !186, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !203, file: !204, line: 29, baseType: !186, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !203, file: !204, line: 30, baseType: !186, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !203, file: !204, line: 31, baseType: !186, size: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !203, file: !204, line: 32, baseType: !186, size: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !203, file: !204, line: 33, baseType: !186, size: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !203, file: !204, line: 34, baseType: !186, size: 32, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !141, file: !142, line: 258, baseType: !89, size: 32, offset: 672)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !141, file: !142, line: 261, baseType: !162, size: 64, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !141, file: !142, line: 302, baseType: !90, size: 32, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !141, file: !142, line: 333, baseType: !219, size: 32, offset: 800)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !221, line: 5291, size: 160, elements: !222)
!221 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!222 = !{!223, !234, !235}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !220, file: !221, line: 5292, baseType: !224, size: 96)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !225, line: 56, size: 96, elements: !226)
!225 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!226 = !{!227, !230, !231}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !224, file: !225, line: 57, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !225, line: 57, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !224, file: !225, line: 58, baseType: !89, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !224, file: !225, line: 59, baseType: !232, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !233, line: 46, baseType: !187)
!233 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!234 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !220, file: !221, line: 5293, baseType: !162, size: 64, offset: 96)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !220, file: !221, line: 5294, baseType: !236, offset: 160)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !237, line: 45, elements: !238)
!237 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!238 = !{}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !141, file: !142, line: 355, baseType: !240, size: 64, offset: 832)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !204, line: 60, size: 64, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !240, file: !204, line: 63, baseType: !186, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !240, file: !204, line: 66, baseType: !186, size: 32, offset: 32)
!244 = !{!245, !246}
!245 = !DILocalVariable(name: "object", arg: 1, scope: !135, file: !6, line: 223, type: !138)
!246 = !DILocalVariable(name: "thread", arg: 2, scope: !135, file: !6, line: 224, type: !140)
!247 = !DILocation(line: 223, column: 61, scope: !135)
!248 = !DILocation(line: 224, column: 24, scope: !135)
!249 = !DILocation(line: 226, column: 9, scope: !135)
!250 = !DILocation(line: 227, column: 9, scope: !135)
!251 = !DILocation(line: 228, column: 1, scope: !135)
!252 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !6, file: !6, line: 243, type: !253, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !255)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !138}
!255 = !{!256}
!256 = !DILocalVariable(name: "object", arg: 1, scope: !252, file: !6, line: 243, type: !138)
!257 = !DILocation(line: 243, column: 56, scope: !252)
!258 = !DILocation(line: 245, column: 9, scope: !252)
!259 = !DILocation(line: 246, column: 1, scope: !252)
!260 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !6, file: !6, line: 359, type: !261, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !263)
!261 = !DISubroutineType(types: !262)
!262 = !{!89, !5}
!263 = !{!264}
!264 = !DILocalVariable(name: "otype", arg: 1, scope: !260, file: !6, line: 359, type: !5)
!265 = !DILocation(line: 359, column: 58, scope: !260)
!266 = !DILocation(line: 361, column: 9, scope: !260)
!267 = !DILocation(line: 363, column: 2, scope: !260)
!268 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !6, file: !6, line: 366, type: !269, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !271)
!269 = !DISubroutineType(types: !270)
!270 = !{!89, !5, !232}
!271 = !{!272, !273}
!272 = !DILocalVariable(name: "otype", arg: 1, scope: !268, file: !6, line: 366, type: !5)
!273 = !DILocalVariable(name: "size", arg: 2, scope: !268, file: !6, line: 367, type: !232)
!274 = !DILocation(line: 366, column: 63, scope: !268)
!275 = !DILocation(line: 367, column: 13, scope: !268)
!276 = !DILocation(line: 369, column: 9, scope: !268)
!277 = !DILocation(line: 370, column: 9, scope: !268)
!278 = !DILocation(line: 372, column: 2, scope: !268)
!279 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !221, file: !221, line: 656, type: !280, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !286)
!280 = !DISubroutineType(types: !281)
!281 = !{!282, !284}
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !283, line: 46, baseType: !200)
!283 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!286 = !{!287}
!287 = !DILocalVariable(name: "t", arg: 1, scope: !279, file: !221, line: 657, type: !284)
!288 = !DILocation(line: 657, column: 30, scope: !279)
!289 = !DILocation(line: 659, column: 28, scope: !279)
!290 = !DILocation(line: 659, column: 31, scope: !279)
!291 = !DILocation(line: 659, column: 36, scope: !279)
!292 = !DILocation(line: 659, column: 9, scope: !279)
!293 = !DILocation(line: 659, column: 2, scope: !279)
!294 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !221, file: !221, line: 671, type: !280, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !295)
!295 = !{!296}
!296 = !DILocalVariable(name: "t", arg: 1, scope: !294, file: !221, line: 672, type: !284)
!297 = !DILocation(line: 672, column: 30, scope: !294)
!298 = !DILocation(line: 674, column: 30, scope: !294)
!299 = !DILocation(line: 674, column: 33, scope: !294)
!300 = !DILocation(line: 674, column: 38, scope: !294)
!301 = !DILocation(line: 674, column: 9, scope: !294)
!302 = !DILocation(line: 674, column: 2, scope: !294)
!303 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !221, file: !221, line: 1634, type: !304, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !325)
!304 = !DISubroutineType(types: !305)
!305 = !{!282, !306}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !221, line: 1439, size: 448, elements: !309)
!309 = !{!310, !311, !312, !317, !318, !323, !324}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !308, file: !221, line: 1445, baseType: !190, size: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !308, file: !221, line: 1448, baseType: !162, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !308, file: !221, line: 1451, baseType: !313, size: 32, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !308, file: !221, line: 1454, baseType: !313, size: 32, offset: 288)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !308, file: !221, line: 1457, baseType: !319, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !283, line: 67, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !283, line: 65, size: 64, elements: !321)
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !320, file: !283, line: 66, baseType: !282, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !308, file: !221, line: 1460, baseType: !186, size: 32, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !308, file: !221, line: 1463, baseType: !89, size: 32, offset: 416)
!325 = !{!326}
!326 = !DILocalVariable(name: "timer", arg: 1, scope: !303, file: !221, line: 1635, type: !306)
!327 = !DILocation(line: 1635, column: 34, scope: !303)
!328 = !DILocation(line: 1637, column: 28, scope: !303)
!329 = !DILocation(line: 1637, column: 35, scope: !303)
!330 = !DILocation(line: 1637, column: 9, scope: !303)
!331 = !DILocation(line: 1637, column: 2, scope: !303)
!332 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !221, file: !221, line: 1649, type: !304, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !333)
!333 = !{!334}
!334 = !DILocalVariable(name: "timer", arg: 1, scope: !332, file: !221, line: 1650, type: !306)
!335 = !DILocation(line: 1650, column: 34, scope: !332)
!336 = !DILocation(line: 1652, column: 30, scope: !332)
!337 = !DILocation(line: 1652, column: 37, scope: !332)
!338 = !DILocation(line: 1652, column: 9, scope: !332)
!339 = !DILocation(line: 1652, column: 2, scope: !332)
!340 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !221, file: !221, line: 1689, type: !341, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !343)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !316, !89}
!343 = !{!344, !345}
!344 = !DILocalVariable(name: "timer", arg: 1, scope: !340, file: !221, line: 1689, type: !316)
!345 = !DILocalVariable(name: "user_data", arg: 2, scope: !340, file: !221, line: 1690, type: !89)
!346 = !DILocation(line: 1689, column: 65, scope: !340)
!347 = !DILocation(line: 1690, column: 19, scope: !340)
!348 = !DILocation(line: 1692, column: 21, scope: !340)
!349 = !DILocation(line: 1692, column: 2, scope: !340)
!350 = !DILocation(line: 1692, column: 9, scope: !340)
!351 = !DILocation(line: 1692, column: 19, scope: !340)
!352 = !DILocation(line: 1693, column: 1, scope: !340)
!353 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !221, file: !221, line: 1704, type: !354, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !356)
!354 = !DISubroutineType(types: !355)
!355 = !{!89, !306}
!356 = !{!357}
!357 = !DILocalVariable(name: "timer", arg: 1, scope: !353, file: !221, line: 1704, type: !306)
!358 = !DILocation(line: 1704, column: 72, scope: !353)
!359 = !DILocation(line: 1706, column: 9, scope: !353)
!360 = !DILocation(line: 1706, column: 16, scope: !353)
!361 = !DILocation(line: 1706, column: 2, scope: !353)
!362 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !221, file: !221, line: 2071, type: !363, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !383)
!363 = !DISubroutineType(types: !364)
!364 = !{!90, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !221, line: 1830, size: 128, elements: !367)
!367 = !{!368, !381, !382}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !366, file: !221, line: 1831, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !370, line: 60, baseType: !371)
!370 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !370, line: 53, size: 64, elements: !372)
!372 = !{!373, !380}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !371, file: !370, line: 54, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !370, line: 50, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !370, line: 44, size: 32, elements: !377)
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !376, file: !370, line: 45, baseType: !379, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !370, line: 40, baseType: !186)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !371, file: !370, line: 55, baseType: !374, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !366, file: !221, line: 1832, baseType: !236, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !366, file: !221, line: 1833, baseType: !162, size: 64, offset: 64)
!383 = !{!384}
!384 = !DILocalVariable(name: "queue", arg: 1, scope: !362, file: !221, line: 2071, type: !365)
!385 = !DILocation(line: 2071, column: 59, scope: !362)
!386 = !DILocation(line: 2073, column: 35, scope: !362)
!387 = !DILocation(line: 2073, column: 42, scope: !362)
!388 = !DILocation(line: 2073, column: 14, scope: !362)
!389 = !DILocation(line: 2073, column: 9, scope: !362)
!390 = !DILocation(line: 2073, column: 2, scope: !362)
!391 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !221, file: !221, line: 3209, type: !392, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !400)
!392 = !DISubroutineType(types: !393)
!393 = !{!187, !394}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !221, line: 3092, size: 128, elements: !396)
!396 = !{!397, !398, !399}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !395, file: !221, line: 3093, baseType: !162, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !395, file: !221, line: 3094, baseType: !187, size: 32, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !395, file: !221, line: 3095, baseType: !187, size: 32, offset: 96)
!400 = !{!401}
!401 = !DILocalVariable(name: "sem", arg: 1, scope: !391, file: !221, line: 3209, type: !394)
!402 = !DILocation(line: 3209, column: 65, scope: !391)
!403 = !DILocation(line: 3211, column: 9, scope: !391)
!404 = !DILocation(line: 3211, column: 14, scope: !391)
!405 = !DILocation(line: 3211, column: 2, scope: !391)
!406 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !221, file: !221, line: 4649, type: !407, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !424)
!407 = !DISubroutineType(types: !408)
!408 = !{!186, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !221, line: 4390, size: 320, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !419, !420, !421, !422, !423}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !410, file: !221, line: 4392, baseType: !162, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !410, file: !221, line: 4394, baseType: !236, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !410, file: !221, line: 4396, baseType: !232, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !410, file: !221, line: 4398, baseType: !186, size: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !410, file: !221, line: 4400, baseType: !417, size: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !410, file: !221, line: 4402, baseType: !417, size: 32, offset: 160)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !410, file: !221, line: 4404, baseType: !417, size: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !410, file: !221, line: 4406, baseType: !417, size: 32, offset: 224)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !410, file: !221, line: 4408, baseType: !186, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !410, file: !221, line: 4413, baseType: !169, size: 8, offset: 288)
!424 = !{!425}
!425 = !DILocalVariable(name: "msgq", arg: 1, scope: !406, file: !221, line: 4649, type: !409)
!426 = !DILocation(line: 4649, column: 66, scope: !406)
!427 = !DILocation(line: 4651, column: 9, scope: !406)
!428 = !DILocation(line: 4651, column: 15, scope: !406)
!429 = !DILocation(line: 4651, column: 26, scope: !406)
!430 = !DILocation(line: 4651, column: 32, scope: !406)
!431 = !DILocation(line: 4651, column: 24, scope: !406)
!432 = !DILocation(line: 4651, column: 2, scope: !406)
!433 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !221, file: !221, line: 4665, type: !407, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !434)
!434 = !{!435}
!435 = !DILocalVariable(name: "msgq", arg: 1, scope: !433, file: !221, line: 4665, type: !409)
!436 = !DILocation(line: 4665, column: 66, scope: !433)
!437 = !DILocation(line: 4667, column: 9, scope: !433)
!438 = !DILocation(line: 4667, column: 15, scope: !433)
!439 = !DILocation(line: 4667, column: 2, scope: !433)
!440 = distinct !DISubprogram(name: "k_heap_init", scope: !108, file: !108, line: 15, type: !441, scopeLine: 16, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !445)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !219, !89, !443}
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !444, line: 51, baseType: !187)
!444 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/string.h", directory: "")
!445 = !{!446, !447, !448}
!446 = !DILocalVariable(name: "h", arg: 1, scope: !440, file: !108, line: 15, type: !219)
!447 = !DILocalVariable(name: "mem", arg: 2, scope: !440, file: !108, line: 15, type: !89)
!448 = !DILocalVariable(name: "bytes", arg: 3, scope: !440, file: !108, line: 15, type: !443)
!449 = !DILocation(line: 15, column: 33, scope: !440)
!450 = !DILocation(line: 15, column: 42, scope: !440)
!451 = !DILocation(line: 15, column: 54, scope: !440)
!452 = !DILocation(line: 17, column: 16, scope: !440)
!453 = !DILocation(line: 17, column: 19, scope: !440)
!454 = !DILocation(line: 17, column: 2, scope: !440)
!455 = !DILocation(line: 18, column: 17, scope: !440)
!456 = !DILocation(line: 18, column: 20, scope: !440)
!457 = !DILocation(line: 18, column: 26, scope: !440)
!458 = !DILocation(line: 18, column: 31, scope: !440)
!459 = !DILocation(line: 18, column: 2, scope: !440)
!460 = !DILocation(line: 20, column: 2, scope: !440)
!461 = !DILocation(line: 20, column: 7, scope: !462)
!462 = distinct !DILexicalBlock(scope: !440, file: !108, line: 20, column: 5)
!463 = !DILocation(line: 21, column: 1, scope: !440)
!464 = distinct !DISubprogram(name: "z_waitq_init", scope: !465, file: !465, line: 47, type: !466, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !468)
!465 = !DIFile(filename: "kernel/include/wait_q.h", directory: "/home/sri/zephyrproject/zephyr")
!466 = !DISubroutineType(types: !467)
!467 = !{null, !161}
!468 = !{!469}
!469 = !DILocalVariable(name: "w", arg: 1, scope: !464, file: !465, line: 47, type: !161)
!470 = !DILocation(line: 47, column: 44, scope: !464)
!471 = !DILocation(line: 49, column: 18, scope: !464)
!472 = !DILocation(line: 49, column: 21, scope: !464)
!473 = !DILocation(line: 49, column: 2, scope: !464)
!474 = !DILocation(line: 50, column: 1, scope: !464)
!475 = !DISubprogram(name: "sys_heap_init", scope: !225, file: !225, line: 102, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !238)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !478, !89, !232}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
