; ModuleID = '../bc_files/mailbox.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/mailbox.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_stack = type { %struct._wait_q_t, %struct.k_spinlock, ptr, ptr, ptr, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%struct.k_spinlock = type {}
%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.z_kernel = type { [1 x %struct._cpu], %struct._ready_q }
%struct._cpu = type { i32, ptr, ptr, ptr, i8, %struct._cpu_arch }
%struct._cpu_arch = type {}
%struct._ready_q = type { ptr, %struct._dnode }
%struct.k_mbox_async = type { %struct._thread_base, %struct.k_mbox_msg }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct.k_mbox_msg = type { i32, i32, i32, ptr, ptr, %struct.k_mem_block, ptr, ptr, ptr, ptr }
%struct.k_mem_block = type { %union.anon.3 }
%union.anon.3 = type { %struct.k_mem_block_id }
%struct.k_mem_block_id = type { ptr, ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }

!41 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 32)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 33)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 34)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 35)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 36)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 37)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 38)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 39)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 40)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 41)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 42)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 43)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 44)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 45)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 46)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 47)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!87 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!88 = !{!89, !210, !212, !214, !153, !183, !246, !248, !249, !250, !236}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !91, line: 250, size: 896, elements: !92)
!91 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!92 = !{!93, !167, !180, !181, !182, !184, !205}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !90, file: !91, line: 252, baseType: !94, size: 384)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !91, line: 58, size: 384, elements: !95)
!95 = !{!96, !124, !132, !135, !136, !149, !152, !154}
!96 = !DIDerivedType(tag: DW_TAG_member, scope: !94, file: !91, line: 61, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !94, file: !91, line: 61, size: 64, elements: !98)
!98 = !{!99, !115}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !97, file: !91, line: 62, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !101, line: 55, baseType: !102)
!101 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !101, line: 37, size: 64, elements: !103)
!103 = !{!104, !110}
!104 = !DIDerivedType(tag: DW_TAG_member, scope: !102, file: !101, line: 38, baseType: !105, size: 32)
!105 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !102, file: !101, line: 38, size: 32, elements: !106)
!106 = !{!107, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !105, file: !101, line: 39, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !105, file: !101, line: 40, baseType: !108, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, scope: !102, file: !101, line: 42, baseType: !111, size: 32, offset: 32)
!111 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !102, file: !101, line: 42, size: 32, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !111, file: !101, line: 43, baseType: !108, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !111, file: !101, line: 44, baseType: !108, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !97, file: !91, line: 63, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !117, line: 58, size: 64, elements: !118)
!117 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!118 = !{!119}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !116, file: !117, line: 60, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !122)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!122 = !{!123}
!123 = !DISubrange(count: 2)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !94, file: !91, line: 69, baseType: !125, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !127, line: 243, baseType: !128)
!127 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 241, size: 64, elements: !129)
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !128, file: !127, line: 242, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !101, line: 51, baseType: !102)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !94, file: !91, line: 72, baseType: !133, size: 8, offset: 96)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !134, line: 62, baseType: !7)
!134 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!135 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !94, file: !91, line: 75, baseType: !133, size: 8, offset: 104)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !94, file: !91, line: 91, baseType: !137, size: 16, offset: 112)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !94, file: !91, line: 91, size: 16, elements: !138)
!138 = !{!139, !146}
!139 = !DIDerivedType(tag: DW_TAG_member, scope: !137, file: !91, line: 92, baseType: !140, size: 16)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !137, file: !91, line: 92, size: 16, elements: !141)
!141 = !{!142, !145}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !140, file: !91, line: 97, baseType: !143, size: 8)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !134, line: 56, baseType: !144)
!144 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !140, file: !91, line: 98, baseType: !133, size: 8, offset: 8)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !137, file: !91, line: 101, baseType: !147, size: 16)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !134, line: 63, baseType: !148)
!148 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !94, file: !91, line: 108, baseType: !150, size: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !134, line: 64, baseType: !151)
!151 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !94, file: !91, line: 132, baseType: !153, size: 32, offset: 160)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !94, file: !91, line: 136, baseType: !155, size: 192, offset: 192)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !127, line: 254, size: 192, elements: !156)
!156 = !{!157, !158, !164}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !155, file: !127, line: 255, baseType: !100, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !155, file: !127, line: 256, baseType: !159, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !127, line: 252, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !155, file: !127, line: 259, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !134, line: 59, baseType: !166)
!166 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !90, file: !91, line: 255, baseType: !168, size: 288, offset: 384)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !169, line: 25, size: 288, elements: !170)
!169 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !168, file: !169, line: 26, baseType: !150, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !168, file: !169, line: 27, baseType: !150, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !168, file: !169, line: 28, baseType: !150, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !168, file: !169, line: 29, baseType: !150, size: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !168, file: !169, line: 30, baseType: !150, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !168, file: !169, line: 31, baseType: !150, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !168, file: !169, line: 32, baseType: !150, size: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !168, file: !169, line: 33, baseType: !150, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !168, file: !169, line: 34, baseType: !150, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !90, file: !91, line: 258, baseType: !153, size: 32, offset: 672)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !90, file: !91, line: 261, baseType: !126, size: 64, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !90, file: !91, line: 302, baseType: !183, size: 32, offset: 768)
!183 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !90, file: !91, line: 333, baseType: !185, size: 32, offset: 800)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !187, line: 5291, size: 160, elements: !188)
!187 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!188 = !{!189, !200, !201}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !186, file: !187, line: 5292, baseType: !190, size: 96)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !191, line: 56, size: 96, elements: !192)
!191 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!192 = !{!193, !196, !197}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !190, file: !191, line: 57, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !191, line: 57, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !190, file: !191, line: 58, baseType: !153, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !190, file: !191, line: 59, baseType: !198, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !199, line: 46, baseType: !151)
!199 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!200 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !186, file: !187, line: 5293, baseType: !126, size: 64, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !186, file: !187, line: 5294, baseType: !202, offset: 160)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !203, line: 45, elements: !204)
!203 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!204 = !{}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !90, file: !91, line: 355, baseType: !206, size: 64, offset: 832)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !169, line: 60, size: 64, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !206, file: !169, line: 63, baseType: !150, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !206, file: !169, line: 66, baseType: !150, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !211, line: 46, baseType: !165)
!211 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mbox_msg", file: !187, line: 4682, size: 352, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !235, !237, !238, !239}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_mailbox", scope: !215, file: !187, line: 4684, baseType: !150, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !215, file: !187, line: 4686, baseType: !198, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !215, file: !187, line: 4688, baseType: !150, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tx_data", scope: !215, file: !187, line: 4690, baseType: !153, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_rx_data", scope: !215, file: !187, line: 4692, baseType: !153, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tx_block", scope: !215, file: !187, line: 4694, baseType: !223, size: 64, offset: 160)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_block", file: !224, line: 24, size: 64, elements: !225)
!224 = !DIFile(filename: "include/zephyr/kernel/mempool_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, scope: !223, file: !224, line: 25, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !223, file: !224, line: 25, size: 64, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !227, file: !224, line: 26, baseType: !153, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !227, file: !224, line: 27, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_block_id", file: !224, line: 16, size: 64, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !231, file: !224, line: 17, baseType: !153, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !231, file: !224, line: 18, baseType: !185, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "rx_source_thread", scope: !215, file: !187, line: 4696, baseType: !236, size: 32, offset: 224)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !91, line: 359, baseType: !89)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tx_target_thread", scope: !215, file: !187, line: 4698, baseType: !236, size: 32, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_syncing_thread", scope: !215, file: !187, line: 4700, baseType: !236, size: 32, offset: 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_async_sem", scope: !215, file: !187, line: 4703, baseType: !240, size: 32, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !187, line: 3092, size: 128, elements: !242)
!242 = !{!243, !244, !245}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !241, file: !187, line: 3093, baseType: !126, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !241, file: !187, line: 3094, baseType: !151, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !241, file: !187, line: 3095, baseType: !151, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_data_t", file: !187, line: 2738, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !134, line: 102, baseType: !151)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mbox_async", file: !252, line: 30, size: 768, elements: !253)
!252 = !DIFile(filename: "kernel/mailbox.c", directory: "/home/sri/zephyrproject/zephyr")
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !251, file: !252, line: 31, baseType: !94, size: 384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tx_msg", scope: !251, file: !252, line: 32, baseType: !215, size: 352, offset: 384)
!256 = !{!0, !257, !278, !283}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "__init_init_mbox_module", scope: !2, file: !252, line: 88, type: !259, isLocal: true, isDefinition: true, align: 32)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !261, line: 92, size: 64, elements: !262)
!261 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!262 = !{!263, !277}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !260, file: !261, line: 94, baseType: !264, size: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !261, line: 59, size: 32, elements: !265)
!265 = !{!266, !270}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !264, file: !261, line: 66, baseType: !267, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DISubroutineType(types: !269)
!269 = !{!183}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !264, file: !261, line: 75, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DISubroutineType(types: !273)
!273 = !{!183, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !261, line: 50, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !260, file: !261, line: 99, baseType: !274, size: 32, offset: 32)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "_k_stack_buf_async_msg_free", scope: !2, file: !252, line: 36, type: !280, isLocal: false, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 320, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 10)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "async_msg", scope: !285, file: !252, line: 60, type: !286, isLocal: true, isDefinition: true)
!285 = distinct !DISubprogram(name: "init_mbox_module", scope: !252, file: !252, line: 57, type: !268, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 7680, elements: !281)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_stack", file: !187, line: 2740, size: 192, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !287, file: !187, line: 2741, baseType: !126, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !287, file: !187, line: 2742, baseType: !202, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !287, file: !187, line: 2743, baseType: !249, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !187, line: 2743, baseType: !249, size: 32, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !287, file: !187, line: 2743, baseType: !249, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !187, line: 2745, baseType: !133, size: 8, offset: 160)
!295 = !{i32 7, !"Dwarf Version", i32 4}
!296 = !{i32 2, !"Debug Info Version", i32 3}
!297 = !{i32 1, !"wchar_size", i32 4}
!298 = !{i32 1, !"static_rwdata", i32 1}
!299 = !{i32 1, !"enumsize_buildattr", i32 1}
!300 = !{i32 1, !"armlib_unavailable", i32 0}
!301 = !{i32 8, !"PIC Level", i32 2}
!302 = !{i32 7, !"PIE Level", i32 2}
!303 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!304 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !6, file: !6, line: 223, type: !305, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !307, !89}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!309 = !DILocalVariable(name: "object", arg: 1, scope: !304, file: !6, line: 223, type: !307)
!310 = !DILocation(line: 223, column: 61, scope: !304)
!311 = !DILocalVariable(name: "thread", arg: 2, scope: !304, file: !6, line: 224, type: !89)
!312 = !DILocation(line: 224, column: 24, scope: !304)
!313 = !DILocation(line: 226, column: 9, scope: !304)
!314 = !DILocation(line: 227, column: 9, scope: !304)
!315 = !DILocation(line: 228, column: 1, scope: !304)
!316 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !6, file: !6, line: 243, type: !317, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !307}
!319 = !DILocalVariable(name: "object", arg: 1, scope: !316, file: !6, line: 243, type: !307)
!320 = !DILocation(line: 243, column: 56, scope: !316)
!321 = !DILocation(line: 245, column: 9, scope: !316)
!322 = !DILocation(line: 246, column: 1, scope: !316)
!323 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !6, file: !6, line: 359, type: !324, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!324 = !DISubroutineType(types: !325)
!325 = !{!153, !5}
!326 = !DILocalVariable(name: "otype", arg: 1, scope: !323, file: !6, line: 359, type: !5)
!327 = !DILocation(line: 359, column: 58, scope: !323)
!328 = !DILocation(line: 361, column: 9, scope: !323)
!329 = !DILocation(line: 363, column: 2, scope: !323)
!330 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !6, file: !6, line: 366, type: !331, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!331 = !DISubroutineType(types: !332)
!332 = !{!153, !5, !198}
!333 = !DILocalVariable(name: "otype", arg: 1, scope: !330, file: !6, line: 366, type: !5)
!334 = !DILocation(line: 366, column: 63, scope: !330)
!335 = !DILocalVariable(name: "size", arg: 2, scope: !330, file: !6, line: 367, type: !198)
!336 = !DILocation(line: 367, column: 13, scope: !330)
!337 = !DILocation(line: 369, column: 9, scope: !330)
!338 = !DILocation(line: 370, column: 9, scope: !330)
!339 = !DILocation(line: 372, column: 2, scope: !330)
!340 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !187, file: !187, line: 656, type: !341, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!341 = !DISubroutineType(types: !342)
!342 = !{!210, !343}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!345 = !DILocalVariable(name: "t", arg: 1, scope: !340, file: !187, line: 657, type: !343)
!346 = !DILocation(line: 657, column: 30, scope: !340)
!347 = !DILocation(line: 659, column: 28, scope: !340)
!348 = !DILocation(line: 659, column: 31, scope: !340)
!349 = !DILocation(line: 659, column: 36, scope: !340)
!350 = !DILocation(line: 659, column: 9, scope: !340)
!351 = !DILocation(line: 659, column: 2, scope: !340)
!352 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !187, file: !187, line: 671, type: !341, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!353 = !DILocalVariable(name: "t", arg: 1, scope: !352, file: !187, line: 672, type: !343)
!354 = !DILocation(line: 672, column: 30, scope: !352)
!355 = !DILocation(line: 674, column: 30, scope: !352)
!356 = !DILocation(line: 674, column: 33, scope: !352)
!357 = !DILocation(line: 674, column: 38, scope: !352)
!358 = !DILocation(line: 674, column: 9, scope: !352)
!359 = !DILocation(line: 674, column: 2, scope: !352)
!360 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !187, file: !187, line: 1634, type: !361, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!361 = !DISubroutineType(types: !362)
!362 = !{!210, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !187, line: 1439, size: 448, elements: !366)
!366 = !{!367, !368, !369, !374, !375, !380, !381}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !365, file: !187, line: 1445, baseType: !155, size: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !365, file: !187, line: 1448, baseType: !126, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !365, file: !187, line: 1451, baseType: !370, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !365, file: !187, line: 1454, baseType: !370, size: 32, offset: 288)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !365, file: !187, line: 1457, baseType: !376, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !211, line: 67, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !211, line: 65, size: 64, elements: !378)
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !377, file: !211, line: 66, baseType: !210, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !365, file: !187, line: 1460, baseType: !150, size: 32, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !365, file: !187, line: 1463, baseType: !153, size: 32, offset: 416)
!382 = !DILocalVariable(name: "timer", arg: 1, scope: !360, file: !187, line: 1635, type: !363)
!383 = !DILocation(line: 1635, column: 34, scope: !360)
!384 = !DILocation(line: 1637, column: 28, scope: !360)
!385 = !DILocation(line: 1637, column: 35, scope: !360)
!386 = !DILocation(line: 1637, column: 9, scope: !360)
!387 = !DILocation(line: 1637, column: 2, scope: !360)
!388 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !187, file: !187, line: 1649, type: !361, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!389 = !DILocalVariable(name: "timer", arg: 1, scope: !388, file: !187, line: 1650, type: !363)
!390 = !DILocation(line: 1650, column: 34, scope: !388)
!391 = !DILocation(line: 1652, column: 30, scope: !388)
!392 = !DILocation(line: 1652, column: 37, scope: !388)
!393 = !DILocation(line: 1652, column: 9, scope: !388)
!394 = !DILocation(line: 1652, column: 2, scope: !388)
!395 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !187, file: !187, line: 1689, type: !396, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !373, !153}
!398 = !DILocalVariable(name: "timer", arg: 1, scope: !395, file: !187, line: 1689, type: !373)
!399 = !DILocation(line: 1689, column: 65, scope: !395)
!400 = !DILocalVariable(name: "user_data", arg: 2, scope: !395, file: !187, line: 1690, type: !153)
!401 = !DILocation(line: 1690, column: 19, scope: !395)
!402 = !DILocation(line: 1692, column: 21, scope: !395)
!403 = !DILocation(line: 1692, column: 2, scope: !395)
!404 = !DILocation(line: 1692, column: 9, scope: !395)
!405 = !DILocation(line: 1692, column: 19, scope: !395)
!406 = !DILocation(line: 1693, column: 1, scope: !395)
!407 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !187, file: !187, line: 1704, type: !408, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!408 = !DISubroutineType(types: !409)
!409 = !{!153, !363}
!410 = !DILocalVariable(name: "timer", arg: 1, scope: !407, file: !187, line: 1704, type: !363)
!411 = !DILocation(line: 1704, column: 72, scope: !407)
!412 = !DILocation(line: 1706, column: 9, scope: !407)
!413 = !DILocation(line: 1706, column: 16, scope: !407)
!414 = !DILocation(line: 1706, column: 2, scope: !407)
!415 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !187, file: !187, line: 2071, type: !416, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!416 = !DISubroutineType(types: !417)
!417 = !{!183, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 32)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !187, line: 1830, size: 128, elements: !420)
!420 = !{!421, !434, !435}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !419, file: !187, line: 1831, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !423, line: 60, baseType: !424)
!423 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !423, line: 53, size: 64, elements: !425)
!425 = !{!426, !433}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !424, file: !423, line: 54, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !423, line: 50, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !423, line: 44, size: 32, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !429, file: !423, line: 45, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !423, line: 40, baseType: !150)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !424, file: !423, line: 55, baseType: !427, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !419, file: !187, line: 1832, baseType: !202, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !419, file: !187, line: 1833, baseType: !126, size: 64, offset: 64)
!436 = !DILocalVariable(name: "queue", arg: 1, scope: !415, file: !187, line: 2071, type: !418)
!437 = !DILocation(line: 2071, column: 59, scope: !415)
!438 = !DILocation(line: 2073, column: 35, scope: !415)
!439 = !DILocation(line: 2073, column: 42, scope: !415)
!440 = !DILocation(line: 2073, column: 14, scope: !415)
!441 = !DILocation(line: 2073, column: 9, scope: !415)
!442 = !DILocation(line: 2073, column: 2, scope: !415)
!443 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !187, file: !187, line: 3209, type: !444, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!444 = !DISubroutineType(types: !445)
!445 = !{!151, !240}
!446 = !DILocalVariable(name: "sem", arg: 1, scope: !443, file: !187, line: 3209, type: !240)
!447 = !DILocation(line: 3209, column: 65, scope: !443)
!448 = !DILocation(line: 3211, column: 9, scope: !443)
!449 = !DILocation(line: 3211, column: 14, scope: !443)
!450 = !DILocation(line: 3211, column: 2, scope: !443)
!451 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !187, file: !187, line: 4649, type: !452, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!452 = !DISubroutineType(types: !453)
!453 = !{!150, !454}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !187, line: 4390, size: 320, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !455, file: !187, line: 4392, baseType: !126, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !455, file: !187, line: 4394, baseType: !202, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !455, file: !187, line: 4396, baseType: !198, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !455, file: !187, line: 4398, baseType: !150, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !455, file: !187, line: 4400, baseType: !212, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !455, file: !187, line: 4402, baseType: !212, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !455, file: !187, line: 4404, baseType: !212, size: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !455, file: !187, line: 4406, baseType: !212, size: 32, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !455, file: !187, line: 4408, baseType: !150, size: 32, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !455, file: !187, line: 4413, baseType: !133, size: 8, offset: 288)
!467 = !DILocalVariable(name: "msgq", arg: 1, scope: !451, file: !187, line: 4649, type: !454)
!468 = !DILocation(line: 4649, column: 66, scope: !451)
!469 = !DILocation(line: 4651, column: 9, scope: !451)
!470 = !DILocation(line: 4651, column: 15, scope: !451)
!471 = !DILocation(line: 4651, column: 26, scope: !451)
!472 = !DILocation(line: 4651, column: 32, scope: !451)
!473 = !DILocation(line: 4651, column: 24, scope: !451)
!474 = !DILocation(line: 4651, column: 2, scope: !451)
!475 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !187, file: !187, line: 4665, type: !452, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!476 = !DILocalVariable(name: "msgq", arg: 1, scope: !475, file: !187, line: 4665, type: !454)
!477 = !DILocation(line: 4665, column: 66, scope: !475)
!478 = !DILocation(line: 4667, column: 9, scope: !475)
!479 = !DILocation(line: 4667, column: 15, scope: !475)
!480 = !DILocation(line: 4667, column: 2, scope: !475)
!481 = !DILocalVariable(name: "i", scope: !285, file: !252, line: 75, type: !183)
!482 = !DILocation(line: 75, column: 6, scope: !285)
!483 = !DILocation(line: 77, column: 9, scope: !484)
!484 = distinct !DILexicalBlock(scope: !285, file: !252, line: 77, column: 2)
!485 = !DILocation(line: 77, column: 7, scope: !484)
!486 = !DILocation(line: 77, column: 14, scope: !487)
!487 = distinct !DILexicalBlock(scope: !484, file: !252, line: 77, column: 2)
!488 = !DILocation(line: 77, column: 16, scope: !487)
!489 = !DILocation(line: 77, column: 2, scope: !484)
!490 = !DILocation(line: 78, column: 33, scope: !491)
!491 = distinct !DILexicalBlock(scope: !487, file: !252, line: 77, column: 27)
!492 = !DILocation(line: 78, column: 23, scope: !491)
!493 = !DILocation(line: 78, column: 36, scope: !491)
!494 = !DILocation(line: 78, column: 3, scope: !491)
!495 = !DILocation(line: 79, column: 58, scope: !491)
!496 = !DILocation(line: 79, column: 48, scope: !491)
!497 = !DILocation(line: 79, column: 33, scope: !491)
!498 = !DILocation(line: 79, column: 3, scope: !491)
!499 = !DILocation(line: 80, column: 2, scope: !491)
!500 = !DILocation(line: 77, column: 23, scope: !487)
!501 = !DILocation(line: 77, column: 2, scope: !487)
!502 = distinct !{!502, !489, !503}
!503 = !DILocation(line: 80, column: 2, scope: !484)
!504 = !DILocation(line: 85, column: 2, scope: !285)
!505 = distinct !DISubprogram(name: "k_mbox_init", scope: !252, file: !252, line: 92, type: !506, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !204)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mbox", file: !187, line: 4710, size: 128, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tx_msg_queue", scope: !509, file: !187, line: 4712, baseType: !126, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "rx_msg_queue", scope: !509, file: !187, line: 4714, baseType: !126, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !509, file: !187, line: 4715, baseType: !202, offset: 128)
!514 = !DILocalVariable(name: "mbox", arg: 1, scope: !505, file: !252, line: 92, type: !508)
!515 = !DILocation(line: 92, column: 33, scope: !505)
!516 = !DILocation(line: 94, column: 16, scope: !505)
!517 = !DILocation(line: 94, column: 22, scope: !505)
!518 = !DILocation(line: 94, column: 2, scope: !505)
!519 = !DILocation(line: 95, column: 16, scope: !505)
!520 = !DILocation(line: 95, column: 22, scope: !505)
!521 = !DILocation(line: 95, column: 2, scope: !505)
!522 = !DILocation(line: 96, column: 2, scope: !505)
!523 = !DILocation(line: 96, column: 8, scope: !505)
!524 = !DILocation(line: 96, column: 15, scope: !505)
!525 = !DILocation(line: 102, column: 2, scope: !505)
!526 = !DILocation(line: 102, column: 7, scope: !527)
!527 = distinct !DILexicalBlock(scope: !505, file: !252, line: 102, column: 5)
!528 = !DILocation(line: 103, column: 1, scope: !505)
!529 = distinct !DISubprogram(name: "z_waitq_init", scope: !530, file: !530, line: 47, type: !531, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!530 = !DIFile(filename: "kernel/include/wait_q.h", directory: "/home/sri/zephyrproject/zephyr")
!531 = !DISubroutineType(types: !532)
!532 = !{null, !125}
!533 = !DILocalVariable(name: "w", arg: 1, scope: !529, file: !530, line: 47, type: !125)
!534 = !DILocation(line: 47, column: 44, scope: !529)
!535 = !DILocation(line: 49, column: 18, scope: !529)
!536 = !DILocation(line: 49, column: 21, scope: !529)
!537 = !DILocation(line: 49, column: 2, scope: !529)
!538 = !DILocation(line: 50, column: 1, scope: !529)
!539 = distinct !DISubprogram(name: "k_mbox_put", scope: !252, file: !252, line: 313, type: !540, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !204)
!540 = !DISubroutineType(types: !541)
!541 = !{!183, !508, !214, !376}
!542 = !DILocalVariable(name: "mbox", arg: 1, scope: !539, file: !252, line: 313, type: !508)
!543 = !DILocation(line: 313, column: 31, scope: !539)
!544 = !DILocalVariable(name: "tx_msg", arg: 2, scope: !539, file: !252, line: 313, type: !214)
!545 = !DILocation(line: 313, column: 56, scope: !539)
!546 = !DILocalVariable(name: "timeout", arg: 3, scope: !539, file: !252, line: 314, type: !376)
!547 = !DILocation(line: 314, column: 21, scope: !539)
!548 = !DILocation(line: 317, column: 44, scope: !539)
!549 = !DILocation(line: 317, column: 2, scope: !539)
!550 = !DILocation(line: 317, column: 10, scope: !539)
!551 = !DILocation(line: 317, column: 26, scope: !539)
!552 = !DILocation(line: 319, column: 2, scope: !539)
!553 = !DILocation(line: 319, column: 7, scope: !554)
!554 = distinct !DILexicalBlock(scope: !539, file: !252, line: 319, column: 5)
!555 = !DILocalVariable(name: "ret", scope: !539, file: !252, line: 321, type: !183)
!556 = !DILocation(line: 321, column: 6, scope: !539)
!557 = !DILocation(line: 321, column: 29, scope: !539)
!558 = !DILocation(line: 321, column: 35, scope: !539)
!559 = !DILocation(line: 321, column: 12, scope: !539)
!560 = !DILocation(line: 323, column: 2, scope: !539)
!561 = !DILocation(line: 323, column: 7, scope: !562)
!562 = distinct !DILexicalBlock(scope: !539, file: !252, line: 323, column: 5)
!563 = !DILocation(line: 325, column: 9, scope: !539)
!564 = !DILocation(line: 325, column: 2, scope: !539)
!565 = distinct !DISubprogram(name: "mbox_message_put", scope: !252, file: !252, line: 228, type: !540, scopeLine: 230, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !204)
!566 = !DILocalVariable(name: "mbox", arg: 1, scope: !565, file: !252, line: 228, type: !508)
!567 = !DILocation(line: 228, column: 44, scope: !565)
!568 = !DILocalVariable(name: "tx_msg", arg: 2, scope: !565, file: !252, line: 228, type: !214)
!569 = !DILocation(line: 228, column: 69, scope: !565)
