; ModuleID = '../bc_files/main.bc'
source_filename = "/home/sri/zephyrproject/zephyr/samples/basic/blinky/src/main.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.gpio_dt_spec = type { ptr, i8, i16 }
%struct.device = type { ptr, ptr, ptr, ptr, ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }
%struct.gpio_driver_api = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

!29 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 20)
!30 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 21)
!31 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 22)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 25)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 26)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 27)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 28)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 29)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 30)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 31)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 32)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 33)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 34)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 35)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 36)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 37)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 38)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 39)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 40)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 41)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 42)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 43)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 44)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 45)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 46)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 47)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!87 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !89, line: 766, baseType: !90, size: 32, elements: !91)
!89 = !DIFile(filename: "include/zephyr/drivers/gpio.h", directory: "/home/sri/zephyrproject/zephyr")
!90 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!91 = !{!92, !93, !94}
!92 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!93 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!94 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !89, line: 776, baseType: !90, size: 32, elements: !96)
!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!98 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!99 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!100 = !{!101, !102, !103, !182, !187, !147, !95, !88, !192, !193, !197}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!102 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !89, line: 788, size: 288, elements: !106)
!106 = !{!107, !137, !143, !148, !152, !153, !154, !158, !178}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !105, file: !89, line: 789, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DISubroutineType(types: !110)
!110 = !{!102, !111, !134, !135}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !114, line: 381, size: 160, elements: !115)
!114 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!115 = !{!116, !120, !123, !124, !133}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !114, line: 383, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !113, file: !114, line: 385, baseType: !121, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !113, file: !114, line: 387, baseType: !121, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !113, file: !114, line: 389, baseType: !125, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !114, line: 354, size: 16, elements: !127)
!127 = !{!128, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !126, file: !114, line: 362, baseType: !129, size: 8)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !130, line: 62, baseType: !7)
!130 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!131 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !126, file: !114, line: 367, baseType: !132, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!132 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !114, line: 391, baseType: !101, size: 32, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !89, line: 252, baseType: !129)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !89, line: 272, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !130, line: 64, baseType: !90)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !105, file: !89, line: 795, baseType: !138, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DISubroutineType(types: !140)
!140 = !{!102, !111, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !89, line: 244, baseType: !136)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !105, file: !89, line: 797, baseType: !144, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DISubroutineType(types: !146)
!146 = !{!102, !111, !147, !142}
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !89, line: 231, baseType: !136)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !105, file: !89, line: 800, baseType: !149, size: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{!102, !111, !147}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !105, file: !89, line: 802, baseType: !149, size: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !105, file: !89, line: 804, baseType: !149, size: 32, offset: 160)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !105, file: !89, line: 806, baseType: !155, size: 32, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!156 = !DISubroutineType(types: !157)
!157 = !{!102, !111, !134, !88, !95}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !105, file: !89, line: 809, baseType: !159, size: 32, offset: 224)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DISubroutineType(types: !161)
!161 = !{!102, !111, !162, !132}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !89, line: 738, size: 96, elements: !164)
!164 = !{!165, !172, !177}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !163, file: !89, line: 742, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !167, line: 39, baseType: !168)
!167 = !DIFile(filename: "include/zephyr/sys/slist.h", directory: "/home/sri/zephyrproject/zephyr")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !167, line: 33, size: 32, elements: !169)
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !168, file: !167, line: 34, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !163, file: !89, line: 745, baseType: !173, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !89, line: 724, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !111, !162, !147}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !163, file: !89, line: 753, baseType: !147, size: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !105, file: !89, line: 812, baseType: !179, size: 32, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!136, !111}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !89, line: 688, size: 32, elements: !185)
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !184, file: !89, line: 694, baseType: !147, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !89, line: 701, size: 32, elements: !190)
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !189, file: !89, line: 707, baseType: !147, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !194, line: 46, baseType: !195)
!194 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !130, line: 59, baseType: !196)
!196 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !130, line: 65, baseType: !198)
!198 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!199 = !{!0}
!200 = !DIFile(filename: "samples/basic/blinky/src/main.c", directory: "/home/sri/zephyrproject/zephyr")
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !89, line: 286, size: 64, elements: !203)
!203 = !{!204, !205, !206}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !202, file: !89, line: 288, baseType: !111, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !202, file: !89, line: 290, baseType: !134, size: 8, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !202, file: !89, line: 292, baseType: !207, size: 16, offset: 48)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !89, line: 264, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !130, line: 63, baseType: !209)
!209 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!210 = !{i32 7, !"Dwarf Version", i32 4}
!211 = !{i32 2, !"Debug Info Version", i32 3}
!212 = !{i32 1, !"wchar_size", i32 4}
!213 = !{i32 1, !"static_rwdata", i32 1}
!214 = !{i32 1, !"enumsize_buildattr", i32 1}
!215 = !{i32 1, !"armlib_unavailable", i32 0}
!216 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!217 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !6, file: !6, line: 223, type: !218, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !331)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !121, !220}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !222, line: 250, size: 896, elements: !223)
!222 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!223 = !{!224, !289, !302, !303, !304, !305, !326}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !221, file: !222, line: 252, baseType: !225, size: 384)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !222, line: 58, size: 384, elements: !226)
!226 = !{!227, !255, !263, !264, !265, !276, !277, !278}
!227 = !DIDerivedType(tag: DW_TAG_member, scope: !225, file: !222, line: 61, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !225, file: !222, line: 61, size: 64, elements: !229)
!229 = !{!230, !246}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !228, file: !222, line: 62, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !232, line: 55, baseType: !233)
!232 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !232, line: 37, size: 64, elements: !234)
!234 = !{!235, !241}
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !233, file: !232, line: 38, baseType: !236, size: 32)
!236 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !232, line: 38, size: 32, elements: !237)
!237 = !{!238, !240}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !236, file: !232, line: 39, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !232, line: 40, baseType: !239, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, scope: !233, file: !232, line: 42, baseType: !242, size: 32, offset: 32)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !232, line: 42, size: 32, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !242, file: !232, line: 43, baseType: !239, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !242, file: !232, line: 44, baseType: !239, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !228, file: !222, line: 63, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !248, line: 58, size: 64, elements: !249)
!248 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !247, file: !248, line: 60, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 64, elements: !253)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!253 = !{!254}
!254 = !DISubrange(count: 2)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !225, file: !222, line: 69, baseType: !256, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !258, line: 243, baseType: !259)
!258 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !258, line: 241, size: 64, elements: !260)
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !259, file: !258, line: 242, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !232, line: 51, baseType: !233)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !225, file: !222, line: 72, baseType: !129, size: 8, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !225, file: !222, line: 75, baseType: !129, size: 8, offset: 104)
!265 = !DIDerivedType(tag: DW_TAG_member, scope: !225, file: !222, line: 91, baseType: !266, size: 16, offset: 112)
!266 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !225, file: !222, line: 91, size: 16, elements: !267)
!267 = !{!268, !275}
!268 = !DIDerivedType(tag: DW_TAG_member, scope: !266, file: !222, line: 92, baseType: !269, size: 16)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !266, file: !222, line: 92, size: 16, elements: !270)
!270 = !{!271, !274}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !269, file: !222, line: 97, baseType: !272, size: 8)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !130, line: 56, baseType: !273)
!273 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !269, file: !222, line: 98, baseType: !129, size: 8, offset: 8)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !266, file: !222, line: 101, baseType: !208, size: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !225, file: !222, line: 108, baseType: !136, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !225, file: !222, line: 132, baseType: !101, size: 32, offset: 160)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !225, file: !222, line: 136, baseType: !279, size: 192, offset: 192)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !258, line: 254, size: 192, elements: !280)
!280 = !{!281, !282, !288}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !279, file: !258, line: 255, baseType: !231, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !279, file: !258, line: 256, baseType: !283, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !258, line: 252, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !287}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !279, file: !258, line: 259, baseType: !195, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !221, file: !222, line: 255, baseType: !290, size: 288, offset: 384)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !291, line: 25, size: 288, elements: !292)
!291 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !290, file: !291, line: 26, baseType: !136, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !290, file: !291, line: 27, baseType: !136, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !290, file: !291, line: 28, baseType: !136, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !290, file: !291, line: 29, baseType: !136, size: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !290, file: !291, line: 30, baseType: !136, size: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !290, file: !291, line: 31, baseType: !136, size: 32, offset: 160)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !290, file: !291, line: 32, baseType: !136, size: 32, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !290, file: !291, line: 33, baseType: !136, size: 32, offset: 224)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !290, file: !291, line: 34, baseType: !136, size: 32, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !221, file: !222, line: 258, baseType: !101, size: 32, offset: 672)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !221, file: !222, line: 261, baseType: !257, size: 64, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !221, file: !222, line: 302, baseType: !102, size: 32, offset: 768)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !221, file: !222, line: 333, baseType: !306, size: 32, offset: 800)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !308, line: 5291, size: 160, elements: !309)
!308 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!309 = !{!310, !321, !322}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !307, file: !308, line: 5292, baseType: !311, size: 96)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !312, line: 56, size: 96, elements: !313)
!312 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!313 = !{!314, !317, !318}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !311, file: !312, line: 57, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !312, line: 57, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !311, file: !312, line: 58, baseType: !101, size: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !311, file: !312, line: 59, baseType: !319, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !320, line: 46, baseType: !90)
!320 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!321 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !307, file: !308, line: 5293, baseType: !257, size: 64, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !307, file: !308, line: 5294, baseType: !323, offset: 160)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !324, line: 45, elements: !325)
!324 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!325 = !{}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !221, file: !222, line: 355, baseType: !327, size: 64, offset: 832)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !291, line: 60, size: 64, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !327, file: !291, line: 63, baseType: !136, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !327, file: !291, line: 66, baseType: !136, size: 32, offset: 32)
!331 = !{!332, !333}
!332 = !DILocalVariable(name: "object", arg: 1, scope: !217, file: !6, line: 223, type: !121)
!333 = !DILocalVariable(name: "thread", arg: 2, scope: !217, file: !6, line: 224, type: !220)
!334 = !DILocation(line: 223, column: 61, scope: !217)
!335 = !DILocation(line: 224, column: 24, scope: !217)
!336 = !DILocation(line: 226, column: 9, scope: !217)
!337 = !DILocation(line: 227, column: 9, scope: !217)
!338 = !DILocation(line: 228, column: 1, scope: !217)
!339 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !6, file: !6, line: 243, type: !340, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !342)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !121}
!342 = !{!343}
!343 = !DILocalVariable(name: "object", arg: 1, scope: !339, file: !6, line: 243, type: !121)
!344 = !DILocation(line: 243, column: 56, scope: !339)
!345 = !DILocation(line: 245, column: 9, scope: !339)
!346 = !DILocation(line: 246, column: 1, scope: !339)
!347 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !6, file: !6, line: 359, type: !348, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !350)
!348 = !DISubroutineType(types: !349)
!349 = !{!101, !5}
!350 = !{!351}
!351 = !DILocalVariable(name: "otype", arg: 1, scope: !347, file: !6, line: 359, type: !5)
!352 = !DILocation(line: 359, column: 58, scope: !347)
!353 = !DILocation(line: 361, column: 9, scope: !347)
!354 = !DILocation(line: 363, column: 2, scope: !347)
!355 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !6, file: !6, line: 366, type: !356, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !358)
!356 = !DISubroutineType(types: !357)
!357 = !{!101, !5, !319}
!358 = !{!359, !360}
!359 = !DILocalVariable(name: "otype", arg: 1, scope: !355, file: !6, line: 366, type: !5)
!360 = !DILocalVariable(name: "size", arg: 2, scope: !355, file: !6, line: 367, type: !319)
!361 = !DILocation(line: 366, column: 63, scope: !355)
!362 = !DILocation(line: 367, column: 13, scope: !355)
!363 = !DILocation(line: 369, column: 9, scope: !355)
!364 = !DILocation(line: 370, column: 9, scope: !355)
!365 = !DILocation(line: 372, column: 2, scope: !355)
!366 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !308, file: !308, line: 656, type: !367, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !371)
!367 = !DISubroutineType(types: !368)
!368 = !{!193, !369}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!371 = !{!372}
!372 = !DILocalVariable(name: "t", arg: 1, scope: !366, file: !308, line: 657, type: !369)
!373 = !DILocation(line: 657, column: 30, scope: !366)
!374 = !DILocation(line: 659, column: 28, scope: !366)
!375 = !DILocation(line: 659, column: 31, scope: !366)
!376 = !DILocation(line: 659, column: 36, scope: !366)
!377 = !DILocation(line: 659, column: 9, scope: !366)
!378 = !DILocation(line: 659, column: 2, scope: !366)
!379 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !308, file: !308, line: 671, type: !367, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !380)
!380 = !{!381}
!381 = !DILocalVariable(name: "t", arg: 1, scope: !379, file: !308, line: 672, type: !369)
!382 = !DILocation(line: 672, column: 30, scope: !379)
!383 = !DILocation(line: 674, column: 30, scope: !379)
!384 = !DILocation(line: 674, column: 33, scope: !379)
!385 = !DILocation(line: 674, column: 38, scope: !379)
!386 = !DILocation(line: 674, column: 9, scope: !379)
!387 = !DILocation(line: 674, column: 2, scope: !379)
!388 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !308, file: !308, line: 1634, type: !389, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !410)
!389 = !DISubroutineType(types: !390)
!390 = !{!193, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !308, line: 1439, size: 448, elements: !394)
!394 = !{!395, !396, !397, !402, !403, !408, !409}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !393, file: !308, line: 1445, baseType: !279, size: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !393, file: !308, line: 1448, baseType: !257, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !393, file: !308, line: 1451, baseType: !398, size: 32, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !393, file: !308, line: 1454, baseType: !398, size: 32, offset: 288)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !393, file: !308, line: 1457, baseType: !404, size: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !194, line: 67, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !194, line: 65, size: 64, elements: !406)
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !405, file: !194, line: 66, baseType: !193, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !393, file: !308, line: 1460, baseType: !136, size: 32, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !393, file: !308, line: 1463, baseType: !101, size: 32, offset: 416)
!410 = !{!411}
!411 = !DILocalVariable(name: "timer", arg: 1, scope: !388, file: !308, line: 1635, type: !391)
!412 = !DILocation(line: 1635, column: 34, scope: !388)
!413 = !DILocation(line: 1637, column: 28, scope: !388)
!414 = !DILocation(line: 1637, column: 35, scope: !388)
!415 = !DILocation(line: 1637, column: 9, scope: !388)
!416 = !DILocation(line: 1637, column: 2, scope: !388)
!417 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !308, file: !308, line: 1649, type: !389, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !418)
!418 = !{!419}
!419 = !DILocalVariable(name: "timer", arg: 1, scope: !417, file: !308, line: 1650, type: !391)
!420 = !DILocation(line: 1650, column: 34, scope: !417)
!421 = !DILocation(line: 1652, column: 30, scope: !417)
!422 = !DILocation(line: 1652, column: 37, scope: !417)
!423 = !DILocation(line: 1652, column: 9, scope: !417)
!424 = !DILocation(line: 1652, column: 2, scope: !417)
!425 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !308, file: !308, line: 1689, type: !426, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !428)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !401, !101}
!428 = !{!429, !430}
!429 = !DILocalVariable(name: "timer", arg: 1, scope: !425, file: !308, line: 1689, type: !401)
!430 = !DILocalVariable(name: "user_data", arg: 2, scope: !425, file: !308, line: 1690, type: !101)
!431 = !DILocation(line: 1689, column: 65, scope: !425)
!432 = !DILocation(line: 1690, column: 19, scope: !425)
!433 = !DILocation(line: 1692, column: 21, scope: !425)
!434 = !DILocation(line: 1692, column: 2, scope: !425)
!435 = !DILocation(line: 1692, column: 9, scope: !425)
!436 = !DILocation(line: 1692, column: 19, scope: !425)
!437 = !DILocation(line: 1693, column: 1, scope: !425)
!438 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !308, file: !308, line: 1704, type: !439, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !441)
!439 = !DISubroutineType(types: !440)
!440 = !{!101, !391}
!441 = !{!442}
!442 = !DILocalVariable(name: "timer", arg: 1, scope: !438, file: !308, line: 1704, type: !391)
!443 = !DILocation(line: 1704, column: 72, scope: !438)
!444 = !DILocation(line: 1706, column: 9, scope: !438)
!445 = !DILocation(line: 1706, column: 16, scope: !438)
!446 = !DILocation(line: 1706, column: 2, scope: !438)
!447 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !308, file: !308, line: 2071, type: !448, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !468)
!448 = !DISubroutineType(types: !449)
!449 = !{!102, !450}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !308, line: 1830, size: 128, elements: !452)
!452 = !{!453, !466, !467}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !451, file: !308, line: 1831, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !455, line: 60, baseType: !456)
!455 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !455, line: 53, size: 64, elements: !457)
!457 = !{!458, !465}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !456, file: !455, line: 54, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !455, line: 50, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !455, line: 44, size: 32, elements: !462)
!462 = !{!463}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !461, file: !455, line: 45, baseType: !464, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !455, line: 40, baseType: !136)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !456, file: !455, line: 55, baseType: !459, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !451, file: !308, line: 1832, baseType: !323, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !451, file: !308, line: 1833, baseType: !257, size: 64, offset: 64)
!468 = !{!469}
!469 = !DILocalVariable(name: "queue", arg: 1, scope: !447, file: !308, line: 2071, type: !450)
!470 = !DILocation(line: 2071, column: 59, scope: !447)
!471 = !DILocation(line: 2073, column: 35, scope: !447)
!472 = !DILocation(line: 2073, column: 42, scope: !447)
!473 = !DILocation(line: 2073, column: 14, scope: !447)
!474 = !DILocation(line: 2073, column: 9, scope: !447)
!475 = !DILocation(line: 2073, column: 2, scope: !447)
!476 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !308, file: !308, line: 3209, type: !477, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !485)
!477 = !DISubroutineType(types: !478)
!478 = !{!90, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !308, line: 3092, size: 128, elements: !481)
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !480, file: !308, line: 3093, baseType: !257, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !480, file: !308, line: 3094, baseType: !90, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !480, file: !308, line: 3095, baseType: !90, size: 32, offset: 96)
!485 = !{!486}
!486 = !DILocalVariable(name: "sem", arg: 1, scope: !476, file: !308, line: 3209, type: !479)
!487 = !DILocation(line: 3209, column: 65, scope: !476)
!488 = !DILocation(line: 3211, column: 9, scope: !476)
!489 = !DILocation(line: 3211, column: 14, scope: !476)
!490 = !DILocation(line: 3211, column: 2, scope: !476)
!491 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !308, file: !308, line: 4649, type: !492, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !508)
!492 = !DISubroutineType(types: !493)
!493 = !{!136, !494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !308, line: 4390, size: 320, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !503, !504, !505, !506, !507}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !495, file: !308, line: 4392, baseType: !257, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !495, file: !308, line: 4394, baseType: !323, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !495, file: !308, line: 4396, baseType: !319, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !495, file: !308, line: 4398, baseType: !136, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !495, file: !308, line: 4400, baseType: !502, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !495, file: !308, line: 4402, baseType: !502, size: 32, offset: 160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !495, file: !308, line: 4404, baseType: !502, size: 32, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !495, file: !308, line: 4406, baseType: !502, size: 32, offset: 224)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !495, file: !308, line: 4408, baseType: !136, size: 32, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !495, file: !308, line: 4413, baseType: !129, size: 8, offset: 288)
!508 = !{!509}
!509 = !DILocalVariable(name: "msgq", arg: 1, scope: !491, file: !308, line: 4649, type: !494)
!510 = !DILocation(line: 4649, column: 66, scope: !491)
!511 = !DILocation(line: 4651, column: 9, scope: !491)
!512 = !DILocation(line: 4651, column: 15, scope: !491)
!513 = !DILocation(line: 4651, column: 26, scope: !491)
!514 = !DILocation(line: 4651, column: 32, scope: !491)
!515 = !DILocation(line: 4651, column: 24, scope: !491)
!516 = !DILocation(line: 4651, column: 2, scope: !491)
!517 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !308, file: !308, line: 4665, type: !492, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !518)
!518 = !{!519}
!519 = !DILocalVariable(name: "msgq", arg: 1, scope: !517, file: !308, line: 4665, type: !494)
!520 = !DILocation(line: 4665, column: 66, scope: !517)
!521 = !DILocation(line: 4667, column: 9, scope: !517)
!522 = !DILocation(line: 4667, column: 15, scope: !517)
!523 = !DILocation(line: 4667, column: 2, scope: !517)
!524 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !114, file: !114, line: 744, type: !525, scopeLine: 745, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !527)
!525 = !DISubroutineType(types: !526)
!526 = !{!132, !111}
!527 = !{!528}
!528 = !DILocalVariable(name: "dev", arg: 1, scope: !524, file: !114, line: 744, type: !111)
!529 = !DILocation(line: 744, column: 65, scope: !524)
!530 = !DILocation(line: 746, column: 27, scope: !524)
!531 = !DILocation(line: 746, column: 9, scope: !524)
!532 = !DILocation(line: 746, column: 2, scope: !524)
!533 = distinct !DISubprogram(name: "z_impl_gpio_pin_interrupt_configure", scope: !89, file: !89, line: 862, type: !109, scopeLine: 865, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !534)
!534 = !{!535, !536, !537, !538, !539, !541, !543, !544}
!535 = !DILocalVariable(name: "port", arg: 1, scope: !533, file: !89, line: 862, type: !111)
!536 = !DILocalVariable(name: "pin", arg: 2, scope: !533, file: !89, line: 863, type: !134)
!537 = !DILocalVariable(name: "flags", arg: 3, scope: !533, file: !89, line: 864, type: !135)
!538 = !DILocalVariable(name: "api", scope: !533, file: !89, line: 866, type: !103)
!539 = !DILocalVariable(name: "cfg", scope: !533, file: !89, line: 868, type: !540)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!541 = !DILocalVariable(name: "data", scope: !533, file: !89, line: 870, type: !542)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!543 = !DILocalVariable(name: "trig", scope: !533, file: !89, line: 872, type: !95)
!544 = !DILocalVariable(name: "mode", scope: !533, file: !89, line: 873, type: !88)
!545 = !DILocation(line: 862, column: 76, scope: !533)
!546 = !DILocation(line: 863, column: 24, scope: !533)
!547 = !DILocation(line: 864, column: 26, scope: !533)
!548 = !DILocation(line: 866, column: 2, scope: !533)
!549 = !DILocation(line: 866, column: 32, scope: !533)
!550 = !DILocation(line: 867, column: 35, scope: !533)
!551 = !DILocation(line: 867, column: 41, scope: !533)
!552 = !DILocation(line: 868, column: 2, scope: !533)
!553 = !DILocation(line: 868, column: 69, scope: !533)
!554 = !DILocation(line: 869, column: 38, scope: !533)
!555 = !DILocation(line: 869, column: 44, scope: !533)
!556 = !DILocation(line: 870, column: 2, scope: !533)
!557 = !DILocation(line: 870, column: 39, scope: !533)
!558 = !DILocation(line: 871, column: 36, scope: !533)
!559 = !DILocation(line: 871, column: 42, scope: !533)
!560 = !DILocation(line: 872, column: 2, scope: !533)
!561 = !DILocation(line: 872, column: 21, scope: !533)
