; ModuleID = '../bc_files/main.bc'
source_filename = "/home/sri/zephyrproject/zephyr/samples/basic/blinky_pwm/src/main.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.pwm_dt_spec = type { ptr, i32, i32, i16 }
%struct.device = type { ptr, ptr, ptr, ptr, ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }
%struct.pwm_driver_api = type { ptr, ptr }


!33 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 17)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 18)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 19)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 20)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 23)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 24)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 25)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 26)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 27)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 28)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 29)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 30)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 31)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 32)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 33)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 34)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 35)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 36)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 37)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 38)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 39)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 40)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 41)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 42)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 43)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 44)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 45)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 46)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 47)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!94 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!95 = !{!96, !101, !103, !104, !105, !136}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !97, line: 46, baseType: !98)
!97 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !99, line: 59, baseType: !100)
!99 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!100 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !99, line: 65, baseType: !102)
!102 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pwm_driver_api", file: !108, line: 436, size: 64, elements: !109)
!108 = !DIFile(filename: "include/zephyr/drivers/pwm.h", directory: "/home/sri/zephyrproject/zephyr")
!109 = !{!110, !141}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "set_cycles", scope: !107, file: !108, line: 437, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "pwm_set_cycles_t", file: !108, line: 400, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DISubroutineType(types: !114)
!114 = !{!104, !115, !136, !136, !136, !138}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 381, size: 160, elements: !119)
!118 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!119 = !{!120, !123, !126, !127, !135}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 383, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !117, file: !118, line: 385, baseType: !124, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !117, file: !118, line: 387, baseType: !124, size: 32, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !117, file: !118, line: 389, baseType: !128, size: 32, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 354, size: 16, elements: !130)
!130 = !{!131, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !129, file: !118, line: 362, baseType: !132, size: 8)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !99, line: 62, baseType: !14)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !129, file: !118, line: 367, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!134 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !118, line: 391, baseType: !103, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !99, line: 64, baseType: !137)
!137 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "pwm_flags_t", file: !108, line: 79, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !99, line: 63, baseType: !140)
!140 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "get_cycles_per_sec", scope: !107, file: !108, line: 438, baseType: !142, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "pwm_get_cycles_per_sec_t", file: !108, line: 408, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = !DISubroutineType(types: !145)
!145 = !{!104, !115, !136, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!147 = !{!0, !148, !153, !158, !163, !168, !7}
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !2, line: 32, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 35)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 31)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 49, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 58)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 56, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 55)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 37)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pwm_dt_spec", file: !108, line: 96, size: 128, elements: !175)
!175 = !{!176, !177, !178, !179}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !174, file: !108, line: 98, baseType: !115, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !174, file: !108, line: 100, baseType: !136, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !174, file: !108, line: 102, baseType: !136, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !174, file: !108, line: 104, baseType: !138, size: 16, offset: 96)
!180 = !{i32 7, !"Dwarf Version", i32 4}
!181 = !{i32 2, !"Debug Info Version", i32 3}
!182 = !{i32 1, !"wchar_size", i32 4}
!183 = !{i32 1, !"static_rwdata", i32 1}
!184 = !{i32 1, !"enumsize_buildattr", i32 1}
!185 = !{i32 1, !"armlib_unavailable", i32 0}
!186 = !{i32 8, !"PIC Level", i32 2}
!187 = !{i32 7, !"PIE Level", i32 2}
!188 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!189 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !13, file: !13, line: 223, type: !190, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !124, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !194, line: 250, size: 896, elements: !195)
!194 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!195 = !{!196, !261, !274, !275, !276, !277, !298}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !193, file: !194, line: 252, baseType: !197, size: 384)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !194, line: 58, size: 384, elements: !198)
!198 = !{!199, !227, !235, !236, !237, !248, !249, !250}
!199 = !DIDerivedType(tag: DW_TAG_member, scope: !197, file: !194, line: 61, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !197, file: !194, line: 61, size: 64, elements: !201)
!201 = !{!202, !218}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !200, file: !194, line: 62, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !204, line: 55, baseType: !205)
!204 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !204, line: 37, size: 64, elements: !206)
!206 = !{!207, !213}
!207 = !DIDerivedType(tag: DW_TAG_member, scope: !205, file: !204, line: 38, baseType: !208, size: 32)
!208 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !205, file: !204, line: 38, size: 32, elements: !209)
!209 = !{!210, !212}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !208, file: !204, line: 39, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !204, line: 40, baseType: !211, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, scope: !205, file: !204, line: 42, baseType: !214, size: 32, offset: 32)
!214 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !205, file: !204, line: 42, size: 32, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !214, file: !204, line: 43, baseType: !211, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !214, file: !204, line: 44, baseType: !211, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !200, file: !194, line: 63, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !220, line: 58, size: 64, elements: !221)
!220 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !219, file: !220, line: 60, baseType: !223, size: 64)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 64, elements: !225)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!225 = !{!226}
!226 = !DISubrange(count: 2)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !197, file: !194, line: 69, baseType: !228, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !230, line: 243, baseType: !231)
!230 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 241, size: 64, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !231, file: !230, line: 242, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !204, line: 51, baseType: !205)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !197, file: !194, line: 72, baseType: !132, size: 8, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !197, file: !194, line: 75, baseType: !132, size: 8, offset: 104)
!237 = !DIDerivedType(tag: DW_TAG_member, scope: !197, file: !194, line: 91, baseType: !238, size: 16, offset: 112)
!238 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !197, file: !194, line: 91, size: 16, elements: !239)
!239 = !{!240, !247}
!240 = !DIDerivedType(tag: DW_TAG_member, scope: !238, file: !194, line: 92, baseType: !241, size: 16)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !238, file: !194, line: 92, size: 16, elements: !242)
!242 = !{!243, !246}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !241, file: !194, line: 97, baseType: !244, size: 8)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !99, line: 56, baseType: !245)
!245 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !241, file: !194, line: 98, baseType: !132, size: 8, offset: 8)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !238, file: !194, line: 101, baseType: !139, size: 16)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !197, file: !194, line: 108, baseType: !136, size: 32, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !197, file: !194, line: 132, baseType: !103, size: 32, offset: 160)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !197, file: !194, line: 136, baseType: !251, size: 192, offset: 192)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !230, line: 254, size: 192, elements: !252)
!252 = !{!253, !254, !260}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !251, file: !230, line: 255, baseType: !203, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !251, file: !230, line: 256, baseType: !255, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !230, line: 252, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !251, file: !230, line: 259, baseType: !98, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !193, file: !194, line: 255, baseType: !262, size: 288, offset: 384)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !263, line: 25, size: 288, elements: !264)
!263 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !262, file: !263, line: 26, baseType: !136, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !262, file: !263, line: 27, baseType: !136, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !262, file: !263, line: 28, baseType: !136, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !262, file: !263, line: 29, baseType: !136, size: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !262, file: !263, line: 30, baseType: !136, size: 32, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !262, file: !263, line: 31, baseType: !136, size: 32, offset: 160)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !262, file: !263, line: 32, baseType: !136, size: 32, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !262, file: !263, line: 33, baseType: !136, size: 32, offset: 224)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !262, file: !263, line: 34, baseType: !136, size: 32, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !193, file: !194, line: 258, baseType: !103, size: 32, offset: 672)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !193, file: !194, line: 261, baseType: !229, size: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !193, file: !194, line: 302, baseType: !104, size: 32, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !193, file: !194, line: 333, baseType: !278, size: 32, offset: 800)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !280, line: 5291, size: 160, elements: !281)
!280 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!281 = !{!282, !293, !294}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !279, file: !280, line: 5292, baseType: !283, size: 96)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !284, line: 56, size: 96, elements: !285)
!284 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!285 = !{!286, !289, !290}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !283, file: !284, line: 57, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !284, line: 57, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !283, file: !284, line: 58, baseType: !103, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !283, file: !284, line: 59, baseType: !291, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !292, line: 46, baseType: !137)
!292 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!293 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !279, file: !280, line: 5293, baseType: !229, size: 64, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !279, file: !280, line: 5294, baseType: !295, offset: 160)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !296, line: 45, elements: !297)
!296 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!297 = !{}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !193, file: !194, line: 355, baseType: !299, size: 64, offset: 832)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !263, line: 60, size: 64, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !299, file: !263, line: 63, baseType: !136, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !299, file: !263, line: 66, baseType: !136, size: 32, offset: 32)
!303 = !DILocalVariable(name: "object", arg: 1, scope: !189, file: !13, line: 223, type: !124)
!304 = !DILocation(line: 223, column: 61, scope: !189)
!305 = !DILocalVariable(name: "thread", arg: 2, scope: !189, file: !13, line: 224, type: !192)
!306 = !DILocation(line: 224, column: 24, scope: !189)
!307 = !DILocation(line: 226, column: 9, scope: !189)
!308 = !DILocation(line: 227, column: 9, scope: !189)
!309 = !DILocation(line: 228, column: 1, scope: !189)
!310 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !13, file: !13, line: 243, type: !311, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !124}
!313 = !DILocalVariable(name: "object", arg: 1, scope: !310, file: !13, line: 243, type: !124)
!314 = !DILocation(line: 243, column: 56, scope: !310)
!315 = !DILocation(line: 245, column: 9, scope: !310)
!316 = !DILocation(line: 246, column: 1, scope: !310)
!317 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !13, file: !13, line: 359, type: !318, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!318 = !DISubroutineType(types: !319)
!319 = !{!103, !12}
!320 = !DILocalVariable(name: "otype", arg: 1, scope: !317, file: !13, line: 359, type: !12)
!321 = !DILocation(line: 359, column: 58, scope: !317)
!322 = !DILocation(line: 361, column: 9, scope: !317)
!323 = !DILocation(line: 363, column: 2, scope: !317)
!324 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !13, file: !13, line: 366, type: !325, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!325 = !DISubroutineType(types: !326)
!326 = !{!103, !12, !291}
!327 = !DILocalVariable(name: "otype", arg: 1, scope: !324, file: !13, line: 366, type: !12)
!328 = !DILocation(line: 366, column: 63, scope: !324)
!329 = !DILocalVariable(name: "size", arg: 2, scope: !324, file: !13, line: 367, type: !291)
!330 = !DILocation(line: 367, column: 13, scope: !324)
!331 = !DILocation(line: 369, column: 9, scope: !324)
!332 = !DILocation(line: 370, column: 9, scope: !324)
!333 = !DILocation(line: 372, column: 2, scope: !324)
!334 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !280, file: !280, line: 656, type: !335, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!335 = !DISubroutineType(types: !336)
!336 = !{!96, !337}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!339 = !DILocalVariable(name: "t", arg: 1, scope: !334, file: !280, line: 657, type: !337)
!340 = !DILocation(line: 657, column: 30, scope: !334)
!341 = !DILocation(line: 659, column: 28, scope: !334)
!342 = !DILocation(line: 659, column: 31, scope: !334)
!343 = !DILocation(line: 659, column: 36, scope: !334)
!344 = !DILocation(line: 659, column: 9, scope: !334)
!345 = !DILocation(line: 659, column: 2, scope: !334)
!346 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !280, file: !280, line: 671, type: !335, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!347 = !DILocalVariable(name: "t", arg: 1, scope: !346, file: !280, line: 672, type: !337)
!348 = !DILocation(line: 672, column: 30, scope: !346)
!349 = !DILocation(line: 674, column: 30, scope: !346)
!350 = !DILocation(line: 674, column: 33, scope: !346)
!351 = !DILocation(line: 674, column: 38, scope: !346)
!352 = !DILocation(line: 674, column: 9, scope: !346)
!353 = !DILocation(line: 674, column: 2, scope: !346)
!354 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !280, file: !280, line: 1634, type: !355, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!355 = !DISubroutineType(types: !356)
!356 = !{!96, !357}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !280, line: 1439, size: 448, elements: !360)
!360 = !{!361, !362, !363, !368, !369, !374, !375}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !359, file: !280, line: 1445, baseType: !251, size: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !359, file: !280, line: 1448, baseType: !229, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !359, file: !280, line: 1451, baseType: !364, size: 32, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !359, file: !280, line: 1454, baseType: !364, size: 32, offset: 288)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !359, file: !280, line: 1457, baseType: !370, size: 64, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !97, line: 67, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !97, line: 65, size: 64, elements: !372)
!372 = !{!373}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !371, file: !97, line: 66, baseType: !96, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !359, file: !280, line: 1460, baseType: !136, size: 32, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !359, file: !280, line: 1463, baseType: !103, size: 32, offset: 416)
!376 = !DILocalVariable(name: "timer", arg: 1, scope: !354, file: !280, line: 1635, type: !357)
!377 = !DILocation(line: 1635, column: 34, scope: !354)
!378 = !DILocation(line: 1637, column: 28, scope: !354)
!379 = !DILocation(line: 1637, column: 35, scope: !354)
!380 = !DILocation(line: 1637, column: 9, scope: !354)
!381 = !DILocation(line: 1637, column: 2, scope: !354)
!382 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !280, file: !280, line: 1649, type: !355, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!383 = !DILocalVariable(name: "timer", arg: 1, scope: !382, file: !280, line: 1650, type: !357)
!384 = !DILocation(line: 1650, column: 34, scope: !382)
!385 = !DILocation(line: 1652, column: 30, scope: !382)
!386 = !DILocation(line: 1652, column: 37, scope: !382)
!387 = !DILocation(line: 1652, column: 9, scope: !382)
!388 = !DILocation(line: 1652, column: 2, scope: !382)
!389 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !280, file: !280, line: 1689, type: !390, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !367, !103}
!392 = !DILocalVariable(name: "timer", arg: 1, scope: !389, file: !280, line: 1689, type: !367)
!393 = !DILocation(line: 1689, column: 65, scope: !389)
!394 = !DILocalVariable(name: "user_data", arg: 2, scope: !389, file: !280, line: 1690, type: !103)
!395 = !DILocation(line: 1690, column: 19, scope: !389)
!396 = !DILocation(line: 1692, column: 21, scope: !389)
!397 = !DILocation(line: 1692, column: 2, scope: !389)
!398 = !DILocation(line: 1692, column: 9, scope: !389)
!399 = !DILocation(line: 1692, column: 19, scope: !389)
!400 = !DILocation(line: 1693, column: 1, scope: !389)
!401 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !280, file: !280, line: 1704, type: !402, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!402 = !DISubroutineType(types: !403)
!403 = !{!103, !357}
!404 = !DILocalVariable(name: "timer", arg: 1, scope: !401, file: !280, line: 1704, type: !357)
!405 = !DILocation(line: 1704, column: 72, scope: !401)
!406 = !DILocation(line: 1706, column: 9, scope: !401)
!407 = !DILocation(line: 1706, column: 16, scope: !401)
!408 = !DILocation(line: 1706, column: 2, scope: !401)
!409 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !280, file: !280, line: 2071, type: !410, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!410 = !DISubroutineType(types: !411)
!411 = !{!104, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !280, line: 1830, size: 128, elements: !414)
!414 = !{!415, !428, !429}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !413, file: !280, line: 1831, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !417, line: 60, baseType: !418)
!417 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !417, line: 53, size: 64, elements: !419)
!419 = !{!420, !427}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !418, file: !417, line: 54, baseType: !421, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !417, line: 50, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !417, line: 44, size: 32, elements: !424)
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !423, file: !417, line: 45, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !417, line: 40, baseType: !136)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !418, file: !417, line: 55, baseType: !421, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !413, file: !280, line: 1832, baseType: !295, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !413, file: !280, line: 1833, baseType: !229, size: 64, offset: 64)
!430 = !DILocalVariable(name: "queue", arg: 1, scope: !409, file: !280, line: 2071, type: !412)
!431 = !DILocation(line: 2071, column: 59, scope: !409)
!432 = !DILocation(line: 2073, column: 35, scope: !409)
!433 = !DILocation(line: 2073, column: 42, scope: !409)
!434 = !DILocation(line: 2073, column: 14, scope: !409)
!435 = !DILocation(line: 2073, column: 9, scope: !409)
!436 = !DILocation(line: 2073, column: 2, scope: !409)
!437 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !280, file: !280, line: 3209, type: !438, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!438 = !DISubroutineType(types: !439)
!439 = !{!137, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !280, line: 3092, size: 128, elements: !442)
!442 = !{!443, !444, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !441, file: !280, line: 3093, baseType: !229, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !441, file: !280, line: 3094, baseType: !137, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !441, file: !280, line: 3095, baseType: !137, size: 32, offset: 96)
!446 = !DILocalVariable(name: "sem", arg: 1, scope: !437, file: !280, line: 3209, type: !440)
!447 = !DILocation(line: 3209, column: 65, scope: !437)
!448 = !DILocation(line: 3211, column: 9, scope: !437)
!449 = !DILocation(line: 3211, column: 14, scope: !437)
!450 = !DILocation(line: 3211, column: 2, scope: !437)
!451 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !280, file: !280, line: 4649, type: !452, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!452 = !DISubroutineType(types: !453)
!453 = !{!136, !454}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !280, line: 4390, size: 320, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !463, !464, !465, !466, !467}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !455, file: !280, line: 4392, baseType: !229, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !455, file: !280, line: 4394, baseType: !295, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !455, file: !280, line: 4396, baseType: !291, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !455, file: !280, line: 4398, baseType: !136, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !455, file: !280, line: 4400, baseType: !462, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !455, file: !280, line: 4402, baseType: !462, size: 32, offset: 160)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !455, file: !280, line: 4404, baseType: !462, size: 32, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !455, file: !280, line: 4406, baseType: !462, size: 32, offset: 224)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !455, file: !280, line: 4408, baseType: !136, size: 32, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !455, file: !280, line: 4413, baseType: !132, size: 8, offset: 288)
!468 = !DILocalVariable(name: "msgq", arg: 1, scope: !451, file: !280, line: 4649, type: !454)
!469 = !DILocation(line: 4649, column: 66, scope: !451)
!470 = !DILocation(line: 4651, column: 9, scope: !451)
!471 = !DILocation(line: 4651, column: 15, scope: !451)
!472 = !DILocation(line: 4651, column: 26, scope: !451)
!473 = !DILocation(line: 4651, column: 32, scope: !451)
!474 = !DILocation(line: 4651, column: 24, scope: !451)
!475 = !DILocation(line: 4651, column: 2, scope: !451)
!476 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !280, file: !280, line: 4665, type: !452, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!477 = !DILocalVariable(name: "msgq", arg: 1, scope: !476, file: !280, line: 4665, type: !454)
!478 = !DILocation(line: 4665, column: 66, scope: !476)
!479 = !DILocation(line: 4667, column: 9, scope: !476)
!480 = !DILocation(line: 4667, column: 15, scope: !476)
!481 = !DILocation(line: 4667, column: 2, scope: !476)
!482 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !118, file: !118, line: 744, type: !483, scopeLine: 745, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!483 = !DISubroutineType(types: !484)
!484 = !{!134, !115}
!485 = !DILocalVariable(name: "dev", arg: 1, scope: !482, file: !118, line: 744, type: !115)
!486 = !DILocation(line: 744, column: 65, scope: !482)
!487 = !DILocation(line: 746, column: 27, scope: !482)
!488 = !DILocation(line: 746, column: 9, scope: !482)
!489 = !DILocation(line: 746, column: 2, scope: !482)
!490 = distinct !DISubprogram(name: "z_impl_pwm_set_cycles", scope: !108, file: !108, line: 481, type: !113, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !297)
!491 = !DILocalVariable(name: "dev", arg: 1, scope: !490, file: !108, line: 481, type: !115)
!492 = !DILocation(line: 481, column: 62, scope: !490)
!493 = !DILocalVariable(name: "channel", arg: 2, scope: !490, file: !108, line: 482, type: !136)
!494 = !DILocation(line: 482, column: 15, scope: !490)
!495 = !DILocalVariable(name: "period", arg: 3, scope: !490, file: !108, line: 482, type: !136)
!496 = !DILocation(line: 482, column: 33, scope: !490)
!497 = !DILocalVariable(name: "pulse", arg: 4, scope: !490, file: !108, line: 483, type: !136)
!498 = !DILocation(line: 483, column: 15, scope: !490)
!499 = !DILocalVariable(name: "flags", arg: 5, scope: !490, file: !108, line: 483, type: !138)
!500 = !DILocation(line: 483, column: 34, scope: !490)
!501 = !DILocalVariable(name: "api", scope: !490, file: !108, line: 485, type: !105)
!502 = !DILocation(line: 485, column: 31, scope: !490)
!503 = !DILocation(line: 486, column: 34, scope: !490)
!504 = !DILocation(line: 486, column: 39, scope: !490)
!505 = !DILocation(line: 488, column: 6, scope: !506)
!506 = distinct !DILexicalBlock(scope: !490, file: !108, line: 488, column: 6)
!507 = !DILocation(line: 488, column: 14, scope: !506)
!508 = !DILocation(line: 488, column: 12, scope: !506)
!509 = !DILocation(line: 488, column: 6, scope: !490)
!510 = !DILocation(line: 489, column: 3, scope: !511)
!511 = distinct !DILexicalBlock(scope: !506, file: !108, line: 488, column: 22)
!512 = !DILocation(line: 492, column: 9, scope: !490)
!513 = !DILocation(line: 492, column: 14, scope: !490)
!514 = !DILocation(line: 492, column: 25, scope: !490)
!515 = !DILocation(line: 492, column: 30, scope: !490)
!516 = !DILocation(line: 492, column: 39, scope: !490)
!517 = !DILocation(line: 492, column: 47, scope: !490)
!518 = !DILocation(line: 492, column: 54, scope: !490)
!519 = !DILocation(line: 492, column: 2, scope: !490)
!520 = !DILocation(line: 493, column: 1, scope: !490)
