; ModuleID = '../bc_files/msg_q.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/msg_q.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.z_kernel = type { [1 x %struct._cpu], %struct._ready_q }
%struct._cpu = type { i32, ptr, ptr, ptr, i8, %struct._cpu_arch }
%struct._cpu_arch = type {}
%struct._ready_q = type { ptr, %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }

!41 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 34)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 35)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 36)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 37)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 38)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 39)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 40)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 41)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 42)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 43)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 44)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 45)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 46)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 47)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!85 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!86 = !{!87, !88, !89, !105}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!88 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !91, line: 55, baseType: !92)
!91 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !91, line: 37, size: 64, elements: !93)
!93 = !{!94, !100}
!94 = !DIDerivedType(tag: DW_TAG_member, scope: !92, file: !91, line: 38, baseType: !95, size: 32)
!95 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !92, file: !91, line: 38, size: 32, elements: !96)
!96 = !{!97, !99}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !95, file: !91, line: 39, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !91, line: 40, baseType: !98, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, scope: !92, file: !91, line: 42, baseType: !101, size: 32, offset: 32)
!101 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !92, file: !91, line: 42, size: 32, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !101, file: !91, line: 43, baseType: !98, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !101, file: !91, line: 44, baseType: !98, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !107, line: 250, size: 896, elements: !108)
!107 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!108 = !{!109, !167, !180, !181, !182, !183, !204}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !106, file: !107, line: 252, baseType: !110, size: 384)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !107, line: 58, size: 384, elements: !111)
!111 = !{!112, !125, !133, !136, !137, !150, !153, !154}
!112 = !DIDerivedType(tag: DW_TAG_member, scope: !110, file: !107, line: 61, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !107, line: 61, size: 64, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !113, file: !107, line: 62, baseType: !90, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !113, file: !107, line: 63, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !118, line: 58, size: 64, elements: !119)
!118 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !117, file: !118, line: 60, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 64, elements: !123)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!123 = !{!124}
!124 = !DISubrange(count: 2)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !110, file: !107, line: 69, baseType: !126, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !128, line: 243, baseType: !129)
!128 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 241, size: 64, elements: !130)
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !129, file: !128, line: 242, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !91, line: 51, baseType: !92)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !110, file: !107, line: 72, baseType: !134, size: 8, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !135, line: 62, baseType: !5)
!135 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!136 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !110, file: !107, line: 75, baseType: !134, size: 8, offset: 104)
!137 = !DIDerivedType(tag: DW_TAG_member, scope: !110, file: !107, line: 91, baseType: !138, size: 16, offset: 112)
!138 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !107, line: 91, size: 16, elements: !139)
!139 = !{!140, !147}
!140 = !DIDerivedType(tag: DW_TAG_member, scope: !138, file: !107, line: 92, baseType: !141, size: 16)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !107, line: 92, size: 16, elements: !142)
!142 = !{!143, !146}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !141, file: !107, line: 97, baseType: !144, size: 8)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !135, line: 56, baseType: !145)
!145 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !141, file: !107, line: 98, baseType: !134, size: 8, offset: 8)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !138, file: !107, line: 101, baseType: !148, size: 16)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !135, line: 63, baseType: !149)
!149 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !110, file: !107, line: 108, baseType: !151, size: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !135, line: 64, baseType: !152)
!152 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !110, file: !107, line: 132, baseType: !87, size: 32, offset: 160)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !110, file: !107, line: 136, baseType: !155, size: 192, offset: 192)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !128, line: 254, size: 192, elements: !156)
!156 = !{!157, !158, !164}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !155, file: !128, line: 255, baseType: !90, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !155, file: !128, line: 256, baseType: !159, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !128, line: 252, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !155, file: !128, line: 259, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !135, line: 59, baseType: !166)
!166 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !106, file: !107, line: 255, baseType: !168, size: 288, offset: 384)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !169, line: 25, size: 288, elements: !170)
!169 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !168, file: !169, line: 26, baseType: !151, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !168, file: !169, line: 27, baseType: !151, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !168, file: !169, line: 28, baseType: !151, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !168, file: !169, line: 29, baseType: !151, size: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !168, file: !169, line: 30, baseType: !151, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !168, file: !169, line: 31, baseType: !151, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !168, file: !169, line: 32, baseType: !151, size: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !168, file: !169, line: 33, baseType: !151, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !168, file: !169, line: 34, baseType: !151, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !106, file: !107, line: 258, baseType: !87, size: 32, offset: 672)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !106, file: !107, line: 261, baseType: !127, size: 64, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !106, file: !107, line: 302, baseType: !88, size: 32, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !106, file: !107, line: 333, baseType: !184, size: 32, offset: 800)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !186, line: 5291, size: 160, elements: !187)
!186 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!187 = !{!188, !199, !200}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !185, file: !186, line: 5292, baseType: !189, size: 96)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !190, line: 56, size: 96, elements: !191)
!190 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!191 = !{!192, !195, !196}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !189, file: !190, line: 57, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !190, line: 57, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !189, file: !190, line: 58, baseType: !87, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !189, file: !190, line: 59, baseType: !197, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !198, line: 46, baseType: !152)
!198 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !185, file: !186, line: 5293, baseType: !127, size: 64, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !185, file: !186, line: 5294, baseType: !201, offset: 160)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !202, line: 45, elements: !203)
!202 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!203 = !{}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !106, file: !107, line: 355, baseType: !205, size: 64, offset: 832)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !169, line: 60, size: 64, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !205, file: !169, line: 63, baseType: !151, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !205, file: !169, line: 66, baseType: !151, size: 32, offset: 32)
!209 = !{i32 7, !"Dwarf Version", i32 4}
!210 = !{i32 2, !"Debug Info Version", i32 3}
!211 = !{i32 1, !"wchar_size", i32 4}
!212 = !{i32 1, !"static_rwdata", i32 1}
!213 = !{i32 1, !"enumsize_buildattr", i32 1}
!214 = !{i32 1, !"armlib_unavailable", i32 0}
!215 = !{i32 8, !"PIC Level", i32 2}
!216 = !{i32 7, !"PIE Level", i32 2}
!217 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!218 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !4, file: !4, line: 223, type: !219, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !221, !105}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!223 = !DILocalVariable(name: "object", arg: 1, scope: !218, file: !4, line: 223, type: !221)
!224 = !DILocation(line: 223, column: 61, scope: !218)
!225 = !DILocalVariable(name: "thread", arg: 2, scope: !218, file: !4, line: 224, type: !105)
!226 = !DILocation(line: 224, column: 24, scope: !218)
!227 = !DILocation(line: 226, column: 9, scope: !218)
!228 = !DILocation(line: 227, column: 9, scope: !218)
!229 = !DILocation(line: 228, column: 1, scope: !218)
!230 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !4, file: !4, line: 243, type: !231, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !221}
!233 = !DILocalVariable(name: "object", arg: 1, scope: !230, file: !4, line: 243, type: !221)
!234 = !DILocation(line: 243, column: 56, scope: !230)
!235 = !DILocation(line: 245, column: 9, scope: !230)
!236 = !DILocation(line: 246, column: 1, scope: !230)
!237 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !4, file: !4, line: 359, type: !238, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!238 = !DISubroutineType(types: !239)
!239 = !{!87, !3}
!240 = !DILocalVariable(name: "otype", arg: 1, scope: !237, file: !4, line: 359, type: !3)
!241 = !DILocation(line: 359, column: 58, scope: !237)
!242 = !DILocation(line: 361, column: 9, scope: !237)
!243 = !DILocation(line: 363, column: 2, scope: !237)
!244 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !4, file: !4, line: 366, type: !245, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!245 = !DISubroutineType(types: !246)
!246 = !{!87, !3, !197}
!247 = !DILocalVariable(name: "otype", arg: 1, scope: !244, file: !4, line: 366, type: !3)
!248 = !DILocation(line: 366, column: 63, scope: !244)
!249 = !DILocalVariable(name: "size", arg: 2, scope: !244, file: !4, line: 367, type: !197)
!250 = !DILocation(line: 367, column: 13, scope: !244)
!251 = !DILocation(line: 369, column: 9, scope: !244)
!252 = !DILocation(line: 370, column: 9, scope: !244)
!253 = !DILocation(line: 372, column: 2, scope: !244)
!254 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !186, file: !186, line: 656, type: !255, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!255 = !DISubroutineType(types: !256)
!256 = !{!257, !259}
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !258, line: 46, baseType: !165)
!258 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!261 = !DILocalVariable(name: "t", arg: 1, scope: !254, file: !186, line: 657, type: !259)
!262 = !DILocation(line: 657, column: 30, scope: !254)
!263 = !DILocation(line: 659, column: 28, scope: !254)
!264 = !DILocation(line: 659, column: 31, scope: !254)
!265 = !DILocation(line: 659, column: 36, scope: !254)
!266 = !DILocation(line: 659, column: 9, scope: !254)
!267 = !DILocation(line: 659, column: 2, scope: !254)
!268 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !186, file: !186, line: 671, type: !255, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!269 = !DILocalVariable(name: "t", arg: 1, scope: !268, file: !186, line: 672, type: !259)
!270 = !DILocation(line: 672, column: 30, scope: !268)
!271 = !DILocation(line: 674, column: 30, scope: !268)
!272 = !DILocation(line: 674, column: 33, scope: !268)
!273 = !DILocation(line: 674, column: 38, scope: !268)
!274 = !DILocation(line: 674, column: 9, scope: !268)
!275 = !DILocation(line: 674, column: 2, scope: !268)
!276 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !186, file: !186, line: 1634, type: !277, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!277 = !DISubroutineType(types: !278)
!278 = !{!257, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !186, line: 1439, size: 448, elements: !282)
!282 = !{!283, !284, !285, !290, !291, !296, !297}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !281, file: !186, line: 1445, baseType: !155, size: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !281, file: !186, line: 1448, baseType: !127, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !281, file: !186, line: 1451, baseType: !286, size: 32, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !281, file: !186, line: 1454, baseType: !286, size: 32, offset: 288)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !281, file: !186, line: 1457, baseType: !292, size: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !258, line: 67, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !258, line: 65, size: 64, elements: !294)
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !293, file: !258, line: 66, baseType: !257, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !281, file: !186, line: 1460, baseType: !151, size: 32, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !281, file: !186, line: 1463, baseType: !87, size: 32, offset: 416)
!298 = !DILocalVariable(name: "timer", arg: 1, scope: !276, file: !186, line: 1635, type: !279)
!299 = !DILocation(line: 1635, column: 34, scope: !276)
!300 = !DILocation(line: 1637, column: 28, scope: !276)
!301 = !DILocation(line: 1637, column: 35, scope: !276)
!302 = !DILocation(line: 1637, column: 9, scope: !276)
!303 = !DILocation(line: 1637, column: 2, scope: !276)
!304 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !186, file: !186, line: 1649, type: !277, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!305 = !DILocalVariable(name: "timer", arg: 1, scope: !304, file: !186, line: 1650, type: !279)
!306 = !DILocation(line: 1650, column: 34, scope: !304)
!307 = !DILocation(line: 1652, column: 30, scope: !304)
!308 = !DILocation(line: 1652, column: 37, scope: !304)
!309 = !DILocation(line: 1652, column: 9, scope: !304)
!310 = !DILocation(line: 1652, column: 2, scope: !304)
!311 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !186, file: !186, line: 1689, type: !312, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !289, !87}
!314 = !DILocalVariable(name: "timer", arg: 1, scope: !311, file: !186, line: 1689, type: !289)
!315 = !DILocation(line: 1689, column: 65, scope: !311)
!316 = !DILocalVariable(name: "user_data", arg: 2, scope: !311, file: !186, line: 1690, type: !87)
!317 = !DILocation(line: 1690, column: 19, scope: !311)
!318 = !DILocation(line: 1692, column: 21, scope: !311)
!319 = !DILocation(line: 1692, column: 2, scope: !311)
!320 = !DILocation(line: 1692, column: 9, scope: !311)
!321 = !DILocation(line: 1692, column: 19, scope: !311)
!322 = !DILocation(line: 1693, column: 1, scope: !311)
!323 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !186, file: !186, line: 1704, type: !324, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!324 = !DISubroutineType(types: !325)
!325 = !{!87, !279}
!326 = !DILocalVariable(name: "timer", arg: 1, scope: !323, file: !186, line: 1704, type: !279)
!327 = !DILocation(line: 1704, column: 72, scope: !323)
!328 = !DILocation(line: 1706, column: 9, scope: !323)
!329 = !DILocation(line: 1706, column: 16, scope: !323)
!330 = !DILocation(line: 1706, column: 2, scope: !323)
!331 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !186, file: !186, line: 2071, type: !332, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!332 = !DISubroutineType(types: !333)
!333 = !{!88, !334}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !186, line: 1830, size: 128, elements: !336)
!336 = !{!337, !350, !351}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !335, file: !186, line: 1831, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !339, line: 60, baseType: !340)
!339 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !339, line: 53, size: 64, elements: !341)
!341 = !{!342, !349}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !340, file: !339, line: 54, baseType: !343, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !339, line: 50, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !339, line: 44, size: 32, elements: !346)
!346 = !{!347}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !345, file: !339, line: 45, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !339, line: 40, baseType: !151)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !340, file: !339, line: 55, baseType: !343, size: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !335, file: !186, line: 1832, baseType: !201, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !335, file: !186, line: 1833, baseType: !127, size: 64, offset: 64)
!352 = !DILocalVariable(name: "queue", arg: 1, scope: !331, file: !186, line: 2071, type: !334)
!353 = !DILocation(line: 2071, column: 59, scope: !331)
!354 = !DILocation(line: 2073, column: 35, scope: !331)
!355 = !DILocation(line: 2073, column: 42, scope: !331)
!356 = !DILocation(line: 2073, column: 14, scope: !331)
!357 = !DILocation(line: 2073, column: 9, scope: !331)
!358 = !DILocation(line: 2073, column: 2, scope: !331)
!359 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !186, file: !186, line: 3209, type: !360, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!360 = !DISubroutineType(types: !361)
!361 = !{!152, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !186, line: 3092, size: 128, elements: !364)
!364 = !{!365, !366, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !363, file: !186, line: 3093, baseType: !127, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !363, file: !186, line: 3094, baseType: !152, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !363, file: !186, line: 3095, baseType: !152, size: 32, offset: 96)
!368 = !DILocalVariable(name: "sem", arg: 1, scope: !359, file: !186, line: 3209, type: !362)
!369 = !DILocation(line: 3209, column: 65, scope: !359)
!370 = !DILocation(line: 3211, column: 9, scope: !359)
!371 = !DILocation(line: 3211, column: 14, scope: !359)
!372 = !DILocation(line: 3211, column: 2, scope: !359)
!373 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !186, file: !186, line: 4649, type: !374, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!374 = !DISubroutineType(types: !375)
!375 = !{!151, !376}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !186, line: 4390, size: 320, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !386, !387, !388, !389, !390}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !377, file: !186, line: 4392, baseType: !127, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !377, file: !186, line: 4394, baseType: !201, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !377, file: !186, line: 4396, baseType: !197, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !377, file: !186, line: 4398, baseType: !151, size: 32, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !377, file: !186, line: 4400, baseType: !384, size: 32, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !377, file: !186, line: 4402, baseType: !384, size: 32, offset: 160)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !377, file: !186, line: 4404, baseType: !384, size: 32, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !377, file: !186, line: 4406, baseType: !384, size: 32, offset: 224)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !377, file: !186, line: 4408, baseType: !151, size: 32, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !377, file: !186, line: 4413, baseType: !134, size: 8, offset: 288)
!391 = !DILocalVariable(name: "msgq", arg: 1, scope: !373, file: !186, line: 4649, type: !376)
!392 = !DILocation(line: 4649, column: 66, scope: !373)
!393 = !DILocation(line: 4651, column: 9, scope: !373)
!394 = !DILocation(line: 4651, column: 15, scope: !373)
!395 = !DILocation(line: 4651, column: 26, scope: !373)
!396 = !DILocation(line: 4651, column: 32, scope: !373)
!397 = !DILocation(line: 4651, column: 24, scope: !373)
!398 = !DILocation(line: 4651, column: 2, scope: !373)
!399 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !186, file: !186, line: 4665, type: !374, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!400 = !DILocalVariable(name: "msgq", arg: 1, scope: !399, file: !186, line: 4665, type: !376)
!401 = !DILocation(line: 4665, column: 66, scope: !399)
!402 = !DILocation(line: 4667, column: 9, scope: !399)
!403 = !DILocation(line: 4667, column: 15, scope: !399)
!404 = !DILocation(line: 4667, column: 2, scope: !399)
!405 = distinct !DISubprogram(name: "k_msgq_init", scope: !406, file: !406, line: 39, type: !407, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !203)
!406 = !DIFile(filename: "kernel/msg_q.c", directory: "/home/sri/zephyrproject/zephyr")
!407 = !DISubroutineType(types: !408)
!408 = !{null, !376, !384, !409, !151}
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !410, line: 51, baseType: !152)
!410 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/string.h", directory: "")
!411 = !DILocalVariable(name: "msgq", arg: 1, scope: !405, file: !406, line: 39, type: !376)
!412 = !DILocation(line: 39, column: 33, scope: !405)
!413 = !DILocalVariable(name: "buffer", arg: 2, scope: !405, file: !406, line: 39, type: !384)
!414 = !DILocation(line: 39, column: 45, scope: !405)
!415 = !DILocalVariable(name: "msg_size", arg: 3, scope: !405, file: !406, line: 39, type: !409)
!416 = !DILocation(line: 39, column: 60, scope: !405)
!417 = !DILocalVariable(name: "max_msgs", arg: 4, scope: !405, file: !406, line: 40, type: !151)
!418 = !DILocation(line: 40, column: 13, scope: !405)
!419 = !DILocation(line: 42, column: 19, scope: !405)
!420 = !DILocation(line: 42, column: 2, scope: !405)
!421 = !DILocation(line: 42, column: 8, scope: !405)
!422 = !DILocation(line: 42, column: 17, scope: !405)
!423 = !DILocation(line: 43, column: 19, scope: !405)
!424 = !DILocation(line: 43, column: 2, scope: !405)
!425 = !DILocation(line: 43, column: 8, scope: !405)
!426 = !DILocation(line: 43, column: 17, scope: !405)
!427 = !DILocation(line: 44, column: 23, scope: !405)
!428 = !DILocation(line: 44, column: 2, scope: !405)
!429 = !DILocation(line: 44, column: 8, scope: !405)
!430 = !DILocation(line: 44, column: 21, scope: !405)
!431 = !DILocation(line: 45, column: 21, scope: !405)
!432 = !DILocation(line: 45, column: 31, scope: !405)
!433 = !DILocation(line: 45, column: 42, scope: !405)
!434 = !DILocation(line: 45, column: 40, scope: !405)
!435 = !DILocation(line: 45, column: 28, scope: !405)
!436 = !DILocation(line: 45, column: 2, scope: !405)
!437 = !DILocation(line: 45, column: 8, scope: !405)
!438 = !DILocation(line: 45, column: 19, scope: !405)
!439 = !DILocation(line: 46, column: 19, scope: !405)
!440 = !DILocation(line: 46, column: 2, scope: !405)
!441 = !DILocation(line: 46, column: 8, scope: !405)
!442 = !DILocation(line: 46, column: 17, scope: !405)
!443 = !DILocation(line: 47, column: 20, scope: !405)
!444 = !DILocation(line: 47, column: 2, scope: !405)
!445 = !DILocation(line: 47, column: 8, scope: !405)
!446 = !DILocation(line: 47, column: 18, scope: !405)
!447 = !DILocation(line: 48, column: 2, scope: !405)
!448 = !DILocation(line: 48, column: 8, scope: !405)
!449 = !DILocation(line: 48, column: 18, scope: !405)
!450 = !DILocation(line: 49, column: 2, scope: !405)
!451 = !DILocation(line: 49, column: 8, scope: !405)
!452 = !DILocation(line: 49, column: 14, scope: !405)
!453 = !DILocation(line: 50, column: 16, scope: !405)
!454 = !DILocation(line: 50, column: 22, scope: !405)
!455 = !DILocation(line: 50, column: 2, scope: !405)
!456 = !DILocation(line: 51, column: 2, scope: !405)
!457 = !DILocation(line: 51, column: 8, scope: !405)
!458 = !DILocation(line: 51, column: 15, scope: !405)
!459 = !DILocation(line: 60, column: 2, scope: !405)
!460 = !DILocation(line: 60, column: 7, scope: !461)
!461 = distinct !DILexicalBlock(scope: !405, file: !406, line: 60, column: 5)
!462 = !DILocation(line: 62, column: 16, scope: !405)
!463 = !DILocation(line: 62, column: 2, scope: !405)
!464 = !DILocation(line: 63, column: 1, scope: !405)
!465 = distinct !DISubprogram(name: "z_waitq_init", scope: !466, file: !466, line: 47, type: !467, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!466 = !DIFile(filename: "kernel/include/wait_q.h", directory: "/home/sri/zephyrproject/zephyr")
!467 = !DISubroutineType(types: !468)
!468 = !{null, !126}
!469 = !DILocalVariable(name: "w", arg: 1, scope: !465, file: !466, line: 47, type: !126)
!470 = !DILocation(line: 47, column: 44, scope: !465)
!471 = !DILocation(line: 49, column: 18, scope: !465)
!472 = !DILocation(line: 49, column: 21, scope: !465)
!473 = !DILocation(line: 49, column: 2, scope: !465)
!474 = !DILocation(line: 50, column: 1, scope: !465)
!475 = distinct !DISubprogram(name: "z_object_init", scope: !4, file: !4, line: 215, type: !231, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!476 = !DILocalVariable(name: "obj", arg: 1, scope: !475, file: !4, line: 215, type: !221)
!477 = !DILocation(line: 215, column: 46, scope: !475)
!478 = !DILocation(line: 217, column: 9, scope: !475)
!479 = !DILocation(line: 218, column: 1, scope: !475)
!480 = distinct !DISubprogram(name: "z_impl_k_msgq_alloc_init", scope: !406, file: !406, line: 65, type: !481, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !203)
!481 = !DISubroutineType(types: !482)
!482 = !{!88, !376, !409, !151}
!483 = !DILocalVariable(name: "msgq", arg: 1, scope: !480, file: !406, line: 65, type: !376)
!484 = !DILocation(line: 65, column: 45, scope: !480)
!485 = !DILocalVariable(name: "msg_size", arg: 2, scope: !480, file: !406, line: 65, type: !409)
!486 = !DILocation(line: 65, column: 58, scope: !480)
!487 = !DILocalVariable(name: "max_msgs", arg: 3, scope: !480, file: !406, line: 66, type: !151)
!488 = !DILocation(line: 66, column: 17, scope: !480)
!489 = !DILocalVariable(name: "buffer", scope: !480, file: !406, line: 68, type: !87)
!490 = !DILocation(line: 68, column: 8, scope: !480)
!491 = !DILocalVariable(name: "ret", scope: !480, file: !406, line: 69, type: !88)
!492 = !DILocation(line: 69, column: 6, scope: !480)
!493 = !DILocalVariable(name: "total_size", scope: !480, file: !406, line: 70, type: !409)
!494 = !DILocation(line: 70, column: 9, scope: !480)
!495 = !DILocation(line: 72, column: 2, scope: !480)
!496 = !DILocation(line: 72, column: 7, scope: !497)
!497 = distinct !DILexicalBlock(scope: !480, file: !406, line: 72, column: 5)
!498 = !DILocation(line: 74, column: 24, scope: !499)
!499 = distinct !DILexicalBlock(scope: !480, file: !406, line: 74, column: 6)
!500 = !DILocation(line: 74, column: 34, scope: !499)
!501 = !DILocation(line: 74, column: 6, scope: !499)
!502 = !DILocation(line: 74, column: 6, scope: !480)
!503 = !DILocation(line: 75, column: 7, scope: !504)
!504 = distinct !DILexicalBlock(scope: !499, file: !406, line: 74, column: 58)
!505 = !DILocation(line: 76, column: 2, scope: !504)
!506 = !DILocation(line: 77, column: 28, scope: !507)
!507 = distinct !DILexicalBlock(scope: !499, file: !406, line: 76, column: 9)
!508 = !DILocation(line: 77, column: 12, scope: !507)
!509 = !DILocation(line: 77, column: 10, scope: !507)
!510 = !DILocation(line: 78, column: 7, scope: !511)
!511 = distinct !DILexicalBlock(scope: !507, file: !406, line: 78, column: 7)
!512 = !DILocation(line: 78, column: 14, scope: !511)
!513 = !DILocation(line: 78, column: 7, scope: !507)
!514 = !DILocation(line: 79, column: 16, scope: !515)
!515 = distinct !DILexicalBlock(scope: !511, file: !406, line: 78, column: 20)
!516 = !DILocation(line: 79, column: 22, scope: !515)
!517 = !DILocation(line: 79, column: 30, scope: !515)
!518 = !DILocation(line: 79, column: 40, scope: !515)
!519 = !DILocation(line: 79, column: 4, scope: !515)
!520 = !DILocation(line: 80, column: 4, scope: !515)
!521 = !DILocation(line: 80, column: 10, scope: !515)
!522 = !DILocation(line: 80, column: 16, scope: !515)
!523 = !DILocation(line: 81, column: 8, scope: !515)
!524 = !DILocation(line: 82, column: 3, scope: !515)
!525 = !DILocation(line: 83, column: 8, scope: !526)
!526 = distinct !DILexicalBlock(scope: !511, file: !406, line: 82, column: 10)
!527 = !DILocation(line: 87, column: 2, scope: !480)
!528 = !DILocation(line: 87, column: 7, scope: !529)
!529 = distinct !DILexicalBlock(scope: !480, file: !406, line: 87, column: 5)
!530 = !DILocation(line: 89, column: 9, scope: !480)
!531 = !DILocation(line: 89, column: 2, scope: !480)
!532 = distinct !DISubprogram(name: "size_mul_overflow", scope: !533, file: !533, line: 105, type: !534, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!533 = !DIFile(filename: "include/zephyr/sys/math_extras_impl.h", directory: "/home/sri/zephyrproject/zephyr")
!534 = !DISubroutineType(types: !535)
!535 = !{!536, !409, !409, !537}
!536 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!538 = !DILocalVariable(name: "a", arg: 1, scope: !532, file: !533, line: 105, type: !409)
!539 = !DILocation(line: 105, column: 46, scope: !532)
!540 = !DILocalVariable(name: "b", arg: 2, scope: !532, file: !533, line: 105, type: !409)
!541 = !DILocation(line: 105, column: 56, scope: !532)
!542 = !DILocalVariable(name: "result", arg: 3, scope: !532, file: !533, line: 105, type: !537)
!543 = !DILocation(line: 105, column: 67, scope: !532)
!544 = !DILocation(line: 107, column: 32, scope: !532)
!545 = !DILocation(line: 107, column: 35, scope: !532)
!546 = !DILocation(line: 107, column: 38, scope: !532)
!547 = !DILocation(line: 107, column: 9, scope: !532)
!548 = !DILocation(line: 107, column: 2, scope: !532)
!549 = distinct !DISubprogram(name: "z_thread_malloc", scope: !550, file: !550, line: 105, type: !551, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!550 = !DIFile(filename: "kernel/include/kernel_internal.h", directory: "/home/sri/zephyrproject/zephyr")
!551 = !DISubroutineType(types: !552)
!552 = !{!87, !409}
!553 = !DILocalVariable(name: "size", arg: 1, scope: !549, file: !550, line: 105, type: !409)
!554 = !DILocation(line: 105, column: 44, scope: !549)
!555 = !DILocation(line: 107, column: 35, scope: !549)
!556 = !DILocation(line: 107, column: 9, scope: !549)
!557 = !DILocation(line: 107, column: 2, scope: !549)
!558 = distinct !DISubprogram(name: "k_msgq_cleanup", scope: !406, file: !406, line: 103, type: !559, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !203)
!559 = !DISubroutineType(types: !560)
!560 = !{!88, !376}
!561 = !DILocalVariable(name: "msgq", arg: 1, scope: !558, file: !406, line: 103, type: !376)
!562 = !DILocation(line: 103, column: 35, scope: !558)
!563 = !DILocation(line: 105, column: 2, scope: !558)
!564 = !DILocation(line: 105, column: 7, scope: !565)
!565 = distinct !DILexicalBlock(scope: !558, file: !406, line: 105, column: 5)
!566 = !DILocation(line: 107, column: 20, scope: !567)
!567 = distinct !DILexicalBlock(scope: !558, file: !406, line: 107, column: 6)
!568 = !DILocation(line: 107, column: 26, scope: !567)
!569 = !DILocation(line: 107, column: 6, scope: !567)
!570 = !DILocation(line: 107, column: 34, scope: !567)
!571 = !DILocation(line: 107, column: 6, scope: !558)
!572 = !DILocation(line: 108, column: 3, scope: !573)
!573 = distinct !DILexicalBlock(scope: !567, file: !406, line: 107, column: 40)
!574 = !DILocation(line: 108, column: 8, scope: !575)
!575 = distinct !DILexicalBlock(scope: !573, file: !406, line: 108, column: 6)
!576 = !DILocation(line: 110, column: 3, scope: !573)
!577 = !DILocation(line: 113, column: 7, scope: !578)
!578 = distinct !DILexicalBlock(scope: !558, file: !406, line: 113, column: 6)
!579 = !DILocation(line: 113, column: 13, scope: !578)
!580 = !DILocation(line: 113, column: 19, scope: !578)
!581 = !DILocation(line: 113, column: 35, scope: !578)
!582 = !DILocation(line: 113, column: 6, scope: !558)
!583 = !DILocation(line: 114, column: 10, scope: !584)
!584 = distinct !DILexicalBlock(scope: !578, file: !406, line: 113, column: 42)
!585 = !DILocation(line: 114, column: 16, scope: !584)
!586 = !DILocation(line: 114, column: 3, scope: !584)
!587 = !DILocation(line: 115, column: 3, scope: !584)
!588 = !DILocation(line: 115, column: 9, scope: !584)
!589 = !DILocation(line: 115, column: 15, scope: !584)
!590 = !DILocation(line: 116, column: 2, scope: !584)
!591 = !DILocation(line: 118, column: 2, scope: !558)
!592 = !DILocation(line: 118, column: 7, scope: !593)
!593 = distinct !DILexicalBlock(scope: !558, file: !406, line: 118, column: 5)
!594 = !DILocation(line: 120, column: 2, scope: !558)
!595 = !DILocation(line: 121, column: 1, scope: !558)
!596 = distinct !DISubprogram(name: "z_waitq_head", scope: !466, file: !466, line: 52, type: !597, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!597 = !DISubroutineType(types: !598)
!598 = !{!105, !126}
!599 = !DILocalVariable(name: "w", arg: 1, scope: !596, file: !466, line: 52, type: !126)
!600 = !DILocation(line: 52, column: 56, scope: !596)
!601 = !DILocation(line: 54, column: 49, scope: !596)
!602 = !DILocation(line: 54, column: 52, scope: !596)
!603 = !DILocation(line: 54, column: 28, scope: !596)
!604 = !DILocation(line: 54, column: 2, scope: !596)
!605 = distinct !DISubprogram(name: "z_impl_k_msgq_put", scope: !406, file: !406, line: 124, type: !606, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !203)
!606 = !DISubroutineType(types: !607)
!607 = !{!88, !376, !221, !292}
!608 = !DILocalVariable(name: "msgq", arg: 1, scope: !605, file: !406, line: 124, type: !376)
!609 = !DILocation(line: 124, column: 38, scope: !605)
!610 = !DILocalVariable(name: "data", arg: 2, scope: !605, file: !406, line: 124, type: !221)
!611 = !DILocation(line: 124, column: 56, scope: !605)
!612 = !DILocalVariable(name: "timeout", arg: 3, scope: !605, file: !406, line: 124, type: !292)
!613 = !DILocation(line: 124, column: 74, scope: !605)
!614 = !DILocalVariable(name: "pending_thread", scope: !605, file: !406, line: 128, type: !105)
!615 = !DILocation(line: 128, column: 19, scope: !605)
!616 = !DILocalVariable(name: "key", scope: !605, file: !406, line: 129, type: !617)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !202, line: 108, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !202, line: 34, size: 32, elements: !619)
!619 = !{!620}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !618, file: !202, line: 35, baseType: !88, size: 32)
!621 = !DILocation(line: 129, column: 19, scope: !605)
!622 = !DILocalVariable(name: "result", scope: !605, file: !406, line: 130, type: !88)
!623 = !DILocation(line: 130, column: 6, scope: !605)
!624 = !DILocation(line: 132, column: 21, scope: !605)
!625 = !DILocation(line: 132, column: 27, scope: !605)
!626 = !DILocalVariable(name: "l", arg: 1, scope: !627, file: !202, line: 160, type: !630)
!627 = distinct !DISubprogram(name: "k_spin_lock", scope: !202, file: !202, line: 160, type: !628, scopeLine: 161, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!628 = !DISubroutineType(types: !629)
!629 = !{!617, !630}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!631 = !DILocation(line: 160, column: 94, scope: !627, inlinedAt: !632)
!632 = distinct !DILocation(line: 132, column: 8, scope: !605)
!633 = !DILocation(line: 162, column: 9, scope: !627, inlinedAt: !632)
!634 = !DILocalVariable(name: "k", scope: !627, file: !202, line: 163, type: !617)
!635 = !DILocation(line: 163, column: 19, scope: !627, inlinedAt: !632)
!636 = !DILocalVariable(name: "key", scope: !637, file: !638, line: 44, type: !152)
!637 = distinct !DISubprogram(name: "arch_irq_lock", scope: !638, file: !638, line: 42, type: !639, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!638 = !DIFile(filename: "include/zephyr/arch/arm/asm_inline_gcc.h", directory: "/home/sri/zephyrproject/zephyr")
!639 = !DISubroutineType(types: !640)
!640 = !{!152}
!641 = !DILocation(line: 44, column: 15, scope: !637, inlinedAt: !642)
!642 = distinct !DILocation(line: 169, column: 10, scope: !627, inlinedAt: !632)
!643 = !DILocation(line: 48, column: 2, scope: !637, inlinedAt: !642)
!644 = !{i64 66945}
!645 = !DILocation(line: 80, column: 9, scope: !637, inlinedAt: !642)
!646 = !DILocation(line: 169, column: 8, scope: !627, inlinedAt: !632)
!647 = !DILocation(line: 171, column: 26, scope: !627, inlinedAt: !632)
!648 = !DILocalVariable(name: "l", arg: 1, scope: !649, file: !202, line: 110, type: !630)
!649 = distinct !DISubprogram(name: "z_spinlock_validate_pre", scope: !202, file: !202, line: 110, type: !650, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !630}
!652 = !DILocation(line: 110, column: 94, scope: !649, inlinedAt: !653)
!653 = distinct !DILocation(line: 171, column: 2, scope: !627, inlinedAt: !632)
!654 = !DILocation(line: 112, column: 9, scope: !649, inlinedAt: !653)
!655 = !DILocation(line: 177, column: 27, scope: !627, inlinedAt: !632)
!656 = !DILocalVariable(name: "l", arg: 1, scope: !657, file: !202, line: 121, type: !630)
!657 = distinct !DISubprogram(name: "z_spinlock_validate_post", scope: !202, file: !202, line: 121, type: !650, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!658 = !DILocation(line: 121, column: 95, scope: !657, inlinedAt: !659)
!659 = distinct !DILocation(line: 177, column: 2, scope: !627, inlinedAt: !632)
!660 = !DILocation(line: 123, column: 9, scope: !657, inlinedAt: !659)
!661 = !DILocation(line: 179, column: 2, scope: !627, inlinedAt: !632)
!662 = !DILocation(line: 132, column: 8, scope: !605)
!663 = !DILocation(line: 134, column: 2, scope: !605)
!664 = !DILocation(line: 134, column: 7, scope: !665)
!665 = distinct !DILexicalBlock(scope: !605, file: !406, line: 134, column: 5)
!666 = !DILocation(line: 136, column: 6, scope: !667)
!667 = distinct !DILexicalBlock(scope: !605, file: !406, line: 136, column: 6)
!668 = !DILocation(line: 136, column: 12, scope: !667)
!669 = !DILocation(line: 136, column: 24, scope: !667)
!670 = !DILocation(line: 136, column: 30, scope: !667)
!671 = !DILocation(line: 136, column: 22, scope: !667)
!672 = !DILocation(line: 136, column: 6, scope: !605)
!673 = !DILocation(line: 138, column: 43, scope: !674)
!674 = distinct !DILexicalBlock(scope: !667, file: !406, line: 136, column: 40)
!675 = !DILocation(line: 138, column: 49, scope: !674)
!676 = !DILocation(line: 138, column: 20, scope: !674)
!677 = !DILocation(line: 138, column: 18, scope: !674)
!678 = !DILocation(line: 139, column: 7, scope: !679)
!679 = distinct !DILexicalBlock(scope: !674, file: !406, line: 139, column: 7)
!680 = !DILocation(line: 139, column: 22, scope: !679)
!681 = !DILocation(line: 139, column: 7, scope: !674)
!682 = !DILocation(line: 140, column: 4, scope: !683)
!683 = distinct !DILexicalBlock(scope: !679, file: !406, line: 139, column: 28)
!684 = !DILocation(line: 140, column: 9, scope: !685)
!685 = distinct !DILexicalBlock(scope: !683, file: !406, line: 140, column: 7)
!686 = !DILocation(line: 143, column: 17, scope: !683)
!687 = !DILocation(line: 143, column: 33, scope: !683)
!688 = !DILocation(line: 143, column: 38, scope: !683)
!689 = !DILocation(line: 143, column: 49, scope: !683)
!690 = !DILocation(line: 144, column: 11, scope: !683)
!691 = !DILocation(line: 144, column: 17, scope: !683)
!692 = !DILocation(line: 143, column: 10, scope: !683)
!693 = !DILocation(line: 146, column: 33, scope: !683)
!694 = !DILocalVariable(name: "thread", arg: 1, scope: !695, file: !696, line: 59, type: !105)
!695 = distinct !DISubprogram(name: "arch_thread_return_value_set", scope: !696, file: !696, line: 59, type: !697, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!696 = !DIFile(filename: "arch/arm/include/cortex_m/kernel_arch_func.h", directory: "/home/sri/zephyrproject/zephyr")
!697 = !DISubroutineType(types: !698)
!698 = !{null, !105, !152}
!699 = !DILocation(line: 59, column: 47, scope: !695, inlinedAt: !700)
!700 = distinct !DILocation(line: 146, column: 4, scope: !683)
!701 = !DILocalVariable(name: "value", arg: 2, scope: !695, file: !696, line: 59, type: !152)
!702 = !DILocation(line: 59, column: 68, scope: !695, inlinedAt: !700)
!703 = !DILocation(line: 61, column: 35, scope: !695, inlinedAt: !700)
!704 = !DILocation(line: 61, column: 2, scope: !695, inlinedAt: !700)
!705 = !DILocation(line: 61, column: 10, scope: !695, inlinedAt: !700)
!706 = !DILocation(line: 61, column: 15, scope: !695, inlinedAt: !700)
!707 = !DILocation(line: 61, column: 33, scope: !695, inlinedAt: !700)
!708 = !DILocation(line: 147, column: 19, scope: !683)
!709 = !DILocation(line: 147, column: 4, scope: !683)
!710 = !DILocation(line: 148, column: 18, scope: !683)
!711 = !DILocation(line: 148, column: 24, scope: !683)
!712 = !DILocation(line: 148, column: 4, scope: !683)
!713 = !DILocation(line: 149, column: 4, scope: !683)
!714 = !DILocation(line: 154, column: 17, scope: !715)
!715 = distinct !DILexicalBlock(scope: !679, file: !406, line: 150, column: 10)
!716 = !DILocation(line: 154, column: 23, scope: !715)
!717 = !DILocation(line: 154, column: 34, scope: !715)
!718 = !DILocation(line: 154, column: 40, scope: !715)
!719 = !DILocation(line: 154, column: 46, scope: !715)
!720 = !DILocation(line: 154, column: 10, scope: !715)
!721 = !DILocation(line: 155, column: 23, scope: !715)
!722 = !DILocation(line: 155, column: 29, scope: !715)
!723 = !DILocation(line: 155, column: 4, scope: !715)
!724 = !DILocation(line: 155, column: 10, scope: !715)
!725 = !DILocation(line: 155, column: 20, scope: !715)
!726 = !DILocation(line: 156, column: 8, scope: !727)
!727 = distinct !DILexicalBlock(scope: !715, file: !406, line: 156, column: 8)
!728 = !DILocation(line: 156, column: 14, scope: !727)
!729 = !DILocation(line: 156, column: 27, scope: !727)
!730 = !DILocation(line: 156, column: 33, scope: !727)
!731 = !DILocation(line: 156, column: 24, scope: !727)
!732 = !DILocation(line: 156, column: 8, scope: !715)
!733 = !DILocation(line: 157, column: 23, scope: !734)
!734 = distinct !DILexicalBlock(scope: !727, file: !406, line: 156, column: 45)
!735 = !DILocation(line: 157, column: 29, scope: !734)
!736 = !DILocation(line: 157, column: 5, scope: !734)
!737 = !DILocation(line: 157, column: 11, scope: !734)
!738 = !DILocation(line: 157, column: 21, scope: !734)
!739 = !DILocation(line: 158, column: 4, scope: !734)
!740 = !DILocation(line: 159, column: 4, scope: !715)
!741 = !DILocation(line: 159, column: 10, scope: !715)
!742 = !DILocation(line: 159, column: 19, scope: !715)
!743 = !DILocation(line: 164, column: 10, scope: !674)
!744 = !DILocation(line: 165, column: 2, scope: !674)
!745 = !DILocation(line: 165, column: 24, scope: !746)
!746 = distinct !DILexicalBlock(scope: !667, file: !406, line: 165, column: 13)
!747 = !DILocation(line: 165, column: 49, scope: !746)
!748 = !DILocation(line: 165, column: 30, scope: !746)
!749 = !DILocation(line: 165, column: 13, scope: !667)
!750 = !DILocation(line: 167, column: 10, scope: !751)
!751 = distinct !DILexicalBlock(scope: !746, file: !406, line: 165, column: 63)
!752 = !DILocation(line: 168, column: 2, scope: !751)
!753 = !DILocation(line: 169, column: 3, scope: !754)
!754 = distinct !DILexicalBlock(scope: !746, file: !406, line: 168, column: 9)
!755 = !DILocation(line: 169, column: 8, scope: !756)
!756 = distinct !DILexicalBlock(scope: !754, file: !406, line: 169, column: 6)
!757 = !DILocation(line: 172, column: 54, scope: !754)
!758 = !DILocation(line: 172, column: 19, scope: !754)
!759 = !DILocation(line: 172, column: 28, scope: !754)
!760 = !DILocation(line: 172, column: 33, scope: !754)
!761 = !DILocation(line: 172, column: 43, scope: !754)
!762 = !DILocation(line: 174, column: 25, scope: !754)
!763 = !DILocation(line: 174, column: 31, scope: !754)
!764 = !DILocation(line: 174, column: 43, scope: !754)
!765 = !DILocation(line: 174, column: 49, scope: !754)
!766 = !DILocation(line: 174, column: 12, scope: !754)
!767 = !DILocation(line: 174, column: 10, scope: !754)
!768 = !DILocation(line: 175, column: 3, scope: !754)
!769 = !DILocation(line: 175, column: 8, scope: !770)
!770 = distinct !DILexicalBlock(scope: !754, file: !406, line: 175, column: 6)
!771 = !DILocation(line: 176, column: 10, scope: !754)
!772 = !DILocation(line: 176, column: 3, scope: !754)
!773 = !DILocation(line: 179, column: 2, scope: !605)
!774 = !DILocation(line: 179, column: 7, scope: !775)
!775 = distinct !DILexicalBlock(scope: !605, file: !406, line: 179, column: 5)
!776 = !DILocation(line: 181, column: 17, scope: !605)
!777 = !DILocation(line: 181, column: 23, scope: !605)
!778 = !DILocation(line: 181, column: 2, scope: !605)
!779 = !DILocalVariable(name: "l", arg: 1, scope: !780, file: !202, line: 235, type: !630)
!780 = distinct !DISubprogram(name: "k_spin_unlock", scope: !202, file: !202, line: 235, type: !781, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !630, !617}
!783 = !DILocation(line: 235, column: 84, scope: !780, inlinedAt: !784)
!784 = distinct !DILocation(line: 181, column: 2, scope: !605)
!785 = !DILocalVariable(name: "key", arg: 2, scope: !780, file: !202, line: 236, type: !617)
!786 = !DILocation(line: 236, column: 23, scope: !780, inlinedAt: !784)
!787 = !DILocation(line: 238, column: 9, scope: !780, inlinedAt: !784)
!788 = !DILocation(line: 261, column: 22, scope: !780, inlinedAt: !784)
!789 = !DILocalVariable(name: "key", arg: 1, scope: !790, file: !638, line: 88, type: !152)
!790 = distinct !DISubprogram(name: "arch_irq_unlock", scope: !638, file: !638, line: 88, type: !791, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !203)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !152}
!793 = !DILocation(line: 88, column: 80, scope: !790, inlinedAt: !794)
!794 = distinct !DILocation(line: 261, column: 2, scope: !780, inlinedAt: !784)
!795 = !DILocation(line: 91, column: 6, scope: !796, inlinedAt: !794)
!796 = distinct !DILexicalBlock(scope: !790, file: !638, line: 91, column: 6)
!797 = !DILocation(line: 91, column: 10, scope: !796, inlinedAt: !794)
!798 = !DILocation(line: 91, column: 6, scope: !790, inlinedAt: !794)
!799 = !DILocation(line: 92, column: 3, scope: !800, inlinedAt: !794)
!800 = distinct !DILexicalBlock(scope: !796, file: !638, line: 91, column: 17)
!801 = !DILocation(line: 94, column: 2, scope: !790, inlinedAt: !794)
!802 = !{i64 67249}
!803 = !DILocation(line: 114, column: 1, scope: !790, inlinedAt: !794)
!804 = !DILocation(line: 183, column: 9, scope: !605)
!805 = !DILocation(line: 183, column: 2, scope: !605)
!806 = !DILocation(line: 184, column: 1, scope: !605)
!807 = distinct !DISubprogram(name: "z_impl_k_msgq_get_attrs", scope: !406, file: !406, line: 198, type: !808, scopeLine: 199, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !203)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !376, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq_attrs", file: !186, line: 4449, size: 96, elements: !812)
!812 = !{!813, !814, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !811, file: !186, line: 4451, baseType: !197, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !811, file: !186, line: 4453, baseType: !151, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !811, file: !186, line: 4455, baseType: !151, size: 32, offset: 64)
!816 = !DILocalVariable(name: "msgq", arg: 1, scope: !807, file: !406, line: 198, type: !376)
!817 = !DILocation(line: 198, column: 45, scope: !807)
!818 = !DILocalVariable(name: "attrs", arg: 2, scope: !807, file: !406, line: 198, type: !810)
!819 = !DILocation(line: 198, column: 72, scope: !807)
!820 = !DILocation(line: 200, column: 20, scope: !807)
!821 = !DILocation(line: 200, column: 26, scope: !807)
!822 = !DILocation(line: 200, column: 2, scope: !807)
!823 = !DILocation(line: 200, column: 9, scope: !807)
!824 = !DILocation(line: 200, column: 18, scope: !807)
!825 = !DILocation(line: 201, column: 20, scope: !807)
!826 = !DILocation(line: 201, column: 26, scope: !807)
!827 = !DILocation(line: 201, column: 2, scope: !807)
!828 = !DILocation(line: 201, column: 9, scope: !807)
!829 = !DILocation(line: 201, column: 18, scope: !807)
!830 = !DILocation(line: 202, column: 21, scope: !807)
!831 = !DILocation(line: 202, column: 27, scope: !807)
!832 = !DILocation(line: 202, column: 2, scope: !807)
!833 = !DILocation(line: 202, column: 9, scope: !807)
!834 = !DILocation(line: 202, column: 19, scope: !807)
!835 = !DILocation(line: 203, column: 1, scope: !807)
!836 = distinct !DISubprogram(name: "z_impl_k_msgq_get", scope: !406, file: !406, line: 216, type: !837, scopeLine: 217, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !203)
!837 = !DISubroutineType(types: !838)
!838 = !{!88, !376, !87, !292}
!839 = !DILocalVariable(name: "msgq", arg: 1, scope: !836, file: !406, line: 216, type: !376)
!840 = !DILocation(line: 216, column: 38, scope: !836)
!841 = !DILocalVariable(name: "data", arg: 2, scope: !836, file: !406, line: 216, type: !87)
!842 = !DILocation(line: 216, column: 50, scope: !836)
!843 = !DILocalVariable(name: "timeout", arg: 3, scope: !836, file: !406, line: 216, type: !292)
!844 = !DILocation(line: 216, column: 68, scope: !836)
!845 = !DILocalVariable(name: "key", scope: !836, file: !406, line: 220, type: !617)
!846 = !DILocation(line: 220, column: 19, scope: !836)
!847 = !DILocalVariable(name: "pending_thread", scope: !836, file: !406, line: 221, type: !105)
!848 = !DILocation(line: 221, column: 19, scope: !836)
!849 = !DILocalVariable(name: "result", scope: !836, file: !406, line: 222, type: !88)
!850 = !DILocation(line: 222, column: 6, scope: !836)
!851 = !DILocation(line: 224, column: 21, scope: !836)
!852 = !DILocation(line: 224, column: 27, scope: !836)
!853 = !DILocation(line: 160, column: 94, scope: !627, inlinedAt: !854)
!854 = distinct !DILocation(line: 224, column: 8, scope: !836)
!855 = !DILocation(line: 162, column: 9, scope: !627, inlinedAt: !854)
!856 = !DILocation(line: 163, column: 19, scope: !627, inlinedAt: !854)
!857 = !DILocation(line: 44, column: 15, scope: !637, inlinedAt: !858)
!858 = distinct !DILocation(line: 169, column: 10, scope: !627, inlinedAt: !854)
!859 = !DILocation(line: 48, column: 2, scope: !637, inlinedAt: !858)
!860 = !DILocation(line: 80, column: 9, scope: !637, inlinedAt: !858)
!861 = !DILocation(line: 169, column: 8, scope: !627, inlinedAt: !854)
!862 = !DILocation(line: 171, column: 26, scope: !627, inlinedAt: !854)
!863 = !DILocation(line: 110, column: 94, scope: !649, inlinedAt: !864)
!864 = distinct !DILocation(line: 171, column: 2, scope: !627, inlinedAt: !854)
!865 = !DILocation(line: 112, column: 9, scope: !649, inlinedAt: !864)
!866 = !DILocation(line: 177, column: 27, scope: !627, inlinedAt: !854)
!867 = !DILocation(line: 121, column: 95, scope: !657, inlinedAt: !868)
!868 = distinct !DILocation(line: 177, column: 2, scope: !627, inlinedAt: !854)
!869 = !DILocation(line: 123, column: 9, scope: !657, inlinedAt: !868)
!870 = !DILocation(line: 179, column: 2, scope: !627, inlinedAt: !854)
!871 = !DILocation(line: 224, column: 8, scope: !836)
!872 = !DILocation(line: 226, column: 2, scope: !836)
