; ModuleID = '../bc_files/msg_q.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/msg_q.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.z_kernel = type { [1 x %struct._cpu], %struct._ready_q }
%struct._cpu = type { i32, ptr, ptr, ptr, i8, %struct._cpu_arch }
%struct._cpu_arch = type {}
%struct._ready_q = type { ptr, %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }

!41 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 34)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 35)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 36)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 37)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 38)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 39)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 40)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 41)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 42)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 43)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 44)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 45)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 46)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 47)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!85 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!86 = !{!87, !88, !89, !105}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!88 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !91, line: 55, baseType: !92)
!91 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !91, line: 37, size: 64, elements: !93)
!93 = !{!94, !100}
!94 = !DIDerivedType(tag: DW_TAG_member, scope: !92, file: !91, line: 38, baseType: !95, size: 32)
!95 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !92, file: !91, line: 38, size: 32, elements: !96)
!96 = !{!97, !99}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !95, file: !91, line: 39, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !91, line: 40, baseType: !98, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, scope: !92, file: !91, line: 42, baseType: !101, size: 32, offset: 32)
!101 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !92, file: !91, line: 42, size: 32, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !101, file: !91, line: 43, baseType: !98, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !101, file: !91, line: 44, baseType: !98, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !107, line: 250, size: 896, elements: !108)
!107 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!108 = !{!109, !167, !180, !181, !182, !183, !204}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !106, file: !107, line: 252, baseType: !110, size: 384)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !107, line: 58, size: 384, elements: !111)
!111 = !{!112, !125, !133, !136, !137, !150, !153, !154}
!112 = !DIDerivedType(tag: DW_TAG_member, scope: !110, file: !107, line: 61, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !107, line: 61, size: 64, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !113, file: !107, line: 62, baseType: !90, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !113, file: !107, line: 63, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !118, line: 58, size: 64, elements: !119)
!118 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !117, file: !118, line: 60, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 64, elements: !123)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!123 = !{!124}
!124 = !DISubrange(count: 2)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !110, file: !107, line: 69, baseType: !126, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !128, line: 243, baseType: !129)
!128 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 241, size: 64, elements: !130)
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !129, file: !128, line: 242, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !91, line: 51, baseType: !92)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !110, file: !107, line: 72, baseType: !134, size: 8, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !135, line: 62, baseType: !5)
!135 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!136 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !110, file: !107, line: 75, baseType: !134, size: 8, offset: 104)
!137 = !DIDerivedType(tag: DW_TAG_member, scope: !110, file: !107, line: 91, baseType: !138, size: 16, offset: 112)
!138 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !107, line: 91, size: 16, elements: !139)
!139 = !{!140, !147}
!140 = !DIDerivedType(tag: DW_TAG_member, scope: !138, file: !107, line: 92, baseType: !141, size: 16)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !107, line: 92, size: 16, elements: !142)
!142 = !{!143, !146}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !141, file: !107, line: 97, baseType: !144, size: 8)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !135, line: 56, baseType: !145)
!145 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !141, file: !107, line: 98, baseType: !134, size: 8, offset: 8)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !138, file: !107, line: 101, baseType: !148, size: 16)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !135, line: 63, baseType: !149)
!149 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !110, file: !107, line: 108, baseType: !151, size: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !135, line: 64, baseType: !152)
!152 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !110, file: !107, line: 132, baseType: !87, size: 32, offset: 160)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !110, file: !107, line: 136, baseType: !155, size: 192, offset: 192)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !128, line: 254, size: 192, elements: !156)
!156 = !{!157, !158, !164}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !155, file: !128, line: 255, baseType: !90, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !155, file: !128, line: 256, baseType: !159, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !128, line: 252, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !155, file: !128, line: 259, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !135, line: 59, baseType: !166)
!166 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !106, file: !107, line: 255, baseType: !168, size: 288, offset: 384)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !169, line: 25, size: 288, elements: !170)
!169 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !168, file: !169, line: 26, baseType: !151, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !168, file: !169, line: 27, baseType: !151, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !168, file: !169, line: 28, baseType: !151, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !168, file: !169, line: 29, baseType: !151, size: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !168, file: !169, line: 30, baseType: !151, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !168, file: !169, line: 31, baseType: !151, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !168, file: !169, line: 32, baseType: !151, size: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !168, file: !169, line: 33, baseType: !151, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !168, file: !169, line: 34, baseType: !151, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !106, file: !107, line: 258, baseType: !87, size: 32, offset: 672)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !106, file: !107, line: 261, baseType: !127, size: 64, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !106, file: !107, line: 302, baseType: !88, size: 32, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !106, file: !107, line: 333, baseType: !184, size: 32, offset: 800)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !186, line: 5291, size: 160, elements: !187)
!186 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!187 = !{!188, !199, !200}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !185, file: !186, line: 5292, baseType: !189, size: 96)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !190, line: 56, size: 96, elements: !191)
!190 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!191 = !{!192, !195, !196}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !189, file: !190, line: 57, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !190, line: 57, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !189, file: !190, line: 58, baseType: !87, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !189, file: !190, line: 59, baseType: !197, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !198, line: 46, baseType: !152)
!198 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !185, file: !186, line: 5293, baseType: !127, size: 64, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !185, file: !186, line: 5294, baseType: !201, offset: 160)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !202, line: 45, elements: !203)
!202 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!203 = !{}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !106, file: !107, line: 355, baseType: !205, size: 64, offset: 832)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !169, line: 60, size: 64, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !205, file: !169, line: 63, baseType: !151, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !205, file: !169, line: 66, baseType: !151, size: 32, offset: 32)
!209 = !{i32 7, !"Dwarf Version", i32 4}
!210 = !{i32 2, !"Debug Info Version", i32 3}
!211 = !{i32 1, !"wchar_size", i32 4}
!212 = !{i32 1, !"static_rwdata", i32 1}
!213 = !{i32 1, !"enumsize_buildattr", i32 1}
!214 = !{i32 1, !"armlib_unavailable", i32 0}
!215 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!216 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !4, file: !4, line: 223, type: !217, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !221)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !219, !105}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!221 = !{!222, !223}
!222 = !DILocalVariable(name: "object", arg: 1, scope: !216, file: !4, line: 223, type: !219)
!223 = !DILocalVariable(name: "thread", arg: 2, scope: !216, file: !4, line: 224, type: !105)
!224 = !DILocation(line: 223, column: 61, scope: !216)
!225 = !DILocation(line: 224, column: 24, scope: !216)
!226 = !DILocation(line: 226, column: 9, scope: !216)
!227 = !DILocation(line: 227, column: 9, scope: !216)
!228 = !DILocation(line: 228, column: 1, scope: !216)
!229 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !4, file: !4, line: 243, type: !230, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !232)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !219}
!232 = !{!233}
!233 = !DILocalVariable(name: "object", arg: 1, scope: !229, file: !4, line: 243, type: !219)
!234 = !DILocation(line: 243, column: 56, scope: !229)
!235 = !DILocation(line: 245, column: 9, scope: !229)
!236 = !DILocation(line: 246, column: 1, scope: !229)
!237 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !4, file: !4, line: 359, type: !238, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !240)
!238 = !DISubroutineType(types: !239)
!239 = !{!87, !3}
!240 = !{!241}
!241 = !DILocalVariable(name: "otype", arg: 1, scope: !237, file: !4, line: 359, type: !3)
!242 = !DILocation(line: 359, column: 58, scope: !237)
!243 = !DILocation(line: 361, column: 9, scope: !237)
!244 = !DILocation(line: 363, column: 2, scope: !237)
!245 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !4, file: !4, line: 366, type: !246, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !248)
!246 = !DISubroutineType(types: !247)
!247 = !{!87, !3, !197}
!248 = !{!249, !250}
!249 = !DILocalVariable(name: "otype", arg: 1, scope: !245, file: !4, line: 366, type: !3)
!250 = !DILocalVariable(name: "size", arg: 2, scope: !245, file: !4, line: 367, type: !197)
!251 = !DILocation(line: 366, column: 63, scope: !245)
!252 = !DILocation(line: 367, column: 13, scope: !245)
!253 = !DILocation(line: 369, column: 9, scope: !245)
!254 = !DILocation(line: 370, column: 9, scope: !245)
!255 = !DILocation(line: 372, column: 2, scope: !245)
!256 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !186, file: !186, line: 656, type: !257, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !263)
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !261}
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !260, line: 46, baseType: !165)
!260 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!263 = !{!264}
!264 = !DILocalVariable(name: "t", arg: 1, scope: !256, file: !186, line: 657, type: !261)
!265 = !DILocation(line: 657, column: 30, scope: !256)
!266 = !DILocation(line: 659, column: 28, scope: !256)
!267 = !DILocation(line: 659, column: 31, scope: !256)
!268 = !DILocation(line: 659, column: 36, scope: !256)
!269 = !DILocation(line: 659, column: 9, scope: !256)
!270 = !DILocation(line: 659, column: 2, scope: !256)
!271 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !186, file: !186, line: 671, type: !257, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !272)
!272 = !{!273}
!273 = !DILocalVariable(name: "t", arg: 1, scope: !271, file: !186, line: 672, type: !261)
!274 = !DILocation(line: 672, column: 30, scope: !271)
!275 = !DILocation(line: 674, column: 30, scope: !271)
!276 = !DILocation(line: 674, column: 33, scope: !271)
!277 = !DILocation(line: 674, column: 38, scope: !271)
!278 = !DILocation(line: 674, column: 9, scope: !271)
!279 = !DILocation(line: 674, column: 2, scope: !271)
!280 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !186, file: !186, line: 1634, type: !281, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !302)
!281 = !DISubroutineType(types: !282)
!282 = !{!259, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !186, line: 1439, size: 448, elements: !286)
!286 = !{!287, !288, !289, !294, !295, !300, !301}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !285, file: !186, line: 1445, baseType: !155, size: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !285, file: !186, line: 1448, baseType: !127, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !285, file: !186, line: 1451, baseType: !290, size: 32, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !285, file: !186, line: 1454, baseType: !290, size: 32, offset: 288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !285, file: !186, line: 1457, baseType: !296, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !260, line: 67, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !260, line: 65, size: 64, elements: !298)
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !297, file: !260, line: 66, baseType: !259, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !285, file: !186, line: 1460, baseType: !151, size: 32, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !285, file: !186, line: 1463, baseType: !87, size: 32, offset: 416)
!302 = !{!303}
!303 = !DILocalVariable(name: "timer", arg: 1, scope: !280, file: !186, line: 1635, type: !283)
!304 = !DILocation(line: 1635, column: 34, scope: !280)
!305 = !DILocation(line: 1637, column: 28, scope: !280)
!306 = !DILocation(line: 1637, column: 35, scope: !280)
!307 = !DILocation(line: 1637, column: 9, scope: !280)
!308 = !DILocation(line: 1637, column: 2, scope: !280)
!309 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !186, file: !186, line: 1649, type: !281, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !310)
!310 = !{!311}
!311 = !DILocalVariable(name: "timer", arg: 1, scope: !309, file: !186, line: 1650, type: !283)
!312 = !DILocation(line: 1650, column: 34, scope: !309)
!313 = !DILocation(line: 1652, column: 30, scope: !309)
!314 = !DILocation(line: 1652, column: 37, scope: !309)
!315 = !DILocation(line: 1652, column: 9, scope: !309)
!316 = !DILocation(line: 1652, column: 2, scope: !309)
!317 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !186, file: !186, line: 1689, type: !318, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !320)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !293, !87}
!320 = !{!321, !322}
!321 = !DILocalVariable(name: "timer", arg: 1, scope: !317, file: !186, line: 1689, type: !293)
!322 = !DILocalVariable(name: "user_data", arg: 2, scope: !317, file: !186, line: 1690, type: !87)
!323 = !DILocation(line: 1689, column: 65, scope: !317)
!324 = !DILocation(line: 1690, column: 19, scope: !317)
!325 = !DILocation(line: 1692, column: 21, scope: !317)
!326 = !DILocation(line: 1692, column: 2, scope: !317)
!327 = !DILocation(line: 1692, column: 9, scope: !317)
!328 = !DILocation(line: 1692, column: 19, scope: !317)
!329 = !DILocation(line: 1693, column: 1, scope: !317)
!330 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !186, file: !186, line: 1704, type: !331, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !333)
!331 = !DISubroutineType(types: !332)
!332 = !{!87, !283}
!333 = !{!334}
!334 = !DILocalVariable(name: "timer", arg: 1, scope: !330, file: !186, line: 1704, type: !283)
!335 = !DILocation(line: 1704, column: 72, scope: !330)
!336 = !DILocation(line: 1706, column: 9, scope: !330)
!337 = !DILocation(line: 1706, column: 16, scope: !330)
!338 = !DILocation(line: 1706, column: 2, scope: !330)
!339 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !186, file: !186, line: 2071, type: !340, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !360)
!340 = !DISubroutineType(types: !341)
!341 = !{!88, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !186, line: 1830, size: 128, elements: !344)
!344 = !{!345, !358, !359}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !343, file: !186, line: 1831, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !347, line: 60, baseType: !348)
!347 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !347, line: 53, size: 64, elements: !349)
!349 = !{!350, !357}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !348, file: !347, line: 54, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !347, line: 50, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !347, line: 44, size: 32, elements: !354)
!354 = !{!355}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !353, file: !347, line: 45, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !347, line: 40, baseType: !151)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !348, file: !347, line: 55, baseType: !351, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !343, file: !186, line: 1832, baseType: !201, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !343, file: !186, line: 1833, baseType: !127, size: 64, offset: 64)
!360 = !{!361}
!361 = !DILocalVariable(name: "queue", arg: 1, scope: !339, file: !186, line: 2071, type: !342)
!362 = !DILocation(line: 2071, column: 59, scope: !339)
!363 = !DILocation(line: 2073, column: 35, scope: !339)
!364 = !DILocation(line: 2073, column: 42, scope: !339)
!365 = !DILocation(line: 2073, column: 14, scope: !339)
!366 = !DILocation(line: 2073, column: 9, scope: !339)
!367 = !DILocation(line: 2073, column: 2, scope: !339)
!368 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !186, file: !186, line: 3209, type: !369, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !377)
!369 = !DISubroutineType(types: !370)
!370 = !{!152, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !186, line: 3092, size: 128, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !372, file: !186, line: 3093, baseType: !127, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !372, file: !186, line: 3094, baseType: !152, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !372, file: !186, line: 3095, baseType: !152, size: 32, offset: 96)
!377 = !{!378}
!378 = !DILocalVariable(name: "sem", arg: 1, scope: !368, file: !186, line: 3209, type: !371)
!379 = !DILocation(line: 3209, column: 65, scope: !368)
!380 = !DILocation(line: 3211, column: 9, scope: !368)
!381 = !DILocation(line: 3211, column: 14, scope: !368)
!382 = !DILocation(line: 3211, column: 2, scope: !368)
!383 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !186, file: !186, line: 4649, type: !384, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !401)
!384 = !DISubroutineType(types: !385)
!385 = !{!151, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !186, line: 4390, size: 320, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !396, !397, !398, !399, !400}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !387, file: !186, line: 4392, baseType: !127, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !387, file: !186, line: 4394, baseType: !201, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !387, file: !186, line: 4396, baseType: !197, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !387, file: !186, line: 4398, baseType: !151, size: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !387, file: !186, line: 4400, baseType: !394, size: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!395 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !387, file: !186, line: 4402, baseType: !394, size: 32, offset: 160)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !387, file: !186, line: 4404, baseType: !394, size: 32, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !387, file: !186, line: 4406, baseType: !394, size: 32, offset: 224)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !387, file: !186, line: 4408, baseType: !151, size: 32, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !387, file: !186, line: 4413, baseType: !134, size: 8, offset: 288)
!401 = !{!402}
!402 = !DILocalVariable(name: "msgq", arg: 1, scope: !383, file: !186, line: 4649, type: !386)
!403 = !DILocation(line: 4649, column: 66, scope: !383)
!404 = !DILocation(line: 4651, column: 9, scope: !383)
!405 = !DILocation(line: 4651, column: 15, scope: !383)
!406 = !DILocation(line: 4651, column: 26, scope: !383)
!407 = !DILocation(line: 4651, column: 32, scope: !383)
!408 = !DILocation(line: 4651, column: 24, scope: !383)
!409 = !DILocation(line: 4651, column: 2, scope: !383)
!410 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !186, file: !186, line: 4665, type: !384, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !411)
!411 = !{!412}
!412 = !DILocalVariable(name: "msgq", arg: 1, scope: !410, file: !186, line: 4665, type: !386)
!413 = !DILocation(line: 4665, column: 66, scope: !410)
!414 = !DILocation(line: 4667, column: 9, scope: !410)
!415 = !DILocation(line: 4667, column: 15, scope: !410)
!416 = !DILocation(line: 4667, column: 2, scope: !410)
!417 = distinct !DISubprogram(name: "k_msgq_init", scope: !418, file: !418, line: 39, type: !419, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !423)
!418 = !DIFile(filename: "kernel/msg_q.c", directory: "/home/sri/zephyrproject/zephyr")
!419 = !DISubroutineType(types: !420)
!420 = !{null, !386, !394, !421, !151}
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !422, line: 51, baseType: !152)
!422 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/string.h", directory: "")
!423 = !{!424, !425, !426, !427}
!424 = !DILocalVariable(name: "msgq", arg: 1, scope: !417, file: !418, line: 39, type: !386)
!425 = !DILocalVariable(name: "buffer", arg: 2, scope: !417, file: !418, line: 39, type: !394)
!426 = !DILocalVariable(name: "msg_size", arg: 3, scope: !417, file: !418, line: 39, type: !421)
!427 = !DILocalVariable(name: "max_msgs", arg: 4, scope: !417, file: !418, line: 40, type: !151)
!428 = !DILocation(line: 39, column: 33, scope: !417)
!429 = !DILocation(line: 39, column: 45, scope: !417)
!430 = !DILocation(line: 39, column: 60, scope: !417)
!431 = !DILocation(line: 40, column: 13, scope: !417)
!432 = !DILocation(line: 42, column: 19, scope: !417)
!433 = !DILocation(line: 42, column: 2, scope: !417)
!434 = !DILocation(line: 42, column: 8, scope: !417)
!435 = !DILocation(line: 42, column: 17, scope: !417)
!436 = !DILocation(line: 43, column: 19, scope: !417)
!437 = !DILocation(line: 43, column: 2, scope: !417)
!438 = !DILocation(line: 43, column: 8, scope: !417)
!439 = !DILocation(line: 43, column: 17, scope: !417)
!440 = !DILocation(line: 44, column: 23, scope: !417)
!441 = !DILocation(line: 44, column: 2, scope: !417)
!442 = !DILocation(line: 44, column: 8, scope: !417)
!443 = !DILocation(line: 44, column: 21, scope: !417)
!444 = !DILocation(line: 45, column: 21, scope: !417)
!445 = !DILocation(line: 45, column: 31, scope: !417)
!446 = !DILocation(line: 45, column: 42, scope: !417)
!447 = !DILocation(line: 45, column: 40, scope: !417)
!448 = !DILocation(line: 45, column: 28, scope: !417)
!449 = !DILocation(line: 45, column: 2, scope: !417)
!450 = !DILocation(line: 45, column: 8, scope: !417)
!451 = !DILocation(line: 45, column: 19, scope: !417)
!452 = !DILocation(line: 46, column: 19, scope: !417)
!453 = !DILocation(line: 46, column: 2, scope: !417)
!454 = !DILocation(line: 46, column: 8, scope: !417)
!455 = !DILocation(line: 46, column: 17, scope: !417)
!456 = !DILocation(line: 47, column: 20, scope: !417)
!457 = !DILocation(line: 47, column: 2, scope: !417)
!458 = !DILocation(line: 47, column: 8, scope: !417)
!459 = !DILocation(line: 47, column: 18, scope: !417)
!460 = !DILocation(line: 48, column: 2, scope: !417)
!461 = !DILocation(line: 48, column: 8, scope: !417)
!462 = !DILocation(line: 48, column: 18, scope: !417)
!463 = !DILocation(line: 49, column: 2, scope: !417)
!464 = !DILocation(line: 49, column: 8, scope: !417)
!465 = !DILocation(line: 49, column: 14, scope: !417)
!466 = !DILocation(line: 50, column: 16, scope: !417)
!467 = !DILocation(line: 50, column: 22, scope: !417)
!468 = !DILocation(line: 50, column: 2, scope: !417)
!469 = !DILocation(line: 51, column: 2, scope: !417)
!470 = !DILocation(line: 51, column: 8, scope: !417)
!471 = !DILocation(line: 51, column: 15, scope: !417)
!472 = !DILocation(line: 60, column: 2, scope: !417)
!473 = !DILocation(line: 60, column: 7, scope: !474)
!474 = distinct !DILexicalBlock(scope: !417, file: !418, line: 60, column: 5)
!475 = !DILocation(line: 62, column: 16, scope: !417)
!476 = !DILocation(line: 62, column: 2, scope: !417)
!477 = !DILocation(line: 63, column: 1, scope: !417)
!478 = distinct !DISubprogram(name: "z_waitq_init", scope: !479, file: !479, line: 47, type: !480, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !482)
!479 = !DIFile(filename: "kernel/include/wait_q.h", directory: "/home/sri/zephyrproject/zephyr")
!480 = !DISubroutineType(types: !481)
!481 = !{null, !126}
!482 = !{!483}
!483 = !DILocalVariable(name: "w", arg: 1, scope: !478, file: !479, line: 47, type: !126)
!484 = !DILocation(line: 47, column: 44, scope: !478)
!485 = !DILocation(line: 49, column: 18, scope: !478)
!486 = !DILocation(line: 49, column: 21, scope: !478)
!487 = !DILocation(line: 49, column: 2, scope: !478)
!488 = !DILocation(line: 50, column: 1, scope: !478)
!489 = distinct !DISubprogram(name: "z_object_init", scope: !4, file: !4, line: 215, type: !230, scopeLine: 216, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !490)
!490 = !{!491}
!491 = !DILocalVariable(name: "obj", arg: 1, scope: !489, file: !4, line: 215, type: !219)
!492 = !DILocation(line: 215, column: 46, scope: !489)
!493 = !DILocation(line: 217, column: 9, scope: !489)
!494 = !DILocation(line: 218, column: 1, scope: !489)
!495 = distinct !DISubprogram(name: "z_impl_k_msgq_alloc_init", scope: !418, file: !418, line: 65, type: !496, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !498)
!496 = !DISubroutineType(types: !497)
!497 = !{!88, !386, !421, !151}
!498 = !{!499, !500, !501, !502, !503, !504}
!499 = !DILocalVariable(name: "msgq", arg: 1, scope: !495, file: !418, line: 65, type: !386)
!500 = !DILocalVariable(name: "msg_size", arg: 2, scope: !495, file: !418, line: 65, type: !421)
!501 = !DILocalVariable(name: "max_msgs", arg: 3, scope: !495, file: !418, line: 66, type: !151)
!502 = !DILocalVariable(name: "buffer", scope: !495, file: !418, line: 68, type: !87)
!503 = !DILocalVariable(name: "ret", scope: !495, file: !418, line: 69, type: !88)
!504 = !DILocalVariable(name: "total_size", scope: !495, file: !418, line: 70, type: !421)
!505 = !DILocation(line: 65, column: 45, scope: !495)
!506 = !DILocation(line: 65, column: 58, scope: !495)
!507 = !DILocation(line: 66, column: 17, scope: !495)
!508 = !DILocation(line: 68, column: 2, scope: !495)
!509 = !DILocation(line: 68, column: 8, scope: !495)
!510 = !DILocation(line: 69, column: 2, scope: !495)
!511 = !DILocation(line: 69, column: 6, scope: !495)
!512 = !DILocation(line: 70, column: 2, scope: !495)
!513 = !DILocation(line: 70, column: 9, scope: !495)
!514 = !DILocation(line: 72, column: 2, scope: !495)
!515 = !DILocation(line: 72, column: 7, scope: !516)
!516 = distinct !DILexicalBlock(scope: !495, file: !418, line: 72, column: 5)
!517 = !DILocation(line: 74, column: 24, scope: !518)
!518 = distinct !DILexicalBlock(scope: !495, file: !418, line: 74, column: 6)
!519 = !DILocation(line: 74, column: 34, scope: !518)
!520 = !DILocation(line: 74, column: 6, scope: !518)
!521 = !DILocation(line: 74, column: 6, scope: !495)
!522 = !DILocation(line: 75, column: 7, scope: !523)
!523 = distinct !DILexicalBlock(scope: !518, file: !418, line: 74, column: 58)
!524 = !DILocation(line: 76, column: 2, scope: !523)
!525 = !DILocation(line: 77, column: 28, scope: !526)
!526 = distinct !DILexicalBlock(scope: !518, file: !418, line: 76, column: 9)
!527 = !DILocation(line: 77, column: 12, scope: !526)
!528 = !DILocation(line: 77, column: 10, scope: !526)
!529 = !DILocation(line: 78, column: 7, scope: !530)
!530 = distinct !DILexicalBlock(scope: !526, file: !418, line: 78, column: 7)
!531 = !DILocation(line: 78, column: 14, scope: !530)
!532 = !DILocation(line: 78, column: 7, scope: !526)
!533 = !DILocation(line: 79, column: 16, scope: !534)
!534 = distinct !DILexicalBlock(scope: !530, file: !418, line: 78, column: 20)
!535 = !DILocation(line: 79, column: 22, scope: !534)
!536 = !DILocation(line: 79, column: 30, scope: !534)
!537 = !DILocation(line: 79, column: 40, scope: !534)
!538 = !DILocation(line: 79, column: 4, scope: !534)
!539 = !DILocation(line: 80, column: 4, scope: !534)
!540 = !DILocation(line: 80, column: 10, scope: !534)
!541 = !DILocation(line: 80, column: 16, scope: !534)
!542 = !DILocation(line: 81, column: 8, scope: !534)
!543 = !DILocation(line: 82, column: 3, scope: !534)
!544 = !DILocation(line: 83, column: 8, scope: !545)
!545 = distinct !DILexicalBlock(scope: !530, file: !418, line: 82, column: 10)
!546 = !DILocation(line: 87, column: 2, scope: !495)
!547 = !DILocation(line: 87, column: 7, scope: !548)
!548 = distinct !DILexicalBlock(scope: !495, file: !418, line: 87, column: 5)
!549 = !DILocation(line: 89, column: 9, scope: !495)
!550 = !DILocation(line: 90, column: 1, scope: !495)
!551 = !DILocation(line: 89, column: 2, scope: !495)
!552 = distinct !DISubprogram(name: "size_mul_overflow", scope: !553, file: !553, line: 105, type: !554, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !558)
!553 = !DIFile(filename: "include/zephyr/sys/math_extras_impl.h", directory: "/home/sri/zephyrproject/zephyr")
!554 = !DISubroutineType(types: !555)
!555 = !{!556, !421, !421, !557}
!556 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!558 = !{!559, !560, !561}
!559 = !DILocalVariable(name: "a", arg: 1, scope: !552, file: !553, line: 105, type: !421)
!560 = !DILocalVariable(name: "b", arg: 2, scope: !552, file: !553, line: 105, type: !421)
!561 = !DILocalVariable(name: "result", arg: 3, scope: !552, file: !553, line: 105, type: !557)
!562 = !DILocation(line: 105, column: 46, scope: !552)
!563 = !DILocation(line: 105, column: 56, scope: !552)
!564 = !DILocation(line: 105, column: 67, scope: !552)
!565 = !DILocation(line: 107, column: 32, scope: !552)
!566 = !DILocation(line: 107, column: 35, scope: !552)
!567 = !DILocation(line: 107, column: 38, scope: !552)
!568 = !DILocation(line: 107, column: 9, scope: !552)
!569 = !DILocation(line: 107, column: 2, scope: !552)
!570 = distinct !DISubprogram(name: "z_thread_malloc", scope: !571, file: !571, line: 105, type: !572, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !574)
!571 = !DIFile(filename: "kernel/include/kernel_internal.h", directory: "/home/sri/zephyrproject/zephyr")
!572 = !DISubroutineType(types: !573)
!573 = !{!87, !421}
!574 = !{!575}
!575 = !DILocalVariable(name: "size", arg: 1, scope: !570, file: !571, line: 105, type: !421)
!576 = !DILocation(line: 105, column: 44, scope: !570)
!577 = !DILocation(line: 107, column: 35, scope: !570)
!578 = !DILocation(line: 107, column: 9, scope: !570)
!579 = !DILocation(line: 107, column: 2, scope: !570)
!580 = distinct !DISubprogram(name: "k_msgq_cleanup", scope: !418, file: !418, line: 103, type: !581, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !583)
!581 = !DISubroutineType(types: !582)
!582 = !{!88, !386}
!583 = !{!584}
!584 = !DILocalVariable(name: "msgq", arg: 1, scope: !580, file: !418, line: 103, type: !386)
!585 = !DILocation(line: 103, column: 35, scope: !580)
!586 = !DILocation(line: 105, column: 2, scope: !580)
!587 = !DILocation(line: 105, column: 7, scope: !588)
!588 = distinct !DILexicalBlock(scope: !580, file: !418, line: 105, column: 5)
!589 = !DILocation(line: 107, column: 20, scope: !590)
!590 = distinct !DILexicalBlock(scope: !580, file: !418, line: 107, column: 6)
!591 = !DILocation(line: 107, column: 26, scope: !590)
!592 = !DILocation(line: 107, column: 6, scope: !590)
!593 = !DILocation(line: 107, column: 34, scope: !590)
!594 = !DILocation(line: 107, column: 6, scope: !580)
!595 = !DILocation(line: 108, column: 3, scope: !596)
!596 = distinct !DILexicalBlock(scope: !590, file: !418, line: 107, column: 40)
!597 = !DILocation(line: 108, column: 8, scope: !598)
!598 = distinct !DILexicalBlock(scope: !596, file: !418, line: 108, column: 6)
!599 = !DILocation(line: 110, column: 3, scope: !596)
!600 = !DILocation(line: 113, column: 7, scope: !601)
!601 = distinct !DILexicalBlock(scope: !580, file: !418, line: 113, column: 6)
!602 = !DILocation(line: 113, column: 13, scope: !601)
!603 = !DILocation(line: 113, column: 19, scope: !601)
!604 = !DILocation(line: 113, column: 35, scope: !601)
!605 = !DILocation(line: 113, column: 6, scope: !580)
!606 = !DILocation(line: 114, column: 10, scope: !607)
!607 = distinct !DILexicalBlock(scope: !601, file: !418, line: 113, column: 42)
!608 = !DILocation(line: 114, column: 16, scope: !607)
!609 = !DILocation(line: 114, column: 3, scope: !607)
!610 = !DILocation(line: 115, column: 3, scope: !607)
!611 = !DILocation(line: 115, column: 9, scope: !607)
!612 = !DILocation(line: 115, column: 15, scope: !607)
!613 = !DILocation(line: 116, column: 2, scope: !607)
!614 = !DILocation(line: 118, column: 2, scope: !580)
!615 = !DILocation(line: 118, column: 7, scope: !616)
!616 = distinct !DILexicalBlock(scope: !580, file: !418, line: 118, column: 5)
!617 = !DILocation(line: 120, column: 2, scope: !580)
!618 = !DILocation(line: 121, column: 1, scope: !580)
!619 = distinct !DISubprogram(name: "z_waitq_head", scope: !479, file: !479, line: 52, type: !620, scopeLine: 53, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !622)
!620 = !DISubroutineType(types: !621)
!621 = !{!105, !126}
!622 = !{!623}
!623 = !DILocalVariable(name: "w", arg: 1, scope: !619, file: !479, line: 52, type: !126)
!624 = !DILocation(line: 52, column: 56, scope: !619)
!625 = !DILocation(line: 54, column: 49, scope: !619)
!626 = !DILocation(line: 54, column: 52, scope: !619)
!627 = !DILocation(line: 54, column: 28, scope: !619)
!628 = !DILocation(line: 54, column: 2, scope: !619)
!629 = !DISubprogram(name: "k_free", scope: !186, file: !186, line: 5490, type: !630, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !203)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !87}
!632 = distinct !DISubprogram(name: "z_impl_k_msgq_put", scope: !418, file: !418, line: 124, type: !633, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !635)
!633 = !DISubroutineType(types: !634)
!634 = !{!88, !386, !219, !296}
!635 = !{!636, !637, !638, !639, !640, !645}
!636 = !DILocalVariable(name: "msgq", arg: 1, scope: !632, file: !418, line: 124, type: !386)
!637 = !DILocalVariable(name: "data", arg: 2, scope: !632, file: !418, line: 124, type: !219)
!638 = !DILocalVariable(name: "timeout", arg: 3, scope: !632, file: !418, line: 124, type: !296)
!639 = !DILocalVariable(name: "pending_thread", scope: !632, file: !418, line: 128, type: !105)
!640 = !DILocalVariable(name: "key", scope: !632, file: !418, line: 129, type: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !202, line: 108, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !202, line: 34, size: 32, elements: !643)
!643 = !{!644}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !642, file: !202, line: 35, baseType: !88, size: 32)
!645 = !DILocalVariable(name: "result", scope: !632, file: !418, line: 130, type: !88)
!646 = !DILocation(line: 124, column: 38, scope: !632)
!647 = !DILocation(line: 124, column: 56, scope: !632)
!648 = !DILocation(line: 124, column: 74, scope: !632)
!649 = !DILocation(line: 128, column: 2, scope: !632)
!650 = !DILocation(line: 128, column: 19, scope: !632)
!651 = !DILocation(line: 129, column: 2, scope: !632)
!652 = !DILocation(line: 129, column: 19, scope: !632)
!653 = !DILocation(line: 130, column: 2, scope: !632)
!654 = !DILocation(line: 130, column: 6, scope: !632)
!655 = !DILocation(line: 132, column: 8, scope: !632)
!656 = !DILocation(line: 132, column: 21, scope: !632)
!657 = !DILocation(line: 132, column: 27, scope: !632)
!658 = !DILocalVariable(name: "l", arg: 1, scope: !659, file: !202, line: 160, type: !662)
!659 = distinct !DISubprogram(name: "k_spin_lock", scope: !202, file: !202, line: 160, type: !660, scopeLine: 161, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !663)
!660 = !DISubroutineType(types: !661)
!661 = !{!641, !662}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!663 = !{!658, !664}
!664 = !DILocalVariable(name: "k", scope: !659, file: !202, line: 163, type: !641)
!665 = !DILocation(line: 160, column: 94, scope: !659, inlinedAt: !666)
!666 = distinct !DILocation(line: 132, column: 8, scope: !632)
!667 = !DILocation(line: 162, column: 9, scope: !659, inlinedAt: !666)
!668 = !DILocation(line: 163, column: 19, scope: !659, inlinedAt: !666)
!669 = !DILocation(line: 44, column: 2, scope: !670, inlinedAt: !676)
!670 = distinct !DISubprogram(name: "arch_irq_lock", scope: !671, file: !671, line: 42, type: !672, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !674)
!671 = !DIFile(filename: "include/zephyr/arch/arm/asm_inline_gcc.h", directory: "/home/sri/zephyrproject/zephyr")
!672 = !DISubroutineType(types: !673)
!673 = !{!152}
!674 = !{!675}
!675 = !DILocalVariable(name: "key", scope: !670, file: !671, line: 44, type: !152)
!676 = distinct !DILocation(line: 169, column: 10, scope: !659, inlinedAt: !666)
!677 = !DILocation(line: 44, column: 15, scope: !670, inlinedAt: !676)
!678 = !DILocation(line: 48, column: 2, scope: !670, inlinedAt: !676)
!679 = !{i64 66945}
!680 = !DILocation(line: 80, column: 9, scope: !670, inlinedAt: !676)
!681 = !DILocation(line: 81, column: 1, scope: !670, inlinedAt: !676)
!682 = !DILocation(line: 169, column: 8, scope: !659, inlinedAt: !666)
!683 = !DILocation(line: 171, column: 26, scope: !659, inlinedAt: !666)
!684 = !DILocalVariable(name: "l", arg: 1, scope: !685, file: !202, line: 110, type: !662)
!685 = distinct !DISubprogram(name: "z_spinlock_validate_pre", scope: !202, file: !202, line: 110, type: !686, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !688)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !662}
!688 = !{!684}
!689 = !DILocation(line: 110, column: 94, scope: !685, inlinedAt: !690)
!690 = distinct !DILocation(line: 171, column: 2, scope: !659, inlinedAt: !666)
!691 = !DILocation(line: 112, column: 9, scope: !685, inlinedAt: !690)
!692 = !DILocation(line: 177, column: 27, scope: !659, inlinedAt: !666)
!693 = !DILocalVariable(name: "l", arg: 1, scope: !694, file: !202, line: 121, type: !662)
!694 = distinct !DISubprogram(name: "z_spinlock_validate_post", scope: !202, file: !202, line: 121, type: !686, scopeLine: 122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !695)
!695 = !{!693}
!696 = !DILocation(line: 121, column: 95, scope: !694, inlinedAt: !697)
!697 = distinct !DILocation(line: 177, column: 2, scope: !659, inlinedAt: !666)
!698 = !DILocation(line: 123, column: 9, scope: !694, inlinedAt: !697)
!699 = !DILocation(line: 179, column: 2, scope: !659, inlinedAt: !666)
!700 = !DILocation(line: 134, column: 2, scope: !632)
!701 = !DILocation(line: 134, column: 7, scope: !702)
!702 = distinct !DILexicalBlock(scope: !632, file: !418, line: 134, column: 5)
!703 = !DILocation(line: 136, column: 6, scope: !704)
!704 = distinct !DILexicalBlock(scope: !632, file: !418, line: 136, column: 6)
!705 = !DILocation(line: 136, column: 12, scope: !704)
!706 = !DILocation(line: 136, column: 24, scope: !704)
!707 = !DILocation(line: 136, column: 30, scope: !704)
!708 = !DILocation(line: 136, column: 22, scope: !704)
!709 = !DILocation(line: 136, column: 6, scope: !632)
!710 = !DILocation(line: 138, column: 43, scope: !711)
!711 = distinct !DILexicalBlock(scope: !704, file: !418, line: 136, column: 40)
!712 = !DILocation(line: 138, column: 49, scope: !711)
!713 = !DILocation(line: 138, column: 20, scope: !711)
!714 = !DILocation(line: 138, column: 18, scope: !711)
!715 = !DILocation(line: 139, column: 7, scope: !716)
!716 = distinct !DILexicalBlock(scope: !711, file: !418, line: 139, column: 7)
!717 = !DILocation(line: 139, column: 22, scope: !716)
!718 = !DILocation(line: 139, column: 7, scope: !711)
!719 = !DILocation(line: 140, column: 4, scope: !720)
!720 = distinct !DILexicalBlock(scope: !716, file: !418, line: 139, column: 28)
!721 = !DILocation(line: 140, column: 9, scope: !722)
!722 = distinct !DILexicalBlock(scope: !720, file: !418, line: 140, column: 7)
!723 = !DILocation(line: 143, column: 17, scope: !720)
!724 = !DILocation(line: 143, column: 33, scope: !720)
!725 = !DILocation(line: 143, column: 38, scope: !720)
!726 = !DILocation(line: 143, column: 49, scope: !720)
!727 = !DILocation(line: 144, column: 11, scope: !720)
!728 = !DILocation(line: 144, column: 17, scope: !720)
!729 = !DILocation(line: 143, column: 10, scope: !720)
!730 = !DILocation(line: 146, column: 33, scope: !720)
!731 = !DILocalVariable(name: "thread", arg: 1, scope: !732, file: !733, line: 59, type: !105)
!732 = distinct !DISubprogram(name: "arch_thread_return_value_set", scope: !733, file: !733, line: 59, type: !734, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !736)
!733 = !DIFile(filename: "arch/arm/include/cortex_m/kernel_arch_func.h", directory: "/home/sri/zephyrproject/zephyr")
!734 = !DISubroutineType(types: !735)
!735 = !{null, !105, !152}
!736 = !{!731, !737}
!737 = !DILocalVariable(name: "value", arg: 2, scope: !732, file: !733, line: 59, type: !152)
!738 = !DILocation(line: 59, column: 47, scope: !732, inlinedAt: !739)
!739 = distinct !DILocation(line: 146, column: 4, scope: !720)
!740 = !DILocation(line: 59, column: 68, scope: !732, inlinedAt: !739)
!741 = !DILocation(line: 61, column: 35, scope: !732, inlinedAt: !739)
!742 = !DILocation(line: 61, column: 2, scope: !732, inlinedAt: !739)
!743 = !DILocation(line: 61, column: 10, scope: !732, inlinedAt: !739)
!744 = !DILocation(line: 61, column: 15, scope: !732, inlinedAt: !739)
!745 = !DILocation(line: 61, column: 33, scope: !732, inlinedAt: !739)
!746 = !DILocation(line: 147, column: 19, scope: !720)
!747 = !DILocation(line: 147, column: 4, scope: !720)
!748 = !DILocation(line: 148, column: 18, scope: !720)
!749 = !DILocation(line: 148, column: 24, scope: !720)
!750 = !DILocation(line: 148, column: 4, scope: !720)
!751 = !DILocation(line: 149, column: 4, scope: !720)
!752 = !DILocation(line: 154, column: 17, scope: !753)
!753 = distinct !DILexicalBlock(scope: !716, file: !418, line: 150, column: 10)
!754 = !DILocation(line: 154, column: 23, scope: !753)
!755 = !DILocation(line: 154, column: 34, scope: !753)
!756 = !DILocation(line: 154, column: 40, scope: !753)
!757 = !DILocation(line: 154, column: 46, scope: !753)
!758 = !DILocation(line: 154, column: 10, scope: !753)
!759 = !DILocation(line: 155, column: 23, scope: !753)
!760 = !DILocation(line: 155, column: 29, scope: !753)
!761 = !DILocation(line: 155, column: 4, scope: !753)
!762 = !DILocation(line: 155, column: 10, scope: !753)
!763 = !DILocation(line: 155, column: 20, scope: !753)
!764 = !DILocation(line: 156, column: 8, scope: !765)
!765 = distinct !DILexicalBlock(scope: !753, file: !418, line: 156, column: 8)
!766 = !DILocation(line: 156, column: 14, scope: !765)
!767 = !DILocation(line: 156, column: 27, scope: !765)
!768 = !DILocation(line: 156, column: 33, scope: !765)
!769 = !DILocation(line: 156, column: 24, scope: !765)
!770 = !DILocation(line: 156, column: 8, scope: !753)
!771 = !DILocation(line: 157, column: 23, scope: !772)
!772 = distinct !DILexicalBlock(scope: !765, file: !418, line: 156, column: 45)
!773 = !DILocation(line: 157, column: 29, scope: !772)
!774 = !DILocation(line: 157, column: 5, scope: !772)
!775 = !DILocation(line: 157, column: 11, scope: !772)
!776 = !DILocation(line: 157, column: 21, scope: !772)
!777 = !DILocation(line: 158, column: 4, scope: !772)
!778 = !DILocation(line: 159, column: 4, scope: !753)
!779 = !DILocation(line: 159, column: 10, scope: !753)
!780 = !DILocation(line: 159, column: 19, scope: !753)
!781 = !DILocation(line: 164, column: 10, scope: !711)
!782 = !DILocation(line: 165, column: 2, scope: !711)
!783 = !DILocation(line: 165, column: 24, scope: !784)
!784 = distinct !DILexicalBlock(scope: !704, file: !418, line: 165, column: 13)
!785 = !DILocation(line: 165, column: 49, scope: !784)
!786 = !DILocation(line: 165, column: 30, scope: !784)
!787 = !DILocation(line: 165, column: 13, scope: !704)
!788 = !DILocation(line: 167, column: 10, scope: !789)
!789 = distinct !DILexicalBlock(scope: !784, file: !418, line: 165, column: 63)
!790 = !DILocation(line: 168, column: 2, scope: !789)
!791 = !DILocation(line: 169, column: 3, scope: !792)
!792 = distinct !DILexicalBlock(scope: !784, file: !418, line: 168, column: 9)
!793 = !DILocation(line: 169, column: 8, scope: !794)
!794 = distinct !DILexicalBlock(scope: !792, file: !418, line: 169, column: 6)
!795 = !DILocation(line: 172, column: 54, scope: !792)
!796 = !DILocation(line: 172, column: 19, scope: !792)
!797 = !DILocation(line: 172, column: 28, scope: !792)
!798 = !DILocation(line: 172, column: 33, scope: !792)
!799 = !DILocation(line: 172, column: 43, scope: !792)
!800 = !DILocation(line: 174, column: 25, scope: !792)
!801 = !DILocation(line: 174, column: 31, scope: !792)
!802 = !DILocation(line: 174, column: 43, scope: !792)
!803 = !DILocation(line: 174, column: 49, scope: !792)
!804 = !DILocation(line: 174, column: 12, scope: !792)
!805 = !DILocation(line: 174, column: 10, scope: !792)
!806 = !DILocation(line: 175, column: 3, scope: !792)
!807 = !DILocation(line: 175, column: 8, scope: !808)
!808 = distinct !DILexicalBlock(scope: !792, file: !418, line: 175, column: 6)
!809 = !DILocation(line: 176, column: 10, scope: !792)
!810 = !DILocation(line: 176, column: 3, scope: !792)
!811 = !DILocation(line: 179, column: 2, scope: !632)
!812 = !DILocation(line: 179, column: 7, scope: !813)
!813 = distinct !DILexicalBlock(scope: !632, file: !418, line: 179, column: 5)
!814 = !DILocation(line: 181, column: 17, scope: !632)
!815 = !DILocation(line: 181, column: 23, scope: !632)
!816 = !DILocation(line: 181, column: 2, scope: !632)
!817 = !DILocalVariable(name: "l", arg: 1, scope: !818, file: !202, line: 235, type: !662)
!818 = distinct !DISubprogram(name: "k_spin_unlock", scope: !202, file: !202, line: 235, type: !819, scopeLine: 237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !821)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !662, !641}
!821 = !{!817, !822}
!822 = !DILocalVariable(name: "key", arg: 2, scope: !818, file: !202, line: 236, type: !641)
!823 = !DILocation(line: 235, column: 84, scope: !818, inlinedAt: !824)
!824 = distinct !DILocation(line: 181, column: 2, scope: !632)
!825 = !DILocation(line: 236, column: 23, scope: !818, inlinedAt: !824)
!826 = !DILocation(line: 238, column: 9, scope: !818, inlinedAt: !824)
!827 = !DILocation(line: 261, column: 22, scope: !818, inlinedAt: !824)
!828 = !DILocalVariable(name: "key", arg: 1, scope: !829, file: !671, line: 88, type: !152)
!829 = distinct !DISubprogram(name: "arch_irq_unlock", scope: !671, file: !671, line: 88, type: !830, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !832)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !152}
!832 = !{!828}
!833 = !DILocation(line: 88, column: 80, scope: !829, inlinedAt: !834)
!834 = distinct !DILocation(line: 261, column: 2, scope: !818, inlinedAt: !824)
!835 = !DILocation(line: 91, column: 6, scope: !836, inlinedAt: !834)
!836 = distinct !DILexicalBlock(scope: !829, file: !671, line: 91, column: 6)
!837 = !DILocation(line: 91, column: 10, scope: !836, inlinedAt: !834)
!838 = !DILocation(line: 91, column: 6, scope: !829, inlinedAt: !834)
!839 = !DILocation(line: 92, column: 3, scope: !840, inlinedAt: !834)
!840 = distinct !DILexicalBlock(scope: !836, file: !671, line: 91, column: 17)
!841 = !DILocation(line: 94, column: 2, scope: !829, inlinedAt: !834)
!842 = !{i64 67249}
!843 = !DILocation(line: 114, column: 1, scope: !829, inlinedAt: !834)
!844 = !DILocation(line: 183, column: 9, scope: !632)
!845 = !DILocation(line: 183, column: 2, scope: !632)
!846 = !DILocation(line: 184, column: 1, scope: !632)
!847 = !DISubprogram(name: "z_unpend_first_thread", scope: !848, file: !848, line: 53, type: !620, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !203)
!848 = !DIFile(filename: "kernel/include/ksched.h", directory: "/home/sri/zephyrproject/zephyr")
!849 = !DISubprogram(name: "z_ready_thread", scope: !848, file: !848, line: 65, type: !850, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !203)
!850 = !DISubroutineType(types: !851)
!851 = !{null, !105}
!852 = !DISubprogram(name: "z_reschedule", scope: !848, file: !848, line: 51, type: !819, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !203)
!853 = !DISubprogram(name: "z_pend_curr", scope: !848, file: !848, line: 46, type: !854, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !203)
!854 = !DISubroutineType(types: !855)
!855 = !{!88, !662, !641, !126, !296}
!856 = distinct !DISubprogram(name: "z_impl_k_msgq_get_attrs", scope: !418, file: !418, line: 198, type: !857, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !865)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !386, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq_attrs", file: !186, line: 4449, size: 96, elements: !861)
!861 = !{!862, !863, !864}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !860, file: !186, line: 4451, baseType: !197, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !860, file: !186, line: 4453, baseType: !151, size: 32, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !860, file: !186, line: 4455, baseType: !151, size: 32, offset: 64)
!865 = !{!866, !867}
!866 = !DILocalVariable(name: "msgq", arg: 1, scope: !856, file: !418, line: 198, type: !386)
!867 = !DILocalVariable(name: "attrs", arg: 2, scope: !856, file: !418, line: 198, type: !859)
!868 = !DILocation(line: 198, column: 45, scope: !856)
!869 = !DILocation(line: 198, column: 72, scope: !856)
!870 = !DILocation(line: 200, column: 20, scope: !856)
!871 = !DILocation(line: 200, column: 26, scope: !856)
!872 = !DILocation(line: 200, column: 2, scope: !856)
!873 = !DILocation(line: 200, column: 9, scope: !856)
!874 = !DILocation(line: 200, column: 18, scope: !856)
!875 = !DILocation(line: 201, column: 20, scope: !856)
!876 = !DILocation(line: 201, column: 26, scope: !856)
!877 = !DILocation(line: 201, column: 2, scope: !856)
!878 = !DILocation(line: 201, column: 9, scope: !856)
!879 = !DILocation(line: 201, column: 18, scope: !856)
!880 = !DILocation(line: 202, column: 21, scope: !856)
!881 = !DILocation(line: 202, column: 27, scope: !856)
!882 = !DILocation(line: 202, column: 2, scope: !856)
!883 = !DILocation(line: 202, column: 9, scope: !856)
!884 = !DILocation(line: 202, column: 19, scope: !856)
!885 = !DILocation(line: 203, column: 1, scope: !856)
!886 = distinct !DISubprogram(name: "z_impl_k_msgq_get", scope: !418, file: !418, line: 216, type: !887, scopeLine: 217, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !889)
!887 = !DISubroutineType(types: !888)
!888 = !{!88, !386, !87, !296}
!889 = !{!890, !891, !892, !893, !894, !895}
!890 = !DILocalVariable(name: "msgq", arg: 1, scope: !886, file: !418, line: 216, type: !386)
!891 = !DILocalVariable(name: "data", arg: 2, scope: !886, file: !418, line: 216, type: !87)
!892 = !DILocalVariable(name: "timeout", arg: 3, scope: !886, file: !418, line: 216, type: !296)
!893 = !DILocalVariable(name: "key", scope: !886, file: !418, line: 220, type: !641)
!894 = !DILocalVariable(name: "pending_thread", scope: !886, file: !418, line: 221, type: !105)
!895 = !DILocalVariable(name: "result", scope: !886, file: !418, line: 222, type: !88)
!896 = !DILocation(line: 216, column: 38, scope: !886)
!897 = !DILocation(line: 216, column: 50, scope: !886)
!898 = !DILocation(line: 216, column: 68, scope: !886)
!899 = !DILocation(line: 220, column: 2, scope: !886)
!900 = !DILocation(line: 220, column: 19, scope: !886)
!901 = !DILocation(line: 221, column: 2, scope: !886)
!902 = !DILocation(line: 221, column: 19, scope: !886)
!903 = !DILocation(line: 222, column: 2, scope: !886)
!904 = !DILocation(line: 222, column: 6, scope: !886)
!905 = !DILocation(line: 224, column: 8, scope: !886)
!906 = !DILocation(line: 224, column: 21, scope: !886)
!907 = !DILocation(line: 224, column: 27, scope: !886)
!908 = !DILocation(line: 160, column: 94, scope: !659, inlinedAt: !909)
!909 = distinct !DILocation(line: 224, column: 8, scope: !886)
!910 = !DILocation(line: 162, column: 9, scope: !659, inlinedAt: !909)
!911 = !DILocation(line: 163, column: 19, scope: !659, inlinedAt: !909)
!912 = !DILocation(line: 44, column: 2, scope: !670, inlinedAt: !913)
!913 = distinct !DILocation(line: 169, column: 10, scope: !659, inlinedAt: !909)
!914 = !DILocation(line: 44, column: 15, scope: !670, inlinedAt: !913)
!915 = !DILocation(line: 48, column: 2, scope: !670, inlinedAt: !913)
!916 = !DILocation(line: 80, column: 9, scope: !670, inlinedAt: !913)
!917 = !DILocation(line: 81, column: 1, scope: !670, inlinedAt: !913)
!918 = !DILocation(line: 169, column: 8, scope: !659, inlinedAt: !909)
!919 = !DILocation(line: 171, column: 26, scope: !659, inlinedAt: !909)
!920 = !DILocation(line: 110, column: 94, scope: !685, inlinedAt: !921)
!921 = distinct !DILocation(line: 171, column: 2, scope: !659, inlinedAt: !909)
!922 = !DILocation(line: 112, column: 9, scope: !685, inlinedAt: !921)
