; ModuleID = '../bc_files/mutex.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/mutex.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_spinlock = type {}
%struct.z_kernel = type { [1 x %struct._cpu], %struct._ready_q }
%struct._cpu = type { i32, ptr, ptr, ptr, i8, %struct._cpu_arch }
%struct._cpu_arch = type {}
%struct._ready_q = type { ptr, %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }

!44 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 35)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 36)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 37)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 38)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 39)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 40)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 41)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 42)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 43)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 44)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 45)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 46)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 47)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!87 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!88 = !{!89, !90, !91, !92, !108}
!89 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!91 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !94, line: 55, baseType: !95)
!94 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !94, line: 37, size: 64, elements: !96)
!96 = !{!97, !103}
!97 = !DIDerivedType(tag: DW_TAG_member, scope: !95, file: !94, line: 38, baseType: !98, size: 32)
!98 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !95, file: !94, line: 38, size: 32, elements: !99)
!99 = !{!100, !102}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !98, file: !94, line: 39, baseType: !101, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !94, line: 40, baseType: !101, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, scope: !95, file: !94, line: 42, baseType: !104, size: 32, offset: 32)
!104 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !95, file: !94, line: 42, size: 32, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !104, file: !94, line: 43, baseType: !101, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !94, line: 44, baseType: !101, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !110, line: 250, size: 896, elements: !111)
!110 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!111 = !{!112, !170, !183, !184, !185, !186, !207}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !109, file: !110, line: 252, baseType: !113, size: 384)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !110, line: 58, size: 384, elements: !114)
!114 = !{!115, !128, !136, !139, !140, !153, !156, !157}
!115 = !DIDerivedType(tag: DW_TAG_member, scope: !113, file: !110, line: 61, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !113, file: !110, line: 61, size: 64, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !116, file: !110, line: 62, baseType: !93, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !116, file: !110, line: 63, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !121, line: 58, size: 64, elements: !122)
!121 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !120, file: !121, line: 60, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 64, elements: !126)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!126 = !{!127}
!127 = !DISubrange(count: 2)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !113, file: !110, line: 69, baseType: !129, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !131, line: 243, baseType: !132)
!131 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 241, size: 64, elements: !133)
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !132, file: !131, line: 242, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !94, line: 51, baseType: !95)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !113, file: !110, line: 72, baseType: !137, size: 8, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !138, line: 62, baseType: !7)
!138 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !113, file: !110, line: 75, baseType: !137, size: 8, offset: 104)
!140 = !DIDerivedType(tag: DW_TAG_member, scope: !113, file: !110, line: 91, baseType: !141, size: 16, offset: 112)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !113, file: !110, line: 91, size: 16, elements: !142)
!142 = !{!143, !150}
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !141, file: !110, line: 92, baseType: !144, size: 16)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !110, line: 92, size: 16, elements: !145)
!145 = !{!146, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !144, file: !110, line: 97, baseType: !147, size: 8)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !138, line: 56, baseType: !148)
!148 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !144, file: !110, line: 98, baseType: !137, size: 8, offset: 8)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !141, file: !110, line: 101, baseType: !151, size: 16)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !138, line: 63, baseType: !152)
!152 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !113, file: !110, line: 108, baseType: !154, size: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !138, line: 64, baseType: !155)
!155 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !113, file: !110, line: 132, baseType: !90, size: 32, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !113, file: !110, line: 136, baseType: !158, size: 192, offset: 192)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !131, line: 254, size: 192, elements: !159)
!159 = !{!160, !161, !167}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !158, file: !131, line: 255, baseType: !93, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !158, file: !131, line: 256, baseType: !162, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !131, line: 252, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !158, file: !131, line: 259, baseType: !168, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !138, line: 59, baseType: !169)
!169 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !109, file: !110, line: 255, baseType: !171, size: 288, offset: 384)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !172, line: 25, size: 288, elements: !173)
!172 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !171, file: !172, line: 26, baseType: !154, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !171, file: !172, line: 27, baseType: !154, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !171, file: !172, line: 28, baseType: !154, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !171, file: !172, line: 29, baseType: !154, size: 32, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !171, file: !172, line: 30, baseType: !154, size: 32, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !171, file: !172, line: 31, baseType: !154, size: 32, offset: 160)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !171, file: !172, line: 32, baseType: !154, size: 32, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !171, file: !172, line: 33, baseType: !154, size: 32, offset: 224)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !171, file: !172, line: 34, baseType: !154, size: 32, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !109, file: !110, line: 258, baseType: !90, size: 32, offset: 672)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !109, file: !110, line: 261, baseType: !130, size: 64, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !109, file: !110, line: 302, baseType: !91, size: 32, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !109, file: !110, line: 333, baseType: !187, size: 32, offset: 800)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !189, line: 5291, size: 160, elements: !190)
!189 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!190 = !{!191, !202, !203}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !188, file: !189, line: 5292, baseType: !192, size: 96)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !193, line: 56, size: 96, elements: !194)
!193 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!194 = !{!195, !198, !199}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !192, file: !193, line: 57, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !193, line: 57, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !192, file: !193, line: 58, baseType: !90, size: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !192, file: !193, line: 59, baseType: !200, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !201, line: 46, baseType: !155)
!201 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!202 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !188, file: !189, line: 5293, baseType: !130, size: 64, offset: 96)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !188, file: !189, line: 5294, baseType: !204, offset: 160)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !205, line: 45, elements: !206)
!205 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!206 = !{}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !109, file: !110, line: 355, baseType: !208, size: 64, offset: 832)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !172, line: 60, size: 64, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !208, file: !172, line: 63, baseType: !154, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !208, file: !172, line: 66, baseType: !154, size: 32, offset: 32)
!212 = !{!0}
!213 = !DIFile(filename: "kernel/mutex.c", directory: "/home/sri/zephyrproject/zephyr")
!214 = !{i32 7, !"Dwarf Version", i32 4}
!215 = !{i32 2, !"Debug Info Version", i32 3}
!216 = !{i32 1, !"wchar_size", i32 4}
!217 = !{i32 1, !"static_rwdata", i32 1}
!218 = !{i32 1, !"enumsize_buildattr", i32 1}
!219 = !{i32 1, !"armlib_unavailable", i32 0}
!220 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!221 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !6, file: !6, line: 223, type: !222, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !226)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !224, !108}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!226 = !{!227, !228}
!227 = !DILocalVariable(name: "object", arg: 1, scope: !221, file: !6, line: 223, type: !224)
!228 = !DILocalVariable(name: "thread", arg: 2, scope: !221, file: !6, line: 224, type: !108)
!229 = !DILocation(line: 223, column: 61, scope: !221)
!230 = !DILocation(line: 224, column: 24, scope: !221)
!231 = !DILocation(line: 226, column: 9, scope: !221)
!232 = !DILocation(line: 227, column: 9, scope: !221)
!233 = !DILocation(line: 228, column: 1, scope: !221)
!234 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !6, file: !6, line: 243, type: !235, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !237)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !224}
!237 = !{!238}
!238 = !DILocalVariable(name: "object", arg: 1, scope: !234, file: !6, line: 243, type: !224)
!239 = !DILocation(line: 243, column: 56, scope: !234)
!240 = !DILocation(line: 245, column: 9, scope: !234)
!241 = !DILocation(line: 246, column: 1, scope: !234)
!242 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !6, file: !6, line: 359, type: !243, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !245)
!243 = !DISubroutineType(types: !244)
!244 = !{!90, !5}
!245 = !{!246}
!246 = !DILocalVariable(name: "otype", arg: 1, scope: !242, file: !6, line: 359, type: !5)
!247 = !DILocation(line: 359, column: 58, scope: !242)
!248 = !DILocation(line: 361, column: 9, scope: !242)
!249 = !DILocation(line: 363, column: 2, scope: !242)
!250 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !6, file: !6, line: 366, type: !251, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !253)
!251 = !DISubroutineType(types: !252)
!252 = !{!90, !5, !200}
!253 = !{!254, !255}
!254 = !DILocalVariable(name: "otype", arg: 1, scope: !250, file: !6, line: 366, type: !5)
!255 = !DILocalVariable(name: "size", arg: 2, scope: !250, file: !6, line: 367, type: !200)
!256 = !DILocation(line: 366, column: 63, scope: !250)
!257 = !DILocation(line: 367, column: 13, scope: !250)
!258 = !DILocation(line: 369, column: 9, scope: !250)
!259 = !DILocation(line: 370, column: 9, scope: !250)
!260 = !DILocation(line: 372, column: 2, scope: !250)
!261 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !189, file: !189, line: 656, type: !262, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !268)
!262 = !DISubroutineType(types: !263)
!263 = !{!264, !266}
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !265, line: 46, baseType: !168)
!265 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!268 = !{!269}
!269 = !DILocalVariable(name: "t", arg: 1, scope: !261, file: !189, line: 657, type: !266)
!270 = !DILocation(line: 657, column: 30, scope: !261)
!271 = !DILocation(line: 659, column: 28, scope: !261)
!272 = !DILocation(line: 659, column: 31, scope: !261)
!273 = !DILocation(line: 659, column: 36, scope: !261)
!274 = !DILocation(line: 659, column: 9, scope: !261)
!275 = !DILocation(line: 659, column: 2, scope: !261)
!276 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !189, file: !189, line: 671, type: !262, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !277)
!277 = !{!278}
!278 = !DILocalVariable(name: "t", arg: 1, scope: !276, file: !189, line: 672, type: !266)
!279 = !DILocation(line: 672, column: 30, scope: !276)
!280 = !DILocation(line: 674, column: 30, scope: !276)
!281 = !DILocation(line: 674, column: 33, scope: !276)
!282 = !DILocation(line: 674, column: 38, scope: !276)
!283 = !DILocation(line: 674, column: 9, scope: !276)
!284 = !DILocation(line: 674, column: 2, scope: !276)
!285 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !189, file: !189, line: 1634, type: !286, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !307)
!286 = !DISubroutineType(types: !287)
!287 = !{!264, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !189, line: 1439, size: 448, elements: !291)
!291 = !{!292, !293, !294, !299, !300, !305, !306}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !290, file: !189, line: 1445, baseType: !158, size: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !290, file: !189, line: 1448, baseType: !130, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !290, file: !189, line: 1451, baseType: !295, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !290, file: !189, line: 1454, baseType: !295, size: 32, offset: 288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !290, file: !189, line: 1457, baseType: !301, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !265, line: 67, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 65, size: 64, elements: !303)
!303 = !{!304}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !302, file: !265, line: 66, baseType: !264, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !290, file: !189, line: 1460, baseType: !154, size: 32, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !290, file: !189, line: 1463, baseType: !90, size: 32, offset: 416)
!307 = !{!308}
!308 = !DILocalVariable(name: "timer", arg: 1, scope: !285, file: !189, line: 1635, type: !288)
!309 = !DILocation(line: 1635, column: 34, scope: !285)
!310 = !DILocation(line: 1637, column: 28, scope: !285)
!311 = !DILocation(line: 1637, column: 35, scope: !285)
!312 = !DILocation(line: 1637, column: 9, scope: !285)
!313 = !DILocation(line: 1637, column: 2, scope: !285)
!314 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !189, file: !189, line: 1649, type: !286, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !315)
!315 = !{!316}
!316 = !DILocalVariable(name: "timer", arg: 1, scope: !314, file: !189, line: 1650, type: !288)
!317 = !DILocation(line: 1650, column: 34, scope: !314)
!318 = !DILocation(line: 1652, column: 30, scope: !314)
!319 = !DILocation(line: 1652, column: 37, scope: !314)
!320 = !DILocation(line: 1652, column: 9, scope: !314)
!321 = !DILocation(line: 1652, column: 2, scope: !314)
!322 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !189, file: !189, line: 1689, type: !323, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !325)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !298, !90}
!325 = !{!326, !327}
!326 = !DILocalVariable(name: "timer", arg: 1, scope: !322, file: !189, line: 1689, type: !298)
!327 = !DILocalVariable(name: "user_data", arg: 2, scope: !322, file: !189, line: 1690, type: !90)
!328 = !DILocation(line: 1689, column: 65, scope: !322)
!329 = !DILocation(line: 1690, column: 19, scope: !322)
!330 = !DILocation(line: 1692, column: 21, scope: !322)
!331 = !DILocation(line: 1692, column: 2, scope: !322)
!332 = !DILocation(line: 1692, column: 9, scope: !322)
!333 = !DILocation(line: 1692, column: 19, scope: !322)
!334 = !DILocation(line: 1693, column: 1, scope: !322)
!335 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !189, file: !189, line: 1704, type: !336, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !338)
!336 = !DISubroutineType(types: !337)
!337 = !{!90, !288}
!338 = !{!339}
!339 = !DILocalVariable(name: "timer", arg: 1, scope: !335, file: !189, line: 1704, type: !288)
!340 = !DILocation(line: 1704, column: 72, scope: !335)
!341 = !DILocation(line: 1706, column: 9, scope: !335)
!342 = !DILocation(line: 1706, column: 16, scope: !335)
!343 = !DILocation(line: 1706, column: 2, scope: !335)
!344 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !189, file: !189, line: 2071, type: !345, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !365)
!345 = !DISubroutineType(types: !346)
!346 = !{!91, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !189, line: 1830, size: 128, elements: !349)
!349 = !{!350, !363, !364}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !348, file: !189, line: 1831, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !352, line: 60, baseType: !353)
!352 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !352, line: 53, size: 64, elements: !354)
!354 = !{!355, !362}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !353, file: !352, line: 54, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !352, line: 50, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !352, line: 44, size: 32, elements: !359)
!359 = !{!360}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !358, file: !352, line: 45, baseType: !361, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !352, line: 40, baseType: !154)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !353, file: !352, line: 55, baseType: !356, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !348, file: !189, line: 1832, baseType: !204, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !348, file: !189, line: 1833, baseType: !130, size: 64, offset: 64)
!365 = !{!366}
!366 = !DILocalVariable(name: "queue", arg: 1, scope: !344, file: !189, line: 2071, type: !347)
!367 = !DILocation(line: 2071, column: 59, scope: !344)
!368 = !DILocation(line: 2073, column: 35, scope: !344)
!369 = !DILocation(line: 2073, column: 42, scope: !344)
!370 = !DILocation(line: 2073, column: 14, scope: !344)
!371 = !DILocation(line: 2073, column: 9, scope: !344)
!372 = !DILocation(line: 2073, column: 2, scope: !344)
!373 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !189, file: !189, line: 3209, type: !374, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !382)
!374 = !DISubroutineType(types: !375)
!375 = !{!155, !376}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !189, line: 3092, size: 128, elements: !378)
!378 = !{!379, !380, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !377, file: !189, line: 3093, baseType: !130, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !377, file: !189, line: 3094, baseType: !155, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !377, file: !189, line: 3095, baseType: !155, size: 32, offset: 96)
!382 = !{!383}
!383 = !DILocalVariable(name: "sem", arg: 1, scope: !373, file: !189, line: 3209, type: !376)
!384 = !DILocation(line: 3209, column: 65, scope: !373)
!385 = !DILocation(line: 3211, column: 9, scope: !373)
!386 = !DILocation(line: 3211, column: 14, scope: !373)
!387 = !DILocation(line: 3211, column: 2, scope: !373)
!388 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !189, file: !189, line: 4649, type: !389, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !406)
!389 = !DISubroutineType(types: !390)
!390 = !{!154, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !189, line: 4390, size: 320, elements: !393)
!393 = !{!394, !395, !396, !397, !398, !401, !402, !403, !404, !405}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !392, file: !189, line: 4392, baseType: !130, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !392, file: !189, line: 4394, baseType: !204, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !392, file: !189, line: 4396, baseType: !200, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !392, file: !189, line: 4398, baseType: !154, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !392, file: !189, line: 4400, baseType: !399, size: 32, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !392, file: !189, line: 4402, baseType: !399, size: 32, offset: 160)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !392, file: !189, line: 4404, baseType: !399, size: 32, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !392, file: !189, line: 4406, baseType: !399, size: 32, offset: 224)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !392, file: !189, line: 4408, baseType: !154, size: 32, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !392, file: !189, line: 4413, baseType: !137, size: 8, offset: 288)
!406 = !{!407}
!407 = !DILocalVariable(name: "msgq", arg: 1, scope: !388, file: !189, line: 4649, type: !391)
!408 = !DILocation(line: 4649, column: 66, scope: !388)
!409 = !DILocation(line: 4651, column: 9, scope: !388)
!410 = !DILocation(line: 4651, column: 15, scope: !388)
!411 = !DILocation(line: 4651, column: 26, scope: !388)
!412 = !DILocation(line: 4651, column: 32, scope: !388)
!413 = !DILocation(line: 4651, column: 24, scope: !388)
!414 = !DILocation(line: 4651, column: 2, scope: !388)
!415 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !189, file: !189, line: 4665, type: !389, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !416)
!416 = !{!417}
!417 = !DILocalVariable(name: "msgq", arg: 1, scope: !415, file: !189, line: 4665, type: !391)
!418 = !DILocation(line: 4665, column: 66, scope: !415)
!419 = !DILocation(line: 4667, column: 9, scope: !415)
!420 = !DILocation(line: 4667, column: 15, scope: !415)
!421 = !DILocation(line: 4667, column: 2, scope: !415)
!422 = distinct !DISubprogram(name: "z_impl_k_mutex_init", scope: !213, file: !213, line: 53, type: !423, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !432)
!423 = !DISubroutineType(types: !424)
!424 = !{!91, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !189, line: 2895, size: 160, elements: !427)
!427 = !{!428, !429, !430, !431}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !426, file: !189, line: 2897, baseType: !130, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !426, file: !189, line: 2899, baseType: !108, size: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !426, file: !189, line: 2902, baseType: !154, size: 32, offset: 96)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !426, file: !189, line: 2905, baseType: !91, size: 32, offset: 128)
!432 = !{!433}
!433 = !DILocalVariable(name: "mutex", arg: 1, scope: !422, file: !213, line: 53, type: !425)
!434 = !DILocation(line: 53, column: 41, scope: !422)
!435 = !DILocation(line: 55, column: 2, scope: !422)
!436 = !DILocation(line: 55, column: 9, scope: !422)
!437 = !DILocation(line: 55, column: 15, scope: !422)
!438 = !DILocation(line: 56, column: 2, scope: !422)
!439 = !DILocation(line: 56, column: 9, scope: !422)
!440 = !DILocation(line: 56, column: 20, scope: !422)
!441 = !DILocation(line: 58, column: 16, scope: !422)
!442 = !DILocation(line: 58, column: 23, scope: !422)
!443 = !DILocation(line: 58, column: 2, scope: !422)
!444 = !DILocation(line: 60, column: 16, scope: !422)
!445 = !DILocation(line: 60, column: 2, scope: !422)
!446 = !DILocation(line: 66, column: 2, scope: !422)
!447 = !DILocation(line: 66, column: 7, scope: !448)
!448 = distinct !DILexicalBlock(scope: !422, file: !213, line: 66, column: 5)
!449 = !DILocation(line: 68, column: 2, scope: !422)
!450 = distinct !DISubprogram(name: "z_waitq_init", scope: !451, file: !451, line: 47, type: !452, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !454)
!451 = !DIFile(filename: "kernel/include/wait_q.h", directory: "/home/sri/zephyrproject/zephyr")
!452 = !DISubroutineType(types: !453)
!453 = !{null, !129}
!454 = !{!455}
!455 = !DILocalVariable(name: "w", arg: 1, scope: !450, file: !451, line: 47, type: !129)
!456 = !DILocation(line: 47, column: 44, scope: !450)
!457 = !DILocation(line: 49, column: 18, scope: !450)
!458 = !DILocation(line: 49, column: 21, scope: !450)
!459 = !DILocation(line: 49, column: 2, scope: !450)
!460 = !DILocation(line: 50, column: 1, scope: !450)
!461 = distinct !DISubprogram(name: "z_object_init", scope: !6, file: !6, line: 215, type: !235, scopeLine: 216, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !462)
!462 = !{!463}
!463 = !DILocalVariable(name: "obj", arg: 1, scope: !461, file: !6, line: 215, type: !224)
!464 = !DILocation(line: 215, column: 46, scope: !461)
!465 = !DILocation(line: 217, column: 9, scope: !461)
!466 = !DILocation(line: 218, column: 1, scope: !461)
!467 = distinct !DISubprogram(name: "z_impl_k_mutex_lock", scope: !213, file: !213, line: 103, type: !468, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !470)
!468 = !DISubroutineType(types: !469)
!469 = !{!91, !425, !301}
!470 = !{!471, !472, !473, !474, !479, !480, !481}
!471 = !DILocalVariable(name: "mutex", arg: 1, scope: !467, file: !213, line: 103, type: !425)
!472 = !DILocalVariable(name: "timeout", arg: 2, scope: !467, file: !213, line: 103, type: !301)
!473 = !DILocalVariable(name: "new_prio", scope: !467, file: !213, line: 105, type: !91)
!474 = !DILocalVariable(name: "key", scope: !467, file: !213, line: 106, type: !475)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !205, line: 108, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !205, line: 34, size: 32, elements: !477)
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !476, file: !205, line: 35, baseType: !91, size: 32)
!479 = !DILocalVariable(name: "resched", scope: !467, file: !213, line: 107, type: !89)
!480 = !DILocalVariable(name: "got_mutex", scope: !467, file: !213, line: 154, type: !91)
!481 = !DILocalVariable(name: "waiter", scope: !482, file: !213, line: 177, type: !108)
!482 = distinct !DILexicalBlock(scope: !483, file: !213, line: 176, column: 65)
!483 = distinct !DILexicalBlock(scope: !467, file: !213, line: 176, column: 6)
