; ModuleID = '../bc_files/mutex.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/mutex.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_spinlock = type {}
%struct.z_kernel = type { [1 x %struct._cpu], %struct._ready_q }
%struct._cpu = type { i32, ptr, ptr, ptr, i8, %struct._cpu_arch }
%struct._cpu_arch = type {}
%struct._ready_q = type { ptr, %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }

!45 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 36)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 37)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 38)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 39)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 40)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 41)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 42)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 43)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 44)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 45)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 46)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 47)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!87 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!88 = !{!89, !90, !91, !92, !108}
!89 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!91 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !94, line: 55, baseType: !95)
!94 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !94, line: 37, size: 64, elements: !96)
!96 = !{!97, !103}
!97 = !DIDerivedType(tag: DW_TAG_member, scope: !95, file: !94, line: 38, baseType: !98, size: 32)
!98 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !95, file: !94, line: 38, size: 32, elements: !99)
!99 = !{!100, !102}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !98, file: !94, line: 39, baseType: !101, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !94, line: 40, baseType: !101, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, scope: !95, file: !94, line: 42, baseType: !104, size: 32, offset: 32)
!104 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !95, file: !94, line: 42, size: 32, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !104, file: !94, line: 43, baseType: !101, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !94, line: 44, baseType: !101, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !110, line: 250, size: 896, elements: !111)
!110 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!111 = !{!112, !170, !183, !184, !185, !186, !207}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !109, file: !110, line: 252, baseType: !113, size: 384)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !110, line: 58, size: 384, elements: !114)
!114 = !{!115, !128, !136, !139, !140, !153, !156, !157}
!115 = !DIDerivedType(tag: DW_TAG_member, scope: !113, file: !110, line: 61, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !113, file: !110, line: 61, size: 64, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !116, file: !110, line: 62, baseType: !93, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !116, file: !110, line: 63, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !121, line: 58, size: 64, elements: !122)
!121 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !120, file: !121, line: 60, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 64, elements: !126)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!126 = !{!127}
!127 = !DISubrange(count: 2)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !113, file: !110, line: 69, baseType: !129, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !131, line: 243, baseType: !132)
!131 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 241, size: 64, elements: !133)
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !132, file: !131, line: 242, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !94, line: 51, baseType: !95)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !113, file: !110, line: 72, baseType: !137, size: 8, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !138, line: 62, baseType: !7)
!138 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !113, file: !110, line: 75, baseType: !137, size: 8, offset: 104)
!140 = !DIDerivedType(tag: DW_TAG_member, scope: !113, file: !110, line: 91, baseType: !141, size: 16, offset: 112)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !113, file: !110, line: 91, size: 16, elements: !142)
!142 = !{!143, !150}
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !141, file: !110, line: 92, baseType: !144, size: 16)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !110, line: 92, size: 16, elements: !145)
!145 = !{!146, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !144, file: !110, line: 97, baseType: !147, size: 8)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !138, line: 56, baseType: !148)
!148 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !144, file: !110, line: 98, baseType: !137, size: 8, offset: 8)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !141, file: !110, line: 101, baseType: !151, size: 16)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !138, line: 63, baseType: !152)
!152 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !113, file: !110, line: 108, baseType: !154, size: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !138, line: 64, baseType: !155)
!155 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !113, file: !110, line: 132, baseType: !90, size: 32, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !113, file: !110, line: 136, baseType: !158, size: 192, offset: 192)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !131, line: 254, size: 192, elements: !159)
!159 = !{!160, !161, !167}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !158, file: !131, line: 255, baseType: !93, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !158, file: !131, line: 256, baseType: !162, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !131, line: 252, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !158, file: !131, line: 259, baseType: !168, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !138, line: 59, baseType: !169)
!169 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !109, file: !110, line: 255, baseType: !171, size: 288, offset: 384)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !172, line: 25, size: 288, elements: !173)
!172 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !171, file: !172, line: 26, baseType: !154, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !171, file: !172, line: 27, baseType: !154, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !171, file: !172, line: 28, baseType: !154, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !171, file: !172, line: 29, baseType: !154, size: 32, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !171, file: !172, line: 30, baseType: !154, size: 32, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !171, file: !172, line: 31, baseType: !154, size: 32, offset: 160)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !171, file: !172, line: 32, baseType: !154, size: 32, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !171, file: !172, line: 33, baseType: !154, size: 32, offset: 224)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !171, file: !172, line: 34, baseType: !154, size: 32, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !109, file: !110, line: 258, baseType: !90, size: 32, offset: 672)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !109, file: !110, line: 261, baseType: !130, size: 64, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !109, file: !110, line: 302, baseType: !91, size: 32, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !109, file: !110, line: 333, baseType: !187, size: 32, offset: 800)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !189, line: 5291, size: 160, elements: !190)
!189 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!190 = !{!191, !202, !203}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !188, file: !189, line: 5292, baseType: !192, size: 96)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !193, line: 56, size: 96, elements: !194)
!193 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!194 = !{!195, !198, !199}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !192, file: !193, line: 57, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !193, line: 57, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !192, file: !193, line: 58, baseType: !90, size: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !192, file: !193, line: 59, baseType: !200, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !201, line: 46, baseType: !155)
!201 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!202 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !188, file: !189, line: 5293, baseType: !130, size: 64, offset: 96)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !188, file: !189, line: 5294, baseType: !204, offset: 160)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !205, line: 45, elements: !206)
!205 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!206 = !{}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !109, file: !110, line: 355, baseType: !208, size: 64, offset: 832)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !172, line: 60, size: 64, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !208, file: !172, line: 63, baseType: !154, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !208, file: !172, line: 66, baseType: !154, size: 32, offset: 32)
!212 = !{!0}
!213 = !DIFile(filename: "kernel/mutex.c", directory: "/home/sri/zephyrproject/zephyr")
!214 = !{i32 7, !"Dwarf Version", i32 4}
!215 = !{i32 2, !"Debug Info Version", i32 3}
!216 = !{i32 1, !"wchar_size", i32 4}
!217 = !{i32 1, !"static_rwdata", i32 1}
!218 = !{i32 1, !"enumsize_buildattr", i32 1}
!219 = !{i32 1, !"armlib_unavailable", i32 0}
!220 = !{i32 8, !"PIC Level", i32 2}
!221 = !{i32 7, !"PIE Level", i32 2}
!222 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!223 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !6, file: !6, line: 223, type: !224, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !226, !108}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!228 = !DILocalVariable(name: "object", arg: 1, scope: !223, file: !6, line: 223, type: !226)
!229 = !DILocation(line: 223, column: 61, scope: !223)
!230 = !DILocalVariable(name: "thread", arg: 2, scope: !223, file: !6, line: 224, type: !108)
!231 = !DILocation(line: 224, column: 24, scope: !223)
!232 = !DILocation(line: 226, column: 9, scope: !223)
!233 = !DILocation(line: 227, column: 9, scope: !223)
!234 = !DILocation(line: 228, column: 1, scope: !223)
!235 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !6, file: !6, line: 243, type: !236, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !226}
!238 = !DILocalVariable(name: "object", arg: 1, scope: !235, file: !6, line: 243, type: !226)
!239 = !DILocation(line: 243, column: 56, scope: !235)
!240 = !DILocation(line: 245, column: 9, scope: !235)
!241 = !DILocation(line: 246, column: 1, scope: !235)
!242 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !6, file: !6, line: 359, type: !243, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!243 = !DISubroutineType(types: !244)
!244 = !{!90, !5}
!245 = !DILocalVariable(name: "otype", arg: 1, scope: !242, file: !6, line: 359, type: !5)
!246 = !DILocation(line: 359, column: 58, scope: !242)
!247 = !DILocation(line: 361, column: 9, scope: !242)
!248 = !DILocation(line: 363, column: 2, scope: !242)
!249 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !6, file: !6, line: 366, type: !250, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!250 = !DISubroutineType(types: !251)
!251 = !{!90, !5, !200}
!252 = !DILocalVariable(name: "otype", arg: 1, scope: !249, file: !6, line: 366, type: !5)
!253 = !DILocation(line: 366, column: 63, scope: !249)
!254 = !DILocalVariable(name: "size", arg: 2, scope: !249, file: !6, line: 367, type: !200)
!255 = !DILocation(line: 367, column: 13, scope: !249)
!256 = !DILocation(line: 369, column: 9, scope: !249)
!257 = !DILocation(line: 370, column: 9, scope: !249)
!258 = !DILocation(line: 372, column: 2, scope: !249)
!259 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !189, file: !189, line: 656, type: !260, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!260 = !DISubroutineType(types: !261)
!261 = !{!262, !264}
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !263, line: 46, baseType: !168)
!263 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!266 = !DILocalVariable(name: "t", arg: 1, scope: !259, file: !189, line: 657, type: !264)
!267 = !DILocation(line: 657, column: 30, scope: !259)
!268 = !DILocation(line: 659, column: 28, scope: !259)
!269 = !DILocation(line: 659, column: 31, scope: !259)
!270 = !DILocation(line: 659, column: 36, scope: !259)
!271 = !DILocation(line: 659, column: 9, scope: !259)
!272 = !DILocation(line: 659, column: 2, scope: !259)
!273 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !189, file: !189, line: 671, type: !260, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!274 = !DILocalVariable(name: "t", arg: 1, scope: !273, file: !189, line: 672, type: !264)
!275 = !DILocation(line: 672, column: 30, scope: !273)
!276 = !DILocation(line: 674, column: 30, scope: !273)
!277 = !DILocation(line: 674, column: 33, scope: !273)
!278 = !DILocation(line: 674, column: 38, scope: !273)
!279 = !DILocation(line: 674, column: 9, scope: !273)
!280 = !DILocation(line: 674, column: 2, scope: !273)
!281 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !189, file: !189, line: 1634, type: !282, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!282 = !DISubroutineType(types: !283)
!283 = !{!262, !284}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !189, line: 1439, size: 448, elements: !287)
!287 = !{!288, !289, !290, !295, !296, !301, !302}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !286, file: !189, line: 1445, baseType: !158, size: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !286, file: !189, line: 1448, baseType: !130, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !286, file: !189, line: 1451, baseType: !291, size: 32, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !294}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !286, file: !189, line: 1454, baseType: !291, size: 32, offset: 288)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !286, file: !189, line: 1457, baseType: !297, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !263, line: 67, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !263, line: 65, size: 64, elements: !299)
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !298, file: !263, line: 66, baseType: !262, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !286, file: !189, line: 1460, baseType: !154, size: 32, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !286, file: !189, line: 1463, baseType: !90, size: 32, offset: 416)
!303 = !DILocalVariable(name: "timer", arg: 1, scope: !281, file: !189, line: 1635, type: !284)
!304 = !DILocation(line: 1635, column: 34, scope: !281)
!305 = !DILocation(line: 1637, column: 28, scope: !281)
!306 = !DILocation(line: 1637, column: 35, scope: !281)
!307 = !DILocation(line: 1637, column: 9, scope: !281)
!308 = !DILocation(line: 1637, column: 2, scope: !281)
!309 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !189, file: !189, line: 1649, type: !282, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!310 = !DILocalVariable(name: "timer", arg: 1, scope: !309, file: !189, line: 1650, type: !284)
!311 = !DILocation(line: 1650, column: 34, scope: !309)
!312 = !DILocation(line: 1652, column: 30, scope: !309)
!313 = !DILocation(line: 1652, column: 37, scope: !309)
!314 = !DILocation(line: 1652, column: 9, scope: !309)
!315 = !DILocation(line: 1652, column: 2, scope: !309)
!316 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !189, file: !189, line: 1689, type: !317, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !294, !90}
!319 = !DILocalVariable(name: "timer", arg: 1, scope: !316, file: !189, line: 1689, type: !294)
!320 = !DILocation(line: 1689, column: 65, scope: !316)
!321 = !DILocalVariable(name: "user_data", arg: 2, scope: !316, file: !189, line: 1690, type: !90)
!322 = !DILocation(line: 1690, column: 19, scope: !316)
!323 = !DILocation(line: 1692, column: 21, scope: !316)
!324 = !DILocation(line: 1692, column: 2, scope: !316)
!325 = !DILocation(line: 1692, column: 9, scope: !316)
!326 = !DILocation(line: 1692, column: 19, scope: !316)
!327 = !DILocation(line: 1693, column: 1, scope: !316)
!328 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !189, file: !189, line: 1704, type: !329, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!329 = !DISubroutineType(types: !330)
!330 = !{!90, !284}
!331 = !DILocalVariable(name: "timer", arg: 1, scope: !328, file: !189, line: 1704, type: !284)
!332 = !DILocation(line: 1704, column: 72, scope: !328)
!333 = !DILocation(line: 1706, column: 9, scope: !328)
!334 = !DILocation(line: 1706, column: 16, scope: !328)
!335 = !DILocation(line: 1706, column: 2, scope: !328)
!336 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !189, file: !189, line: 2071, type: !337, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!337 = !DISubroutineType(types: !338)
!338 = !{!91, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !189, line: 1830, size: 128, elements: !341)
!341 = !{!342, !355, !356}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !340, file: !189, line: 1831, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !344, line: 60, baseType: !345)
!344 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !344, line: 53, size: 64, elements: !346)
!346 = !{!347, !354}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !345, file: !344, line: 54, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !344, line: 50, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !344, line: 44, size: 32, elements: !351)
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !350, file: !344, line: 45, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !344, line: 40, baseType: !154)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !345, file: !344, line: 55, baseType: !348, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !340, file: !189, line: 1832, baseType: !204, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !340, file: !189, line: 1833, baseType: !130, size: 64, offset: 64)
!357 = !DILocalVariable(name: "queue", arg: 1, scope: !336, file: !189, line: 2071, type: !339)
!358 = !DILocation(line: 2071, column: 59, scope: !336)
!359 = !DILocation(line: 2073, column: 35, scope: !336)
!360 = !DILocation(line: 2073, column: 42, scope: !336)
!361 = !DILocation(line: 2073, column: 14, scope: !336)
!362 = !DILocation(line: 2073, column: 9, scope: !336)
!363 = !DILocation(line: 2073, column: 2, scope: !336)
!364 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !189, file: !189, line: 3209, type: !365, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!365 = !DISubroutineType(types: !366)
!366 = !{!155, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !189, line: 3092, size: 128, elements: !369)
!369 = !{!370, !371, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !368, file: !189, line: 3093, baseType: !130, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !368, file: !189, line: 3094, baseType: !155, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !368, file: !189, line: 3095, baseType: !155, size: 32, offset: 96)
!373 = !DILocalVariable(name: "sem", arg: 1, scope: !364, file: !189, line: 3209, type: !367)
!374 = !DILocation(line: 3209, column: 65, scope: !364)
!375 = !DILocation(line: 3211, column: 9, scope: !364)
!376 = !DILocation(line: 3211, column: 14, scope: !364)
!377 = !DILocation(line: 3211, column: 2, scope: !364)
!378 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !189, file: !189, line: 4649, type: !379, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!379 = !DISubroutineType(types: !380)
!380 = !{!154, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !189, line: 4390, size: 320, elements: !383)
!383 = !{!384, !385, !386, !387, !388, !391, !392, !393, !394, !395}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !382, file: !189, line: 4392, baseType: !130, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !382, file: !189, line: 4394, baseType: !204, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !382, file: !189, line: 4396, baseType: !200, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !382, file: !189, line: 4398, baseType: !154, size: 32, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !382, file: !189, line: 4400, baseType: !389, size: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !382, file: !189, line: 4402, baseType: !389, size: 32, offset: 160)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !382, file: !189, line: 4404, baseType: !389, size: 32, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !382, file: !189, line: 4406, baseType: !389, size: 32, offset: 224)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !382, file: !189, line: 4408, baseType: !154, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !382, file: !189, line: 4413, baseType: !137, size: 8, offset: 288)
!396 = !DILocalVariable(name: "msgq", arg: 1, scope: !378, file: !189, line: 4649, type: !381)
!397 = !DILocation(line: 4649, column: 66, scope: !378)
!398 = !DILocation(line: 4651, column: 9, scope: !378)
!399 = !DILocation(line: 4651, column: 15, scope: !378)
!400 = !DILocation(line: 4651, column: 26, scope: !378)
!401 = !DILocation(line: 4651, column: 32, scope: !378)
!402 = !DILocation(line: 4651, column: 24, scope: !378)
!403 = !DILocation(line: 4651, column: 2, scope: !378)
!404 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !189, file: !189, line: 4665, type: !379, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!405 = !DILocalVariable(name: "msgq", arg: 1, scope: !404, file: !189, line: 4665, type: !381)
!406 = !DILocation(line: 4665, column: 66, scope: !404)
!407 = !DILocation(line: 4667, column: 9, scope: !404)
!408 = !DILocation(line: 4667, column: 15, scope: !404)
!409 = !DILocation(line: 4667, column: 2, scope: !404)
!410 = distinct !DISubprogram(name: "z_impl_k_mutex_init", scope: !213, file: !213, line: 53, type: !411, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !206)
!411 = !DISubroutineType(types: !412)
!412 = !{!91, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !189, line: 2895, size: 160, elements: !415)
!415 = !{!416, !417, !418, !419}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !414, file: !189, line: 2897, baseType: !130, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !414, file: !189, line: 2899, baseType: !108, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !414, file: !189, line: 2902, baseType: !154, size: 32, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !414, file: !189, line: 2905, baseType: !91, size: 32, offset: 128)
!420 = !DILocalVariable(name: "mutex", arg: 1, scope: !410, file: !213, line: 53, type: !413)
!421 = !DILocation(line: 53, column: 41, scope: !410)
!422 = !DILocation(line: 55, column: 2, scope: !410)
!423 = !DILocation(line: 55, column: 9, scope: !410)
!424 = !DILocation(line: 55, column: 15, scope: !410)
!425 = !DILocation(line: 56, column: 2, scope: !410)
!426 = !DILocation(line: 56, column: 9, scope: !410)
!427 = !DILocation(line: 56, column: 20, scope: !410)
!428 = !DILocation(line: 58, column: 16, scope: !410)
!429 = !DILocation(line: 58, column: 23, scope: !410)
!430 = !DILocation(line: 58, column: 2, scope: !410)
!431 = !DILocation(line: 60, column: 16, scope: !410)
!432 = !DILocation(line: 60, column: 2, scope: !410)
!433 = !DILocation(line: 66, column: 2, scope: !410)
!434 = !DILocation(line: 66, column: 7, scope: !435)
!435 = distinct !DILexicalBlock(scope: !410, file: !213, line: 66, column: 5)
!436 = !DILocation(line: 68, column: 2, scope: !410)
!437 = distinct !DISubprogram(name: "z_waitq_init", scope: !438, file: !438, line: 47, type: !439, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!438 = !DIFile(filename: "kernel/include/wait_q.h", directory: "/home/sri/zephyrproject/zephyr")
!439 = !DISubroutineType(types: !440)
!440 = !{null, !129}
!441 = !DILocalVariable(name: "w", arg: 1, scope: !437, file: !438, line: 47, type: !129)
!442 = !DILocation(line: 47, column: 44, scope: !437)
!443 = !DILocation(line: 49, column: 18, scope: !437)
!444 = !DILocation(line: 49, column: 21, scope: !437)
!445 = !DILocation(line: 49, column: 2, scope: !437)
!446 = !DILocation(line: 50, column: 1, scope: !437)
!447 = distinct !DISubprogram(name: "z_object_init", scope: !6, file: !6, line: 215, type: !236, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !206)
!448 = !DILocalVariable(name: "obj", arg: 1, scope: !447, file: !6, line: 215, type: !226)
!449 = !DILocation(line: 215, column: 46, scope: !447)
!450 = !DILocation(line: 217, column: 9, scope: !447)
!451 = !DILocation(line: 218, column: 1, scope: !447)
!452 = distinct !DISubprogram(name: "z_impl_k_mutex_lock", scope: !213, file: !213, line: 103, type: !453, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !206)
!453 = !DISubroutineType(types: !454)
!454 = !{!91, !413, !297}
!455 = !DILocalVariable(name: "mutex", arg: 1, scope: !452, file: !213, line: 103, type: !413)
!456 = !DILocation(line: 103, column: 41, scope: !452)
!457 = !DILocalVariable(name: "timeout", arg: 2, scope: !452, file: !213, line: 103, type: !297)
!458 = !DILocation(line: 103, column: 60, scope: !452)
!459 = !DILocalVariable(name: "new_prio", scope: !452, file: !213, line: 105, type: !91)
!460 = !DILocation(line: 105, column: 6, scope: !452)
!461 = !DILocalVariable(name: "key", scope: !452, file: !213, line: 106, type: !462)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !205, line: 108, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !205, line: 34, size: 32, elements: !464)
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !463, file: !205, line: 35, baseType: !91, size: 32)
!466 = !DILocation(line: 106, column: 19, scope: !452)
!467 = !DILocalVariable(name: "resched", scope: !452, file: !213, line: 107, type: !89)
!468 = !DILocation(line: 107, column: 8, scope: !452)
!469 = !DILocation(line: 111, column: 2, scope: !452)
!470 = !DILocation(line: 111, column: 7, scope: !471)
!471 = distinct !DILexicalBlock(scope: !452, file: !213, line: 111, column: 5)
!472 = !DILocalVariable(name: "l", arg: 1, scope: !473, file: !205, line: 160, type: !476)
