; ModuleID = '../bc_files/queue.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/queue.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.z_kernel = type { [1 x %struct._cpu], %struct._ready_q }
%struct._cpu = type { i32, ptr, ptr, ptr, i8, %struct._cpu_arch }
%struct._cpu_arch = type {}
%struct._ready_q = type { ptr, %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }

!20 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!21 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!22 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!23 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!24 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!25 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!26 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!27 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!28 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!29 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!30 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!31 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!32 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!33 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!34 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 17)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 18)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 19)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 20)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 21)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 22)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 25)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 26)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 27)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 28)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 29)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 30)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 31)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 32)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 33)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 34)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 35)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 36)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 37)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 38)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 39)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 40)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 41)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 42)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 43)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 44)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 45)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 46)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 47)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!96 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!97 = !{!98, !100, !115, !114, !117, !118, !119, !120, !121, !110}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !99, line: 62, baseType: !5)
!99 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc_node", file: !102, line: 25, size: 64, elements: !103)
!102 = !DIFile(filename: "kernel/queue.c", directory: "/home/sri/zephyrproject/zephyr")
!103 = !{!104, !113}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !101, file: !102, line: 26, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !106, line: 50, baseType: !107)
!106 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !106, line: 44, size: 32, elements: !108)
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !107, file: !106, line: 45, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !106, line: 40, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !99, line: 64, baseType: !112)
!112 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !101, file: !102, line: 27, baseType: !114, size: 32, offset: 32)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!118 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!120 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !123, line: 55, baseType: !124)
!123 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !123, line: 37, size: 64, elements: !125)
!125 = !{!126, !132}
!126 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !123, line: 38, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !123, line: 38, size: 32, elements: !128)
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !127, file: !123, line: 39, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !123, line: 40, baseType: !130, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !123, line: 42, baseType: !133, size: 32, offset: 32)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !123, line: 42, size: 32, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !133, file: !123, line: 43, baseType: !130, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !133, file: !123, line: 44, baseType: !130, size: 32)
!137 = !{i32 7, !"Dwarf Version", i32 4}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{i32 1, !"wchar_size", i32 4}
!140 = !{i32 1, !"static_rwdata", i32 1}
!141 = !{i32 1, !"enumsize_buildattr", i32 1}
!142 = !{i32 1, !"armlib_unavailable", i32 0}
!143 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!144 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !16, file: !16, line: 223, type: !145, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !248)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !147, !149}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !151, line: 250, size: 896, elements: !152)
!151 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!152 = !{!153, !207, !220, !221, !222, !223, !243}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !150, file: !151, line: 252, baseType: !154, size: 384)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !151, line: 58, size: 384, elements: !155)
!155 = !{!156, !169, !177, !178, !179, !192, !193, !194}
!156 = !DIDerivedType(tag: DW_TAG_member, scope: !154, file: !151, line: 61, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !154, file: !151, line: 61, size: 64, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !157, file: !151, line: 62, baseType: !122, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !157, file: !151, line: 63, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !162, line: 58, size: 64, elements: !163)
!162 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!163 = !{!164}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !161, file: !162, line: 60, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 64, elements: !167)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!167 = !{!168}
!168 = !DISubrange(count: 2)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !154, file: !151, line: 69, baseType: !170, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !172, line: 243, baseType: !173)
!172 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 241, size: 64, elements: !174)
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !173, file: !172, line: 242, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !123, line: 51, baseType: !124)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !154, file: !151, line: 72, baseType: !98, size: 8, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !154, file: !151, line: 75, baseType: !98, size: 8, offset: 104)
!179 = !DIDerivedType(tag: DW_TAG_member, scope: !154, file: !151, line: 91, baseType: !180, size: 16, offset: 112)
!180 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !154, file: !151, line: 91, size: 16, elements: !181)
!181 = !{!182, !189}
!182 = !DIDerivedType(tag: DW_TAG_member, scope: !180, file: !151, line: 92, baseType: !183, size: 16)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !180, file: !151, line: 92, size: 16, elements: !184)
!184 = !{!185, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !183, file: !151, line: 97, baseType: !186, size: 8)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !99, line: 56, baseType: !187)
!187 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !183, file: !151, line: 98, baseType: !98, size: 8, offset: 8)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !180, file: !151, line: 101, baseType: !190, size: 16)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !99, line: 63, baseType: !191)
!191 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !154, file: !151, line: 108, baseType: !111, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !154, file: !151, line: 132, baseType: !114, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !154, file: !151, line: 136, baseType: !195, size: 192, offset: 192)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !172, line: 254, size: 192, elements: !196)
!196 = !{!197, !198, !204}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !195, file: !172, line: 255, baseType: !122, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !195, file: !172, line: 256, baseType: !199, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !172, line: 252, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !195, file: !172, line: 259, baseType: !205, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !99, line: 59, baseType: !206)
!206 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !150, file: !151, line: 255, baseType: !208, size: 288, offset: 384)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !209, line: 25, size: 288, elements: !210)
!209 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !208, file: !209, line: 26, baseType: !111, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !208, file: !209, line: 27, baseType: !111, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !208, file: !209, line: 28, baseType: !111, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !208, file: !209, line: 29, baseType: !111, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !208, file: !209, line: 30, baseType: !111, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !208, file: !209, line: 31, baseType: !111, size: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !208, file: !209, line: 32, baseType: !111, size: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !208, file: !209, line: 33, baseType: !111, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !208, file: !209, line: 34, baseType: !111, size: 32, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !150, file: !151, line: 258, baseType: !114, size: 32, offset: 672)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !150, file: !151, line: 261, baseType: !171, size: 64, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !150, file: !151, line: 302, baseType: !120, size: 32, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !150, file: !151, line: 333, baseType: !224, size: 32, offset: 800)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !4, line: 5291, size: 160, elements: !226)
!226 = !{!227, !238, !239}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !225, file: !4, line: 5292, baseType: !228, size: 96)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !229, line: 56, size: 96, elements: !230)
!229 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!230 = !{!231, !234, !235}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !228, file: !229, line: 57, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !229, line: 57, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !228, file: !229, line: 58, baseType: !114, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !228, file: !229, line: 59, baseType: !236, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !237, line: 46, baseType: !112)
!237 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!238 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !225, file: !4, line: 5293, baseType: !171, size: 64, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !225, file: !4, line: 5294, baseType: !240, offset: 160)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !241, line: 45, elements: !242)
!241 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!242 = !{}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !150, file: !151, line: 355, baseType: !244, size: 64, offset: 832)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !209, line: 60, size: 64, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !244, file: !209, line: 63, baseType: !111, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !244, file: !209, line: 66, baseType: !111, size: 32, offset: 32)
!248 = !{!249, !250}
!249 = !DILocalVariable(name: "object", arg: 1, scope: !144, file: !16, line: 223, type: !147)
!250 = !DILocalVariable(name: "thread", arg: 2, scope: !144, file: !16, line: 224, type: !149)
!251 = !DILocation(line: 223, column: 61, scope: !144)
!252 = !DILocation(line: 224, column: 24, scope: !144)
!253 = !DILocation(line: 226, column: 9, scope: !144)
!254 = !DILocation(line: 227, column: 9, scope: !144)
!255 = !DILocation(line: 228, column: 1, scope: !144)
!256 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !16, file: !16, line: 243, type: !257, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !259)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !147}
!259 = !{!260}
!260 = !DILocalVariable(name: "object", arg: 1, scope: !256, file: !16, line: 243, type: !147)
!261 = !DILocation(line: 243, column: 56, scope: !256)
!262 = !DILocation(line: 245, column: 9, scope: !256)
!263 = !DILocation(line: 246, column: 1, scope: !256)
!264 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !16, file: !16, line: 359, type: !265, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !267)
!265 = !DISubroutineType(types: !266)
!266 = !{!114, !15}
!267 = !{!268}
!268 = !DILocalVariable(name: "otype", arg: 1, scope: !264, file: !16, line: 359, type: !15)
!269 = !DILocation(line: 359, column: 58, scope: !264)
!270 = !DILocation(line: 361, column: 9, scope: !264)
!271 = !DILocation(line: 363, column: 2, scope: !264)
!272 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !16, file: !16, line: 366, type: !273, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !275)
!273 = !DISubroutineType(types: !274)
!274 = !{!114, !15, !236}
!275 = !{!276, !277}
!276 = !DILocalVariable(name: "otype", arg: 1, scope: !272, file: !16, line: 366, type: !15)
!277 = !DILocalVariable(name: "size", arg: 2, scope: !272, file: !16, line: 367, type: !236)
!278 = !DILocation(line: 366, column: 63, scope: !272)
!279 = !DILocation(line: 367, column: 13, scope: !272)
!280 = !DILocation(line: 369, column: 9, scope: !272)
!281 = !DILocation(line: 370, column: 9, scope: !272)
!282 = !DILocation(line: 372, column: 2, scope: !272)
!283 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !4, file: !4, line: 656, type: !284, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !290)
!284 = !DISubroutineType(types: !285)
!285 = !{!286, !288}
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !287, line: 46, baseType: !205)
!287 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!290 = !{!291}
!291 = !DILocalVariable(name: "t", arg: 1, scope: !283, file: !4, line: 657, type: !288)
!292 = !DILocation(line: 657, column: 30, scope: !283)
!293 = !DILocation(line: 659, column: 28, scope: !283)
!294 = !DILocation(line: 659, column: 31, scope: !283)
!295 = !DILocation(line: 659, column: 36, scope: !283)
!296 = !DILocation(line: 659, column: 9, scope: !283)
!297 = !DILocation(line: 659, column: 2, scope: !283)
!298 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !4, file: !4, line: 671, type: !284, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !299)
!299 = !{!300}
!300 = !DILocalVariable(name: "t", arg: 1, scope: !298, file: !4, line: 672, type: !288)
!301 = !DILocation(line: 672, column: 30, scope: !298)
!302 = !DILocation(line: 674, column: 30, scope: !298)
!303 = !DILocation(line: 674, column: 33, scope: !298)
!304 = !DILocation(line: 674, column: 38, scope: !298)
!305 = !DILocation(line: 674, column: 9, scope: !298)
!306 = !DILocation(line: 674, column: 2, scope: !298)
!307 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !4, file: !4, line: 1634, type: !308, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !329)
!308 = !DISubroutineType(types: !309)
!309 = !{!286, !310}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !4, line: 1439, size: 448, elements: !313)
!313 = !{!314, !315, !316, !321, !322, !327, !328}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !312, file: !4, line: 1445, baseType: !195, size: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !312, file: !4, line: 1448, baseType: !171, size: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !312, file: !4, line: 1451, baseType: !317, size: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !320}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !312, file: !4, line: 1454, baseType: !317, size: 32, offset: 288)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !312, file: !4, line: 1457, baseType: !323, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !287, line: 67, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !287, line: 65, size: 64, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !324, file: !287, line: 66, baseType: !286, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !312, file: !4, line: 1460, baseType: !111, size: 32, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !312, file: !4, line: 1463, baseType: !114, size: 32, offset: 416)
!329 = !{!330}
!330 = !DILocalVariable(name: "timer", arg: 1, scope: !307, file: !4, line: 1635, type: !310)
!331 = !DILocation(line: 1635, column: 34, scope: !307)
!332 = !DILocation(line: 1637, column: 28, scope: !307)
!333 = !DILocation(line: 1637, column: 35, scope: !307)
!334 = !DILocation(line: 1637, column: 9, scope: !307)
!335 = !DILocation(line: 1637, column: 2, scope: !307)
!336 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !4, file: !4, line: 1649, type: !308, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !337)
!337 = !{!338}
!338 = !DILocalVariable(name: "timer", arg: 1, scope: !336, file: !4, line: 1650, type: !310)
!339 = !DILocation(line: 1650, column: 34, scope: !336)
!340 = !DILocation(line: 1652, column: 30, scope: !336)
!341 = !DILocation(line: 1652, column: 37, scope: !336)
!342 = !DILocation(line: 1652, column: 9, scope: !336)
!343 = !DILocation(line: 1652, column: 2, scope: !336)
!344 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !4, file: !4, line: 1689, type: !345, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !347)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !320, !114}
!347 = !{!348, !349}
!348 = !DILocalVariable(name: "timer", arg: 1, scope: !344, file: !4, line: 1689, type: !320)
!349 = !DILocalVariable(name: "user_data", arg: 2, scope: !344, file: !4, line: 1690, type: !114)
!350 = !DILocation(line: 1689, column: 65, scope: !344)
!351 = !DILocation(line: 1690, column: 19, scope: !344)
!352 = !DILocation(line: 1692, column: 21, scope: !344)
!353 = !DILocation(line: 1692, column: 2, scope: !344)
!354 = !DILocation(line: 1692, column: 9, scope: !344)
!355 = !DILocation(line: 1692, column: 19, scope: !344)
!356 = !DILocation(line: 1693, column: 1, scope: !344)
!357 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !4, file: !4, line: 1704, type: !358, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !360)
!358 = !DISubroutineType(types: !359)
!359 = !{!114, !310}
!360 = !{!361}
!361 = !DILocalVariable(name: "timer", arg: 1, scope: !357, file: !4, line: 1704, type: !310)
!362 = !DILocation(line: 1704, column: 72, scope: !357)
!363 = !DILocation(line: 1706, column: 9, scope: !357)
!364 = !DILocation(line: 1706, column: 16, scope: !357)
!365 = !DILocation(line: 1706, column: 2, scope: !357)
!366 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !4, file: !4, line: 2071, type: !367, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !380)
!367 = !DISubroutineType(types: !368)
!368 = !{!120, !369}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !4, line: 1830, size: 128, elements: !371)
!371 = !{!372, !378, !379}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !370, file: !4, line: 1831, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !106, line: 60, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !106, line: 53, size: 64, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !374, file: !106, line: 54, baseType: !119, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !374, file: !106, line: 55, baseType: !119, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !370, file: !4, line: 1832, baseType: !240, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !370, file: !4, line: 1833, baseType: !171, size: 64, offset: 64)
!380 = !{!381}
!381 = !DILocalVariable(name: "queue", arg: 1, scope: !366, file: !4, line: 2071, type: !369)
!382 = !DILocation(line: 2071, column: 59, scope: !366)
!383 = !DILocation(line: 2073, column: 35, scope: !366)
!384 = !DILocation(line: 2073, column: 42, scope: !366)
!385 = !DILocation(line: 2073, column: 14, scope: !366)
!386 = !DILocation(line: 2073, column: 9, scope: !366)
!387 = !DILocation(line: 2073, column: 2, scope: !366)
!388 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !4, file: !4, line: 3209, type: !389, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !397)
!389 = !DISubroutineType(types: !390)
!390 = !{!112, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !4, line: 3092, size: 128, elements: !393)
!393 = !{!394, !395, !396}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !392, file: !4, line: 3093, baseType: !171, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !392, file: !4, line: 3094, baseType: !112, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !392, file: !4, line: 3095, baseType: !112, size: 32, offset: 96)
!397 = !{!398}
!398 = !DILocalVariable(name: "sem", arg: 1, scope: !388, file: !4, line: 3209, type: !391)
!399 = !DILocation(line: 3209, column: 65, scope: !388)
!400 = !DILocation(line: 3211, column: 9, scope: !388)
!401 = !DILocation(line: 3211, column: 14, scope: !388)
!402 = !DILocation(line: 3211, column: 2, scope: !388)
!403 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !4, file: !4, line: 4649, type: !404, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !419)
!404 = !DISubroutineType(types: !405)
!405 = !{!111, !406}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !4, line: 4390, size: 320, elements: !408)
!408 = !{!409, !410, !411, !412, !413, !414, !415, !416, !417, !418}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !407, file: !4, line: 4392, baseType: !171, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !407, file: !4, line: 4394, baseType: !240, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !407, file: !4, line: 4396, baseType: !236, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !407, file: !4, line: 4398, baseType: !111, size: 32, offset: 96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !407, file: !4, line: 4400, baseType: !115, size: 32, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !407, file: !4, line: 4402, baseType: !115, size: 32, offset: 160)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !407, file: !4, line: 4404, baseType: !115, size: 32, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !407, file: !4, line: 4406, baseType: !115, size: 32, offset: 224)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !407, file: !4, line: 4408, baseType: !111, size: 32, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !407, file: !4, line: 4413, baseType: !98, size: 8, offset: 288)
!419 = !{!420}
!420 = !DILocalVariable(name: "msgq", arg: 1, scope: !403, file: !4, line: 4649, type: !406)
!421 = !DILocation(line: 4649, column: 66, scope: !403)
!422 = !DILocation(line: 4651, column: 9, scope: !403)
!423 = !DILocation(line: 4651, column: 15, scope: !403)
!424 = !DILocation(line: 4651, column: 26, scope: !403)
!425 = !DILocation(line: 4651, column: 32, scope: !403)
!426 = !DILocation(line: 4651, column: 24, scope: !403)
!427 = !DILocation(line: 4651, column: 2, scope: !403)
!428 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !4, file: !4, line: 4665, type: !404, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !429)
!429 = !{!430}
!430 = !DILocalVariable(name: "msgq", arg: 1, scope: !428, file: !4, line: 4665, type: !406)
!431 = !DILocation(line: 4665, column: 66, scope: !428)
!432 = !DILocation(line: 4667, column: 9, scope: !428)
!433 = !DILocation(line: 4667, column: 15, scope: !428)
!434 = !DILocation(line: 4667, column: 2, scope: !428)
!435 = distinct !DISubprogram(name: "z_queue_node_peek", scope: !102, file: !102, line: 30, type: !436, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !438)
!436 = !DISubroutineType(types: !437)
!437 = !{!114, !119, !118}
!438 = !{!439, !440, !441, !442}
!439 = !DILocalVariable(name: "node", arg: 1, scope: !435, file: !102, line: 30, type: !119)
!440 = !DILocalVariable(name: "needs_free", arg: 2, scope: !435, file: !102, line: 30, type: !118)
!441 = !DILocalVariable(name: "ret", scope: !435, file: !102, line: 32, type: !114)
!442 = !DILocalVariable(name: "anode", scope: !443, file: !102, line: 40, type: !100)
!443 = distinct !DILexicalBlock(scope: !444, file: !102, line: 34, column: 65)
!444 = distinct !DILexicalBlock(scope: !435, file: !102, line: 34, column: 6)
!445 = !DILocation(line: 30, column: 39, scope: !435)
!446 = !DILocation(line: 30, column: 51, scope: !435)
!447 = !DILocation(line: 32, column: 2, scope: !435)
!448 = !DILocation(line: 32, column: 8, scope: !435)
!449 = !DILocation(line: 34, column: 7, scope: !444)
!450 = !DILocation(line: 34, column: 12, scope: !444)
!451 = !DILocation(line: 34, column: 18, scope: !444)
!452 = !DILocation(line: 34, column: 43, scope: !444)
!453 = !DILocation(line: 34, column: 22, scope: !444)
!454 = !DILocation(line: 34, column: 49, scope: !444)
!455 = !DILocation(line: 34, column: 6, scope: !435)
!456 = !DILocation(line: 40, column: 3, scope: !443)
!457 = !DILocation(line: 40, column: 22, scope: !443)
!458 = !DILocation(line: 42, column: 49, scope: !459)
!459 = distinct !DILexicalBlock(scope: !443, file: !102, line: 42, column: 12)
!460 = !DILocation(line: 42, column: 56, scope: !459)
!461 = !DILocation(line: 42, column: 12, scope: !443)
!462 = !DILocation(line: 42, column: 105, scope: !459)
!463 = !DILocation(line: 42, column: 9, scope: !443)
!464 = !DILocation(line: 43, column: 9, scope: !443)
!465 = !DILocation(line: 43, column: 16, scope: !443)
!466 = !DILocation(line: 43, column: 7, scope: !443)
!467 = !DILocation(line: 44, column: 7, scope: !468)
!468 = distinct !DILexicalBlock(scope: !443, file: !102, line: 44, column: 7)
!469 = !{i8 0, i8 2}
!470 = !DILocation(line: 44, column: 7, scope: !443)
!471 = !DILocation(line: 45, column: 11, scope: !472)
!472 = distinct !DILexicalBlock(scope: !468, file: !102, line: 44, column: 19)
!473 = !DILocation(line: 45, column: 4, scope: !472)
!474 = !DILocation(line: 46, column: 3, scope: !472)
!475 = !DILocation(line: 47, column: 2, scope: !444)
!476 = !DILocation(line: 47, column: 2, scope: !443)
!477 = !DILocation(line: 52, column: 17, scope: !478)
!478 = distinct !DILexicalBlock(scope: !444, file: !102, line: 47, column: 9)
!479 = !DILocation(line: 52, column: 7, scope: !478)
!480 = !DILocation(line: 55, column: 9, scope: !435)
!481 = !DILocation(line: 56, column: 1, scope: !435)
!482 = !DILocation(line: 55, column: 2, scope: !435)
!483 = distinct !DISubprogram(name: "sys_sfnode_flags_get", scope: !106, file: !106, line: 282, type: !484, scopeLine: 283, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !486)
!484 = !DISubroutineType(types: !485)
!485 = !{!98, !119}
!486 = !{!487}
!487 = !DILocalVariable(name: "node", arg: 1, scope: !483, file: !106, line: 282, type: !119)
!488 = !DILocation(line: 282, column: 58, scope: !483)
!489 = !DILocation(line: 284, column: 9, scope: !483)
!490 = !DILocation(line: 284, column: 15, scope: !483)
!491 = !DILocation(line: 284, column: 30, scope: !483)
!492 = !DILocation(line: 284, column: 2, scope: !483)
!493 = !DISubprogram(name: "k_free", scope: !4, file: !4, line: 5490, type: !494, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !242)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !114}
!496 = distinct !DISubprogram(name: "z_impl_k_queue_init", scope: !102, file: !102, line: 58, type: !497, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !499)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !369}
!499 = !{!500}
!500 = !DILocalVariable(name: "queue", arg: 1, scope: !496, file: !102, line: 58, type: !369)
!501 = !DILocation(line: 58, column: 42, scope: !496)
!502 = !DILocation(line: 60, column: 19, scope: !496)
!503 = !DILocation(line: 60, column: 26, scope: !496)
!504 = !DILocation(line: 60, column: 2, scope: !496)
!505 = !DILocation(line: 61, column: 2, scope: !496)
!506 = !DILocation(line: 61, column: 9, scope: !496)
!507 = !DILocation(line: 61, column: 16, scope: !496)
!508 = !DILocation(line: 62, column: 16, scope: !496)
!509 = !DILocation(line: 62, column: 23, scope: !496)
!510 = !DILocation(line: 62, column: 2, scope: !496)
!511 = !DILocation(line: 67, column: 2, scope: !496)
!512 = !DILocation(line: 67, column: 7, scope: !513)
!513 = distinct !DILexicalBlock(scope: !496, file: !102, line: 67, column: 5)
!514 = !DILocation(line: 69, column: 16, scope: !496)
!515 = !DILocation(line: 69, column: 2, scope: !496)
!516 = !DILocation(line: 70, column: 1, scope: !496)
!517 = distinct !DISubprogram(name: "sys_sflist_init", scope: !106, file: !106, line: 210, type: !518, scopeLine: 211, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !521)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !520}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!521 = !{!522}
!522 = !DILocalVariable(name: "list", arg: 1, scope: !517, file: !106, line: 210, type: !520)
!523 = !DILocation(line: 210, column: 50, scope: !517)
!524 = !DILocation(line: 212, column: 2, scope: !517)
!525 = !DILocation(line: 212, column: 8, scope: !517)
!526 = !DILocation(line: 212, column: 13, scope: !517)
!527 = !DILocation(line: 213, column: 2, scope: !517)
!528 = !DILocation(line: 213, column: 8, scope: !517)
!529 = !DILocation(line: 213, column: 13, scope: !517)
!530 = !DILocation(line: 214, column: 1, scope: !517)
!531 = distinct !DISubprogram(name: "z_waitq_init", scope: !532, file: !532, line: 47, type: !533, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !535)
!532 = !DIFile(filename: "kernel/include/wait_q.h", directory: "/home/sri/zephyrproject/zephyr")
!533 = !DISubroutineType(types: !534)
!534 = !{null, !170}
!535 = !{!536}
!536 = !DILocalVariable(name: "w", arg: 1, scope: !531, file: !532, line: 47, type: !170)
!537 = !DILocation(line: 47, column: 44, scope: !531)
!538 = !DILocation(line: 49, column: 18, scope: !531)
!539 = !DILocation(line: 49, column: 21, scope: !531)
!540 = !DILocation(line: 49, column: 2, scope: !531)
!541 = !DILocation(line: 50, column: 1, scope: !531)
!542 = distinct !DISubprogram(name: "z_object_init", scope: !16, file: !16, line: 215, type: !257, scopeLine: 216, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !543)
!543 = !{!544}
!544 = !DILocalVariable(name: "obj", arg: 1, scope: !542, file: !16, line: 215, type: !147)
!545 = !DILocation(line: 215, column: 46, scope: !542)
!546 = !DILocation(line: 217, column: 9, scope: !542)
!547 = !DILocation(line: 218, column: 1, scope: !542)
!548 = distinct !DISubprogram(name: "z_impl_k_queue_cancel_wait", scope: !102, file: !102, line: 97, type: !497, scopeLine: 98, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !549)
!549 = !{!550, !551, !556}
!550 = !DILocalVariable(name: "queue", arg: 1, scope: !548, file: !102, line: 97, type: !369)
!551 = !DILocalVariable(name: "key", scope: !548, file: !102, line: 101, type: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !241, line: 108, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !241, line: 34, size: 32, elements: !554)
!554 = !{!555}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !553, file: !241, line: 35, baseType: !120, size: 32)
!556 = !DILocalVariable(name: "first_pending_thread", scope: !548, file: !102, line: 102, type: !149)
!557 = !DILocation(line: 97, column: 49, scope: !548)
!558 = !DILocation(line: 99, column: 2, scope: !548)
!559 = !DILocation(line: 99, column: 7, scope: !560)
!560 = distinct !DILexicalBlock(scope: !548, file: !102, line: 99, column: 5)
!561 = !DILocation(line: 101, column: 2, scope: !548)
!562 = !DILocation(line: 101, column: 19, scope: !548)
!563 = !DILocation(line: 101, column: 38, scope: !548)
!564 = !DILocation(line: 101, column: 45, scope: !548)
!565 = !DILocalVariable(name: "l", arg: 1, scope: !566, file: !241, line: 160, type: !569)
!566 = distinct !DISubprogram(name: "k_spin_lock", scope: !241, file: !241, line: 160, type: !567, scopeLine: 161, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !570)
!567 = !DISubroutineType(types: !568)
!568 = !{!552, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!570 = !{!565, !571}
!571 = !DILocalVariable(name: "k", scope: !566, file: !241, line: 163, type: !552)
!572 = !DILocation(line: 160, column: 94, scope: !566, inlinedAt: !573)
!573 = distinct !DILocation(line: 101, column: 25, scope: !548)
!574 = !DILocation(line: 162, column: 9, scope: !566, inlinedAt: !573)
!575 = !DILocation(line: 163, column: 19, scope: !566, inlinedAt: !573)
!576 = !DILocation(line: 44, column: 2, scope: !577, inlinedAt: !583)
!577 = distinct !DISubprogram(name: "arch_irq_lock", scope: !578, file: !578, line: 42, type: !579, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !581)
!578 = !DIFile(filename: "include/zephyr/arch/arm/asm_inline_gcc.h", directory: "/home/sri/zephyrproject/zephyr")
!579 = !DISubroutineType(types: !580)
!580 = !{!112}
!581 = !{!582}
!582 = !DILocalVariable(name: "key", scope: !577, file: !578, line: 44, type: !112)
!583 = distinct !DILocation(line: 169, column: 10, scope: !566, inlinedAt: !573)
!584 = !DILocation(line: 44, column: 15, scope: !577, inlinedAt: !583)
!585 = !DILocation(line: 48, column: 2, scope: !577, inlinedAt: !583)
!586 = !{i64 66945}
!587 = !DILocation(line: 80, column: 9, scope: !577, inlinedAt: !583)
!588 = !DILocation(line: 81, column: 1, scope: !577, inlinedAt: !583)
!589 = !DILocation(line: 169, column: 8, scope: !566, inlinedAt: !573)
!590 = !DILocation(line: 171, column: 26, scope: !566, inlinedAt: !573)
!591 = !DILocalVariable(name: "l", arg: 1, scope: !592, file: !241, line: 110, type: !569)
!592 = distinct !DISubprogram(name: "z_spinlock_validate_pre", scope: !241, file: !241, line: 110, type: !593, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !595)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !569}
!595 = !{!591}
!596 = !DILocation(line: 110, column: 94, scope: !592, inlinedAt: !597)
!597 = distinct !DILocation(line: 171, column: 2, scope: !566, inlinedAt: !573)
!598 = !DILocation(line: 112, column: 9, scope: !592, inlinedAt: !597)
!599 = !DILocation(line: 177, column: 27, scope: !566, inlinedAt: !573)
!600 = !DILocalVariable(name: "l", arg: 1, scope: !601, file: !241, line: 121, type: !569)
!601 = distinct !DISubprogram(name: "z_spinlock_validate_post", scope: !241, file: !241, line: 121, type: !593, scopeLine: 122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !602)
!602 = !{!600}
!603 = !DILocation(line: 121, column: 95, scope: !601, inlinedAt: !604)
!604 = distinct !DILocation(line: 177, column: 2, scope: !566, inlinedAt: !573)
!605 = !DILocation(line: 123, column: 9, scope: !601, inlinedAt: !604)
!606 = !DILocation(line: 179, column: 2, scope: !566, inlinedAt: !573)
!607 = !DILocation(line: 101, column: 25, scope: !548)
!608 = !DILocation(line: 102, column: 2, scope: !548)
!609 = !DILocation(line: 102, column: 19, scope: !548)
!610 = !DILocation(line: 104, column: 48, scope: !548)
!611 = !DILocation(line: 104, column: 55, scope: !548)
!612 = !DILocation(line: 104, column: 25, scope: !548)
!613 = !DILocation(line: 104, column: 23, scope: !548)
!614 = !DILocation(line: 106, column: 6, scope: !615)
!615 = distinct !DILexicalBlock(scope: !548, file: !102, line: 106, column: 6)
!616 = !DILocation(line: 106, column: 27, scope: !615)
!617 = !DILocation(line: 106, column: 6, scope: !548)
!618 = !DILocation(line: 107, column: 25, scope: !619)
!619 = distinct !DILexicalBlock(scope: !615, file: !102, line: 106, column: 33)
!620 = !DILocation(line: 107, column: 3, scope: !619)
!621 = !DILocation(line: 108, column: 2, scope: !619)
!622 = !DILocation(line: 110, column: 21, scope: !548)
!623 = !DILocation(line: 110, column: 2, scope: !548)
!624 = !DILocation(line: 111, column: 16, scope: !548)
!625 = !DILocation(line: 111, column: 23, scope: !548)
!626 = !DILocation(line: 111, column: 2, scope: !548)
!627 = !DILocation(line: 112, column: 1, scope: !548)
!628 = !DISubprogram(name: "z_unpend_first_thread", scope: !629, file: !629, line: 53, type: !630, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !242)
!629 = !DIFile(filename: "kernel/include/ksched.h", directory: "/home/sri/zephyrproject/zephyr")
!630 = !DISubroutineType(types: !631)
!631 = !{!149, !170}
!632 = distinct !DISubprogram(name: "prepare_thread_to_run", scope: !102, file: !102, line: 81, type: !633, scopeLine: 82, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !635)
!633 = !DISubroutineType(types: !634)
!634 = !{null, !149, !114}
!635 = !{!636, !637}
!636 = !DILocalVariable(name: "thread", arg: 1, scope: !632, file: !102, line: 81, type: !149)
!637 = !DILocalVariable(name: "data", arg: 2, scope: !632, file: !102, line: 81, type: !114)
!638 = !DILocation(line: 81, column: 52, scope: !632)
!639 = !DILocation(line: 81, column: 66, scope: !632)
!640 = !DILocation(line: 83, column: 38, scope: !632)
!641 = !DILocation(line: 83, column: 49, scope: !632)
!642 = !DILocalVariable(name: "thread", arg: 1, scope: !643, file: !644, line: 137, type: !149)
!643 = distinct !DISubprogram(name: "z_thread_return_value_set_with_data", scope: !644, file: !644, line: 137, type: !645, scopeLine: 140, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !647)
!644 = !DIFile(filename: "kernel/include/kernel_internal.h", directory: "/home/sri/zephyrproject/zephyr")
!645 = !DISubroutineType(types: !646)
!646 = !{null, !149, !112, !114}
!647 = !{!642, !648, !649}
!648 = !DILocalVariable(name: "value", arg: 2, scope: !643, file: !644, line: 138, type: !112)
!649 = !DILocalVariable(name: "data", arg: 3, scope: !643, file: !644, line: 139, type: !114)
!650 = !DILocation(line: 137, column: 54, scope: !643, inlinedAt: !651)
!651 = distinct !DILocation(line: 83, column: 2, scope: !632)
!652 = !DILocation(line: 138, column: 21, scope: !643, inlinedAt: !651)
!653 = !DILocation(line: 139, column: 14, scope: !643, inlinedAt: !651)
!654 = !DILocation(line: 141, column: 31, scope: !643, inlinedAt: !651)
!655 = !DILocation(line: 141, column: 39, scope: !643, inlinedAt: !651)
!656 = !DILocalVariable(name: "thread", arg: 1, scope: !657, file: !658, line: 59, type: !149)
!657 = distinct !DISubprogram(name: "arch_thread_return_value_set", scope: !658, file: !658, line: 59, type: !659, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !661)
!658 = !DIFile(filename: "arch/arm/include/cortex_m/kernel_arch_func.h", directory: "/home/sri/zephyrproject/zephyr")
!659 = !DISubroutineType(types: !660)
!660 = !{null, !149, !112}
!661 = !{!656, !662}
!662 = !DILocalVariable(name: "value", arg: 2, scope: !657, file: !658, line: 59, type: !112)
!663 = !DILocation(line: 59, column: 47, scope: !657, inlinedAt: !664)
!664 = distinct !DILocation(line: 141, column: 2, scope: !643, inlinedAt: !651)
!665 = !DILocation(line: 59, column: 68, scope: !657, inlinedAt: !664)
!666 = !DILocation(line: 61, column: 35, scope: !657, inlinedAt: !664)
!667 = !DILocation(line: 61, column: 2, scope: !657, inlinedAt: !664)
!668 = !DILocation(line: 61, column: 10, scope: !657, inlinedAt: !664)
!669 = !DILocation(line: 61, column: 15, scope: !657, inlinedAt: !664)
!670 = !DILocation(line: 61, column: 33, scope: !657, inlinedAt: !664)
!671 = !DILocation(line: 142, column: 27, scope: !643, inlinedAt: !651)
!672 = !DILocation(line: 142, column: 2, scope: !643, inlinedAt: !651)
!673 = !DILocation(line: 142, column: 15, scope: !643, inlinedAt: !651)
!674 = !DILocation(line: 142, column: 25, scope: !643, inlinedAt: !651)
!675 = !DILocation(line: 84, column: 17, scope: !632)
!676 = !DILocation(line: 84, column: 2, scope: !632)
!677 = !DILocation(line: 85, column: 1, scope: !632)
!678 = distinct !DISubprogram(name: "handle_poll_events", scope: !102, file: !102, line: 87, type: !679, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !681)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !369, !111}
!681 = !{!682, !683}
!682 = !DILocalVariable(name: "queue", arg: 1, scope: !678, file: !102, line: 87, type: !369)
!683 = !DILocalVariable(name: "state", arg: 2, scope: !678, file: !102, line: 87, type: !111)
!684 = !DILocation(line: 87, column: 55, scope: !678)
!685 = !DILocation(line: 87, column: 71, scope: !678)
!686 = !DILocation(line: 92, column: 9, scope: !678)
!687 = !DILocation(line: 93, column: 9, scope: !678)
!688 = !DILocation(line: 95, column: 1, scope: !678)
!689 = !DISubprogram(name: "z_reschedule", scope: !629, file: !629, line: 51, type: !690, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !242)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !569, !552}
!692 = distinct !DISubprogram(name: "k_queue_insert", scope: !102, file: !102, line: 178, type: !693, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !695)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !369, !114, !114}
!695 = !{!696, !697, !698}
!696 = !DILocalVariable(name: "queue", arg: 1, scope: !692, file: !102, line: 178, type: !369)
!697 = !DILocalVariable(name: "prev", arg: 2, scope: !692, file: !102, line: 178, type: !114)
!698 = !DILocalVariable(name: "data", arg: 3, scope: !692, file: !102, line: 178, type: !114)
!699 = !DILocation(line: 178, column: 37, scope: !692)
!700 = !DILocation(line: 178, column: 50, scope: !692)
!701 = !DILocation(line: 178, column: 62, scope: !692)
!702 = !DILocation(line: 180, column: 2, scope: !692)
!703 = !DILocation(line: 180, column: 7, scope: !704)
!704 = distinct !DILexicalBlock(scope: !692, file: !102, line: 180, column: 5)
!705 = !DILocation(line: 182, column: 21, scope: !692)
!706 = !DILocation(line: 182, column: 28, scope: !692)
!707 = !DILocation(line: 182, column: 34, scope: !692)
!708 = !DILocation(line: 182, column: 8, scope: !692)
!709 = !DILocation(line: 184, column: 2, scope: !692)
!710 = !DILocation(line: 184, column: 7, scope: !711)
!711 = distinct !DILexicalBlock(scope: !692, file: !102, line: 184, column: 5)
!712 = !DILocation(line: 185, column: 1, scope: !692)
!713 = distinct !DISubprogram(name: "queue_insert", scope: !102, file: !102, line: 123, type: !714, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !717)
!714 = !DISubroutineType(types: !715)
!715 = !{!716, !369, !114, !114, !118, !118}
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !99, line: 58, baseType: !120)
!717 = !{!718, !719, !720, !721, !722, !723, !724, !725}
!718 = !DILocalVariable(name: "queue", arg: 1, scope: !713, file: !102, line: 123, type: !369)
!719 = !DILocalVariable(name: "prev", arg: 2, scope: !713, file: !102, line: 123, type: !114)
!720 = !DILocalVariable(name: "data", arg: 3, scope: !713, file: !102, line: 123, type: !114)
!721 = !DILocalVariable(name: "alloc", arg: 4, scope: !713, file: !102, line: 124, type: !118)
!722 = !DILocalVariable(name: "is_append", arg: 5, scope: !713, file: !102, line: 124, type: !118)
!723 = !DILocalVariable(name: "first_pending_thread", scope: !713, file: !102, line: 126, type: !149)
!724 = !DILocalVariable(name: "key", scope: !713, file: !102, line: 127, type: !552)
!725 = !DILocalVariable(name: "anode", scope: !726, file: !102, line: 149, type: !100)
!726 = distinct !DILexicalBlock(scope: !727, file: !102, line: 148, column: 13)
!727 = distinct !DILexicalBlock(scope: !713, file: !102, line: 148, column: 6)
!728 = !DILocation(line: 123, column: 45, scope: !713)
!729 = !DILocation(line: 123, column: 58, scope: !713)
!730 = !DILocation(line: 123, column: 70, scope: !713)
!731 = !DILocation(line: 124, column: 14, scope: !713)
!732 = !DILocation(line: 124, column: 27, scope: !713)
!733 = !DILocation(line: 126, column: 2, scope: !713)
!734 = !DILocation(line: 126, column: 19, scope: !713)
!735 = !DILocation(line: 127, column: 2, scope: !713)
!736 = !DILocation(line: 127, column: 19, scope: !713)
!737 = !DILocation(line: 127, column: 38, scope: !713)
!738 = !DILocation(line: 127, column: 45, scope: !713)
!739 = !DILocation(line: 160, column: 94, scope: !566, inlinedAt: !740)
!740 = distinct !DILocation(line: 127, column: 25, scope: !713)
!741 = !DILocation(line: 162, column: 9, scope: !566, inlinedAt: !740)
!742 = !DILocation(line: 163, column: 19, scope: !566, inlinedAt: !740)
!743 = !DILocation(line: 44, column: 2, scope: !577, inlinedAt: !744)
!744 = distinct !DILocation(line: 169, column: 10, scope: !566, inlinedAt: !740)
!745 = !DILocation(line: 44, column: 15, scope: !577, inlinedAt: !744)
!746 = !DILocation(line: 48, column: 2, scope: !577, inlinedAt: !744)
!747 = !DILocation(line: 80, column: 9, scope: !577, inlinedAt: !744)
!748 = !DILocation(line: 81, column: 1, scope: !577, inlinedAt: !744)
!749 = !DILocation(line: 169, column: 8, scope: !566, inlinedAt: !740)
!750 = !DILocation(line: 171, column: 26, scope: !566, inlinedAt: !740)
!751 = !DILocation(line: 110, column: 94, scope: !592, inlinedAt: !752)
!752 = distinct !DILocation(line: 171, column: 2, scope: !566, inlinedAt: !740)
!753 = !DILocation(line: 112, column: 9, scope: !592, inlinedAt: !752)
!754 = !DILocation(line: 177, column: 27, scope: !566, inlinedAt: !740)
!755 = !DILocation(line: 121, column: 95, scope: !601, inlinedAt: !756)
!756 = distinct !DILocation(line: 177, column: 2, scope: !566, inlinedAt: !740)
!757 = !DILocation(line: 123, column: 9, scope: !601, inlinedAt: !756)
!758 = !DILocation(line: 179, column: 2, scope: !566, inlinedAt: !740)
!759 = !DILocation(line: 127, column: 25, scope: !713)
!760 = !DILocation(line: 129, column: 2, scope: !713)
!761 = !DILocation(line: 129, column: 7, scope: !762)
!762 = distinct !DILexicalBlock(scope: !713, file: !102, line: 129, column: 5)
!763 = !DILocation(line: 131, column: 6, scope: !764)
!764 = distinct !DILexicalBlock(scope: !713, file: !102, line: 131, column: 6)
!765 = !DILocation(line: 131, column: 6, scope: !713)
!766 = !DILocation(line: 132, column: 32, scope: !767)
!767 = distinct !DILexicalBlock(scope: !764, file: !102, line: 131, column: 17)
!768 = !DILocation(line: 132, column: 39, scope: !767)
!769 = !DILocation(line: 132, column: 10, scope: !767)
!770 = !DILocation(line: 132, column: 8, scope: !767)
!771 = !DILocation(line: 133, column: 2, scope: !767)
!772 = !DILocation(line: 134, column: 48, scope: !713)
!773 = !DILocation(line: 134, column: 55, scope: !713)
!774 = !DILocation(line: 134, column: 25, scope: !713)
!775 = !DILocation(line: 134, column: 23, scope: !713)
!776 = !DILocation(line: 136, column: 6, scope: !777)
!777 = distinct !DILexicalBlock(scope: !713, file: !102, line: 136, column: 6)
!778 = !DILocation(line: 136, column: 27, scope: !777)
!779 = !DILocation(line: 136, column: 6, scope: !713)
!780 = !DILocation(line: 137, column: 3, scope: !781)
!781 = distinct !DILexicalBlock(scope: !777, file: !102, line: 136, column: 33)
!782 = !DILocation(line: 137, column: 8, scope: !783)
!783 = distinct !DILexicalBlock(scope: !781, file: !102, line: 137, column: 6)
!784 = !DILocation(line: 139, column: 25, scope: !781)
!785 = !DILocation(line: 139, column: 47, scope: !781)
!786 = !DILocation(line: 139, column: 3, scope: !781)
!787 = !DILocation(line: 140, column: 17, scope: !781)
!788 = !DILocation(line: 140, column: 24, scope: !781)
!789 = !DILocation(line: 140, column: 3, scope: !781)
!790 = !DILocation(line: 142, column: 3, scope: !781)
!791 = !DILocation(line: 142, column: 8, scope: !792)
!792 = distinct !DILexicalBlock(scope: !781, file: !102, line: 142, column: 6)
!793 = !DILocation(line: 144, column: 3, scope: !781)
!794 = !DILocation(line: 148, column: 6, scope: !727)
!795 = !DILocation(line: 148, column: 6, scope: !713)
!796 = !DILocation(line: 149, column: 3, scope: !726)
!797 = !DILocation(line: 149, column: 22, scope: !726)
!798 = !DILocation(line: 151, column: 11, scope: !726)
!799 = !DILocation(line: 151, column: 9, scope: !726)
!800 = !DILocation(line: 152, column: 7, scope: !801)
!801 = distinct !DILexicalBlock(scope: !726, file: !102, line: 152, column: 7)
!802 = !DILocation(line: 152, column: 13, scope: !801)
!803 = !DILocation(line: 152, column: 7, scope: !726)
!804 = !DILocation(line: 153, column: 19, scope: !805)
!805 = distinct !DILexicalBlock(scope: !801, file: !102, line: 152, column: 19)
!806 = !DILocation(line: 153, column: 26, scope: !805)
!807 = !DILocation(line: 153, column: 4, scope: !805)
!808 = !DILocalVariable(name: "l", arg: 1, scope: !809, file: !241, line: 235, type: !569)
!809 = distinct !DISubprogram(name: "k_spin_unlock", scope: !241, file: !241, line: 235, type: !690, scopeLine: 237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !810)
!810 = !{!808, !811}
!811 = !DILocalVariable(name: "key", arg: 2, scope: !809, file: !241, line: 236, type: !552)
!812 = !DILocation(line: 235, column: 84, scope: !809, inlinedAt: !813)
!813 = distinct !DILocation(line: 153, column: 4, scope: !805)
!814 = !DILocation(line: 236, column: 23, scope: !809, inlinedAt: !813)
!815 = !DILocation(line: 238, column: 9, scope: !809, inlinedAt: !813)
!816 = !DILocation(line: 261, column: 22, scope: !809, inlinedAt: !813)
!817 = !DILocalVariable(name: "key", arg: 1, scope: !818, file: !578, line: 88, type: !112)
!818 = distinct !DISubprogram(name: "arch_irq_unlock", scope: !578, file: !578, line: 88, type: !819, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !821)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !112}
!821 = !{!817}
!822 = !DILocation(line: 88, column: 80, scope: !818, inlinedAt: !823)
!823 = distinct !DILocation(line: 261, column: 2, scope: !809, inlinedAt: !813)
!824 = !DILocation(line: 91, column: 6, scope: !825, inlinedAt: !823)
!825 = distinct !DILexicalBlock(scope: !818, file: !578, line: 91, column: 6)
!826 = !DILocation(line: 91, column: 10, scope: !825, inlinedAt: !823)
!827 = !DILocation(line: 91, column: 6, scope: !818, inlinedAt: !823)
!828 = !DILocation(line: 92, column: 3, scope: !829, inlinedAt: !823)
!829 = distinct !DILexicalBlock(scope: !825, file: !578, line: 91, column: 17)
!830 = !DILocation(line: 94, column: 2, scope: !818, inlinedAt: !823)
!831 = !{i64 67249}
!832 = !DILocation(line: 114, column: 1, scope: !818, inlinedAt: !823)
!833 = !DILocation(line: 155, column: 4, scope: !805)
!834 = !DILocation(line: 155, column: 9, scope: !835)
!835 = distinct !DILexicalBlock(scope: !805, file: !102, line: 155, column: 7)
!836 = !DILocation(line: 158, column: 4, scope: !805)
!837 = !DILocation(line: 160, column: 17, scope: !726)
!838 = !DILocation(line: 160, column: 3, scope: !726)
!839 = !DILocation(line: 160, column: 10, scope: !726)
!840 = !DILocation(line: 160, column: 15, scope: !726)
!841 = !DILocation(line: 161, column: 20, scope: !726)
!842 = !DILocation(line: 161, column: 27, scope: !726)
!843 = !DILocation(line: 161, column: 3, scope: !726)
!844 = !DILocation(line: 162, column: 10, scope: !726)
!845 = !DILocation(line: 162, column: 8, scope: !726)
!846 = !DILocation(line: 163, column: 2, scope: !727)
!847 = !DILocation(line: 163, column: 2, scope: !726)
!848 = !DILocation(line: 164, column: 19, scope: !849)
!849 = distinct !DILexicalBlock(scope: !727, file: !102, line: 163, column: 9)
!850 = !DILocation(line: 164, column: 3, scope: !849)
!851 = !DILocation(line: 167, column: 2, scope: !713)
!852 = !DILocation(line: 167, column: 7, scope: !853)
!853 = distinct !DILexicalBlock(scope: !713, file: !102, line: 167, column: 5)
!854 = !DILocation(line: 169, column: 21, scope: !713)
!855 = !DILocation(line: 169, column: 28, scope: !713)
!856 = !DILocation(line: 169, column: 36, scope: !713)
!857 = !DILocation(line: 169, column: 42, scope: !713)
!858 = !DILocation(line: 169, column: 2, scope: !713)
!859 = !DILocation(line: 170, column: 21, scope: !713)
!860 = !DILocation(line: 170, column: 2, scope: !713)
!861 = !DILocation(line: 171, column: 16, scope: !713)
!862 = !DILocation(line: 171, column: 23, scope: !713)
!863 = !DILocation(line: 171, column: 2, scope: !713)
!864 = !DILocation(line: 173, column: 2, scope: !713)
!865 = !DILocation(line: 173, column: 7, scope: !866)
!866 = distinct !DILexicalBlock(scope: !713, file: !102, line: 173, column: 5)
!867 = !DILocation(line: 175, column: 2, scope: !713)
!868 = !DILocation(line: 176, column: 1, scope: !713)
!869 = distinct !DISubprogram(name: "k_queue_append", scope: !102, file: !102, line: 187, type: !870, scopeLine: 188, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !872)
!870 = !DISubroutineType(types: !871)
!871 = !{null, !369, !114}
!872 = !{!873, !874}
!873 = !DILocalVariable(name: "queue", arg: 1, scope: !869, file: !102, line: 187, type: !369)
!874 = !DILocalVariable(name: "data", arg: 2, scope: !869, file: !102, line: 187, type: !114)
!875 = !DILocation(line: 187, column: 37, scope: !869)
!876 = !DILocation(line: 187, column: 50, scope: !869)
!877 = !DILocation(line: 189, column: 2, scope: !869)
!878 = !DILocation(line: 189, column: 7, scope: !879)
!879 = distinct !DILexicalBlock(scope: !869, file: !102, line: 189, column: 5)
!880 = !DILocation(line: 191, column: 21, scope: !869)
!881 = !DILocation(line: 191, column: 31, scope: !869)
!882 = !DILocation(line: 191, column: 8, scope: !869)
!883 = !DILocation(line: 193, column: 2, scope: !869)
!884 = !DILocation(line: 193, column: 7, scope: !885)
!885 = distinct !DILexicalBlock(scope: !869, file: !102, line: 193, column: 5)
!886 = !DILocation(line: 194, column: 1, scope: !869)
!887 = distinct !DISubprogram(name: "k_queue_prepend", scope: !102, file: !102, line: 196, type: !870, scopeLine: 197, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !888)
!888 = !{!889, !890}
!889 = !DILocalVariable(name: "queue", arg: 1, scope: !887, file: !102, line: 196, type: !369)
!890 = !DILocalVariable(name: "data", arg: 2, scope: !887, file: !102, line: 196, type: !114)
!891 = !DILocation(line: 196, column: 38, scope: !887)
!892 = !DILocation(line: 196, column: 51, scope: !887)
!893 = !DILocation(line: 198, column: 2, scope: !887)
!894 = !DILocation(line: 198, column: 7, scope: !895)
!895 = distinct !DILexicalBlock(scope: !887, file: !102, line: 198, column: 5)
!896 = !DILocation(line: 200, column: 21, scope: !887)
!897 = !DILocation(line: 200, column: 31, scope: !887)
!898 = !DILocation(line: 200, column: 8, scope: !887)
!899 = !DILocation(line: 202, column: 2, scope: !887)
!900 = !DILocation(line: 202, column: 7, scope: !901)
!901 = distinct !DILexicalBlock(scope: !887, file: !102, line: 202, column: 5)
!902 = !DILocation(line: 203, column: 1, scope: !887)
!903 = distinct !DISubprogram(name: "z_impl_k_queue_alloc_append", scope: !102, file: !102, line: 205, type: !904, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !906)
!904 = !DISubroutineType(types: !905)
!905 = !{!716, !369, !114}
!906 = !{!907, !908, !909}
!907 = !DILocalVariable(name: "queue", arg: 1, scope: !903, file: !102, line: 205, type: !369)
!908 = !DILocalVariable(name: "data", arg: 2, scope: !903, file: !102, line: 205, type: !114)
!909 = !DILocalVariable(name: "ret", scope: !903, file: !102, line: 209, type: !716)
!910 = !DILocation(line: 205, column: 53, scope: !903)
!911 = !DILocation(line: 205, column: 66, scope: !903)
!912 = !DILocation(line: 207, column: 2, scope: !903)
!913 = !DILocation(line: 207, column: 7, scope: !914)
!914 = distinct !DILexicalBlock(scope: !903, file: !102, line: 207, column: 5)
!915 = !DILocation(line: 209, column: 2, scope: !903)
!916 = !DILocation(line: 209, column: 10, scope: !903)
!917 = !DILocation(line: 209, column: 29, scope: !903)
!918 = !DILocation(line: 209, column: 39, scope: !903)
!919 = !DILocation(line: 209, column: 16, scope: !903)
!920 = !DILocation(line: 211, column: 2, scope: !903)
!921 = !DILocation(line: 211, column: 7, scope: !922)
!922 = distinct !DILexicalBlock(scope: !903, file: !102, line: 211, column: 5)
!923 = !DILocation(line: 213, column: 9, scope: !903)
!924 = !DILocation(line: 214, column: 1, scope: !903)
!925 = !DILocation(line: 213, column: 2, scope: !903)
!926 = distinct !DISubprogram(name: "z_impl_k_queue_alloc_prepend", scope: !102, file: !102, line: 226, type: !904, scopeLine: 227, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !927)
!927 = !{!928, !929, !930}
!928 = !DILocalVariable(name: "queue", arg: 1, scope: !926, file: !102, line: 226, type: !369)
!929 = !DILocalVariable(name: "data", arg: 2, scope: !926, file: !102, line: 226, type: !114)
!930 = !DILocalVariable(name: "ret", scope: !926, file: !102, line: 230, type: !716)
!931 = !DILocation(line: 226, column: 54, scope: !926)
!932 = !DILocation(line: 226, column: 67, scope: !926)
!933 = !DILocation(line: 228, column: 2, scope: !926)
!934 = !DILocation(line: 228, column: 7, scope: !935)
!935 = distinct !DILexicalBlock(scope: !926, file: !102, line: 228, column: 5)
!936 = !DILocation(line: 230, column: 2, scope: !926)
!937 = !DILocation(line: 230, column: 10, scope: !926)
!938 = !DILocation(line: 230, column: 29, scope: !926)
!939 = !DILocation(line: 230, column: 39, scope: !926)
!940 = !DILocation(line: 230, column: 16, scope: !926)
!941 = !DILocation(line: 232, column: 2, scope: !926)
!942 = !DILocation(line: 232, column: 7, scope: !943)
!943 = distinct !DILexicalBlock(scope: !926, file: !102, line: 232, column: 5)
!944 = !DILocation(line: 234, column: 9, scope: !926)
!945 = !DILocation(line: 235, column: 1, scope: !926)
!946 = !DILocation(line: 234, column: 2, scope: !926)
!947 = distinct !DISubprogram(name: "k_queue_append_list", scope: !102, file: !102, line: 247, type: !948, scopeLine: 248, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !950)
!948 = !DISubroutineType(types: !949)
!949 = !{!120, !369, !114, !114}
!950 = !{!951, !952, !953, !954, !955}
!951 = !DILocalVariable(name: "queue", arg: 1, scope: !947, file: !102, line: 247, type: !369)
!952 = !DILocalVariable(name: "head", arg: 2, scope: !947, file: !102, line: 247, type: !114)
!953 = !DILocalVariable(name: "tail", arg: 3, scope: !947, file: !102, line: 247, type: !114)
!954 = !DILocalVariable(name: "key", scope: !947, file: !102, line: 258, type: !552)
!955 = !DILocalVariable(name: "thread", scope: !947, file: !102, line: 259, type: !149)
!956 = !DILocation(line: 247, column: 41, scope: !947)
!957 = !DILocation(line: 247, column: 54, scope: !947)
!958 = !DILocation(line: 247, column: 66, scope: !947)
!959 = !DILocation(line: 249, column: 2, scope: !947)
!960 = !DILocation(line: 249, column: 7, scope: !961)
!961 = distinct !DILexicalBlock(scope: !947, file: !102, line: 249, column: 5)
!962 = !DILocation(line: 252, column: 6, scope: !963)
!963 = distinct !DILexicalBlock(scope: !947, file: !102, line: 252, column: 6)
!964 = !DILocation(line: 252, column: 11, scope: !963)
!965 = !DILocation(line: 252, column: 16, scope: !963)
!966 = !DILocation(line: 252, column: 19, scope: !963)
!967 = !DILocation(line: 252, column: 24, scope: !963)
!968 = !DILocation(line: 252, column: 6, scope: !947)
!969 = !DILocation(line: 253, column: 3, scope: !970)
!970 = distinct !DILexicalBlock(scope: !963, file: !102, line: 252, column: 30)
!971 = !DILocation(line: 253, column: 8, scope: !972)
!972 = distinct !DILexicalBlock(scope: !970, file: !102, line: 253, column: 6)
!973 = !DILocation(line: 255, column: 3, scope: !970)
!974 = !DILocation(line: 258, column: 2, scope: !947)
!975 = !DILocation(line: 258, column: 19, scope: !947)
!976 = !DILocation(line: 258, column: 38, scope: !947)
!977 = !DILocation(line: 258, column: 45, scope: !947)
!978 = !DILocation(line: 160, column: 94, scope: !566, inlinedAt: !979)
!979 = distinct !DILocation(line: 258, column: 25, scope: !947)
!980 = !DILocation(line: 162, column: 9, scope: !566, inlinedAt: !979)
!981 = !DILocation(line: 163, column: 19, scope: !566, inlinedAt: !979)
!982 = !DILocation(line: 44, column: 2, scope: !577, inlinedAt: !983)
!983 = distinct !DILocation(line: 169, column: 10, scope: !566, inlinedAt: !979)
!984 = !DILocation(line: 44, column: 15, scope: !577, inlinedAt: !983)
!985 = !DILocation(line: 48, column: 2, scope: !577, inlinedAt: !983)
!986 = !DILocation(line: 80, column: 9, scope: !577, inlinedAt: !983)
!987 = !DILocation(line: 81, column: 1, scope: !577, inlinedAt: !983)
!988 = !DILocation(line: 169, column: 8, scope: !566, inlinedAt: !979)
!989 = !DILocation(line: 171, column: 26, scope: !566, inlinedAt: !979)
!990 = !DILocation(line: 110, column: 94, scope: !592, inlinedAt: !991)
!991 = distinct !DILocation(line: 171, column: 2, scope: !566, inlinedAt: !979)
!992 = !DILocation(line: 112, column: 9, scope: !592, inlinedAt: !991)
!993 = !DILocation(line: 177, column: 27, scope: !566, inlinedAt: !979)
!994 = !DILocation(line: 121, column: 95, scope: !601, inlinedAt: !995)
!995 = distinct !DILocation(line: 177, column: 2, scope: !566, inlinedAt: !979)
!996 = !DILocation(line: 123, column: 9, scope: !601, inlinedAt: !995)
!997 = !DILocation(line: 179, column: 2, scope: !566, inlinedAt: !979)
!998 = !DILocation(line: 258, column: 25, scope: !947)
!999 = !DILocation(line: 259, column: 2, scope: !947)
!1000 = !DILocation(line: 259, column: 19, scope: !947)
!1001 = !DILocation(line: 261, column: 6, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !947, file: !102, line: 261, column: 6)
!1003 = !DILocation(line: 261, column: 11, scope: !1002)
!1004 = !DILocation(line: 261, column: 6, scope: !947)
!1005 = !DILocation(line: 262, column: 35, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1002, file: !102, line: 261, column: 17)
!1007 = !DILocation(line: 262, column: 42, scope: !1006)
!1008 = !DILocation(line: 262, column: 12, scope: !1006)
!1009 = !DILocation(line: 262, column: 10, scope: !1006)
!1010 = !DILocation(line: 263, column: 2, scope: !1006)
!1011 = !DILocation(line: 265, column: 2, scope: !947)
!1012 = !DILocation(line: 265, column: 10, scope: !947)
!1013 = !DILocation(line: 265, column: 15, scope: !947)
!1014 = !DILocation(line: 265, column: 21, scope: !947)
!1015 = !DILocation(line: 265, column: 25, scope: !947)
!1016 = !DILocation(line: 265, column: 32, scope: !947)
!1017 = !DILocation(line: 0, scope: !947)
!1018 = !DILocation(line: 266, column: 25, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !947, file: !102, line: 265, column: 39)
!1020 = !DILocation(line: 266, column: 33, scope: !1019)
!1021 = !DILocation(line: 266, column: 3, scope: !1019)
!1022 = !DILocation(line: 267, column: 20, scope: !1019)
!1023 = !DILocation(line: 267, column: 10, scope: !1019)
!1024 = !DILocation(line: 267, column: 8, scope: !1019)
!1025 = !DILocation(line: 268, column: 35, scope: !1019)
!1026 = !DILocation(line: 268, column: 42, scope: !1019)
!1027 = !DILocation(line: 268, column: 12, scope: !1019)
!1028 = !DILocation(line: 268, column: 10, scope: !1019)
!1029 = distinct !{!1029, !1011, !1030}
!1030 = !DILocation(line: 269, column: 2, scope: !947)
!1031 = !DILocation(line: 271, column: 6, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !947, file: !102, line: 271, column: 6)
!1033 = !DILocation(line: 271, column: 11, scope: !1032)
!1034 = !DILocation(line: 271, column: 6, scope: !947)
!1035 = !DILocation(line: 272, column: 27, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1032, file: !102, line: 271, column: 17)
!1037 = !DILocation(line: 272, column: 34, scope: !1036)
!1038 = !DILocation(line: 272, column: 42, scope: !1036)
!1039 = !DILocation(line: 272, column: 48, scope: !1036)
!1040 = !DILocation(line: 272, column: 3, scope: !1036)
!1041 = !DILocation(line: 273, column: 2, scope: !1036)
!1042 = !DILocation(line: 275, column: 2, scope: !947)
!1043 = !DILocation(line: 275, column: 7, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !947, file: !102, line: 275, column: 5)
!1045 = !DILocation(line: 277, column: 21, scope: !947)
!1046 = !DILocation(line: 277, column: 2, scope: !947)
!1047 = !DILocation(line: 278, column: 16, scope: !947)
!1048 = !DILocation(line: 278, column: 23, scope: !947)
!1049 = !DILocation(line: 278, column: 2, scope: !947)
!1050 = !DILocation(line: 279, column: 2, scope: !947)
!1051 = !DILocation(line: 280, column: 1, scope: !947)
!1052 = distinct !DISubprogram(name: "sys_sflist_append_list", scope: !106, file: !106, line: 403, type: !1053, scopeLine: 403, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1055)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{null, !520, !114, !114}
!1055 = !{!1056, !1057, !1058}
!1056 = !DILocalVariable(name: "list", arg: 1, scope: !1052, file: !106, line: 403, type: !520)
!1057 = !DILocalVariable(name: "head", arg: 2, scope: !1052, file: !106, line: 403, type: !114)
!1058 = !DILocalVariable(name: "tail", arg: 3, scope: !1052, file: !106, line: 403, type: !114)
!1059 = !DILocation(line: 403, column: 57, scope: !1052)
!1060 = !DILocation(line: 403, column: 69, scope: !1052)
!1061 = !DILocation(line: 403, column: 81, scope: !1052)
!1062 = !DILocation(line: 403, column: 93, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1052, file: !106, line: 403, column: 93)
!1064 = !DILocation(line: 403, column: 98, scope: !1063)
!1065 = !DILocation(line: 403, column: 112, scope: !1063)
!1066 = !DILocation(line: 403, column: 115, scope: !1063)
!1067 = !DILocation(line: 403, column: 120, scope: !1063)
!1068 = !DILocation(line: 403, column: 93, scope: !1052)
!1069 = !DILocation(line: 403, column: 162, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !106, line: 403, column: 141)
!1071 = distinct !DILexicalBlock(scope: !1063, file: !106, line: 403, column: 135)
!1072 = !DILocation(line: 403, column: 141, scope: !1070)
!1073 = !DILocation(line: 403, column: 168, scope: !1070)
!1074 = !DILocation(line: 403, column: 141, scope: !1071)
!1075 = !DILocation(line: 403, column: 203, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1070, file: !106, line: 403, column: 183)
!1077 = !DILocation(line: 403, column: 225, scope: !1076)
!1078 = !DILocation(line: 403, column: 185, scope: !1076)
!1079 = !DILocation(line: 403, column: 232, scope: !1076)
!1080 = !DILocation(line: 403, column: 281, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1070, file: !106, line: 403, column: 239)
!1082 = !DILocation(line: 403, column: 260, scope: !1081)
!1083 = !DILocation(line: 403, column: 304, scope: !1081)
!1084 = !DILocation(line: 403, column: 241, scope: !1081)
!1085 = !DILocation(line: 403, column: 331, scope: !1071)
!1086 = !DILocation(line: 403, column: 353, scope: !1071)
!1087 = !DILocation(line: 403, column: 313, scope: !1071)
!1088 = !DILocation(line: 403, column: 360, scope: !1071)
!1089 = !DILocation(line: 403, column: 362, scope: !1052)
!1090 = distinct !DISubprogram(name: "k_queue_merge_slist", scope: !102, file: !102, line: 282, type: !1091, scopeLine: 283, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1106)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!120, !369, !1093}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 32)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !1095, line: 49, baseType: !1096)
!1095 = !DIFile(filename: "include/zephyr/sys/slist.h", directory: "/home/sri/zephyrproject/zephyr")
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !1095, line: 42, size: 64, elements: !1097)
!1097 = !{!1098, !1105}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1096, file: !1095, line: 43, baseType: !1099, size: 32)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !1095, line: 39, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !1095, line: 33, size: 32, elements: !1102)
!1102 = !{!1103}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1101, file: !1095, line: 34, baseType: !1104, size: 32)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1096, file: !1095, line: 44, baseType: !1099, size: 32, offset: 32)
!1106 = !{!1107, !1108, !1109}
!1107 = !DILocalVariable(name: "queue", arg: 1, scope: !1090, file: !102, line: 282, type: !369)
!1108 = !DILocalVariable(name: "list", arg: 2, scope: !1090, file: !102, line: 282, type: !1093)
!1109 = !DILocalVariable(name: "ret", scope: !1090, file: !102, line: 284, type: !120)
!1110 = !DILocation(line: 282, column: 41, scope: !1090)
!1111 = !DILocation(line: 282, column: 61, scope: !1090)
!1112 = !DILocation(line: 284, column: 2, scope: !1090)
!1113 = !DILocation(line: 284, column: 6, scope: !1090)
!1114 = !DILocation(line: 286, column: 2, scope: !1090)
!1115 = !DILocation(line: 286, column: 7, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1090, file: !102, line: 286, column: 5)
!1117 = !DILocation(line: 289, column: 25, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1090, file: !102, line: 289, column: 6)
!1119 = !DILocation(line: 289, column: 6, scope: !1118)
!1120 = !DILocation(line: 289, column: 6, scope: !1090)
!1121 = !DILocation(line: 290, column: 3, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1118, file: !102, line: 289, column: 32)
!1123 = !DILocation(line: 290, column: 8, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1122, file: !102, line: 290, column: 6)
!1125 = !DILocation(line: 292, column: 3, scope: !1122)
!1126 = !DILocation(line: 304, column: 28, scope: !1090)
!1127 = !DILocation(line: 304, column: 35, scope: !1090)
!1128 = !DILocation(line: 304, column: 41, scope: !1090)
!1129 = !DILocation(line: 304, column: 47, scope: !1090)
!1130 = !DILocation(line: 304, column: 53, scope: !1090)
!1131 = !DILocation(line: 304, column: 8, scope: !1090)
!1132 = !DILocation(line: 304, column: 6, scope: !1090)
!1133 = !DILocation(line: 305, column: 6, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1090, file: !102, line: 305, column: 6)
!1135 = !DILocation(line: 305, column: 10, scope: !1134)
!1136 = !DILocation(line: 305, column: 6, scope: !1090)
!1137 = !DILocation(line: 306, column: 3, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1134, file: !102, line: 305, column: 16)
!1139 = !DILocation(line: 306, column: 8, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1138, file: !102, line: 306, column: 6)
!1141 = !DILocation(line: 308, column: 10, scope: !1138)
!1142 = !DILocation(line: 308, column: 3, scope: !1138)
!1143 = !DILocation(line: 310, column: 17, scope: !1090)
!1144 = !DILocation(line: 310, column: 2, scope: !1090)
!1145 = !DILocation(line: 312, column: 2, scope: !1090)
!1146 = !DILocation(line: 312, column: 7, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1090, file: !102, line: 312, column: 5)
!1148 = !DILocation(line: 314, column: 2, scope: !1090)
!1149 = !DILocation(line: 315, column: 1, scope: !1090)
!1150 = distinct !DISubprogram(name: "sys_slist_is_empty", scope: !1095, file: !1095, line: 268, type: !1151, scopeLine: 268, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1153)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!118, !1093}
!1153 = !{!1154}
!1154 = !DILocalVariable(name: "list", arg: 1, scope: !1150, file: !1095, line: 268, type: !1093)
!1155 = !DILocation(line: 268, column: 53, scope: !1150)
!1156 = !DILocation(line: 268, column: 89, scope: !1150)
!1157 = !DILocation(line: 268, column: 69, scope: !1150)
!1158 = !DILocation(line: 268, column: 95, scope: !1150)
!1159 = !DILocation(line: 268, column: 61, scope: !1150)
!1160 = distinct !DISubprogram(name: "sys_slist_init", scope: !1095, file: !1095, line: 199, type: !1161, scopeLine: 200, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1163)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{null, !1093}
!1163 = !{!1164}
