; ModuleID = '../bc_files/queue.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/queue.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.z_kernel = type { [1 x %struct._cpu], %struct._ready_q }
%struct._cpu = type { i32, ptr, ptr, ptr, i8, %struct._cpu_arch }
%struct._cpu_arch = type {}
%struct._ready_q = type { ptr, %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }

!20 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!21 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!22 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!23 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!24 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!25 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!26 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!27 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!28 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!29 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!30 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!31 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!32 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!33 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!34 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 17)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 18)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 19)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 20)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 23)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 24)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 25)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 26)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 27)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 28)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 29)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 30)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 31)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 32)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 33)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 34)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 35)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 36)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 37)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 38)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 39)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 40)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 41)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 42)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 43)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 44)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 45)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 46)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 47)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!96 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!97 = !{!98, !100, !115, !114, !117, !118, !119, !120, !121, !110}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !99, line: 62, baseType: !5)
!99 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc_node", file: !102, line: 25, size: 64, elements: !103)
!102 = !DIFile(filename: "kernel/queue.c", directory: "/home/sri/zephyrproject/zephyr")
!103 = !{!104, !113}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !101, file: !102, line: 26, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !106, line: 50, baseType: !107)
!106 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !106, line: 44, size: 32, elements: !108)
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !107, file: !106, line: 45, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !106, line: 40, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !99, line: 64, baseType: !112)
!112 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !101, file: !102, line: 27, baseType: !114, size: 32, offset: 32)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!118 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!120 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !123, line: 55, baseType: !124)
!123 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !123, line: 37, size: 64, elements: !125)
!125 = !{!126, !132}
!126 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !123, line: 38, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !123, line: 38, size: 32, elements: !128)
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !127, file: !123, line: 39, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !123, line: 40, baseType: !130, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !123, line: 42, baseType: !133, size: 32, offset: 32)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !123, line: 42, size: 32, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !133, file: !123, line: 43, baseType: !130, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !133, file: !123, line: 44, baseType: !130, size: 32)
!137 = !{i32 7, !"Dwarf Version", i32 4}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{i32 1, !"wchar_size", i32 4}
!140 = !{i32 1, !"static_rwdata", i32 1}
!141 = !{i32 1, !"enumsize_buildattr", i32 1}
!142 = !{i32 1, !"armlib_unavailable", i32 0}
!143 = !{i32 8, !"PIC Level", i32 2}
!144 = !{i32 7, !"PIE Level", i32 2}
!145 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!146 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !16, file: !16, line: 223, type: !147, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !149, !151}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !153, line: 250, size: 896, elements: !154)
!153 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!154 = !{!155, !209, !222, !223, !224, !225, !245}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !152, file: !153, line: 252, baseType: !156, size: 384)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !153, line: 58, size: 384, elements: !157)
!157 = !{!158, !171, !179, !180, !181, !194, !195, !196}
!158 = !DIDerivedType(tag: DW_TAG_member, scope: !156, file: !153, line: 61, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !156, file: !153, line: 61, size: 64, elements: !160)
!160 = !{!161, !162}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !159, file: !153, line: 62, baseType: !122, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !159, file: !153, line: 63, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !164, line: 58, size: 64, elements: !165)
!164 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !163, file: !164, line: 60, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 64, elements: !169)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!169 = !{!170}
!170 = !DISubrange(count: 2)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !156, file: !153, line: 69, baseType: !172, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !174, line: 243, baseType: !175)
!174 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !174, line: 241, size: 64, elements: !176)
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !175, file: !174, line: 242, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !123, line: 51, baseType: !124)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !156, file: !153, line: 72, baseType: !98, size: 8, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !156, file: !153, line: 75, baseType: !98, size: 8, offset: 104)
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !156, file: !153, line: 91, baseType: !182, size: 16, offset: 112)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !156, file: !153, line: 91, size: 16, elements: !183)
!183 = !{!184, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !153, line: 92, baseType: !185, size: 16)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !153, line: 92, size: 16, elements: !186)
!186 = !{!187, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !185, file: !153, line: 97, baseType: !188, size: 8)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !99, line: 56, baseType: !189)
!189 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !185, file: !153, line: 98, baseType: !98, size: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !182, file: !153, line: 101, baseType: !192, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !99, line: 63, baseType: !193)
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !156, file: !153, line: 108, baseType: !111, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !156, file: !153, line: 132, baseType: !114, size: 32, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !156, file: !153, line: 136, baseType: !197, size: 192, offset: 192)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !174, line: 254, size: 192, elements: !198)
!198 = !{!199, !200, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !197, file: !174, line: 255, baseType: !122, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !197, file: !174, line: 256, baseType: !201, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !174, line: 252, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !197, file: !174, line: 259, baseType: !207, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !99, line: 59, baseType: !208)
!208 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !152, file: !153, line: 255, baseType: !210, size: 288, offset: 384)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !211, line: 25, size: 288, elements: !212)
!211 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !210, file: !211, line: 26, baseType: !111, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !210, file: !211, line: 27, baseType: !111, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !210, file: !211, line: 28, baseType: !111, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !210, file: !211, line: 29, baseType: !111, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !210, file: !211, line: 30, baseType: !111, size: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !210, file: !211, line: 31, baseType: !111, size: 32, offset: 160)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !210, file: !211, line: 32, baseType: !111, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !210, file: !211, line: 33, baseType: !111, size: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !210, file: !211, line: 34, baseType: !111, size: 32, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !152, file: !153, line: 258, baseType: !114, size: 32, offset: 672)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !152, file: !153, line: 261, baseType: !173, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !152, file: !153, line: 302, baseType: !120, size: 32, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !152, file: !153, line: 333, baseType: !226, size: 32, offset: 800)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !4, line: 5291, size: 160, elements: !228)
!228 = !{!229, !240, !241}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !227, file: !4, line: 5292, baseType: !230, size: 96)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !231, line: 56, size: 96, elements: !232)
!231 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!232 = !{!233, !236, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !230, file: !231, line: 57, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !231, line: 57, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !230, file: !231, line: 58, baseType: !114, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !230, file: !231, line: 59, baseType: !238, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !239, line: 46, baseType: !112)
!239 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!240 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !227, file: !4, line: 5293, baseType: !173, size: 64, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !227, file: !4, line: 5294, baseType: !242, offset: 160)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !243, line: 45, elements: !244)
!243 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!244 = !{}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !152, file: !153, line: 355, baseType: !246, size: 64, offset: 832)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !211, line: 60, size: 64, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !246, file: !211, line: 63, baseType: !111, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !246, file: !211, line: 66, baseType: !111, size: 32, offset: 32)
!250 = !DILocalVariable(name: "object", arg: 1, scope: !146, file: !16, line: 223, type: !149)
!251 = !DILocation(line: 223, column: 61, scope: !146)
!252 = !DILocalVariable(name: "thread", arg: 2, scope: !146, file: !16, line: 224, type: !151)
!253 = !DILocation(line: 224, column: 24, scope: !146)
!254 = !DILocation(line: 226, column: 9, scope: !146)
!255 = !DILocation(line: 227, column: 9, scope: !146)
!256 = !DILocation(line: 228, column: 1, scope: !146)
!257 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !16, file: !16, line: 243, type: !258, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !149}
!260 = !DILocalVariable(name: "object", arg: 1, scope: !257, file: !16, line: 243, type: !149)
!261 = !DILocation(line: 243, column: 56, scope: !257)
!262 = !DILocation(line: 245, column: 9, scope: !257)
!263 = !DILocation(line: 246, column: 1, scope: !257)
!264 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !16, file: !16, line: 359, type: !265, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!265 = !DISubroutineType(types: !266)
!266 = !{!114, !15}
!267 = !DILocalVariable(name: "otype", arg: 1, scope: !264, file: !16, line: 359, type: !15)
!268 = !DILocation(line: 359, column: 58, scope: !264)
!269 = !DILocation(line: 361, column: 9, scope: !264)
!270 = !DILocation(line: 363, column: 2, scope: !264)
!271 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !16, file: !16, line: 366, type: !272, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!272 = !DISubroutineType(types: !273)
!273 = !{!114, !15, !238}
!274 = !DILocalVariable(name: "otype", arg: 1, scope: !271, file: !16, line: 366, type: !15)
!275 = !DILocation(line: 366, column: 63, scope: !271)
!276 = !DILocalVariable(name: "size", arg: 2, scope: !271, file: !16, line: 367, type: !238)
!277 = !DILocation(line: 367, column: 13, scope: !271)
!278 = !DILocation(line: 369, column: 9, scope: !271)
!279 = !DILocation(line: 370, column: 9, scope: !271)
!280 = !DILocation(line: 372, column: 2, scope: !271)
!281 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !4, file: !4, line: 656, type: !282, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!282 = !DISubroutineType(types: !283)
!283 = !{!284, !286}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !285, line: 46, baseType: !207)
!285 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!288 = !DILocalVariable(name: "t", arg: 1, scope: !281, file: !4, line: 657, type: !286)
!289 = !DILocation(line: 657, column: 30, scope: !281)
!290 = !DILocation(line: 659, column: 28, scope: !281)
!291 = !DILocation(line: 659, column: 31, scope: !281)
!292 = !DILocation(line: 659, column: 36, scope: !281)
!293 = !DILocation(line: 659, column: 9, scope: !281)
!294 = !DILocation(line: 659, column: 2, scope: !281)
!295 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !4, file: !4, line: 671, type: !282, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!296 = !DILocalVariable(name: "t", arg: 1, scope: !295, file: !4, line: 672, type: !286)
!297 = !DILocation(line: 672, column: 30, scope: !295)
!298 = !DILocation(line: 674, column: 30, scope: !295)
!299 = !DILocation(line: 674, column: 33, scope: !295)
!300 = !DILocation(line: 674, column: 38, scope: !295)
!301 = !DILocation(line: 674, column: 9, scope: !295)
!302 = !DILocation(line: 674, column: 2, scope: !295)
!303 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !4, file: !4, line: 1634, type: !304, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!304 = !DISubroutineType(types: !305)
!305 = !{!284, !306}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !4, line: 1439, size: 448, elements: !309)
!309 = !{!310, !311, !312, !317, !318, !323, !324}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !308, file: !4, line: 1445, baseType: !197, size: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !308, file: !4, line: 1448, baseType: !173, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !308, file: !4, line: 1451, baseType: !313, size: 32, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !308, file: !4, line: 1454, baseType: !313, size: 32, offset: 288)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !308, file: !4, line: 1457, baseType: !319, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !285, line: 67, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !285, line: 65, size: 64, elements: !321)
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !320, file: !285, line: 66, baseType: !284, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !308, file: !4, line: 1460, baseType: !111, size: 32, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !308, file: !4, line: 1463, baseType: !114, size: 32, offset: 416)
!325 = !DILocalVariable(name: "timer", arg: 1, scope: !303, file: !4, line: 1635, type: !306)
!326 = !DILocation(line: 1635, column: 34, scope: !303)
!327 = !DILocation(line: 1637, column: 28, scope: !303)
!328 = !DILocation(line: 1637, column: 35, scope: !303)
!329 = !DILocation(line: 1637, column: 9, scope: !303)
!330 = !DILocation(line: 1637, column: 2, scope: !303)
!331 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !4, file: !4, line: 1649, type: !304, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!332 = !DILocalVariable(name: "timer", arg: 1, scope: !331, file: !4, line: 1650, type: !306)
!333 = !DILocation(line: 1650, column: 34, scope: !331)
!334 = !DILocation(line: 1652, column: 30, scope: !331)
!335 = !DILocation(line: 1652, column: 37, scope: !331)
!336 = !DILocation(line: 1652, column: 9, scope: !331)
!337 = !DILocation(line: 1652, column: 2, scope: !331)
!338 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !4, file: !4, line: 1689, type: !339, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !316, !114}
!341 = !DILocalVariable(name: "timer", arg: 1, scope: !338, file: !4, line: 1689, type: !316)
!342 = !DILocation(line: 1689, column: 65, scope: !338)
!343 = !DILocalVariable(name: "user_data", arg: 2, scope: !338, file: !4, line: 1690, type: !114)
!344 = !DILocation(line: 1690, column: 19, scope: !338)
!345 = !DILocation(line: 1692, column: 21, scope: !338)
!346 = !DILocation(line: 1692, column: 2, scope: !338)
!347 = !DILocation(line: 1692, column: 9, scope: !338)
!348 = !DILocation(line: 1692, column: 19, scope: !338)
!349 = !DILocation(line: 1693, column: 1, scope: !338)
!350 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !4, file: !4, line: 1704, type: !351, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!351 = !DISubroutineType(types: !352)
!352 = !{!114, !306}
!353 = !DILocalVariable(name: "timer", arg: 1, scope: !350, file: !4, line: 1704, type: !306)
!354 = !DILocation(line: 1704, column: 72, scope: !350)
!355 = !DILocation(line: 1706, column: 9, scope: !350)
!356 = !DILocation(line: 1706, column: 16, scope: !350)
!357 = !DILocation(line: 1706, column: 2, scope: !350)
!358 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !4, file: !4, line: 2071, type: !359, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!359 = !DISubroutineType(types: !360)
!360 = !{!120, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !4, line: 1830, size: 128, elements: !363)
!363 = !{!364, !370, !371}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !362, file: !4, line: 1831, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !106, line: 60, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !106, line: 53, size: 64, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !366, file: !106, line: 54, baseType: !119, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !366, file: !106, line: 55, baseType: !119, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !362, file: !4, line: 1832, baseType: !242, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !362, file: !4, line: 1833, baseType: !173, size: 64, offset: 64)
!372 = !DILocalVariable(name: "queue", arg: 1, scope: !358, file: !4, line: 2071, type: !361)
!373 = !DILocation(line: 2071, column: 59, scope: !358)
!374 = !DILocation(line: 2073, column: 35, scope: !358)
!375 = !DILocation(line: 2073, column: 42, scope: !358)
!376 = !DILocation(line: 2073, column: 14, scope: !358)
!377 = !DILocation(line: 2073, column: 9, scope: !358)
!378 = !DILocation(line: 2073, column: 2, scope: !358)
!379 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !4, file: !4, line: 3209, type: !380, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!380 = !DISubroutineType(types: !381)
!381 = !{!112, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !4, line: 3092, size: 128, elements: !384)
!384 = !{!385, !386, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !383, file: !4, line: 3093, baseType: !173, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !383, file: !4, line: 3094, baseType: !112, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !383, file: !4, line: 3095, baseType: !112, size: 32, offset: 96)
!388 = !DILocalVariable(name: "sem", arg: 1, scope: !379, file: !4, line: 3209, type: !382)
!389 = !DILocation(line: 3209, column: 65, scope: !379)
!390 = !DILocation(line: 3211, column: 9, scope: !379)
!391 = !DILocation(line: 3211, column: 14, scope: !379)
!392 = !DILocation(line: 3211, column: 2, scope: !379)
!393 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !4, file: !4, line: 4649, type: !394, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!394 = !DISubroutineType(types: !395)
!395 = !{!111, !396}
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 32)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !4, line: 4390, size: 320, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !397, file: !4, line: 4392, baseType: !173, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !397, file: !4, line: 4394, baseType: !242, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !397, file: !4, line: 4396, baseType: !238, size: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !397, file: !4, line: 4398, baseType: !111, size: 32, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !397, file: !4, line: 4400, baseType: !115, size: 32, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !397, file: !4, line: 4402, baseType: !115, size: 32, offset: 160)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !397, file: !4, line: 4404, baseType: !115, size: 32, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !397, file: !4, line: 4406, baseType: !115, size: 32, offset: 224)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !397, file: !4, line: 4408, baseType: !111, size: 32, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !397, file: !4, line: 4413, baseType: !98, size: 8, offset: 288)
!409 = !DILocalVariable(name: "msgq", arg: 1, scope: !393, file: !4, line: 4649, type: !396)
!410 = !DILocation(line: 4649, column: 66, scope: !393)
!411 = !DILocation(line: 4651, column: 9, scope: !393)
!412 = !DILocation(line: 4651, column: 15, scope: !393)
!413 = !DILocation(line: 4651, column: 26, scope: !393)
!414 = !DILocation(line: 4651, column: 32, scope: !393)
!415 = !DILocation(line: 4651, column: 24, scope: !393)
!416 = !DILocation(line: 4651, column: 2, scope: !393)
!417 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !4, file: !4, line: 4665, type: !394, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!418 = !DILocalVariable(name: "msgq", arg: 1, scope: !417, file: !4, line: 4665, type: !396)
!419 = !DILocation(line: 4665, column: 66, scope: !417)
!420 = !DILocation(line: 4667, column: 9, scope: !417)
!421 = !DILocation(line: 4667, column: 15, scope: !417)
!422 = !DILocation(line: 4667, column: 2, scope: !417)
!423 = distinct !DISubprogram(name: "z_queue_node_peek", scope: !102, file: !102, line: 30, type: !424, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !244)
!424 = !DISubroutineType(types: !425)
!425 = !{!114, !119, !118}
!426 = !DILocalVariable(name: "node", arg: 1, scope: !423, file: !102, line: 30, type: !119)
!427 = !DILocation(line: 30, column: 39, scope: !423)
!428 = !DILocalVariable(name: "needs_free", arg: 2, scope: !423, file: !102, line: 30, type: !118)
!429 = !DILocation(line: 30, column: 51, scope: !423)
!430 = !DILocalVariable(name: "ret", scope: !423, file: !102, line: 32, type: !114)
!431 = !DILocation(line: 32, column: 8, scope: !423)
!432 = !DILocation(line: 34, column: 7, scope: !433)
!433 = distinct !DILexicalBlock(scope: !423, file: !102, line: 34, column: 6)
!434 = !DILocation(line: 34, column: 12, scope: !433)
!435 = !DILocation(line: 34, column: 18, scope: !433)
!436 = !DILocation(line: 34, column: 43, scope: !433)
!437 = !DILocation(line: 34, column: 22, scope: !433)
!438 = !DILocation(line: 34, column: 49, scope: !433)
!439 = !DILocation(line: 34, column: 6, scope: !423)
!440 = !DILocalVariable(name: "anode", scope: !441, file: !102, line: 40, type: !100)
!441 = distinct !DILexicalBlock(scope: !433, file: !102, line: 34, column: 65)
!442 = !DILocation(line: 40, column: 22, scope: !441)
!443 = !DILocation(line: 42, column: 49, scope: !444)
!444 = distinct !DILexicalBlock(scope: !441, file: !102, line: 42, column: 12)
!445 = !DILocation(line: 42, column: 56, scope: !444)
!446 = !DILocation(line: 42, column: 12, scope: !441)
!447 = !DILocation(line: 42, column: 105, scope: !444)
!448 = !DILocation(line: 42, column: 9, scope: !441)
!449 = !DILocation(line: 43, column: 9, scope: !441)
!450 = !DILocation(line: 43, column: 16, scope: !441)
!451 = !DILocation(line: 43, column: 7, scope: !441)
!452 = !DILocation(line: 44, column: 7, scope: !453)
!453 = distinct !DILexicalBlock(scope: !441, file: !102, line: 44, column: 7)
!454 = !DILocation(line: 44, column: 7, scope: !441)
!455 = !DILocation(line: 45, column: 11, scope: !456)
!456 = distinct !DILexicalBlock(scope: !453, file: !102, line: 44, column: 19)
!457 = !DILocation(line: 45, column: 4, scope: !456)
!458 = !DILocation(line: 46, column: 3, scope: !456)
!459 = !DILocation(line: 47, column: 2, scope: !441)
!460 = !DILocation(line: 52, column: 17, scope: !461)
!461 = distinct !DILexicalBlock(scope: !433, file: !102, line: 47, column: 9)
!462 = !DILocation(line: 52, column: 7, scope: !461)
!463 = !DILocation(line: 55, column: 9, scope: !423)
!464 = !DILocation(line: 55, column: 2, scope: !423)
!465 = distinct !DISubprogram(name: "sys_sfnode_flags_get", scope: !106, file: !106, line: 282, type: !466, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!466 = !DISubroutineType(types: !467)
!467 = !{!98, !119}
!468 = !DILocalVariable(name: "node", arg: 1, scope: !465, file: !106, line: 282, type: !119)
!469 = !DILocation(line: 282, column: 58, scope: !465)
!470 = !DILocation(line: 284, column: 9, scope: !465)
!471 = !DILocation(line: 284, column: 15, scope: !465)
!472 = !DILocation(line: 284, column: 30, scope: !465)
!473 = !DILocation(line: 284, column: 2, scope: !465)
!474 = distinct !DISubprogram(name: "z_impl_k_queue_init", scope: !102, file: !102, line: 58, type: !475, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !244)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !361}
!477 = !DILocalVariable(name: "queue", arg: 1, scope: !474, file: !102, line: 58, type: !361)
!478 = !DILocation(line: 58, column: 42, scope: !474)
!479 = !DILocation(line: 60, column: 19, scope: !474)
!480 = !DILocation(line: 60, column: 26, scope: !474)
!481 = !DILocation(line: 60, column: 2, scope: !474)
!482 = !DILocation(line: 61, column: 2, scope: !474)
!483 = !DILocation(line: 61, column: 9, scope: !474)
!484 = !DILocation(line: 61, column: 16, scope: !474)
!485 = !DILocation(line: 62, column: 16, scope: !474)
!486 = !DILocation(line: 62, column: 23, scope: !474)
!487 = !DILocation(line: 62, column: 2, scope: !474)
!488 = !DILocation(line: 67, column: 2, scope: !474)
!489 = !DILocation(line: 67, column: 7, scope: !490)
!490 = distinct !DILexicalBlock(scope: !474, file: !102, line: 67, column: 5)
!491 = !DILocation(line: 69, column: 16, scope: !474)
!492 = !DILocation(line: 69, column: 2, scope: !474)
!493 = !DILocation(line: 70, column: 1, scope: !474)
!494 = distinct !DISubprogram(name: "sys_sflist_init", scope: !106, file: !106, line: 210, type: !495, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!498 = !DILocalVariable(name: "list", arg: 1, scope: !494, file: !106, line: 210, type: !497)
!499 = !DILocation(line: 210, column: 50, scope: !494)
!500 = !DILocation(line: 212, column: 2, scope: !494)
!501 = !DILocation(line: 212, column: 8, scope: !494)
!502 = !DILocation(line: 212, column: 13, scope: !494)
!503 = !DILocation(line: 213, column: 2, scope: !494)
!504 = !DILocation(line: 213, column: 8, scope: !494)
!505 = !DILocation(line: 213, column: 13, scope: !494)
!506 = !DILocation(line: 214, column: 1, scope: !494)
!507 = distinct !DISubprogram(name: "z_waitq_init", scope: !508, file: !508, line: 47, type: !509, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!508 = !DIFile(filename: "kernel/include/wait_q.h", directory: "/home/sri/zephyrproject/zephyr")
!509 = !DISubroutineType(types: !510)
!510 = !{null, !172}
!511 = !DILocalVariable(name: "w", arg: 1, scope: !507, file: !508, line: 47, type: !172)
!512 = !DILocation(line: 47, column: 44, scope: !507)
!513 = !DILocation(line: 49, column: 18, scope: !507)
!514 = !DILocation(line: 49, column: 21, scope: !507)
!515 = !DILocation(line: 49, column: 2, scope: !507)
!516 = !DILocation(line: 50, column: 1, scope: !507)
!517 = distinct !DISubprogram(name: "z_object_init", scope: !16, file: !16, line: 215, type: !258, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!518 = !DILocalVariable(name: "obj", arg: 1, scope: !517, file: !16, line: 215, type: !149)
!519 = !DILocation(line: 215, column: 46, scope: !517)
!520 = !DILocation(line: 217, column: 9, scope: !517)
!521 = !DILocation(line: 218, column: 1, scope: !517)
!522 = distinct !DISubprogram(name: "z_impl_k_queue_cancel_wait", scope: !102, file: !102, line: 97, type: !475, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !244)
!523 = !DILocalVariable(name: "queue", arg: 1, scope: !522, file: !102, line: 97, type: !361)
!524 = !DILocation(line: 97, column: 49, scope: !522)
!525 = !DILocation(line: 99, column: 2, scope: !522)
!526 = !DILocation(line: 99, column: 7, scope: !527)
!527 = distinct !DILexicalBlock(scope: !522, file: !102, line: 99, column: 5)
!528 = !DILocalVariable(name: "key", scope: !522, file: !102, line: 101, type: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !243, line: 108, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !243, line: 34, size: 32, elements: !531)
!531 = !{!532}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !530, file: !243, line: 35, baseType: !120, size: 32)
!533 = !DILocation(line: 101, column: 19, scope: !522)
!534 = !DILocation(line: 101, column: 38, scope: !522)
!535 = !DILocation(line: 101, column: 45, scope: !522)
!536 = !DILocalVariable(name: "l", arg: 1, scope: !537, file: !243, line: 160, type: !540)
!537 = distinct !DISubprogram(name: "k_spin_lock", scope: !243, file: !243, line: 160, type: !538, scopeLine: 161, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!538 = !DISubroutineType(types: !539)
!539 = !{!529, !540}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!541 = !DILocation(line: 160, column: 94, scope: !537, inlinedAt: !542)
!542 = distinct !DILocation(line: 101, column: 25, scope: !522)
!543 = !DILocation(line: 162, column: 9, scope: !537, inlinedAt: !542)
!544 = !DILocalVariable(name: "k", scope: !537, file: !243, line: 163, type: !529)
!545 = !DILocation(line: 163, column: 19, scope: !537, inlinedAt: !542)
!546 = !DILocalVariable(name: "key", scope: !547, file: !548, line: 44, type: !112)
!547 = distinct !DISubprogram(name: "arch_irq_lock", scope: !548, file: !548, line: 42, type: !549, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!548 = !DIFile(filename: "include/zephyr/arch/arm/asm_inline_gcc.h", directory: "/home/sri/zephyrproject/zephyr")
!549 = !DISubroutineType(types: !550)
!550 = !{!112}
!551 = !DILocation(line: 44, column: 15, scope: !547, inlinedAt: !552)
!552 = distinct !DILocation(line: 169, column: 10, scope: !537, inlinedAt: !542)
!553 = !DILocation(line: 48, column: 2, scope: !547, inlinedAt: !552)
!554 = !{i64 66945}
!555 = !DILocation(line: 80, column: 9, scope: !547, inlinedAt: !552)
!556 = !DILocation(line: 169, column: 8, scope: !537, inlinedAt: !542)
!557 = !DILocation(line: 171, column: 26, scope: !537, inlinedAt: !542)
!558 = !DILocalVariable(name: "l", arg: 1, scope: !559, file: !243, line: 110, type: !540)
!559 = distinct !DISubprogram(name: "z_spinlock_validate_pre", scope: !243, file: !243, line: 110, type: !560, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !540}
!562 = !DILocation(line: 110, column: 94, scope: !559, inlinedAt: !563)
!563 = distinct !DILocation(line: 171, column: 2, scope: !537, inlinedAt: !542)
!564 = !DILocation(line: 112, column: 9, scope: !559, inlinedAt: !563)
!565 = !DILocation(line: 177, column: 27, scope: !537, inlinedAt: !542)
!566 = !DILocalVariable(name: "l", arg: 1, scope: !567, file: !243, line: 121, type: !540)
!567 = distinct !DISubprogram(name: "z_spinlock_validate_post", scope: !243, file: !243, line: 121, type: !560, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!568 = !DILocation(line: 121, column: 95, scope: !567, inlinedAt: !569)
!569 = distinct !DILocation(line: 177, column: 2, scope: !537, inlinedAt: !542)
!570 = !DILocation(line: 123, column: 9, scope: !567, inlinedAt: !569)
!571 = !DILocation(line: 179, column: 2, scope: !537, inlinedAt: !542)
!572 = !DILocation(line: 101, column: 25, scope: !522)
!573 = !DILocalVariable(name: "first_pending_thread", scope: !522, file: !102, line: 102, type: !151)
!574 = !DILocation(line: 102, column: 19, scope: !522)
!575 = !DILocation(line: 104, column: 48, scope: !522)
!576 = !DILocation(line: 104, column: 55, scope: !522)
!577 = !DILocation(line: 104, column: 25, scope: !522)
!578 = !DILocation(line: 104, column: 23, scope: !522)
!579 = !DILocation(line: 106, column: 6, scope: !580)
!580 = distinct !DILexicalBlock(scope: !522, file: !102, line: 106, column: 6)
!581 = !DILocation(line: 106, column: 27, scope: !580)
!582 = !DILocation(line: 106, column: 6, scope: !522)
!583 = !DILocation(line: 107, column: 25, scope: !584)
!584 = distinct !DILexicalBlock(scope: !580, file: !102, line: 106, column: 33)
!585 = !DILocation(line: 107, column: 3, scope: !584)
!586 = !DILocation(line: 108, column: 2, scope: !584)
!587 = !DILocation(line: 110, column: 21, scope: !522)
!588 = !DILocation(line: 110, column: 2, scope: !522)
!589 = !DILocation(line: 111, column: 16, scope: !522)
!590 = !DILocation(line: 111, column: 23, scope: !522)
!591 = !DILocation(line: 111, column: 2, scope: !522)
!592 = !DILocation(line: 112, column: 1, scope: !522)
!593 = distinct !DISubprogram(name: "prepare_thread_to_run", scope: !102, file: !102, line: 81, type: !594, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !151, !114}
!596 = !DILocalVariable(name: "thread", arg: 1, scope: !593, file: !102, line: 81, type: !151)
!597 = !DILocation(line: 81, column: 52, scope: !593)
!598 = !DILocalVariable(name: "data", arg: 2, scope: !593, file: !102, line: 81, type: !114)
!599 = !DILocation(line: 81, column: 66, scope: !593)
!600 = !DILocation(line: 83, column: 38, scope: !593)
!601 = !DILocation(line: 83, column: 49, scope: !593)
!602 = !DILocalVariable(name: "thread", arg: 1, scope: !603, file: !604, line: 137, type: !151)
!603 = distinct !DISubprogram(name: "z_thread_return_value_set_with_data", scope: !604, file: !604, line: 137, type: !605, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!604 = !DIFile(filename: "kernel/include/kernel_internal.h", directory: "/home/sri/zephyrproject/zephyr")
!605 = !DISubroutineType(types: !606)
!606 = !{null, !151, !112, !114}
!607 = !DILocation(line: 137, column: 54, scope: !603, inlinedAt: !608)
!608 = distinct !DILocation(line: 83, column: 2, scope: !593)
!609 = !DILocalVariable(name: "value", arg: 2, scope: !603, file: !604, line: 138, type: !112)
!610 = !DILocation(line: 138, column: 21, scope: !603, inlinedAt: !608)
!611 = !DILocalVariable(name: "data", arg: 3, scope: !603, file: !604, line: 139, type: !114)
!612 = !DILocation(line: 139, column: 14, scope: !603, inlinedAt: !608)
!613 = !DILocation(line: 141, column: 31, scope: !603, inlinedAt: !608)
!614 = !DILocation(line: 141, column: 39, scope: !603, inlinedAt: !608)
!615 = !DILocalVariable(name: "thread", arg: 1, scope: !616, file: !617, line: 59, type: !151)
!616 = distinct !DISubprogram(name: "arch_thread_return_value_set", scope: !617, file: !617, line: 59, type: !618, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!617 = !DIFile(filename: "arch/arm/include/cortex_m/kernel_arch_func.h", directory: "/home/sri/zephyrproject/zephyr")
!618 = !DISubroutineType(types: !619)
!619 = !{null, !151, !112}
!620 = !DILocation(line: 59, column: 47, scope: !616, inlinedAt: !621)
!621 = distinct !DILocation(line: 141, column: 2, scope: !603, inlinedAt: !608)
!622 = !DILocalVariable(name: "value", arg: 2, scope: !616, file: !617, line: 59, type: !112)
!623 = !DILocation(line: 59, column: 68, scope: !616, inlinedAt: !621)
!624 = !DILocation(line: 61, column: 35, scope: !616, inlinedAt: !621)
!625 = !DILocation(line: 61, column: 2, scope: !616, inlinedAt: !621)
!626 = !DILocation(line: 61, column: 10, scope: !616, inlinedAt: !621)
!627 = !DILocation(line: 61, column: 15, scope: !616, inlinedAt: !621)
!628 = !DILocation(line: 61, column: 33, scope: !616, inlinedAt: !621)
!629 = !DILocation(line: 142, column: 27, scope: !603, inlinedAt: !608)
!630 = !DILocation(line: 142, column: 2, scope: !603, inlinedAt: !608)
!631 = !DILocation(line: 142, column: 15, scope: !603, inlinedAt: !608)
!632 = !DILocation(line: 142, column: 25, scope: !603, inlinedAt: !608)
!633 = !DILocation(line: 84, column: 17, scope: !593)
!634 = !DILocation(line: 84, column: 2, scope: !593)
!635 = !DILocation(line: 85, column: 1, scope: !593)
!636 = distinct !DISubprogram(name: "handle_poll_events", scope: !102, file: !102, line: 87, type: !637, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !361, !111}
!639 = !DILocalVariable(name: "queue", arg: 1, scope: !636, file: !102, line: 87, type: !361)
!640 = !DILocation(line: 87, column: 55, scope: !636)
!641 = !DILocalVariable(name: "state", arg: 2, scope: !636, file: !102, line: 87, type: !111)
!642 = !DILocation(line: 87, column: 71, scope: !636)
!643 = !DILocation(line: 92, column: 9, scope: !636)
!644 = !DILocation(line: 93, column: 9, scope: !636)
!645 = !DILocation(line: 95, column: 1, scope: !636)
!646 = distinct !DISubprogram(name: "k_queue_insert", scope: !102, file: !102, line: 178, type: !647, scopeLine: 179, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !244)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !361, !114, !114}
!649 = !DILocalVariable(name: "queue", arg: 1, scope: !646, file: !102, line: 178, type: !361)
!650 = !DILocation(line: 178, column: 37, scope: !646)
!651 = !DILocalVariable(name: "prev", arg: 2, scope: !646, file: !102, line: 178, type: !114)
!652 = !DILocation(line: 178, column: 50, scope: !646)
!653 = !DILocalVariable(name: "data", arg: 3, scope: !646, file: !102, line: 178, type: !114)
!654 = !DILocation(line: 178, column: 62, scope: !646)
!655 = !DILocation(line: 180, column: 2, scope: !646)
!656 = !DILocation(line: 180, column: 7, scope: !657)
!657 = distinct !DILexicalBlock(scope: !646, file: !102, line: 180, column: 5)
!658 = !DILocation(line: 182, column: 21, scope: !646)
!659 = !DILocation(line: 182, column: 28, scope: !646)
!660 = !DILocation(line: 182, column: 34, scope: !646)
!661 = !DILocation(line: 182, column: 8, scope: !646)
!662 = !DILocation(line: 184, column: 2, scope: !646)
!663 = !DILocation(line: 184, column: 7, scope: !664)
!664 = distinct !DILexicalBlock(scope: !646, file: !102, line: 184, column: 5)
!665 = !DILocation(line: 185, column: 1, scope: !646)
!666 = distinct !DISubprogram(name: "queue_insert", scope: !102, file: !102, line: 123, type: !667, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!667 = !DISubroutineType(types: !668)
!668 = !{!669, !361, !114, !114, !118, !118}
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !99, line: 58, baseType: !120)
!670 = !DILocalVariable(name: "queue", arg: 1, scope: !666, file: !102, line: 123, type: !361)
!671 = !DILocation(line: 123, column: 45, scope: !666)
!672 = !DILocalVariable(name: "prev", arg: 2, scope: !666, file: !102, line: 123, type: !114)
!673 = !DILocation(line: 123, column: 58, scope: !666)
!674 = !DILocalVariable(name: "data", arg: 3, scope: !666, file: !102, line: 123, type: !114)
!675 = !DILocation(line: 123, column: 70, scope: !666)
!676 = !DILocalVariable(name: "alloc", arg: 4, scope: !666, file: !102, line: 124, type: !118)
!677 = !DILocation(line: 124, column: 14, scope: !666)
!678 = !DILocalVariable(name: "is_append", arg: 5, scope: !666, file: !102, line: 124, type: !118)
!679 = !DILocation(line: 124, column: 27, scope: !666)
!680 = !DILocalVariable(name: "first_pending_thread", scope: !666, file: !102, line: 126, type: !151)
!681 = !DILocation(line: 126, column: 19, scope: !666)
!682 = !DILocalVariable(name: "key", scope: !666, file: !102, line: 127, type: !529)
!683 = !DILocation(line: 127, column: 19, scope: !666)
!684 = !DILocation(line: 127, column: 38, scope: !666)
!685 = !DILocation(line: 127, column: 45, scope: !666)
!686 = !DILocation(line: 160, column: 94, scope: !537, inlinedAt: !687)
!687 = distinct !DILocation(line: 127, column: 25, scope: !666)
!688 = !DILocation(line: 162, column: 9, scope: !537, inlinedAt: !687)
!689 = !DILocation(line: 163, column: 19, scope: !537, inlinedAt: !687)
!690 = !DILocation(line: 44, column: 15, scope: !547, inlinedAt: !691)
!691 = distinct !DILocation(line: 169, column: 10, scope: !537, inlinedAt: !687)
!692 = !DILocation(line: 48, column: 2, scope: !547, inlinedAt: !691)
!693 = !DILocation(line: 80, column: 9, scope: !547, inlinedAt: !691)
!694 = !DILocation(line: 169, column: 8, scope: !537, inlinedAt: !687)
!695 = !DILocation(line: 171, column: 26, scope: !537, inlinedAt: !687)
!696 = !DILocation(line: 110, column: 94, scope: !559, inlinedAt: !697)
!697 = distinct !DILocation(line: 171, column: 2, scope: !537, inlinedAt: !687)
!698 = !DILocation(line: 112, column: 9, scope: !559, inlinedAt: !697)
!699 = !DILocation(line: 177, column: 27, scope: !537, inlinedAt: !687)
!700 = !DILocation(line: 121, column: 95, scope: !567, inlinedAt: !701)
!701 = distinct !DILocation(line: 177, column: 2, scope: !537, inlinedAt: !687)
!702 = !DILocation(line: 123, column: 9, scope: !567, inlinedAt: !701)
!703 = !DILocation(line: 179, column: 2, scope: !537, inlinedAt: !687)
!704 = !DILocation(line: 127, column: 25, scope: !666)
!705 = !DILocation(line: 129, column: 2, scope: !666)
!706 = !DILocation(line: 129, column: 7, scope: !707)
!707 = distinct !DILexicalBlock(scope: !666, file: !102, line: 129, column: 5)
!708 = !DILocation(line: 131, column: 6, scope: !709)
!709 = distinct !DILexicalBlock(scope: !666, file: !102, line: 131, column: 6)
!710 = !DILocation(line: 131, column: 6, scope: !666)
!711 = !DILocation(line: 132, column: 32, scope: !712)
!712 = distinct !DILexicalBlock(scope: !709, file: !102, line: 131, column: 17)
!713 = !DILocation(line: 132, column: 39, scope: !712)
!714 = !DILocation(line: 132, column: 10, scope: !712)
!715 = !DILocation(line: 132, column: 8, scope: !712)
!716 = !DILocation(line: 133, column: 2, scope: !712)
!717 = !DILocation(line: 134, column: 48, scope: !666)
!718 = !DILocation(line: 134, column: 55, scope: !666)
!719 = !DILocation(line: 134, column: 25, scope: !666)
!720 = !DILocation(line: 134, column: 23, scope: !666)
!721 = !DILocation(line: 136, column: 6, scope: !722)
!722 = distinct !DILexicalBlock(scope: !666, file: !102, line: 136, column: 6)
!723 = !DILocation(line: 136, column: 27, scope: !722)
!724 = !DILocation(line: 136, column: 6, scope: !666)
!725 = !DILocation(line: 137, column: 3, scope: !726)
!726 = distinct !DILexicalBlock(scope: !722, file: !102, line: 136, column: 33)
!727 = !DILocation(line: 137, column: 8, scope: !728)
!728 = distinct !DILexicalBlock(scope: !726, file: !102, line: 137, column: 6)
!729 = !DILocation(line: 139, column: 25, scope: !726)
!730 = !DILocation(line: 139, column: 47, scope: !726)
!731 = !DILocation(line: 139, column: 3, scope: !726)
!732 = !DILocation(line: 140, column: 17, scope: !726)
!733 = !DILocation(line: 140, column: 24, scope: !726)
!734 = !DILocation(line: 140, column: 3, scope: !726)
!735 = !DILocation(line: 142, column: 3, scope: !726)
!736 = !DILocation(line: 142, column: 8, scope: !737)
!737 = distinct !DILexicalBlock(scope: !726, file: !102, line: 142, column: 6)
!738 = !DILocation(line: 144, column: 3, scope: !726)
!739 = !DILocation(line: 148, column: 6, scope: !740)
!740 = distinct !DILexicalBlock(scope: !666, file: !102, line: 148, column: 6)
!741 = !DILocation(line: 148, column: 6, scope: !666)
!742 = !DILocalVariable(name: "anode", scope: !743, file: !102, line: 149, type: !100)
!743 = distinct !DILexicalBlock(scope: !740, file: !102, line: 148, column: 13)
!744 = !DILocation(line: 149, column: 22, scope: !743)
!745 = !DILocation(line: 151, column: 11, scope: !743)
!746 = !DILocation(line: 151, column: 9, scope: !743)
!747 = !DILocation(line: 152, column: 7, scope: !748)
!748 = distinct !DILexicalBlock(scope: !743, file: !102, line: 152, column: 7)
!749 = !DILocation(line: 152, column: 13, scope: !748)
!750 = !DILocation(line: 152, column: 7, scope: !743)
!751 = !DILocation(line: 153, column: 19, scope: !752)
!752 = distinct !DILexicalBlock(scope: !748, file: !102, line: 152, column: 19)
!753 = !DILocation(line: 153, column: 26, scope: !752)
!754 = !DILocation(line: 153, column: 4, scope: !752)
!755 = !DILocalVariable(name: "l", arg: 1, scope: !756, file: !243, line: 235, type: !540)
!756 = distinct !DISubprogram(name: "k_spin_unlock", scope: !243, file: !243, line: 235, type: !757, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !540, !529}
!759 = !DILocation(line: 235, column: 84, scope: !756, inlinedAt: !760)
!760 = distinct !DILocation(line: 153, column: 4, scope: !752)
!761 = !DILocalVariable(name: "key", arg: 2, scope: !756, file: !243, line: 236, type: !529)
!762 = !DILocation(line: 236, column: 23, scope: !756, inlinedAt: !760)
!763 = !DILocation(line: 238, column: 9, scope: !756, inlinedAt: !760)
!764 = !DILocation(line: 261, column: 22, scope: !756, inlinedAt: !760)
!765 = !DILocalVariable(name: "key", arg: 1, scope: !766, file: !548, line: 88, type: !112)
!766 = distinct !DISubprogram(name: "arch_irq_unlock", scope: !548, file: !548, line: 88, type: !767, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !112}
!769 = !DILocation(line: 88, column: 80, scope: !766, inlinedAt: !770)
!770 = distinct !DILocation(line: 261, column: 2, scope: !756, inlinedAt: !760)
!771 = !DILocation(line: 91, column: 6, scope: !772, inlinedAt: !770)
!772 = distinct !DILexicalBlock(scope: !766, file: !548, line: 91, column: 6)
!773 = !DILocation(line: 91, column: 10, scope: !772, inlinedAt: !770)
!774 = !DILocation(line: 91, column: 6, scope: !766, inlinedAt: !770)
!775 = !DILocation(line: 92, column: 3, scope: !776, inlinedAt: !770)
!776 = distinct !DILexicalBlock(scope: !772, file: !548, line: 91, column: 17)
!777 = !DILocation(line: 94, column: 2, scope: !766, inlinedAt: !770)
!778 = !{i64 67249}
!779 = !DILocation(line: 114, column: 1, scope: !766, inlinedAt: !770)
!780 = !DILocation(line: 155, column: 4, scope: !752)
!781 = !DILocation(line: 155, column: 9, scope: !782)
!782 = distinct !DILexicalBlock(scope: !752, file: !102, line: 155, column: 7)
!783 = !DILocation(line: 158, column: 4, scope: !752)
!784 = !DILocation(line: 160, column: 17, scope: !743)
!785 = !DILocation(line: 160, column: 3, scope: !743)
!786 = !DILocation(line: 160, column: 10, scope: !743)
!787 = !DILocation(line: 160, column: 15, scope: !743)
!788 = !DILocation(line: 161, column: 20, scope: !743)
!789 = !DILocation(line: 161, column: 27, scope: !743)
!790 = !DILocation(line: 161, column: 3, scope: !743)
!791 = !DILocation(line: 162, column: 10, scope: !743)
!792 = !DILocation(line: 162, column: 8, scope: !743)
!793 = !DILocation(line: 163, column: 2, scope: !743)
!794 = !DILocation(line: 164, column: 19, scope: !795)
!795 = distinct !DILexicalBlock(scope: !740, file: !102, line: 163, column: 9)
!796 = !DILocation(line: 164, column: 3, scope: !795)
!797 = !DILocation(line: 167, column: 2, scope: !666)
!798 = !DILocation(line: 167, column: 7, scope: !799)
!799 = distinct !DILexicalBlock(scope: !666, file: !102, line: 167, column: 5)
!800 = !DILocation(line: 169, column: 21, scope: !666)
!801 = !DILocation(line: 169, column: 28, scope: !666)
!802 = !DILocation(line: 169, column: 36, scope: !666)
!803 = !DILocation(line: 169, column: 42, scope: !666)
!804 = !DILocation(line: 169, column: 2, scope: !666)
!805 = !DILocation(line: 170, column: 21, scope: !666)
!806 = !DILocation(line: 170, column: 2, scope: !666)
!807 = !DILocation(line: 171, column: 16, scope: !666)
!808 = !DILocation(line: 171, column: 23, scope: !666)
!809 = !DILocation(line: 171, column: 2, scope: !666)
!810 = !DILocation(line: 173, column: 2, scope: !666)
!811 = !DILocation(line: 173, column: 7, scope: !812)
!812 = distinct !DILexicalBlock(scope: !666, file: !102, line: 173, column: 5)
!813 = !DILocation(line: 175, column: 2, scope: !666)
!814 = !DILocation(line: 176, column: 1, scope: !666)
!815 = distinct !DISubprogram(name: "k_queue_append", scope: !102, file: !102, line: 187, type: !816, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !244)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !361, !114}
!818 = !DILocalVariable(name: "queue", arg: 1, scope: !815, file: !102, line: 187, type: !361)
!819 = !DILocation(line: 187, column: 37, scope: !815)
!820 = !DILocalVariable(name: "data", arg: 2, scope: !815, file: !102, line: 187, type: !114)
!821 = !DILocation(line: 187, column: 50, scope: !815)
!822 = !DILocation(line: 189, column: 2, scope: !815)
!823 = !DILocation(line: 189, column: 7, scope: !824)
!824 = distinct !DILexicalBlock(scope: !815, file: !102, line: 189, column: 5)
!825 = !DILocation(line: 191, column: 21, scope: !815)
!826 = !DILocation(line: 191, column: 31, scope: !815)
!827 = !DILocation(line: 191, column: 8, scope: !815)
!828 = !DILocation(line: 193, column: 2, scope: !815)
!829 = !DILocation(line: 193, column: 7, scope: !830)
!830 = distinct !DILexicalBlock(scope: !815, file: !102, line: 193, column: 5)
!831 = !DILocation(line: 194, column: 1, scope: !815)
!832 = distinct !DISubprogram(name: "k_queue_prepend", scope: !102, file: !102, line: 196, type: !816, scopeLine: 197, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !244)
!833 = !DILocalVariable(name: "queue", arg: 1, scope: !832, file: !102, line: 196, type: !361)
!834 = !DILocation(line: 196, column: 38, scope: !832)
!835 = !DILocalVariable(name: "data", arg: 2, scope: !832, file: !102, line: 196, type: !114)
!836 = !DILocation(line: 196, column: 51, scope: !832)
!837 = !DILocation(line: 198, column: 2, scope: !832)
!838 = !DILocation(line: 198, column: 7, scope: !839)
!839 = distinct !DILexicalBlock(scope: !832, file: !102, line: 198, column: 5)
!840 = !DILocation(line: 200, column: 21, scope: !832)
!841 = !DILocation(line: 200, column: 31, scope: !832)
!842 = !DILocation(line: 200, column: 8, scope: !832)
!843 = !DILocation(line: 202, column: 2, scope: !832)
!844 = !DILocation(line: 202, column: 7, scope: !845)
!845 = distinct !DILexicalBlock(scope: !832, file: !102, line: 202, column: 5)
!846 = !DILocation(line: 203, column: 1, scope: !832)
!847 = distinct !DISubprogram(name: "z_impl_k_queue_alloc_append", scope: !102, file: !102, line: 205, type: !848, scopeLine: 206, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !244)
!848 = !DISubroutineType(types: !849)
!849 = !{!669, !361, !114}
!850 = !DILocalVariable(name: "queue", arg: 1, scope: !847, file: !102, line: 205, type: !361)
!851 = !DILocation(line: 205, column: 53, scope: !847)
!852 = !DILocalVariable(name: "data", arg: 2, scope: !847, file: !102, line: 205, type: !114)
!853 = !DILocation(line: 205, column: 66, scope: !847)
!854 = !DILocation(line: 207, column: 2, scope: !847)
!855 = !DILocation(line: 207, column: 7, scope: !856)
!856 = distinct !DILexicalBlock(scope: !847, file: !102, line: 207, column: 5)
!857 = !DILocalVariable(name: "ret", scope: !847, file: !102, line: 209, type: !669)
!858 = !DILocation(line: 209, column: 10, scope: !847)
!859 = !DILocation(line: 209, column: 29, scope: !847)
!860 = !DILocation(line: 209, column: 39, scope: !847)
!861 = !DILocation(line: 209, column: 16, scope: !847)
!862 = !DILocation(line: 211, column: 2, scope: !847)
!863 = !DILocation(line: 211, column: 7, scope: !864)
!864 = distinct !DILexicalBlock(scope: !847, file: !102, line: 211, column: 5)
!865 = !DILocation(line: 213, column: 9, scope: !847)
!866 = !DILocation(line: 213, column: 2, scope: !847)
!867 = distinct !DISubprogram(name: "z_impl_k_queue_alloc_prepend", scope: !102, file: !102, line: 226, type: !848, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !244)
!868 = !DILocalVariable(name: "queue", arg: 1, scope: !867, file: !102, line: 226, type: !361)
!869 = !DILocation(line: 226, column: 54, scope: !867)
!870 = !DILocalVariable(name: "data", arg: 2, scope: !867, file: !102, line: 226, type: !114)
!871 = !DILocation(line: 226, column: 67, scope: !867)
!872 = !DILocation(line: 228, column: 2, scope: !867)
!873 = !DILocation(line: 228, column: 7, scope: !874)
!874 = distinct !DILexicalBlock(scope: !867, file: !102, line: 228, column: 5)
!875 = !DILocalVariable(name: "ret", scope: !867, file: !102, line: 230, type: !669)
!876 = !DILocation(line: 230, column: 10, scope: !867)
!877 = !DILocation(line: 230, column: 29, scope: !867)
!878 = !DILocation(line: 230, column: 39, scope: !867)
!879 = !DILocation(line: 230, column: 16, scope: !867)
!880 = !DILocation(line: 232, column: 2, scope: !867)
!881 = !DILocation(line: 232, column: 7, scope: !882)
!882 = distinct !DILexicalBlock(scope: !867, file: !102, line: 232, column: 5)
!883 = !DILocation(line: 234, column: 9, scope: !867)
!884 = !DILocation(line: 234, column: 2, scope: !867)
!885 = distinct !DISubprogram(name: "k_queue_append_list", scope: !102, file: !102, line: 247, type: !886, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !244)
!886 = !DISubroutineType(types: !887)
!887 = !{!120, !361, !114, !114}
!888 = !DILocalVariable(name: "queue", arg: 1, scope: !885, file: !102, line: 247, type: !361)
!889 = !DILocation(line: 247, column: 41, scope: !885)
!890 = !DILocalVariable(name: "head", arg: 2, scope: !885, file: !102, line: 247, type: !114)
!891 = !DILocation(line: 247, column: 54, scope: !885)
!892 = !DILocalVariable(name: "tail", arg: 3, scope: !885, file: !102, line: 247, type: !114)
!893 = !DILocation(line: 247, column: 66, scope: !885)
!894 = !DILocation(line: 249, column: 2, scope: !885)
!895 = !DILocation(line: 249, column: 7, scope: !896)
!896 = distinct !DILexicalBlock(scope: !885, file: !102, line: 249, column: 5)
!897 = !DILocation(line: 252, column: 6, scope: !898)
!898 = distinct !DILexicalBlock(scope: !885, file: !102, line: 252, column: 6)
!899 = !DILocation(line: 252, column: 11, scope: !898)
!900 = !DILocation(line: 252, column: 16, scope: !898)
!901 = !DILocation(line: 252, column: 19, scope: !898)
!902 = !DILocation(line: 252, column: 24, scope: !898)
!903 = !DILocation(line: 252, column: 6, scope: !885)
!904 = !DILocation(line: 253, column: 3, scope: !905)
!905 = distinct !DILexicalBlock(scope: !898, file: !102, line: 252, column: 30)
!906 = !DILocation(line: 253, column: 8, scope: !907)
!907 = distinct !DILexicalBlock(scope: !905, file: !102, line: 253, column: 6)
!908 = !DILocation(line: 255, column: 3, scope: !905)
!909 = !DILocalVariable(name: "key", scope: !885, file: !102, line: 258, type: !529)
!910 = !DILocation(line: 258, column: 19, scope: !885)
!911 = !DILocation(line: 258, column: 38, scope: !885)
!912 = !DILocation(line: 258, column: 45, scope: !885)
!913 = !DILocation(line: 160, column: 94, scope: !537, inlinedAt: !914)
!914 = distinct !DILocation(line: 258, column: 25, scope: !885)
!915 = !DILocation(line: 162, column: 9, scope: !537, inlinedAt: !914)
!916 = !DILocation(line: 163, column: 19, scope: !537, inlinedAt: !914)
!917 = !DILocation(line: 44, column: 15, scope: !547, inlinedAt: !918)
!918 = distinct !DILocation(line: 169, column: 10, scope: !537, inlinedAt: !914)
!919 = !DILocation(line: 48, column: 2, scope: !547, inlinedAt: !918)
!920 = !DILocation(line: 80, column: 9, scope: !547, inlinedAt: !918)
!921 = !DILocation(line: 169, column: 8, scope: !537, inlinedAt: !914)
!922 = !DILocation(line: 171, column: 26, scope: !537, inlinedAt: !914)
!923 = !DILocation(line: 110, column: 94, scope: !559, inlinedAt: !924)
!924 = distinct !DILocation(line: 171, column: 2, scope: !537, inlinedAt: !914)
!925 = !DILocation(line: 112, column: 9, scope: !559, inlinedAt: !924)
!926 = !DILocation(line: 177, column: 27, scope: !537, inlinedAt: !914)
!927 = !DILocation(line: 121, column: 95, scope: !567, inlinedAt: !928)
!928 = distinct !DILocation(line: 177, column: 2, scope: !537, inlinedAt: !914)
!929 = !DILocation(line: 123, column: 9, scope: !567, inlinedAt: !928)
!930 = !DILocation(line: 179, column: 2, scope: !537, inlinedAt: !914)
!931 = !DILocation(line: 258, column: 25, scope: !885)
!932 = !DILocalVariable(name: "thread", scope: !885, file: !102, line: 259, type: !151)
!933 = !DILocation(line: 259, column: 19, scope: !885)
!934 = !DILocation(line: 261, column: 6, scope: !935)
!935 = distinct !DILexicalBlock(scope: !885, file: !102, line: 261, column: 6)
!936 = !DILocation(line: 261, column: 11, scope: !935)
!937 = !DILocation(line: 261, column: 6, scope: !885)
!938 = !DILocation(line: 262, column: 35, scope: !939)
!939 = distinct !DILexicalBlock(scope: !935, file: !102, line: 261, column: 17)
!940 = !DILocation(line: 262, column: 42, scope: !939)
!941 = !DILocation(line: 262, column: 12, scope: !939)
!942 = !DILocation(line: 262, column: 10, scope: !939)
!943 = !DILocation(line: 263, column: 2, scope: !939)
!944 = !DILocation(line: 265, column: 2, scope: !885)
!945 = !DILocation(line: 265, column: 10, scope: !885)
!946 = !DILocation(line: 265, column: 15, scope: !885)
!947 = !DILocation(line: 265, column: 21, scope: !885)
!948 = !DILocation(line: 265, column: 25, scope: !885)
!949 = !DILocation(line: 265, column: 32, scope: !885)
!950 = !DILocation(line: 0, scope: !885)
!951 = !DILocation(line: 266, column: 25, scope: !952)
!952 = distinct !DILexicalBlock(scope: !885, file: !102, line: 265, column: 39)
!953 = !DILocation(line: 266, column: 33, scope: !952)
!954 = !DILocation(line: 266, column: 3, scope: !952)
!955 = !DILocation(line: 267, column: 20, scope: !952)
!956 = !DILocation(line: 267, column: 10, scope: !952)
!957 = !DILocation(line: 267, column: 8, scope: !952)
!958 = !DILocation(line: 268, column: 35, scope: !952)
!959 = !DILocation(line: 268, column: 42, scope: !952)
!960 = !DILocation(line: 268, column: 12, scope: !952)
!961 = !DILocation(line: 268, column: 10, scope: !952)
!962 = distinct !{!962, !944, !963}
!963 = !DILocation(line: 269, column: 2, scope: !885)
!964 = !DILocation(line: 271, column: 6, scope: !965)
!965 = distinct !DILexicalBlock(scope: !885, file: !102, line: 271, column: 6)
!966 = !DILocation(line: 271, column: 11, scope: !965)
!967 = !DILocation(line: 271, column: 6, scope: !885)
!968 = !DILocation(line: 272, column: 27, scope: !969)
!969 = distinct !DILexicalBlock(scope: !965, file: !102, line: 271, column: 17)
!970 = !DILocation(line: 272, column: 34, scope: !969)
!971 = !DILocation(line: 272, column: 42, scope: !969)
!972 = !DILocation(line: 272, column: 48, scope: !969)
!973 = !DILocation(line: 272, column: 3, scope: !969)
!974 = !DILocation(line: 273, column: 2, scope: !969)
!975 = !DILocation(line: 275, column: 2, scope: !885)
!976 = !DILocation(line: 275, column: 7, scope: !977)
!977 = distinct !DILexicalBlock(scope: !885, file: !102, line: 275, column: 5)
!978 = !DILocation(line: 277, column: 21, scope: !885)
!979 = !DILocation(line: 277, column: 2, scope: !885)
!980 = !DILocation(line: 278, column: 16, scope: !885)
!981 = !DILocation(line: 278, column: 23, scope: !885)
!982 = !DILocation(line: 278, column: 2, scope: !885)
!983 = !DILocation(line: 279, column: 2, scope: !885)
!984 = !DILocation(line: 280, column: 1, scope: !885)
!985 = distinct !DISubprogram(name: "sys_sflist_append_list", scope: !106, file: !106, line: 403, type: !986, scopeLine: 403, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!986 = !DISubroutineType(types: !987)
!987 = !{null, !497, !114, !114}
!988 = !DILocalVariable(name: "list", arg: 1, scope: !985, file: !106, line: 403, type: !497)
!989 = !DILocation(line: 403, column: 57, scope: !985)
!990 = !DILocalVariable(name: "head", arg: 2, scope: !985, file: !106, line: 403, type: !114)
!991 = !DILocation(line: 403, column: 69, scope: !985)
!992 = !DILocalVariable(name: "tail", arg: 3, scope: !985, file: !106, line: 403, type: !114)
!993 = !DILocation(line: 403, column: 81, scope: !985)
!994 = !DILocation(line: 403, column: 93, scope: !995)
!995 = distinct !DILexicalBlock(scope: !985, file: !106, line: 403, column: 93)
!996 = !DILocation(line: 403, column: 98, scope: !995)
!997 = !DILocation(line: 403, column: 112, scope: !995)
!998 = !DILocation(line: 403, column: 115, scope: !995)
!999 = !DILocation(line: 403, column: 120, scope: !995)
!1000 = !DILocation(line: 403, column: 93, scope: !985)
!1001 = !DILocation(line: 403, column: 162, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !106, line: 403, column: 141)
!1003 = distinct !DILexicalBlock(scope: !995, file: !106, line: 403, column: 135)
!1004 = !DILocation(line: 403, column: 141, scope: !1002)
!1005 = !DILocation(line: 403, column: 168, scope: !1002)
!1006 = !DILocation(line: 403, column: 141, scope: !1003)
!1007 = !DILocation(line: 403, column: 203, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1002, file: !106, line: 403, column: 183)
!1009 = !DILocation(line: 403, column: 225, scope: !1008)
!1010 = !DILocation(line: 403, column: 185, scope: !1008)
!1011 = !DILocation(line: 403, column: 232, scope: !1008)
!1012 = !DILocation(line: 403, column: 281, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1002, file: !106, line: 403, column: 239)
!1014 = !DILocation(line: 403, column: 260, scope: !1013)
!1015 = !DILocation(line: 403, column: 304, scope: !1013)
!1016 = !DILocation(line: 403, column: 241, scope: !1013)
!1017 = !DILocation(line: 403, column: 331, scope: !1003)
!1018 = !DILocation(line: 403, column: 353, scope: !1003)
!1019 = !DILocation(line: 403, column: 313, scope: !1003)
!1020 = !DILocation(line: 403, column: 360, scope: !1003)
!1021 = !DILocation(line: 403, column: 362, scope: !985)
!1022 = distinct !DISubprogram(name: "k_queue_merge_slist", scope: !102, file: !102, line: 282, type: !1023, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !244)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!120, !361, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !1027, line: 49, baseType: !1028)
!1027 = !DIFile(filename: "include/zephyr/sys/slist.h", directory: "/home/sri/zephyrproject/zephyr")
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !1027, line: 42, size: 64, elements: !1029)
!1029 = !{!1030, !1037}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1028, file: !1027, line: 43, baseType: !1031, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !1027, line: 39, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !1027, line: 33, size: 32, elements: !1034)
!1034 = !{!1035}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1033, file: !1027, line: 34, baseType: !1036, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1028, file: !1027, line: 44, baseType: !1031, size: 32, offset: 32)
!1038 = !DILocalVariable(name: "queue", arg: 1, scope: !1022, file: !102, line: 282, type: !361)
!1039 = !DILocation(line: 282, column: 41, scope: !1022)
!1040 = !DILocalVariable(name: "list", arg: 2, scope: !1022, file: !102, line: 282, type: !1025)
!1041 = !DILocation(line: 282, column: 61, scope: !1022)
!1042 = !DILocalVariable(name: "ret", scope: !1022, file: !102, line: 284, type: !120)
!1043 = !DILocation(line: 284, column: 6, scope: !1022)
!1044 = !DILocation(line: 286, column: 2, scope: !1022)
!1045 = !DILocation(line: 286, column: 7, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1022, file: !102, line: 286, column: 5)
!1047 = !DILocation(line: 289, column: 25, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1022, file: !102, line: 289, column: 6)
!1049 = !DILocation(line: 289, column: 6, scope: !1048)
!1050 = !DILocation(line: 289, column: 6, scope: !1022)
!1051 = !DILocation(line: 290, column: 3, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1048, file: !102, line: 289, column: 32)
!1053 = !DILocation(line: 290, column: 8, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1052, file: !102, line: 290, column: 6)
!1055 = !DILocation(line: 292, column: 3, scope: !1052)
!1056 = !DILocation(line: 304, column: 28, scope: !1022)
!1057 = !DILocation(line: 304, column: 35, scope: !1022)
!1058 = !DILocation(line: 304, column: 41, scope: !1022)
!1059 = !DILocation(line: 304, column: 47, scope: !1022)
!1060 = !DILocation(line: 304, column: 53, scope: !1022)
!1061 = !DILocation(line: 304, column: 8, scope: !1022)
!1062 = !DILocation(line: 304, column: 6, scope: !1022)
!1063 = !DILocation(line: 305, column: 6, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1022, file: !102, line: 305, column: 6)
!1065 = !DILocation(line: 305, column: 10, scope: !1064)
!1066 = !DILocation(line: 305, column: 6, scope: !1022)
!1067 = !DILocation(line: 306, column: 3, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1064, file: !102, line: 305, column: 16)
!1069 = !DILocation(line: 306, column: 8, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1068, file: !102, line: 306, column: 6)
!1071 = !DILocation(line: 308, column: 10, scope: !1068)
!1072 = !DILocation(line: 308, column: 3, scope: !1068)
!1073 = !DILocation(line: 310, column: 17, scope: !1022)
!1074 = !DILocation(line: 310, column: 2, scope: !1022)
!1075 = !DILocation(line: 312, column: 2, scope: !1022)
!1076 = !DILocation(line: 312, column: 7, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1022, file: !102, line: 312, column: 5)
!1078 = !DILocation(line: 314, column: 2, scope: !1022)
!1079 = !DILocation(line: 315, column: 1, scope: !1022)
!1080 = distinct !DISubprogram(name: "sys_slist_is_empty", scope: !1027, file: !1027, line: 268, type: !1081, scopeLine: 268, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!118, !1025}
!1083 = !DILocalVariable(name: "list", arg: 1, scope: !1080, file: !1027, line: 268, type: !1025)
!1084 = !DILocation(line: 268, column: 53, scope: !1080)
!1085 = !DILocation(line: 268, column: 89, scope: !1080)
!1086 = !DILocation(line: 268, column: 69, scope: !1080)
!1087 = !DILocation(line: 268, column: 95, scope: !1080)
!1088 = !DILocation(line: 268, column: 61, scope: !1080)
!1089 = distinct !DISubprogram(name: "sys_slist_init", scope: !1027, file: !1027, line: 199, type: !1090, scopeLine: 200, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !244)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{null, !1025}
!1092 = !DILocalVariable(name: "list", arg: 1, scope: !1089, file: !1027, line: 199, type: !1025)
!1093 = !DILocation(line: 199, column: 48, scope: !1089)
!1094 = !DILocation(line: 201, column: 2, scope: !1089)
