; ModuleID = '../bc_files/rb.bc'
source_filename = "/home/sri/zephyrproject/zephyr/lib/os/rb.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }
%struct.rbtree = type { ptr, ptr, i32 }
%struct.rbnode = type { [2 x ptr] }
%struct._rb_foreach = type { ptr, ptr, i32 }

; Function Attrs: noinline nounwind optnone

!66 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!90 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!91 = !{!92, !93, !94, !97, !105}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!93 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !95, line: 102, baseType: !96)
!95 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!96 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !99, line: 58, size: 64, elements: !100)
!99 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !98, file: !99, line: 60, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 64, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 2)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !95, line: 62, baseType: !5)
!106 = !{i32 7, !"Dwarf Version", i32 4}
!107 = !{i32 2, !"Debug Info Version", i32 3}
!108 = !{i32 1, !"wchar_size", i32 4}
!109 = !{i32 1, !"static_rwdata", i32 1}
!110 = !{i32 1, !"enumsize_buildattr", i32 1}
!111 = !{i32 1, !"armlib_unavailable", i32 0}
!112 = !{i32 8, !"PIC Level", i32 2}
!113 = !{i32 7, !"PIE Level", i32 2}
!114 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!115 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !10, file: !10, line: 223, type: !116, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !118, !120}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !122, line: 250, size: 896, elements: !123)
!122 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!123 = !{!124, !186, !199, !200, !201, !202, !223}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !121, file: !122, line: 252, baseType: !125, size: 384)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !122, line: 58, size: 384, elements: !126)
!126 = !{!127, !147, !155, !156, !157, !170, !172, !173}
!127 = !DIDerivedType(tag: DW_TAG_member, scope: !125, file: !122, line: 61, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !125, file: !122, line: 61, size: 64, elements: !129)
!129 = !{!130, !146}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !128, file: !122, line: 62, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !132, line: 55, baseType: !133)
!132 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !132, line: 37, size: 64, elements: !134)
!134 = !{!135, !141}
!135 = !DIDerivedType(tag: DW_TAG_member, scope: !133, file: !132, line: 38, baseType: !136, size: 32)
!136 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !133, file: !132, line: 38, size: 32, elements: !137)
!137 = !{!138, !140}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !136, file: !132, line: 39, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !136, file: !132, line: 40, baseType: !139, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, scope: !133, file: !132, line: 42, baseType: !142, size: 32, offset: 32)
!142 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !133, file: !132, line: 42, size: 32, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !142, file: !132, line: 43, baseType: !139, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !142, file: !132, line: 44, baseType: !139, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !128, file: !122, line: 63, baseType: !98, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !125, file: !122, line: 69, baseType: !148, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !150, line: 243, baseType: !151)
!150 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 241, size: 64, elements: !152)
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !151, file: !150, line: 242, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !132, line: 51, baseType: !133)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !125, file: !122, line: 72, baseType: !105, size: 8, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !125, file: !122, line: 75, baseType: !105, size: 8, offset: 104)
!157 = !DIDerivedType(tag: DW_TAG_member, scope: !125, file: !122, line: 91, baseType: !158, size: 16, offset: 112)
!158 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !125, file: !122, line: 91, size: 16, elements: !159)
!159 = !{!160, !167}
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !158, file: !122, line: 92, baseType: !161, size: 16)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !158, file: !122, line: 92, size: 16, elements: !162)
!162 = !{!163, !166}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !161, file: !122, line: 97, baseType: !164, size: 8)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !95, line: 56, baseType: !165)
!165 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !161, file: !122, line: 98, baseType: !105, size: 8, offset: 8)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !158, file: !122, line: 101, baseType: !168, size: 16)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !95, line: 63, baseType: !169)
!169 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !125, file: !122, line: 108, baseType: !171, size: 32, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !95, line: 64, baseType: !96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !125, file: !122, line: 132, baseType: !92, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !125, file: !122, line: 136, baseType: !174, size: 192, offset: 192)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !150, line: 254, size: 192, elements: !175)
!175 = !{!176, !177, !183}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !174, file: !150, line: 255, baseType: !131, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !174, file: !150, line: 256, baseType: !178, size: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !150, line: 252, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !174, file: !150, line: 259, baseType: !184, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !95, line: 59, baseType: !185)
!185 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !121, file: !122, line: 255, baseType: !187, size: 288, offset: 384)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !188, line: 25, size: 288, elements: !189)
!188 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !198}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !187, file: !188, line: 26, baseType: !171, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !187, file: !188, line: 27, baseType: !171, size: 32, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !187, file: !188, line: 28, baseType: !171, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !187, file: !188, line: 29, baseType: !171, size: 32, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !187, file: !188, line: 30, baseType: !171, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !187, file: !188, line: 31, baseType: !171, size: 32, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !187, file: !188, line: 32, baseType: !171, size: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !187, file: !188, line: 33, baseType: !171, size: 32, offset: 224)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !187, file: !188, line: 34, baseType: !171, size: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !121, file: !122, line: 258, baseType: !92, size: 32, offset: 672)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !121, file: !122, line: 261, baseType: !149, size: 64, offset: 704)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !121, file: !122, line: 302, baseType: !93, size: 32, offset: 768)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !121, file: !122, line: 333, baseType: !203, size: 32, offset: 800)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !205, line: 5291, size: 160, elements: !206)
!205 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!206 = !{!207, !218, !219}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !204, file: !205, line: 5292, baseType: !208, size: 96)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !209, line: 56, size: 96, elements: !210)
!209 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!210 = !{!211, !214, !215}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !208, file: !209, line: 57, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !209, line: 57, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !208, file: !209, line: 58, baseType: !92, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !208, file: !209, line: 59, baseType: !216, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !217, line: 46, baseType: !96)
!217 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!218 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !204, file: !205, line: 5293, baseType: !149, size: 64, offset: 96)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !204, file: !205, line: 5294, baseType: !220, offset: 160)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !221, line: 45, elements: !222)
!221 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!222 = !{}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !121, file: !122, line: 355, baseType: !224, size: 64, offset: 832)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !188, line: 60, size: 64, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !224, file: !188, line: 63, baseType: !171, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !224, file: !188, line: 66, baseType: !171, size: 32, offset: 32)
!228 = !DILocalVariable(name: "object", arg: 1, scope: !115, file: !10, line: 223, type: !118)
!229 = !DILocation(line: 223, column: 61, scope: !115)
!230 = !DILocalVariable(name: "thread", arg: 2, scope: !115, file: !10, line: 224, type: !120)
!231 = !DILocation(line: 224, column: 24, scope: !115)
!232 = !DILocation(line: 226, column: 9, scope: !115)
!233 = !DILocation(line: 227, column: 9, scope: !115)
!234 = !DILocation(line: 228, column: 1, scope: !115)
!235 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !10, file: !10, line: 243, type: !236, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !118}
!238 = !DILocalVariable(name: "object", arg: 1, scope: !235, file: !10, line: 243, type: !118)
!239 = !DILocation(line: 243, column: 56, scope: !235)
!240 = !DILocation(line: 245, column: 9, scope: !235)
!241 = !DILocation(line: 246, column: 1, scope: !235)
!242 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !10, file: !10, line: 359, type: !243, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!243 = !DISubroutineType(types: !244)
!244 = !{!92, !9}
!245 = !DILocalVariable(name: "otype", arg: 1, scope: !242, file: !10, line: 359, type: !9)
!246 = !DILocation(line: 359, column: 58, scope: !242)
!247 = !DILocation(line: 361, column: 9, scope: !242)
!248 = !DILocation(line: 363, column: 2, scope: !242)
!249 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !10, file: !10, line: 366, type: !250, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!250 = !DISubroutineType(types: !251)
!251 = !{!92, !9, !216}
!252 = !DILocalVariable(name: "otype", arg: 1, scope: !249, file: !10, line: 366, type: !9)
!253 = !DILocation(line: 366, column: 63, scope: !249)
!254 = !DILocalVariable(name: "size", arg: 2, scope: !249, file: !10, line: 367, type: !216)
!255 = !DILocation(line: 367, column: 13, scope: !249)
!256 = !DILocation(line: 369, column: 9, scope: !249)
!257 = !DILocation(line: 370, column: 9, scope: !249)
!258 = !DILocation(line: 372, column: 2, scope: !249)
!259 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !205, file: !205, line: 656, type: !260, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!260 = !DISubroutineType(types: !261)
!261 = !{!262, !264}
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !263, line: 46, baseType: !184)
!263 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!266 = !DILocalVariable(name: "t", arg: 1, scope: !259, file: !205, line: 657, type: !264)
!267 = !DILocation(line: 657, column: 30, scope: !259)
!268 = !DILocation(line: 659, column: 28, scope: !259)
!269 = !DILocation(line: 659, column: 31, scope: !259)
!270 = !DILocation(line: 659, column: 36, scope: !259)
!271 = !DILocation(line: 659, column: 9, scope: !259)
!272 = !DILocation(line: 659, column: 2, scope: !259)
!273 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !205, file: !205, line: 671, type: !260, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!274 = !DILocalVariable(name: "t", arg: 1, scope: !273, file: !205, line: 672, type: !264)
!275 = !DILocation(line: 672, column: 30, scope: !273)
!276 = !DILocation(line: 674, column: 30, scope: !273)
!277 = !DILocation(line: 674, column: 33, scope: !273)
!278 = !DILocation(line: 674, column: 38, scope: !273)
!279 = !DILocation(line: 674, column: 9, scope: !273)
!280 = !DILocation(line: 674, column: 2, scope: !273)
!281 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !205, file: !205, line: 1634, type: !282, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!282 = !DISubroutineType(types: !283)
!283 = !{!262, !284}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !205, line: 1439, size: 448, elements: !287)
!287 = !{!288, !289, !290, !295, !296, !301, !302}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !286, file: !205, line: 1445, baseType: !174, size: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !286, file: !205, line: 1448, baseType: !149, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !286, file: !205, line: 1451, baseType: !291, size: 32, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !294}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !286, file: !205, line: 1454, baseType: !291, size: 32, offset: 288)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !286, file: !205, line: 1457, baseType: !297, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !263, line: 67, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !263, line: 65, size: 64, elements: !299)
!299 = !{!300}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !298, file: !263, line: 66, baseType: !262, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !286, file: !205, line: 1460, baseType: !171, size: 32, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !286, file: !205, line: 1463, baseType: !92, size: 32, offset: 416)
!303 = !DILocalVariable(name: "timer", arg: 1, scope: !281, file: !205, line: 1635, type: !284)
!304 = !DILocation(line: 1635, column: 34, scope: !281)
!305 = !DILocation(line: 1637, column: 28, scope: !281)
!306 = !DILocation(line: 1637, column: 35, scope: !281)
!307 = !DILocation(line: 1637, column: 9, scope: !281)
!308 = !DILocation(line: 1637, column: 2, scope: !281)
!309 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !205, file: !205, line: 1649, type: !282, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!310 = !DILocalVariable(name: "timer", arg: 1, scope: !309, file: !205, line: 1650, type: !284)
!311 = !DILocation(line: 1650, column: 34, scope: !309)
!312 = !DILocation(line: 1652, column: 30, scope: !309)
!313 = !DILocation(line: 1652, column: 37, scope: !309)
!314 = !DILocation(line: 1652, column: 9, scope: !309)
!315 = !DILocation(line: 1652, column: 2, scope: !309)
!316 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !205, file: !205, line: 1689, type: !317, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !294, !92}
!319 = !DILocalVariable(name: "timer", arg: 1, scope: !316, file: !205, line: 1689, type: !294)
!320 = !DILocation(line: 1689, column: 65, scope: !316)
!321 = !DILocalVariable(name: "user_data", arg: 2, scope: !316, file: !205, line: 1690, type: !92)
!322 = !DILocation(line: 1690, column: 19, scope: !316)
!323 = !DILocation(line: 1692, column: 21, scope: !316)
!324 = !DILocation(line: 1692, column: 2, scope: !316)
!325 = !DILocation(line: 1692, column: 9, scope: !316)
!326 = !DILocation(line: 1692, column: 19, scope: !316)
!327 = !DILocation(line: 1693, column: 1, scope: !316)
!328 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !205, file: !205, line: 1704, type: !329, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!329 = !DISubroutineType(types: !330)
!330 = !{!92, !284}
!331 = !DILocalVariable(name: "timer", arg: 1, scope: !328, file: !205, line: 1704, type: !284)
!332 = !DILocation(line: 1704, column: 72, scope: !328)
!333 = !DILocation(line: 1706, column: 9, scope: !328)
!334 = !DILocation(line: 1706, column: 16, scope: !328)
!335 = !DILocation(line: 1706, column: 2, scope: !328)
!336 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !205, file: !205, line: 2071, type: !337, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!337 = !DISubroutineType(types: !338)
!338 = !{!93, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !205, line: 1830, size: 128, elements: !341)
!341 = !{!342, !355, !356}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !340, file: !205, line: 1831, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !344, line: 60, baseType: !345)
!344 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !344, line: 53, size: 64, elements: !346)
!346 = !{!347, !354}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !345, file: !344, line: 54, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !344, line: 50, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !344, line: 44, size: 32, elements: !351)
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !350, file: !344, line: 45, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !344, line: 40, baseType: !171)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !345, file: !344, line: 55, baseType: !348, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !340, file: !205, line: 1832, baseType: !220, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !340, file: !205, line: 1833, baseType: !149, size: 64, offset: 64)
!357 = !DILocalVariable(name: "queue", arg: 1, scope: !336, file: !205, line: 2071, type: !339)
!358 = !DILocation(line: 2071, column: 59, scope: !336)
!359 = !DILocation(line: 2073, column: 35, scope: !336)
!360 = !DILocation(line: 2073, column: 42, scope: !336)
!361 = !DILocation(line: 2073, column: 14, scope: !336)
!362 = !DILocation(line: 2073, column: 9, scope: !336)
!363 = !DILocation(line: 2073, column: 2, scope: !336)
!364 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !205, file: !205, line: 3209, type: !365, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!365 = !DISubroutineType(types: !366)
!366 = !{!96, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !205, line: 3092, size: 128, elements: !369)
!369 = !{!370, !371, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !368, file: !205, line: 3093, baseType: !149, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !368, file: !205, line: 3094, baseType: !96, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !368, file: !205, line: 3095, baseType: !96, size: 32, offset: 96)
!373 = !DILocalVariable(name: "sem", arg: 1, scope: !364, file: !205, line: 3209, type: !367)
!374 = !DILocation(line: 3209, column: 65, scope: !364)
!375 = !DILocation(line: 3211, column: 9, scope: !364)
!376 = !DILocation(line: 3211, column: 14, scope: !364)
!377 = !DILocation(line: 3211, column: 2, scope: !364)
!378 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !205, file: !205, line: 4649, type: !379, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!379 = !DISubroutineType(types: !380)
!380 = !{!171, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !205, line: 4390, size: 320, elements: !383)
!383 = !{!384, !385, !386, !387, !388, !391, !392, !393, !394, !395}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !382, file: !205, line: 4392, baseType: !149, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !382, file: !205, line: 4394, baseType: !220, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !382, file: !205, line: 4396, baseType: !216, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !382, file: !205, line: 4398, baseType: !171, size: 32, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !382, file: !205, line: 4400, baseType: !389, size: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !382, file: !205, line: 4402, baseType: !389, size: 32, offset: 160)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !382, file: !205, line: 4404, baseType: !389, size: 32, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !382, file: !205, line: 4406, baseType: !389, size: 32, offset: 224)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !382, file: !205, line: 4408, baseType: !171, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !382, file: !205, line: 4413, baseType: !105, size: 8, offset: 288)
!396 = !DILocalVariable(name: "msgq", arg: 1, scope: !378, file: !205, line: 4649, type: !381)
!397 = !DILocation(line: 4649, column: 66, scope: !378)
!398 = !DILocation(line: 4651, column: 9, scope: !378)
!399 = !DILocation(line: 4651, column: 15, scope: !378)
!400 = !DILocation(line: 4651, column: 26, scope: !378)
!401 = !DILocation(line: 4651, column: 32, scope: !378)
!402 = !DILocation(line: 4651, column: 24, scope: !378)
!403 = !DILocation(line: 4651, column: 2, scope: !378)
!404 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !205, file: !205, line: 4665, type: !379, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!405 = !DILocalVariable(name: "msgq", arg: 1, scope: !404, file: !205, line: 4665, type: !381)
!406 = !DILocation(line: 4665, column: 66, scope: !404)
!407 = !DILocation(line: 4667, column: 9, scope: !404)
!408 = !DILocation(line: 4667, column: 15, scope: !404)
!409 = !DILocation(line: 4667, column: 2, scope: !404)
!410 = distinct !DISubprogram(name: "z_rb_get_minmax", scope: !4, file: !4, line: 100, type: !411, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !222)
!411 = !DISubroutineType(types: !412)
!412 = !{!97, !413, !105}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbtree", file: !99, line: 91, size: 96, elements: !415)
!415 = !{!416, !417, !423}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !414, file: !99, line: 93, baseType: !97, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lessthan_fn", scope: !414, file: !99, line: 95, baseType: !418, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_lessthan_t", file: !99, line: 86, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!420 = !DISubroutineType(types: !421)
!421 = !{!422, !97, !97}
!422 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "max_depth", scope: !414, file: !99, line: 97, baseType: !93, size: 32, offset: 64)
!424 = !DILocalVariable(name: "tree", arg: 1, scope: !410, file: !4, line: 100, type: !413)
!425 = !DILocation(line: 100, column: 47, scope: !410)
!426 = !DILocalVariable(name: "side", arg: 2, scope: !410, file: !4, line: 100, type: !105)
!427 = !DILocation(line: 100, column: 61, scope: !410)
!428 = !DILocalVariable(name: "n", scope: !410, file: !4, line: 102, type: !97)
!429 = !DILocation(line: 102, column: 17, scope: !410)
!430 = !DILocation(line: 104, column: 11, scope: !431)
!431 = distinct !DILexicalBlock(scope: !410, file: !4, line: 104, column: 2)
!432 = !DILocation(line: 104, column: 17, scope: !431)
!433 = !DILocation(line: 104, column: 9, scope: !431)
!434 = !DILocation(line: 104, column: 7, scope: !431)
!435 = !DILocation(line: 104, column: 24, scope: !436)
!436 = distinct !DILexicalBlock(scope: !431, file: !4, line: 104, column: 2)
!437 = !DILocation(line: 104, column: 26, scope: !436)
!438 = !DILocation(line: 104, column: 41, scope: !436)
!439 = !DILocation(line: 104, column: 55, scope: !436)
!440 = !DILocation(line: 104, column: 58, scope: !436)
!441 = !DILocation(line: 104, column: 45, scope: !436)
!442 = !DILocation(line: 104, column: 64, scope: !436)
!443 = !DILocation(line: 0, scope: !436)
!444 = !DILocation(line: 104, column: 2, scope: !431)
!445 = !DILocation(line: 107, column: 2, scope: !446)
!446 = distinct !DILexicalBlock(scope: !436, file: !4, line: 105, column: 28)
!447 = !DILocation(line: 105, column: 18, scope: !436)
!448 = !DILocation(line: 105, column: 21, scope: !436)
!449 = !DILocation(line: 105, column: 8, scope: !436)
!450 = !DILocation(line: 105, column: 6, scope: !436)
!451 = !DILocation(line: 104, column: 2, scope: !436)
!452 = distinct !{!452, !444, !453}
!453 = !DILocation(line: 107, column: 2, scope: !431)
!454 = !DILocation(line: 108, column: 9, scope: !410)
!455 = !DILocation(line: 108, column: 2, scope: !410)
!456 = distinct !DISubprogram(name: "get_child", scope: !4, file: !4, line: 21, type: !457, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!457 = !DISubroutineType(types: !458)
!458 = !{!97, !97, !105}
!459 = !DILocalVariable(name: "n", arg: 1, scope: !456, file: !4, line: 21, type: !97)
!460 = !DILocation(line: 21, column: 48, scope: !456)
!461 = !DILocalVariable(name: "side", arg: 2, scope: !456, file: !4, line: 21, type: !105)
!462 = !DILocation(line: 21, column: 59, scope: !456)
!463 = !DILocation(line: 24, column: 6, scope: !464)
!464 = distinct !DILexicalBlock(scope: !456, file: !4, line: 24, column: 6)
!465 = !DILocation(line: 24, column: 11, scope: !464)
!466 = !DILocation(line: 24, column: 6, scope: !456)
!467 = !DILocation(line: 25, column: 10, scope: !468)
!468 = distinct !DILexicalBlock(scope: !464, file: !4, line: 24, column: 18)
!469 = !DILocation(line: 25, column: 13, scope: !468)
!470 = !DILocation(line: 25, column: 3, scope: !468)
!471 = !DILocalVariable(name: "l", scope: !456, file: !4, line: 28, type: !94)
!472 = !DILocation(line: 28, column: 12, scope: !456)
!473 = !DILocation(line: 28, column: 28, scope: !456)
!474 = !DILocation(line: 28, column: 31, scope: !456)
!475 = !DILocation(line: 28, column: 16, scope: !456)
!476 = !DILocation(line: 30, column: 4, scope: !456)
!477 = !DILocation(line: 31, column: 27, scope: !456)
!478 = !DILocation(line: 31, column: 9, scope: !456)
!479 = !DILocation(line: 31, column: 2, scope: !456)
!480 = !DILocation(line: 32, column: 1, scope: !456)
!481 = distinct !DISubprogram(name: "rb_insert", scope: !4, file: !4, line: 217, type: !482, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !222)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !413, !97}
!484 = !DILocalVariable(name: "tree", arg: 1, scope: !481, file: !4, line: 217, type: !413)
!485 = !DILocation(line: 217, column: 31, scope: !481)
!486 = !DILocalVariable(name: "node", arg: 2, scope: !481, file: !4, line: 217, type: !97)
!487 = !DILocation(line: 217, column: 52, scope: !481)
!488 = !DILocation(line: 219, column: 12, scope: !481)
!489 = !DILocation(line: 219, column: 2, scope: !481)
!490 = !DILocation(line: 220, column: 12, scope: !481)
!491 = !DILocation(line: 220, column: 2, scope: !481)
!492 = !DILocation(line: 222, column: 6, scope: !493)
!493 = distinct !DILexicalBlock(scope: !481, file: !4, line: 222, column: 6)
!494 = !DILocation(line: 222, column: 12, scope: !493)
!495 = !DILocation(line: 222, column: 17, scope: !493)
!496 = !DILocation(line: 222, column: 6, scope: !481)
!497 = !DILocation(line: 223, column: 16, scope: !498)
!498 = distinct !DILexicalBlock(scope: !493, file: !4, line: 222, column: 32)
!499 = !DILocation(line: 223, column: 3, scope: !498)
!500 = !DILocation(line: 223, column: 9, scope: !498)
!501 = !DILocation(line: 223, column: 14, scope: !498)
!502 = !DILocation(line: 224, column: 3, scope: !498)
!503 = !DILocation(line: 224, column: 9, scope: !498)
!504 = !DILocation(line: 224, column: 19, scope: !498)
!505 = !DILocation(line: 225, column: 13, scope: !498)
!506 = !DILocation(line: 225, column: 3, scope: !498)
!507 = !DILocation(line: 226, column: 3, scope: !498)
!508 = !DILocation(line: 232, column: 23, scope: !481)
!509 = !DILocation(line: 232, column: 29, scope: !481)
!510 = !DILocation(line: 232, column: 39, scope: !481)
!511 = !DILocation(line: 232, column: 2, scope: !481)
!512 = !DILocalVariable(name: "__vla_expr0", scope: !481, type: !96, flags: DIFlagArtificial)
!513 = !DILocation(line: 0, scope: !481)
!514 = !DILocalVariable(name: "stack", scope: !481, file: !4, line: 232, type: !515)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: !512)
!518 = !DILocation(line: 232, column: 17, scope: !481)
!519 = !DILocalVariable(name: "stacksz", scope: !481, file: !4, line: 235, type: !93)
!520 = !DILocation(line: 235, column: 6, scope: !481)
!521 = !DILocation(line: 235, column: 31, scope: !481)
!522 = !DILocation(line: 235, column: 37, scope: !481)
!523 = !DILocation(line: 235, column: 16, scope: !481)
!524 = !DILocalVariable(name: "parent", scope: !481, file: !4, line: 237, type: !97)
!525 = !DILocation(line: 237, column: 17, scope: !481)
!526 = !DILocation(line: 237, column: 32, scope: !481)
!527 = !DILocation(line: 237, column: 40, scope: !481)
!528 = !DILocation(line: 237, column: 26, scope: !481)
!529 = !DILocalVariable(name: "side", scope: !481, file: !4, line: 239, type: !105)
!530 = !DILocation(line: 239, column: 10, scope: !481)
!531 = !DILocation(line: 239, column: 17, scope: !481)
!532 = !DILocation(line: 239, column: 23, scope: !481)
!533 = !DILocation(line: 239, column: 35, scope: !481)
!534 = !DILocation(line: 239, column: 41, scope: !481)
!535 = !DILocation(line: 241, column: 12, scope: !481)
!536 = !DILocation(line: 241, column: 20, scope: !481)
!537 = !DILocation(line: 241, column: 26, scope: !481)
!538 = !DILocation(line: 241, column: 2, scope: !481)
!539 = !DILocation(line: 242, column: 12, scope: !481)
!540 = !DILocation(line: 242, column: 2, scope: !481)
!541 = !DILocation(line: 244, column: 21, scope: !481)
!542 = !DILocation(line: 244, column: 15, scope: !481)
!543 = !DILocation(line: 244, column: 2, scope: !481)
!544 = !DILocation(line: 244, column: 19, scope: !481)
!545 = !DILocation(line: 245, column: 23, scope: !481)
!546 = !DILocation(line: 245, column: 2, scope: !481)
!547 = !DILocation(line: 247, column: 6, scope: !548)
!548 = distinct !DILexicalBlock(scope: !481, file: !4, line: 247, column: 6)
!549 = !DILocation(line: 247, column: 16, scope: !548)
!550 = !DILocation(line: 247, column: 22, scope: !548)
!551 = !DILocation(line: 247, column: 14, scope: !548)
!552 = !DILocation(line: 247, column: 6, scope: !481)
!553 = !DILocation(line: 248, column: 21, scope: !554)
!554 = distinct !DILexicalBlock(scope: !548, file: !4, line: 247, column: 33)
!555 = !DILocation(line: 248, column: 3, scope: !554)
!556 = !DILocation(line: 248, column: 9, scope: !554)
!557 = !DILocation(line: 248, column: 19, scope: !554)
!558 = !DILocation(line: 249, column: 2, scope: !554)
!559 = !DILocation(line: 252, column: 15, scope: !481)
!560 = !DILocation(line: 252, column: 2, scope: !481)
!561 = !DILocation(line: 252, column: 8, scope: !481)
!562 = !DILocation(line: 252, column: 13, scope: !481)
!563 = !DILocation(line: 254, column: 1, scope: !481)
!564 = distinct !DISubprogram(name: "set_child", scope: !4, file: !4, line: 34, type: !565, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !97, !105, !92}
!567 = !DILocalVariable(name: "n", arg: 1, scope: !564, file: !4, line: 34, type: !97)
!568 = !DILocation(line: 34, column: 38, scope: !564)
!569 = !DILocalVariable(name: "side", arg: 2, scope: !564, file: !4, line: 34, type: !105)
!570 = !DILocation(line: 34, column: 49, scope: !564)
!571 = !DILocalVariable(name: "val", arg: 3, scope: !564, file: !4, line: 34, type: !92)
!572 = !DILocation(line: 34, column: 61, scope: !564)
!573 = !DILocation(line: 37, column: 6, scope: !574)
!574 = distinct !DILexicalBlock(scope: !564, file: !4, line: 37, column: 6)
!575 = !DILocation(line: 37, column: 11, scope: !574)
!576 = !DILocation(line: 37, column: 6, scope: !564)
!577 = !DILocation(line: 38, column: 20, scope: !578)
!578 = distinct !DILexicalBlock(scope: !574, file: !4, line: 37, column: 18)
!579 = !DILocation(line: 38, column: 3, scope: !578)
!580 = !DILocation(line: 38, column: 6, scope: !578)
!581 = !DILocation(line: 38, column: 18, scope: !578)
!582 = !DILocation(line: 39, column: 2, scope: !578)
!583 = !DILocalVariable(name: "old", scope: !584, file: !4, line: 40, type: !94)
!584 = distinct !DILexicalBlock(scope: !574, file: !4, line: 39, column: 9)
!585 = !DILocation(line: 40, column: 13, scope: !584)
!586 = !DILocation(line: 40, column: 31, scope: !584)
!587 = !DILocation(line: 40, column: 34, scope: !584)
!588 = !DILocation(line: 40, column: 19, scope: !584)
!589 = !DILocalVariable(name: "new", scope: !584, file: !4, line: 41, type: !94)
!590 = !DILocation(line: 41, column: 13, scope: !584)
!591 = !DILocation(line: 41, column: 31, scope: !584)
!592 = !DILocation(line: 41, column: 19, scope: !584)
!593 = !DILocation(line: 43, column: 30, scope: !584)
!594 = !DILocation(line: 43, column: 37, scope: !584)
!595 = !DILocation(line: 43, column: 41, scope: !584)
!596 = !DILocation(line: 43, column: 34, scope: !584)
!597 = !DILocation(line: 43, column: 20, scope: !584)
!598 = !DILocation(line: 43, column: 3, scope: !584)
!599 = !DILocation(line: 43, column: 6, scope: !584)
!600 = !DILocation(line: 43, column: 18, scope: !584)
!601 = !DILocation(line: 45, column: 1, scope: !564)
!602 = distinct !DISubprogram(name: "set_color", scope: !4, file: !4, line: 63, type: !603, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !97, !3}
!605 = !DILocalVariable(name: "n", arg: 1, scope: !602, file: !4, line: 63, type: !97)
!606 = !DILocation(line: 63, column: 38, scope: !602)
!607 = !DILocalVariable(name: "color", arg: 2, scope: !602, file: !4, line: 63, type: !3)
!608 = !DILocation(line: 63, column: 55, scope: !602)
!609 = !DILocalVariable(name: "p", scope: !602, file: !4, line: 67, type: !610)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!611 = !DILocation(line: 67, column: 13, scope: !602)
!612 = !DILocation(line: 67, column: 27, scope: !602)
!613 = !DILocation(line: 67, column: 30, scope: !602)
!614 = !DILocation(line: 69, column: 9, scope: !602)
!615 = !DILocation(line: 69, column: 8, scope: !602)
!616 = !DILocation(line: 69, column: 11, scope: !602)
!617 = !DILocation(line: 69, column: 30, scope: !602)
!618 = !DILocation(line: 69, column: 21, scope: !602)
!619 = !DILocation(line: 69, column: 19, scope: !602)
!620 = !DILocation(line: 69, column: 3, scope: !602)
!621 = !DILocation(line: 69, column: 5, scope: !602)
!622 = !DILocation(line: 70, column: 1, scope: !602)
!623 = distinct !DISubprogram(name: "find_and_stack", scope: !4, file: !4, line: 79, type: !624, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!624 = !DISubroutineType(types: !625)
!625 = !{!93, !413, !97, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!627 = !DILocalVariable(name: "tree", arg: 1, scope: !623, file: !4, line: 79, type: !413)
!628 = !DILocation(line: 79, column: 42, scope: !623)
!629 = !DILocalVariable(name: "node", arg: 2, scope: !623, file: !4, line: 79, type: !97)
!630 = !DILocation(line: 79, column: 63, scope: !623)
!631 = !DILocalVariable(name: "stack", arg: 3, scope: !623, file: !4, line: 80, type: !626)
!632 = !DILocation(line: 80, column: 22, scope: !623)
!633 = !DILocalVariable(name: "sz", scope: !623, file: !4, line: 82, type: !93)
!634 = !DILocation(line: 82, column: 6, scope: !623)
!635 = !DILocation(line: 84, column: 16, scope: !623)
!636 = !DILocation(line: 84, column: 22, scope: !623)
!637 = !DILocation(line: 84, column: 2, scope: !623)
!638 = !DILocation(line: 84, column: 10, scope: !623)
!639 = !DILocation(line: 84, column: 14, scope: !623)
!640 = !DILocation(line: 86, column: 2, scope: !623)
!641 = !DILocation(line: 86, column: 9, scope: !623)
!642 = !DILocation(line: 86, column: 15, scope: !623)
!643 = !DILocation(line: 86, column: 18, scope: !623)
!644 = !DILocation(line: 86, column: 26, scope: !623)
!645 = !DILocation(line: 86, column: 23, scope: !623)
!646 = !DILocalVariable(name: "side", scope: !647, file: !4, line: 87, type: !105)
!647 = distinct !DILexicalBlock(scope: !623, file: !4, line: 86, column: 32)
!648 = !DILocation(line: 87, column: 11, scope: !647)
!649 = !DILocation(line: 87, column: 18, scope: !647)
!650 = !DILocation(line: 87, column: 24, scope: !647)
!651 = !DILocation(line: 87, column: 36, scope: !647)
!652 = !DILocation(line: 87, column: 42, scope: !647)
!653 = !DILocation(line: 87, column: 48, scope: !647)
!654 = !DILocation(line: 87, column: 51, scope: !647)
!655 = !DILocalVariable(name: "ch", scope: !647, file: !4, line: 88, type: !97)
!656 = !DILocation(line: 88, column: 18, scope: !647)
!657 = !DILocation(line: 88, column: 33, scope: !647)
!658 = !DILocation(line: 88, column: 39, scope: !647)
!659 = !DILocation(line: 88, column: 42, scope: !647)
!660 = !DILocation(line: 88, column: 48, scope: !647)
!661 = !DILocation(line: 88, column: 23, scope: !647)
!662 = !DILocation(line: 90, column: 7, scope: !663)
!663 = distinct !DILexicalBlock(scope: !647, file: !4, line: 90, column: 7)
!664 = !DILocation(line: 90, column: 10, scope: !663)
!665 = !DILocation(line: 90, column: 7, scope: !647)
!666 = !DILocation(line: 91, column: 18, scope: !667)
!667 = distinct !DILexicalBlock(scope: !663, file: !4, line: 90, column: 25)
!668 = !DILocation(line: 91, column: 4, scope: !667)
!669 = !DILocation(line: 91, column: 12, scope: !667)
!670 = !DILocation(line: 91, column: 16, scope: !667)
!671 = !DILocation(line: 92, column: 3, scope: !667)
!672 = !DILocation(line: 93, column: 4, scope: !673)
!673 = distinct !DILexicalBlock(scope: !663, file: !4, line: 92, column: 10)
!674 = distinct !{!674, !640, !675}
!675 = !DILocation(line: 95, column: 2, scope: !623)
!676 = !DILocation(line: 97, column: 9, scope: !623)
!677 = !DILocation(line: 97, column: 2, scope: !623)
!678 = distinct !DISubprogram(name: "fix_extra_red", scope: !4, file: !4, line: 155, type: !679, scopeLine: 156, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !626, !93}
!681 = !DILocalVariable(name: "stack", arg: 1, scope: !678, file: !4, line: 155, type: !626)
!682 = !DILocation(line: 155, column: 43, scope: !678)
!683 = !DILocalVariable(name: "stacksz", arg: 2, scope: !678, file: !4, line: 155, type: !93)
!684 = !DILocation(line: 155, column: 54, scope: !678)
!685 = !DILocation(line: 157, column: 2, scope: !678)
!686 = !DILocation(line: 157, column: 9, scope: !678)
!687 = !DILocation(line: 157, column: 17, scope: !678)
!688 = !DILocalVariable(name: "node", scope: !689, file: !4, line: 158, type: !97)
!689 = distinct !DILexicalBlock(scope: !678, file: !4, line: 157, column: 22)
!690 = !DILocation(line: 158, column: 18, scope: !689)
!691 = !DILocation(line: 158, column: 25, scope: !689)
!692 = !DILocation(line: 158, column: 31, scope: !689)
!693 = !DILocation(line: 158, column: 39, scope: !689)
!694 = !DILocalVariable(name: "parent", scope: !689, file: !4, line: 159, type: !97)
!695 = !DILocation(line: 159, column: 18, scope: !689)
!696 = !DILocation(line: 159, column: 27, scope: !689)
!697 = !DILocation(line: 159, column: 33, scope: !689)
!698 = !DILocation(line: 159, column: 41, scope: !689)
!699 = !DILocation(line: 167, column: 16, scope: !700)
!700 = distinct !DILexicalBlock(scope: !689, file: !4, line: 167, column: 7)
!701 = !DILocation(line: 167, column: 7, scope: !700)
!702 = !DILocation(line: 167, column: 7, scope: !689)
!703 = !DILocation(line: 168, column: 4, scope: !704)
!704 = distinct !DILexicalBlock(scope: !700, file: !4, line: 167, column: 25)
!705 = !DILocalVariable(name: "grandparent", scope: !689, file: !4, line: 176, type: !97)
!706 = !DILocation(line: 176, column: 18, scope: !689)
!707 = !DILocation(line: 176, column: 32, scope: !689)
!708 = !DILocation(line: 176, column: 38, scope: !689)
!709 = !DILocation(line: 176, column: 46, scope: !689)
!710 = !DILocalVariable(name: "side", scope: !689, file: !4, line: 177, type: !105)
!711 = !DILocation(line: 177, column: 11, scope: !689)
!712 = !DILocation(line: 177, column: 27, scope: !689)
!713 = !DILocation(line: 177, column: 40, scope: !689)
!714 = !DILocation(line: 177, column: 18, scope: !689)
!715 = !DILocalVariable(name: "aunt", scope: !689, file: !4, line: 178, type: !97)
!716 = !DILocation(line: 178, column: 18, scope: !689)
!717 = !DILocation(line: 178, column: 35, scope: !689)
!718 = !DILocation(line: 179, column: 8, scope: !689)
!719 = !DILocation(line: 179, column: 13, scope: !689)
!720 = !DILocation(line: 179, column: 7, scope: !689)
!721 = !DILocation(line: 178, column: 25, scope: !689)
!722 = !DILocation(line: 181, column: 8, scope: !723)
!723 = distinct !DILexicalBlock(scope: !689, file: !4, line: 181, column: 7)
!724 = !DILocation(line: 181, column: 13, scope: !723)
!725 = !DILocation(line: 181, column: 28, scope: !723)
!726 = !DILocation(line: 181, column: 38, scope: !723)
!727 = !DILocation(line: 181, column: 31, scope: !723)
!728 = !DILocation(line: 181, column: 7, scope: !689)
!729 = !DILocation(line: 182, column: 14, scope: !730)
!730 = distinct !DILexicalBlock(scope: !723, file: !4, line: 181, column: 45)
!731 = !DILocation(line: 182, column: 4, scope: !730)
!732 = !DILocation(line: 183, column: 14, scope: !730)
!733 = !DILocation(line: 183, column: 4, scope: !730)
!734 = !DILocation(line: 184, column: 14, scope: !730)
!735 = !DILocation(line: 184, column: 4, scope: !730)
!736 = !DILocation(line: 190, column: 12, scope: !730)
!737 = !DILocation(line: 191, column: 4, scope: !730)
!738 = distinct !{!738, !685, !739}
!739 = !DILocation(line: 209, column: 2, scope: !678)
!740 = !DILocalVariable(name: "parent_side", scope: !689, file: !4, line: 198, type: !105)
!741 = !DILocation(line: 198, column: 11, scope: !689)
!742 = !DILocation(line: 198, column: 34, scope: !689)
!743 = !DILocation(line: 198, column: 42, scope: !689)
!744 = !DILocation(line: 198, column: 25, scope: !689)
!745 = !DILocation(line: 200, column: 7, scope: !746)
!746 = distinct !DILexicalBlock(scope: !689, file: !4, line: 200, column: 7)
!747 = !DILocation(line: 200, column: 22, scope: !746)
!748 = !DILocation(line: 200, column: 19, scope: !746)
!749 = !DILocation(line: 200, column: 7, scope: !689)
!750 = !DILocation(line: 201, column: 11, scope: !751)
!751 = distinct !DILexicalBlock(scope: !746, file: !4, line: 200, column: 28)
!752 = !DILocation(line: 201, column: 18, scope: !751)
!753 = !DILocation(line: 201, column: 4, scope: !751)
!754 = !DILocation(line: 202, column: 3, scope: !751)
!755 = !DILocation(line: 205, column: 10, scope: !689)
!756 = !DILocation(line: 205, column: 17, scope: !689)
!757 = !DILocation(line: 205, column: 25, scope: !689)
!758 = !DILocation(line: 205, column: 3, scope: !689)
!759 = !DILocation(line: 206, column: 13, scope: !689)
!760 = !DILocation(line: 206, column: 19, scope: !689)
!761 = !DILocation(line: 206, column: 27, scope: !689)
!762 = !DILocation(line: 206, column: 3, scope: !689)
!763 = !DILocation(line: 207, column: 13, scope: !689)
!764 = !DILocation(line: 207, column: 19, scope: !689)
!765 = !DILocation(line: 207, column: 27, scope: !689)
!766 = !DILocation(line: 207, column: 3, scope: !689)
!767 = !DILocation(line: 208, column: 3, scope: !689)
!768 = !DILocation(line: 214, column: 12, scope: !678)
!769 = !DILocation(line: 214, column: 2, scope: !678)
!770 = !DILocation(line: 215, column: 1, scope: !678)
!771 = distinct !DISubprogram(name: "rb_remove", scope: !4, file: !4, line: 367, type: !482, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !222)
!772 = !DILocalVariable(name: "tree", arg: 1, scope: !771, file: !4, line: 367, type: !413)
!773 = !DILocation(line: 367, column: 31, scope: !771)
!774 = !DILocalVariable(name: "node", arg: 2, scope: !771, file: !4, line: 367, type: !97)
!775 = !DILocation(line: 367, column: 52, scope: !771)
!776 = !DILocalVariable(name: "tmp", scope: !771, file: !4, line: 369, type: !97)
!777 = !DILocation(line: 369, column: 17, scope: !771)
!778 = !DILocation(line: 373, column: 23, scope: !771)
!779 = !DILocation(line: 373, column: 29, scope: !771)
!780 = !DILocation(line: 373, column: 39, scope: !771)
!781 = !DILocation(line: 373, column: 2, scope: !771)
!782 = !DILocalVariable(name: "__vla_expr0", scope: !771, type: !96, flags: DIFlagArtificial)
!783 = !DILocation(line: 0, scope: !771)
!784 = !DILocalVariable(name: "stack", scope: !771, file: !4, line: 373, type: !785)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: !782)
!788 = !DILocation(line: 373, column: 17, scope: !771)
!789 = !DILocalVariable(name: "stacksz", scope: !771, file: !4, line: 376, type: !93)
!790 = !DILocation(line: 376, column: 6, scope: !771)
!791 = !DILocation(line: 376, column: 31, scope: !771)
!792 = !DILocation(line: 376, column: 37, scope: !771)
!793 = !DILocation(line: 376, column: 16, scope: !771)
!794 = !DILocation(line: 378, column: 6, scope: !795)
!795 = distinct !DILexicalBlock(scope: !771, file: !4, line: 378, column: 6)
!796 = !DILocation(line: 378, column: 20, scope: !795)
!797 = !DILocation(line: 378, column: 28, scope: !795)
!798 = !DILocation(line: 378, column: 14, scope: !795)
!799 = !DILocation(line: 378, column: 11, scope: !795)
!800 = !DILocation(line: 378, column: 6, scope: !771)
!801 = !DILocation(line: 379, column: 3, scope: !802)
!802 = distinct !DILexicalBlock(scope: !795, file: !4, line: 378, column: 34)
!803 = !DILocation(line: 387, column: 17, scope: !804)
!804 = distinct !DILexicalBlock(scope: !771, file: !4, line: 387, column: 6)
!805 = !DILocation(line: 387, column: 7, scope: !804)
!806 = !DILocation(line: 387, column: 27, scope: !804)
!807 = !DILocation(line: 387, column: 42, scope: !804)
!808 = !DILocation(line: 387, column: 56, scope: !804)
!809 = !DILocation(line: 387, column: 46, scope: !804)
!810 = !DILocation(line: 387, column: 66, scope: !804)
!811 = !DILocation(line: 387, column: 6, scope: !771)
!812 = !DILocalVariable(name: "stacksz0", scope: !813, file: !4, line: 388, type: !93)
!813 = distinct !DILexicalBlock(scope: !804, file: !4, line: 387, column: 82)
!814 = !DILocation(line: 388, column: 7, scope: !813)
!815 = !DILocation(line: 388, column: 18, scope: !813)
!816 = !DILocalVariable(name: "hiparent", scope: !813, file: !4, line: 389, type: !97)
!817 = !DILocation(line: 389, column: 18, scope: !813)
!818 = !DILocalVariable(name: "loparent", scope: !813, file: !4, line: 389, type: !97)
!819 = !DILocation(line: 389, column: 29, scope: !813)
!820 = !DILocalVariable(name: "node2", scope: !813, file: !4, line: 390, type: !97)
!821 = !DILocation(line: 390, column: 18, scope: !813)
!822 = !DILocation(line: 390, column: 36, scope: !813)
!823 = !DILocation(line: 390, column: 26, scope: !813)
!824 = !DILocation(line: 392, column: 15, scope: !813)
!825 = !DILocation(line: 392, column: 23, scope: !813)
!826 = !DILocation(line: 392, column: 14, scope: !813)
!827 = !DILocation(line: 392, column: 36, scope: !813)
!828 = !DILocation(line: 392, column: 44, scope: !813)
!829 = !DILocation(line: 392, column: 30, scope: !813)
!830 = !DILocation(line: 392, column: 12, scope: !813)
!831 = !DILocation(line: 393, column: 22, scope: !813)
!832 = !DILocation(line: 393, column: 16, scope: !813)
!833 = !DILocation(line: 393, column: 3, scope: !813)
!834 = !DILocation(line: 393, column: 20, scope: !813)
!835 = !DILocation(line: 394, column: 3, scope: !813)
!836 = !DILocation(line: 394, column: 20, scope: !813)
!837 = !DILocation(line: 394, column: 10, scope: !813)
!838 = !DILocation(line: 394, column: 31, scope: !813)
!839 = !DILocation(line: 395, column: 22, scope: !840)
!840 = distinct !DILexicalBlock(scope: !813, file: !4, line: 394, column: 46)
!841 = !DILocation(line: 395, column: 12, scope: !840)
!842 = !DILocation(line: 395, column: 10, scope: !840)
!843 = !DILocation(line: 396, column: 23, scope: !840)
!844 = !DILocation(line: 396, column: 17, scope: !840)
!845 = !DILocation(line: 396, column: 4, scope: !840)
!846 = !DILocation(line: 396, column: 21, scope: !840)
!847 = distinct !{!847, !835, !848}
!848 = !DILocation(line: 397, column: 3, scope: !813)
!849 = !DILocation(line: 399, column: 20, scope: !813)
!850 = !DILocation(line: 399, column: 28, scope: !813)
!851 = !DILocation(line: 399, column: 14, scope: !813)
!852 = !DILocation(line: 399, column: 12, scope: !813)
!853 = !DILocation(line: 417, column: 7, scope: !854)
!854 = distinct !DILexicalBlock(scope: !813, file: !4, line: 417, column: 7)
!855 = !DILocation(line: 417, column: 16, scope: !854)
!856 = !DILocation(line: 417, column: 7, scope: !813)
!857 = !DILocation(line: 418, column: 14, scope: !858)
!858 = distinct !DILexicalBlock(scope: !854, file: !4, line: 417, column: 31)
!859 = !DILocation(line: 418, column: 33, scope: !858)
!860 = !DILocation(line: 418, column: 43, scope: !858)
!861 = !DILocation(line: 418, column: 24, scope: !858)
!862 = !DILocation(line: 418, column: 50, scope: !858)
!863 = !DILocation(line: 418, column: 4, scope: !858)
!864 = !DILocation(line: 419, column: 3, scope: !858)
!865 = !DILocation(line: 420, column: 17, scope: !866)
!866 = distinct !DILexicalBlock(scope: !854, file: !4, line: 419, column: 10)
!867 = !DILocation(line: 420, column: 4, scope: !866)
!868 = !DILocation(line: 420, column: 10, scope: !866)
!869 = !DILocation(line: 420, column: 15, scope: !866)
!870 = !DILocation(line: 423, column: 7, scope: !871)
!871 = distinct !DILexicalBlock(scope: !813, file: !4, line: 423, column: 7)
!872 = !DILocation(line: 423, column: 19, scope: !871)
!873 = !DILocation(line: 423, column: 16, scope: !871)
!874 = !DILocation(line: 423, column: 7, scope: !813)
!875 = !DILocation(line: 424, column: 14, scope: !876)
!876 = distinct !DILexicalBlock(scope: !871, file: !4, line: 423, column: 25)
!877 = !DILocation(line: 424, column: 34, scope: !876)
!878 = !DILocation(line: 424, column: 24, scope: !876)
!879 = !DILocation(line: 424, column: 4, scope: !876)
!880 = !DILocation(line: 425, column: 14, scope: !876)
!881 = !DILocation(line: 425, column: 25, scope: !876)
!882 = !DILocation(line: 425, column: 4, scope: !876)
!883 = !DILocation(line: 426, column: 3, scope: !876)
!884 = !DILocation(line: 427, column: 14, scope: !885)
!885 = distinct !DILexicalBlock(scope: !871, file: !4, line: 426, column: 10)
!886 = !DILocation(line: 427, column: 33, scope: !885)
!887 = !DILocation(line: 427, column: 43, scope: !885)
!888 = !DILocation(line: 427, column: 24, scope: !885)
!889 = !DILocation(line: 427, column: 51, scope: !885)
!890 = !DILocation(line: 427, column: 4, scope: !885)
!891 = !DILocation(line: 428, column: 20, scope: !885)
!892 = !DILocation(line: 428, column: 10, scope: !885)
!893 = !DILocation(line: 428, column: 8, scope: !885)
!894 = !DILocation(line: 429, column: 14, scope: !885)
!895 = !DILocation(line: 429, column: 34, scope: !885)
!896 = !DILocation(line: 429, column: 24, scope: !885)
!897 = !DILocation(line: 429, column: 4, scope: !885)
!898 = !DILocation(line: 430, column: 14, scope: !885)
!899 = !DILocation(line: 430, column: 25, scope: !885)
!900 = !DILocation(line: 430, column: 4, scope: !885)
!901 = !DILocation(line: 433, column: 13, scope: !813)
!902 = !DILocation(line: 433, column: 34, scope: !813)
!903 = !DILocation(line: 433, column: 24, scope: !813)
!904 = !DILocation(line: 433, column: 3, scope: !813)
!905 = !DILocation(line: 434, column: 13, scope: !813)
!906 = !DILocation(line: 434, column: 3, scope: !813)
!907 = !DILocation(line: 436, column: 15, scope: !813)
!908 = !DILocation(line: 436, column: 24, scope: !813)
!909 = !DILocation(line: 436, column: 9, scope: !813)
!910 = !DILocation(line: 436, column: 7, scope: !813)
!911 = !DILocation(line: 437, column: 31, scope: !813)
!912 = !DILocation(line: 437, column: 39, scope: !813)
!913 = !DILocation(line: 437, column: 25, scope: !813)
!914 = !DILocation(line: 437, column: 9, scope: !813)
!915 = !DILocation(line: 437, column: 18, scope: !813)
!916 = !DILocation(line: 437, column: 3, scope: !813)
!917 = !DILocation(line: 437, column: 23, scope: !813)
!918 = !DILocation(line: 438, column: 24, scope: !813)
!919 = !DILocation(line: 438, column: 9, scope: !813)
!920 = !DILocation(line: 438, column: 17, scope: !813)
!921 = !DILocation(line: 438, column: 3, scope: !813)
!922 = !DILocation(line: 438, column: 22, scope: !813)
!923 = !DILocalVariable(name: "ctmp", scope: !813, file: !4, line: 440, type: !3)
!924 = !DILocation(line: 440, column: 17, scope: !813)
!925 = !DILocation(line: 440, column: 34, scope: !813)
!926 = !DILocation(line: 440, column: 24, scope: !813)
!927 = !DILocation(line: 442, column: 13, scope: !813)
!928 = !DILocation(line: 442, column: 29, scope: !813)
!929 = !DILocation(line: 442, column: 19, scope: !813)
!930 = !DILocation(line: 442, column: 3, scope: !813)
!931 = !DILocation(line: 443, column: 13, scope: !813)
!932 = !DILocation(line: 443, column: 20, scope: !813)
!933 = !DILocation(line: 443, column: 3, scope: !813)
!934 = !DILocation(line: 444, column: 2, scope: !813)
!935 = !DILocalVariable(name: "child", scope: !771, file: !4, line: 449, type: !97)
!936 = !DILocation(line: 449, column: 17, scope: !771)
!937 = !DILocation(line: 449, column: 35, scope: !771)
!938 = !DILocation(line: 449, column: 25, scope: !771)
!939 = !DILocation(line: 451, column: 6, scope: !940)
!940 = distinct !DILexicalBlock(scope: !771, file: !4, line: 451, column: 6)
!941 = !DILocation(line: 451, column: 12, scope: !940)
!942 = !DILocation(line: 451, column: 6, scope: !771)
!943 = !DILocation(line: 452, column: 21, scope: !944)
!944 = distinct !DILexicalBlock(scope: !940, file: !4, line: 451, column: 27)
!945 = !DILocation(line: 452, column: 11, scope: !944)
!946 = !DILocation(line: 452, column: 9, scope: !944)
!947 = !DILocation(line: 453, column: 2, scope: !944)
!948 = !DILocation(line: 456, column: 6, scope: !949)
!949 = distinct !DILexicalBlock(scope: !771, file: !4, line: 456, column: 6)
!950 = !DILocation(line: 456, column: 14, scope: !949)
!951 = !DILocation(line: 456, column: 6, scope: !771)
!952 = !DILocation(line: 457, column: 16, scope: !953)
!953 = distinct !DILexicalBlock(scope: !949, file: !4, line: 456, column: 19)
!954 = !DILocation(line: 457, column: 3, scope: !953)
!955 = !DILocation(line: 457, column: 9, scope: !953)
!956 = !DILocation(line: 457, column: 14, scope: !953)
!957 = !DILocation(line: 458, column: 7, scope: !958)
!958 = distinct !DILexicalBlock(scope: !953, file: !4, line: 458, column: 7)
!959 = !DILocation(line: 458, column: 13, scope: !958)
!960 = !DILocation(line: 458, column: 7, scope: !953)
!961 = !DILocation(line: 459, column: 14, scope: !962)
!962 = distinct !DILexicalBlock(scope: !958, file: !4, line: 458, column: 28)
!963 = !DILocation(line: 459, column: 4, scope: !962)
!964 = !DILocation(line: 460, column: 3, scope: !962)
!965 = !DILocation(line: 461, column: 4, scope: !966)
!966 = distinct !DILexicalBlock(scope: !958, file: !4, line: 460, column: 10)
!967 = !DILocation(line: 461, column: 10, scope: !966)
!968 = !DILocation(line: 461, column: 20, scope: !966)
!969 = !DILocation(line: 463, column: 3, scope: !953)
!970 = !DILocalVariable(name: "parent", scope: !771, file: !4, line: 466, type: !97)
!971 = !DILocation(line: 466, column: 17, scope: !771)
!972 = !DILocation(line: 466, column: 32, scope: !771)
!973 = !DILocation(line: 466, column: 40, scope: !771)
!974 = !DILocation(line: 466, column: 26, scope: !771)
!975 = !DILocation(line: 473, column: 6, scope: !976)
!976 = distinct !DILexicalBlock(scope: !771, file: !4, line: 473, column: 6)
!977 = !DILocation(line: 473, column: 12, scope: !976)
!978 = !DILocation(line: 473, column: 6, scope: !771)
!979 = !DILocation(line: 474, column: 16, scope: !980)
!980 = distinct !DILexicalBlock(scope: !981, file: !4, line: 474, column: 7)
!981 = distinct !DILexicalBlock(scope: !976, file: !4, line: 473, column: 27)
!982 = !DILocation(line: 474, column: 7, scope: !980)
!983 = !DILocation(line: 474, column: 7, scope: !981)
!984 = !DILocation(line: 475, column: 29, scope: !985)
!985 = distinct !DILexicalBlock(scope: !980, file: !4, line: 474, column: 23)
!986 = !DILocation(line: 475, column: 38, scope: !985)
!987 = !DILocation(line: 475, column: 4, scope: !985)
!988 = !DILocation(line: 476, column: 3, scope: !985)
!989 = !DILocation(line: 478, column: 14, scope: !990)
!990 = distinct !DILexicalBlock(scope: !980, file: !4, line: 476, column: 10)
!991 = !DILocation(line: 478, column: 31, scope: !990)
!992 = !DILocation(line: 478, column: 39, scope: !990)
!993 = !DILocation(line: 478, column: 22, scope: !990)
!994 = !DILocation(line: 478, column: 4, scope: !990)
!995 = !DILocation(line: 480, column: 2, scope: !981)
!996 = !DILocation(line: 481, column: 13, scope: !997)
!997 = distinct !DILexicalBlock(scope: !976, file: !4, line: 480, column: 9)
!998 = !DILocation(line: 481, column: 30, scope: !997)
!999 = !DILocation(line: 481, column: 38, scope: !997)
!1000 = !DILocation(line: 481, column: 21, scope: !997)
!1001 = !DILocation(line: 481, column: 45, scope: !997)
!1002 = !DILocation(line: 481, column: 3, scope: !997)
!1003 = !DILocation(line: 487, column: 14, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !997, file: !4, line: 487, column: 7)
!1005 = !DILocation(line: 487, column: 7, scope: !1004)
!1006 = !DILocation(line: 487, column: 20, scope: !1004)
!1007 = !DILocation(line: 487, column: 30, scope: !1004)
!1008 = !DILocation(line: 487, column: 23, scope: !1004)
!1009 = !DILocation(line: 487, column: 7, scope: !997)
!1010 = !DILocation(line: 488, column: 14, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1004, file: !4, line: 487, column: 38)
!1012 = !DILocation(line: 488, column: 4, scope: !1011)
!1013 = !DILocation(line: 489, column: 3, scope: !1011)
!1014 = !DILocation(line: 493, column: 15, scope: !771)
!1015 = !DILocation(line: 493, column: 2, scope: !771)
!1016 = !DILocation(line: 493, column: 8, scope: !771)
!1017 = !DILocation(line: 493, column: 13, scope: !771)
!1018 = !DILocation(line: 494, column: 1, scope: !771)
!1019 = distinct !DISubprogram(name: "get_side", scope: !4, file: !4, line: 111, type: !1020, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!105, !97, !97}
!1022 = !DILocalVariable(name: "parent", arg: 1, scope: !1019, file: !4, line: 111, type: !97)
!1023 = !DILocation(line: 111, column: 40, scope: !1019)
!1024 = !DILocalVariable(name: "child", arg: 2, scope: !1019, file: !4, line: 111, type: !97)
!1025 = !DILocation(line: 111, column: 63, scope: !1019)
!1026 = !DILocation(line: 115, column: 20, scope: !1019)
!1027 = !DILocation(line: 115, column: 10, scope: !1019)
!1028 = !DILocation(line: 115, column: 35, scope: !1019)
!1029 = !DILocation(line: 115, column: 32, scope: !1019)
!1030 = !DILocation(line: 115, column: 9, scope: !1019)
!1031 = !DILocation(line: 115, column: 2, scope: !1019)
!1032 = distinct !DISubprogram(name: "get_color", scope: !4, file: !4, line: 47, type: !1033, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!3, !97}
!1035 = !DILocalVariable(name: "n", arg: 1, scope: !1032, file: !4, line: 47, type: !97)
!1036 = !DILocation(line: 47, column: 47, scope: !1032)
!1037 = !DILocation(line: 50, column: 21, scope: !1032)
!1038 = !DILocation(line: 50, column: 24, scope: !1032)
!1039 = !DILocation(line: 50, column: 10, scope: !1032)
!1040 = !DILocation(line: 50, column: 37, scope: !1032)
!1041 = !DILocation(line: 50, column: 9, scope: !1032)
!1042 = !DILocation(line: 50, column: 2, scope: !1032)
!1043 = distinct !DISubprogram(name: "is_black", scope: !4, file: !4, line: 53, type: !1044, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!422, !97}
!1046 = !DILocalVariable(name: "n", arg: 1, scope: !1043, file: !4, line: 53, type: !97)
!1047 = !DILocation(line: 53, column: 38, scope: !1043)
!1048 = !DILocation(line: 55, column: 19, scope: !1043)
!1049 = !DILocation(line: 55, column: 9, scope: !1043)
!1050 = !DILocation(line: 55, column: 22, scope: !1043)
!1051 = !DILocation(line: 55, column: 2, scope: !1043)
!1052 = distinct !DISubprogram(name: "fix_missing_black", scope: !4, file: !4, line: 266, type: !1053, scopeLine: 268, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{null, !626, !93, !97}
!1055 = !DILocalVariable(name: "stack", arg: 1, scope: !1052, file: !4, line: 266, type: !626)
!1056 = !DILocation(line: 266, column: 47, scope: !1052)
!1057 = !DILocalVariable(name: "stacksz", arg: 2, scope: !1052, file: !4, line: 266, type: !93)
!1058 = !DILocation(line: 266, column: 58, scope: !1052)
!1059 = !DILocalVariable(name: "null_node", arg: 3, scope: !1052, file: !4, line: 267, type: !97)
!1060 = !DILocation(line: 267, column: 25, scope: !1052)
!1061 = !DILocation(line: 270, column: 2, scope: !1052)
!1062 = !DILocation(line: 270, column: 9, scope: !1052)
!1063 = !DILocation(line: 270, column: 17, scope: !1052)
!1064 = !DILocalVariable(name: "c0", scope: !1065, file: !4, line: 271, type: !97)
!1065 = distinct !DILexicalBlock(scope: !1052, file: !4, line: 270, column: 22)
!1066 = !DILocation(line: 271, column: 18, scope: !1065)
!1067 = !DILocalVariable(name: "c1", scope: !1065, file: !4, line: 271, type: !97)
!1068 = !DILocation(line: 271, column: 23, scope: !1065)
!1069 = !DILocalVariable(name: "inner", scope: !1065, file: !4, line: 271, type: !97)
!1070 = !DILocation(line: 271, column: 28, scope: !1065)
!1071 = !DILocalVariable(name: "outer", scope: !1065, file: !4, line: 271, type: !97)
!1072 = !DILocation(line: 271, column: 36, scope: !1065)
!1073 = !DILocalVariable(name: "n", scope: !1065, file: !4, line: 272, type: !97)
!1074 = !DILocation(line: 272, column: 18, scope: !1065)
!1075 = !DILocation(line: 272, column: 22, scope: !1065)
!1076 = !DILocation(line: 272, column: 28, scope: !1065)
!1077 = !DILocation(line: 272, column: 36, scope: !1065)
!1078 = !DILocalVariable(name: "parent", scope: !1065, file: !4, line: 273, type: !97)
!1079 = !DILocation(line: 273, column: 18, scope: !1065)
!1080 = !DILocation(line: 273, column: 27, scope: !1065)
!1081 = !DILocation(line: 273, column: 33, scope: !1065)
!1082 = !DILocation(line: 273, column: 41, scope: !1065)
!1083 = !DILocalVariable(name: "n_side", scope: !1065, file: !4, line: 274, type: !105)
!1084 = !DILocation(line: 274, column: 11, scope: !1065)
!1085 = !DILocation(line: 274, column: 29, scope: !1065)
!1086 = !DILocation(line: 274, column: 37, scope: !1065)
!1087 = !DILocation(line: 274, column: 20, scope: !1065)
!1088 = !DILocalVariable(name: "sib", scope: !1065, file: !4, line: 275, type: !97)
!1089 = !DILocation(line: 275, column: 18, scope: !1065)
!1090 = !DILocation(line: 275, column: 34, scope: !1065)
!1091 = !DILocation(line: 276, column: 14, scope: !1065)
!1092 = !DILocation(line: 276, column: 21, scope: !1065)
!1093 = !DILocation(line: 276, column: 13, scope: !1065)
!1094 = !DILocation(line: 275, column: 24, scope: !1065)
!1095 = !DILocation(line: 285, column: 17, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1065, file: !4, line: 285, column: 7)
!1097 = !DILocation(line: 285, column: 8, scope: !1096)
!1098 = !DILocation(line: 285, column: 7, scope: !1065)
!1099 = !DILocation(line: 286, column: 25, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1096, file: !4, line: 285, column: 23)
!1101 = !DILocation(line: 286, column: 4, scope: !1100)
!1102 = !DILocation(line: 286, column: 10, scope: !1100)
!1103 = !DILocation(line: 286, column: 18, scope: !1100)
!1104 = !DILocation(line: 286, column: 23, scope: !1100)
!1105 = !DILocation(line: 287, column: 11, scope: !1100)
!1106 = !DILocation(line: 287, column: 18, scope: !1100)
!1107 = !DILocation(line: 287, column: 4, scope: !1100)
!1108 = !DILocation(line: 288, column: 14, scope: !1100)
!1109 = !DILocation(line: 288, column: 4, scope: !1100)
!1110 = !DILocation(line: 289, column: 14, scope: !1100)
!1111 = !DILocation(line: 289, column: 4, scope: !1100)
!1112 = !DILocation(line: 290, column: 23, scope: !1100)
!1113 = !DILocation(line: 290, column: 4, scope: !1100)
!1114 = !DILocation(line: 290, column: 17, scope: !1100)
!1115 = !DILocation(line: 290, column: 21, scope: !1100)
!1116 = !DILocation(line: 292, column: 13, scope: !1100)
!1117 = !DILocation(line: 292, column: 19, scope: !1100)
!1118 = !DILocation(line: 292, column: 27, scope: !1100)
!1119 = !DILocation(line: 292, column: 11, scope: !1100)
!1120 = !DILocation(line: 293, column: 20, scope: !1100)
!1121 = !DILocation(line: 293, column: 29, scope: !1100)
!1122 = !DILocation(line: 293, column: 36, scope: !1100)
!1123 = !DILocation(line: 293, column: 28, scope: !1100)
!1124 = !DILocation(line: 293, column: 10, scope: !1100)
!1125 = !DILocation(line: 293, column: 8, scope: !1100)
!1126 = !DILocation(line: 294, column: 3, scope: !1100)
!1127 = !DILocation(line: 301, column: 18, scope: !1065)
!1128 = !DILocation(line: 301, column: 8, scope: !1065)
!1129 = !DILocation(line: 301, column: 6, scope: !1065)
!1130 = !DILocation(line: 302, column: 18, scope: !1065)
!1131 = !DILocation(line: 302, column: 8, scope: !1065)
!1132 = !DILocation(line: 302, column: 6, scope: !1065)
!1133 = !DILocation(line: 303, column: 9, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1065, file: !4, line: 303, column: 7)
!1135 = !DILocation(line: 303, column: 12, scope: !1134)
!1136 = !DILocation(line: 303, column: 27, scope: !1134)
!1137 = !DILocation(line: 303, column: 39, scope: !1134)
!1138 = !DILocation(line: 303, column: 30, scope: !1134)
!1139 = !DILocation(line: 303, column: 44, scope: !1134)
!1140 = !DILocation(line: 303, column: 49, scope: !1134)
!1141 = !DILocation(line: 303, column: 52, scope: !1134)
!1142 = !DILocation(line: 303, column: 67, scope: !1134)
!1143 = !DILocation(line: 304, column: 15, scope: !1134)
!1144 = !DILocation(line: 304, column: 6, scope: !1134)
!1145 = !DILocation(line: 303, column: 7, scope: !1065)
!1146 = !DILocation(line: 305, column: 8, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1148, file: !4, line: 305, column: 8)
!1148 = distinct !DILexicalBlock(scope: !1134, file: !4, line: 304, column: 21)
!1149 = !DILocation(line: 305, column: 13, scope: !1147)
!1150 = !DILocation(line: 305, column: 10, scope: !1147)
!1151 = !DILocation(line: 305, column: 8, scope: !1148)
!1152 = !DILocation(line: 306, column: 15, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1147, file: !4, line: 305, column: 24)
!1154 = !DILocation(line: 306, column: 23, scope: !1153)
!1155 = !DILocation(line: 306, column: 5, scope: !1153)
!1156 = !DILocation(line: 307, column: 4, scope: !1153)
!1157 = !DILocation(line: 309, column: 14, scope: !1148)
!1158 = !DILocation(line: 309, column: 4, scope: !1148)
!1159 = !DILocation(line: 310, column: 17, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1148, file: !4, line: 310, column: 8)
!1161 = !DILocation(line: 310, column: 8, scope: !1160)
!1162 = !DILocation(line: 310, column: 8, scope: !1148)
!1163 = !DILocation(line: 316, column: 12, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1160, file: !4, line: 310, column: 26)
!1165 = !DILocation(line: 317, column: 5, scope: !1164)
!1166 = distinct !{!1166, !1061, !1167}
!1167 = !DILocation(line: 364, column: 2, scope: !1052)
!1168 = !DILocation(line: 320, column: 15, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1160, file: !4, line: 318, column: 11)
!1170 = !DILocation(line: 320, column: 5, scope: !1169)
!1171 = !DILocation(line: 321, column: 5, scope: !1169)
!1172 = !DILocation(line: 331, column: 21, scope: !1065)
!1173 = !DILocation(line: 331, column: 27, scope: !1065)
!1174 = !DILocation(line: 331, column: 34, scope: !1065)
!1175 = !DILocation(line: 331, column: 26, scope: !1065)
!1176 = !DILocation(line: 331, column: 11, scope: !1065)
!1177 = !DILocation(line: 331, column: 9, scope: !1065)
!1178 = !DILocation(line: 332, column: 10, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1065, file: !4, line: 332, column: 7)
!1180 = !DILocation(line: 332, column: 16, scope: !1179)
!1181 = !DILocation(line: 332, column: 31, scope: !1179)
!1182 = !DILocation(line: 332, column: 41, scope: !1179)
!1183 = !DILocation(line: 332, column: 34, scope: !1179)
!1184 = !DILocation(line: 332, column: 7, scope: !1065)
!1185 = !DILocation(line: 333, column: 22, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1179, file: !4, line: 332, column: 50)
!1187 = !DILocation(line: 333, column: 27, scope: !1186)
!1188 = !DILocation(line: 333, column: 12, scope: !1186)
!1189 = !DILocation(line: 333, column: 10, scope: !1186)
!1190 = !DILocation(line: 335, column: 25, scope: !1186)
!1191 = !DILocation(line: 335, column: 4, scope: !1186)
!1192 = !DILocation(line: 335, column: 10, scope: !1186)
!1193 = !DILocation(line: 335, column: 18, scope: !1186)
!1194 = !DILocation(line: 335, column: 23, scope: !1186)
!1195 = !DILocation(line: 336, column: 23, scope: !1186)
!1196 = !DILocation(line: 336, column: 4, scope: !1186)
!1197 = !DILocation(line: 336, column: 17, scope: !1186)
!1198 = !DILocation(line: 336, column: 21, scope: !1186)
!1199 = !DILocation(line: 337, column: 11, scope: !1186)
!1200 = !DILocation(line: 337, column: 18, scope: !1186)
!1201 = !DILocation(line: 337, column: 4, scope: !1186)
!1202 = !DILocation(line: 338, column: 14, scope: !1186)
!1203 = !DILocation(line: 338, column: 4, scope: !1186)
!1204 = !DILocation(line: 339, column: 14, scope: !1186)
!1205 = !DILocation(line: 339, column: 4, scope: !1186)
!1206 = !DILocation(line: 344, column: 10, scope: !1186)
!1207 = !DILocation(line: 344, column: 16, scope: !1186)
!1208 = !DILocation(line: 344, column: 24, scope: !1186)
!1209 = !DILocation(line: 344, column: 8, scope: !1186)
!1210 = !DILocation(line: 345, column: 22, scope: !1186)
!1211 = !DILocation(line: 345, column: 28, scope: !1186)
!1212 = !DILocation(line: 345, column: 35, scope: !1186)
!1213 = !DILocation(line: 345, column: 27, scope: !1186)
!1214 = !DILocation(line: 345, column: 12, scope: !1186)
!1215 = !DILocation(line: 345, column: 10, scope: !1186)
!1216 = !DILocation(line: 346, column: 25, scope: !1186)
!1217 = !DILocation(line: 346, column: 4, scope: !1186)
!1218 = !DILocation(line: 346, column: 10, scope: !1186)
!1219 = !DILocation(line: 346, column: 18, scope: !1186)
!1220 = !DILocation(line: 346, column: 23, scope: !1186)
!1221 = !DILocation(line: 347, column: 11, scope: !1186)
!1222 = !DILocation(line: 348, column: 3, scope: !1186)
!1223 = !DILocation(line: 355, column: 13, scope: !1065)
!1224 = !DILocation(line: 355, column: 28, scope: !1065)
!1225 = !DILocation(line: 355, column: 18, scope: !1065)
!1226 = !DILocation(line: 355, column: 3, scope: !1065)
!1227 = !DILocation(line: 356, column: 13, scope: !1065)
!1228 = !DILocation(line: 356, column: 3, scope: !1065)
!1229 = !DILocation(line: 357, column: 13, scope: !1065)
!1230 = !DILocation(line: 357, column: 3, scope: !1065)
!1231 = !DILocation(line: 358, column: 24, scope: !1065)
!1232 = !DILocation(line: 358, column: 3, scope: !1065)
!1233 = !DILocation(line: 358, column: 9, scope: !1065)
!1234 = !DILocation(line: 358, column: 17, scope: !1065)
!1235 = !DILocation(line: 358, column: 22, scope: !1065)
!1236 = !DILocation(line: 359, column: 10, scope: !1065)
!1237 = !DILocation(line: 359, column: 17, scope: !1065)
!1238 = !DILocation(line: 359, column: 3, scope: !1065)
!1239 = !DILocation(line: 360, column: 7, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1065, file: !4, line: 360, column: 7)
!1241 = !DILocation(line: 360, column: 12, scope: !1240)
!1242 = !DILocation(line: 360, column: 9, scope: !1240)
!1243 = !DILocation(line: 360, column: 7, scope: !1065)
!1244 = !DILocation(line: 361, column: 14, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1240, file: !4, line: 360, column: 23)
!1246 = !DILocation(line: 361, column: 22, scope: !1245)
!1247 = !DILocation(line: 361, column: 4, scope: !1245)
!1248 = !DILocation(line: 362, column: 3, scope: !1245)
!1249 = !DILocation(line: 363, column: 3, scope: !1065)
!1250 = !DILocation(line: 365, column: 1, scope: !1052)
!1251 = distinct !DISubprogram(name: "is_red", scope: !4, file: !4, line: 58, type: !1044, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !222)
!1252 = !DILocalVariable(name: "n", arg: 1, scope: !1251, file: !4, line: 58, type: !97)
!1253 = !DILocation(line: 58, column: 36, scope: !1251)
!1254 = !DILocation(line: 60, column: 19, scope: !1251)
!1255 = !DILocation(line: 60, column: 9, scope: !1251)
!1256 = !DILocation(line: 60, column: 22, scope: !1251)
!1257 = !DILocation(line: 60, column: 2, scope: !1251)
!1258 = distinct !DISubprogram(name: "z_rb_walk", scope: !4, file: !4, line: 497, type: !1259, scopeLine: 498, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !222)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{null, !97, !1261, !92}
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_visit_t", file: !99, line: 110, baseType: !1262)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 32)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{null, !97, !92}
!1265 = !DILocalVariable(name: "node", arg: 1, scope: !1258, file: !4, line: 497, type: !97)
!1266 = !DILocation(line: 497, column: 31, scope: !1258)
!1267 = !DILocalVariable(name: "visit_fn", arg: 2, scope: !1258, file: !4, line: 497, type: !1261)
!1268 = !DILocation(line: 497, column: 48, scope: !1258)
!1269 = !DILocalVariable(name: "cookie", arg: 3, scope: !1258, file: !4, line: 497, type: !92)
!1270 = !DILocation(line: 497, column: 64, scope: !1258)
!1271 = !DILocation(line: 499, column: 6, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1258, file: !4, line: 499, column: 6)
!1273 = !DILocation(line: 499, column: 11, scope: !1272)
!1274 = !DILocation(line: 499, column: 6, scope: !1258)
!1275 = !DILocation(line: 500, column: 23, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1272, file: !4, line: 499, column: 26)
!1277 = !DILocation(line: 500, column: 13, scope: !1276)
!1278 = !DILocation(line: 500, column: 34, scope: !1276)
!1279 = !DILocation(line: 500, column: 44, scope: !1276)
!1280 = !DILocation(line: 500, column: 3, scope: !1276)
!1281 = !DILocation(line: 501, column: 3, scope: !1276)
!1282 = !DILocation(line: 501, column: 12, scope: !1276)
!1283 = !DILocation(line: 501, column: 18, scope: !1276)
!1284 = !DILocation(line: 502, column: 23, scope: !1276)
!1285 = !DILocation(line: 502, column: 13, scope: !1276)
!1286 = !DILocation(line: 502, column: 34, scope: !1276)
!1287 = !DILocation(line: 502, column: 44, scope: !1276)
!1288 = !DILocation(line: 502, column: 3, scope: !1276)
!1289 = !DILocation(line: 503, column: 2, scope: !1276)
!1290 = !DILocation(line: 504, column: 1, scope: !1258)
!1291 = distinct !DISubprogram(name: "z_rb_child", scope: !4, file: !4, line: 507, type: !457, scopeLine: 508, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !222)
!1292 = !DILocalVariable(name: "node", arg: 1, scope: !1291, file: !4, line: 507, type: !97)
!1293 = !DILocation(line: 507, column: 42, scope: !1291)
!1294 = !DILocalVariable(name: "side", arg: 2, scope: !1291, file: !4, line: 507, type: !105)
!1295 = !DILocation(line: 507, column: 56, scope: !1291)
!1296 = !DILocation(line: 509, column: 19, scope: !1291)
!1297 = !DILocation(line: 509, column: 25, scope: !1291)
!1298 = !DILocation(line: 509, column: 9, scope: !1291)
!1299 = !DILocation(line: 509, column: 2, scope: !1291)
!1300 = distinct !DISubprogram(name: "z_rb_is_black", scope: !4, file: !4, line: 512, type: !1301, scopeLine: 513, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !222)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!93, !97}
!1303 = !DILocalVariable(name: "node", arg: 1, scope: !1300, file: !4, line: 512, type: !97)
!1304 = !DILocation(line: 512, column: 34, scope: !1300)
!1305 = !DILocation(line: 514, column: 18, scope: !1300)
!1306 = !DILocation(line: 514, column: 9, scope: !1300)
!1307 = !DILocation(line: 514, column: 2, scope: !1300)
!1308 = distinct !DISubprogram(name: "rb_contains", scope: !4, file: !4, line: 517, type: !1309, scopeLine: 518, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !222)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!422, !413, !97}
!1311 = !DILocalVariable(name: "tree", arg: 1, scope: !1308, file: !4, line: 517, type: !413)
!1312 = !DILocation(line: 517, column: 34, scope: !1308)
!1313 = !DILocalVariable(name: "node", arg: 2, scope: !1308, file: !4, line: 517, type: !97)
!1314 = !DILocation(line: 517, column: 55, scope: !1308)
!1315 = !DILocalVariable(name: "n", scope: !1308, file: !4, line: 519, type: !97)
!1316 = !DILocation(line: 519, column: 17, scope: !1308)
!1317 = !DILocation(line: 519, column: 21, scope: !1308)
!1318 = !DILocation(line: 519, column: 27, scope: !1308)
!1319 = !DILocation(line: 521, column: 2, scope: !1308)
!1320 = !DILocation(line: 521, column: 10, scope: !1308)
!1321 = !DILocation(line: 521, column: 12, scope: !1308)
!1322 = !DILocation(line: 521, column: 27, scope: !1308)
!1323 = !DILocation(line: 521, column: 31, scope: !1308)
!1324 = !DILocation(line: 521, column: 36, scope: !1308)
!1325 = !DILocation(line: 521, column: 33, scope: !1308)
!1326 = !DILocation(line: 0, scope: !1308)
!1327 = !DILocation(line: 522, column: 17, scope: !1328)
!1328 = distinct !DILexicalBlock(scope: !1308, file: !4, line: 521, column: 43)
!1329 = !DILocation(line: 522, column: 20, scope: !1328)
!1330 = !DILocation(line: 522, column: 26, scope: !1328)
!1331 = !DILocation(line: 522, column: 38, scope: !1328)
!1332 = !DILocation(line: 522, column: 41, scope: !1328)
!1333 = !DILocation(line: 522, column: 7, scope: !1328)
!1334 = !DILocation(line: 522, column: 5, scope: !1328)
!1335 = distinct !{!1335, !1319, !1336}
!1336 = !DILocation(line: 523, column: 2, scope: !1308)
!1337 = !DILocation(line: 525, column: 9, scope: !1308)
!1338 = !DILocation(line: 525, column: 14, scope: !1308)
!1339 = !DILocation(line: 525, column: 11, scope: !1308)
!1340 = !DILocation(line: 525, column: 2, scope: !1308)
!1341 = distinct !DISubprogram(name: "z_rb_foreach_next", scope: !4, file: !4, line: 557, type: !1342, scopeLine: 558, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !222)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{!97, !413, !1344}
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 32)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rb_foreach", file: !99, line: 172, size: 96, elements: !1346)
!1346 = !{!1347, !1348, !1350}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !1345, file: !99, line: 173, baseType: !626, size: 32)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "is_left", scope: !1345, file: !99, line: 174, baseType: !1349, size: 32, offset: 32)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1345, file: !99, line: 175, baseType: !1351, size: 32, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !95, line: 58, baseType: !93)
!1352 = !DILocalVariable(name: "tree", arg: 1, scope: !1341, file: !4, line: 557, type: !413)
!1353 = !DILocation(line: 557, column: 49, scope: !1341)
!1354 = !DILocalVariable(name: "f", arg: 2, scope: !1341, file: !4, line: 557, type: !1344)
!1355 = !DILocation(line: 557, column: 75, scope: !1341)
!1356 = !DILocalVariable(name: "n", scope: !1341, file: !4, line: 559, type: !97)
!1357 = !DILocation(line: 559, column: 17, scope: !1341)
!1358 = !DILocation(line: 561, column: 6, scope: !1359)
!1359 = distinct !DILexicalBlock(scope: !1341, file: !4, line: 561, column: 6)
!1360 = !DILocation(line: 561, column: 12, scope: !1359)
!1361 = !DILocation(line: 561, column: 17, scope: !1359)
!1362 = !DILocation(line: 561, column: 6, scope: !1341)
!1363 = !DILocation(line: 562, column: 3, scope: !1364)
!1364 = distinct !DILexicalBlock(scope: !1359, file: !4, line: 561, column: 32)
!1365 = !DILocation(line: 568, column: 6, scope: !1366)
!1366 = distinct !DILexicalBlock(scope: !1341, file: !4, line: 568, column: 6)
!1367 = !DILocation(line: 568, column: 9, scope: !1366)
!1368 = !DILocation(line: 568, column: 13, scope: !1366)
!1369 = !DILocation(line: 568, column: 6, scope: !1341)
!1370 = !DILocation(line: 569, column: 26, scope: !1371)
!1371 = distinct !DILexicalBlock(scope: !1366, file: !4, line: 568, column: 20)
!1372 = !DILocation(line: 569, column: 32, scope: !1371)
!1373 = !DILocation(line: 569, column: 38, scope: !1371)
!1374 = !DILocation(line: 569, column: 10, scope: !1371)
!1375 = !DILocation(line: 569, column: 3, scope: !1371)
!1376 = !DILocation(line: 575, column: 16, scope: !1341)
!1377 = !DILocation(line: 575, column: 19, scope: !1341)
!1378 = !DILocation(line: 575, column: 25, scope: !1341)
!1379 = !DILocation(line: 575, column: 28, scope: !1341)
!1380 = !DILocation(line: 575, column: 6, scope: !1341)
!1381 = !DILocation(line: 575, column: 4, scope: !1341)
!1382 = !DILocation(line: 576, column: 6, scope: !1383)
!1383 = distinct !DILexicalBlock(scope: !1341, file: !4, line: 576, column: 6)
!1384 = !DILocation(line: 576, column: 8, scope: !1383)
!1385 = !DILocation(line: 576, column: 6, scope: !1341)
!1386 = !DILocation(line: 577, column: 26, scope: !1387)
!1387 = distinct !DILexicalBlock(scope: !1383, file: !4, line: 576, column: 23)
!1388 = !DILocation(line: 577, column: 29, scope: !1387)
!1389 = !DILocation(line: 577, column: 10, scope: !1387)
!1390 = !DILocation(line: 577, column: 3, scope: !1387)
!1391 = !DILocation(line: 585, column: 6, scope: !1392)
!1392 = distinct !DILexicalBlock(scope: !1341, file: !4, line: 585, column: 6)
!1393 = !DILocation(line: 585, column: 9, scope: !1392)
!1394 = !DILocation(line: 585, column: 17, scope: !1392)
!1395 = !DILocation(line: 585, column: 20, scope: !1392)
!1396 = !DILocation(line: 585, column: 25, scope: !1392)
!1397 = !DILocation(line: 585, column: 6, scope: !1341)
!1398 = !DILocation(line: 586, column: 10, scope: !1399)
!1399 = distinct !DILexicalBlock(scope: !1392, file: !4, line: 585, column: 32)
!1400 = !DILocation(line: 586, column: 13, scope: !1399)
!1401 = !DILocation(line: 586, column: 21, scope: !1399)
!1402 = !DILocation(line: 586, column: 24, scope: !1399)
!1403 = !DILocation(line: 586, column: 19, scope: !1399)
!1404 = !DILocation(line: 586, column: 3, scope: !1399)
!1405 = !DILocation(line: 593, column: 2, scope: !1341)
!1406 = !DILocation(line: 593, column: 10, scope: !1341)
!1407 = !DILocation(line: 593, column: 13, scope: !1341)
!1408 = !DILocation(line: 593, column: 17, scope: !1341)
!1409 = !DILocation(line: 593, column: 22, scope: !1341)
!1410 = !DILocation(line: 593, column: 26, scope: !1341)
!1411 = !DILocation(line: 593, column: 29, scope: !1341)
!1412 = !DILocation(line: 593, column: 37, scope: !1341)
!1413 = !DILocation(line: 593, column: 40, scope: !1341)
