; ModuleID = '../bc_files/rb.bc'
source_filename = "/home/sri/zephyrproject/zephyr/lib/os/rb.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }
%struct.rbtree = type { ptr, ptr, i32 }
%struct.rbnode = type { [2 x ptr] }
%struct._rb_foreach = type { ptr, ptr, i32 }

; Function Attrs: inlinehint nounwind optsize

!66 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!90 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!91 = !{!92, !93, !94, !97, !105}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!93 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !95, line: 102, baseType: !96)
!95 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!96 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !99, line: 58, size: 64, elements: !100)
!99 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!100 = !{!101}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !98, file: !99, line: 60, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 64, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 2)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !95, line: 62, baseType: !5)
!106 = !{i32 7, !"Dwarf Version", i32 4}
!107 = !{i32 2, !"Debug Info Version", i32 3}
!108 = !{i32 1, !"wchar_size", i32 4}
!109 = !{i32 1, !"static_rwdata", i32 1}
!110 = !{i32 1, !"enumsize_buildattr", i32 1}
!111 = !{i32 1, !"armlib_unavailable", i32 0}
!112 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!113 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !10, file: !10, line: 223, type: !114, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !226)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !116, !118}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !120, line: 250, size: 896, elements: !121)
!120 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!121 = !{!122, !184, !197, !198, !199, !200, !221}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !119, file: !120, line: 252, baseType: !123, size: 384)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !120, line: 58, size: 384, elements: !124)
!124 = !{!125, !145, !153, !154, !155, !168, !170, !171}
!125 = !DIDerivedType(tag: DW_TAG_member, scope: !123, file: !120, line: 61, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !123, file: !120, line: 61, size: 64, elements: !127)
!127 = !{!128, !144}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !126, file: !120, line: 62, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !130, line: 55, baseType: !131)
!130 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !130, line: 37, size: 64, elements: !132)
!132 = !{!133, !139}
!133 = !DIDerivedType(tag: DW_TAG_member, scope: !131, file: !130, line: 38, baseType: !134, size: 32)
!134 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !130, line: 38, size: 32, elements: !135)
!135 = !{!136, !138}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !134, file: !130, line: 39, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !130, line: 40, baseType: !137, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, scope: !131, file: !130, line: 42, baseType: !140, size: 32, offset: 32)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !130, line: 42, size: 32, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !140, file: !130, line: 43, baseType: !137, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !140, file: !130, line: 44, baseType: !137, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !126, file: !120, line: 63, baseType: !98, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !123, file: !120, line: 69, baseType: !146, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !148, line: 243, baseType: !149)
!148 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 241, size: 64, elements: !150)
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !149, file: !148, line: 242, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !130, line: 51, baseType: !131)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !123, file: !120, line: 72, baseType: !105, size: 8, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !123, file: !120, line: 75, baseType: !105, size: 8, offset: 104)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !123, file: !120, line: 91, baseType: !156, size: 16, offset: 112)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !123, file: !120, line: 91, size: 16, elements: !157)
!157 = !{!158, !165}
!158 = !DIDerivedType(tag: DW_TAG_member, scope: !156, file: !120, line: 92, baseType: !159, size: 16)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !156, file: !120, line: 92, size: 16, elements: !160)
!160 = !{!161, !164}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !159, file: !120, line: 97, baseType: !162, size: 8)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !95, line: 56, baseType: !163)
!163 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !159, file: !120, line: 98, baseType: !105, size: 8, offset: 8)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !156, file: !120, line: 101, baseType: !166, size: 16)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !95, line: 63, baseType: !167)
!167 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !123, file: !120, line: 108, baseType: !169, size: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !95, line: 64, baseType: !96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !123, file: !120, line: 132, baseType: !92, size: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !123, file: !120, line: 136, baseType: !172, size: 192, offset: 192)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !148, line: 254, size: 192, elements: !173)
!173 = !{!174, !175, !181}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !172, file: !148, line: 255, baseType: !129, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !172, file: !148, line: 256, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !148, line: 252, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !172, file: !148, line: 259, baseType: !182, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !95, line: 59, baseType: !183)
!183 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !119, file: !120, line: 255, baseType: !185, size: 288, offset: 384)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !186, line: 25, size: 288, elements: !187)
!186 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!187 = !{!188, !189, !190, !191, !192, !193, !194, !195, !196}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !185, file: !186, line: 26, baseType: !169, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !185, file: !186, line: 27, baseType: !169, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !185, file: !186, line: 28, baseType: !169, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !185, file: !186, line: 29, baseType: !169, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !185, file: !186, line: 30, baseType: !169, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !185, file: !186, line: 31, baseType: !169, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !185, file: !186, line: 32, baseType: !169, size: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !185, file: !186, line: 33, baseType: !169, size: 32, offset: 224)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !185, file: !186, line: 34, baseType: !169, size: 32, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !119, file: !120, line: 258, baseType: !92, size: 32, offset: 672)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !119, file: !120, line: 261, baseType: !147, size: 64, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !119, file: !120, line: 302, baseType: !93, size: 32, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !119, file: !120, line: 333, baseType: !201, size: 32, offset: 800)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !203, line: 5291, size: 160, elements: !204)
!203 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!204 = !{!205, !216, !217}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !202, file: !203, line: 5292, baseType: !206, size: 96)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !207, line: 56, size: 96, elements: !208)
!207 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!208 = !{!209, !212, !213}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !206, file: !207, line: 57, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !207, line: 57, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !206, file: !207, line: 58, baseType: !92, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !206, file: !207, line: 59, baseType: !214, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !215, line: 46, baseType: !96)
!215 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!216 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !202, file: !203, line: 5293, baseType: !147, size: 64, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !202, file: !203, line: 5294, baseType: !218, offset: 160)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !219, line: 45, elements: !220)
!219 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!220 = !{}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !119, file: !120, line: 355, baseType: !222, size: 64, offset: 832)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !186, line: 60, size: 64, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !222, file: !186, line: 63, baseType: !169, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !222, file: !186, line: 66, baseType: !169, size: 32, offset: 32)
!226 = !{!227, !228}
!227 = !DILocalVariable(name: "object", arg: 1, scope: !113, file: !10, line: 223, type: !116)
!228 = !DILocalVariable(name: "thread", arg: 2, scope: !113, file: !10, line: 224, type: !118)
!229 = !DILocation(line: 223, column: 61, scope: !113)
!230 = !DILocation(line: 224, column: 24, scope: !113)
!231 = !DILocation(line: 226, column: 9, scope: !113)
!232 = !DILocation(line: 227, column: 9, scope: !113)
!233 = !DILocation(line: 228, column: 1, scope: !113)
!234 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !10, file: !10, line: 243, type: !235, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !237)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !116}
!237 = !{!238}
!238 = !DILocalVariable(name: "object", arg: 1, scope: !234, file: !10, line: 243, type: !116)
!239 = !DILocation(line: 243, column: 56, scope: !234)
!240 = !DILocation(line: 245, column: 9, scope: !234)
!241 = !DILocation(line: 246, column: 1, scope: !234)
!242 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !10, file: !10, line: 359, type: !243, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !245)
!243 = !DISubroutineType(types: !244)
!244 = !{!92, !9}
!245 = !{!246}
!246 = !DILocalVariable(name: "otype", arg: 1, scope: !242, file: !10, line: 359, type: !9)
!247 = !DILocation(line: 359, column: 58, scope: !242)
!248 = !DILocation(line: 361, column: 9, scope: !242)
!249 = !DILocation(line: 363, column: 2, scope: !242)
!250 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !10, file: !10, line: 366, type: !251, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !253)
!251 = !DISubroutineType(types: !252)
!252 = !{!92, !9, !214}
!253 = !{!254, !255}
!254 = !DILocalVariable(name: "otype", arg: 1, scope: !250, file: !10, line: 366, type: !9)
!255 = !DILocalVariable(name: "size", arg: 2, scope: !250, file: !10, line: 367, type: !214)
!256 = !DILocation(line: 366, column: 63, scope: !250)
!257 = !DILocation(line: 367, column: 13, scope: !250)
!258 = !DILocation(line: 369, column: 9, scope: !250)
!259 = !DILocation(line: 370, column: 9, scope: !250)
!260 = !DILocation(line: 372, column: 2, scope: !250)
!261 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !203, file: !203, line: 656, type: !262, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !268)
!262 = !DISubroutineType(types: !263)
!263 = !{!264, !266}
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !265, line: 46, baseType: !182)
!265 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!268 = !{!269}
!269 = !DILocalVariable(name: "t", arg: 1, scope: !261, file: !203, line: 657, type: !266)
!270 = !DILocation(line: 657, column: 30, scope: !261)
!271 = !DILocation(line: 659, column: 28, scope: !261)
!272 = !DILocation(line: 659, column: 31, scope: !261)
!273 = !DILocation(line: 659, column: 36, scope: !261)
!274 = !DILocation(line: 659, column: 9, scope: !261)
!275 = !DILocation(line: 659, column: 2, scope: !261)
!276 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !203, file: !203, line: 671, type: !262, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !277)
!277 = !{!278}
!278 = !DILocalVariable(name: "t", arg: 1, scope: !276, file: !203, line: 672, type: !266)
!279 = !DILocation(line: 672, column: 30, scope: !276)
!280 = !DILocation(line: 674, column: 30, scope: !276)
!281 = !DILocation(line: 674, column: 33, scope: !276)
!282 = !DILocation(line: 674, column: 38, scope: !276)
!283 = !DILocation(line: 674, column: 9, scope: !276)
!284 = !DILocation(line: 674, column: 2, scope: !276)
!285 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !203, file: !203, line: 1634, type: !286, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !307)
!286 = !DISubroutineType(types: !287)
!287 = !{!264, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !203, line: 1439, size: 448, elements: !291)
!291 = !{!292, !293, !294, !299, !300, !305, !306}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !290, file: !203, line: 1445, baseType: !172, size: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !290, file: !203, line: 1448, baseType: !147, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !290, file: !203, line: 1451, baseType: !295, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !290, file: !203, line: 1454, baseType: !295, size: 32, offset: 288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !290, file: !203, line: 1457, baseType: !301, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !265, line: 67, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 65, size: 64, elements: !303)
!303 = !{!304}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !302, file: !265, line: 66, baseType: !264, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !290, file: !203, line: 1460, baseType: !169, size: 32, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !290, file: !203, line: 1463, baseType: !92, size: 32, offset: 416)
!307 = !{!308}
!308 = !DILocalVariable(name: "timer", arg: 1, scope: !285, file: !203, line: 1635, type: !288)
!309 = !DILocation(line: 1635, column: 34, scope: !285)
!310 = !DILocation(line: 1637, column: 28, scope: !285)
!311 = !DILocation(line: 1637, column: 35, scope: !285)
!312 = !DILocation(line: 1637, column: 9, scope: !285)
!313 = !DILocation(line: 1637, column: 2, scope: !285)
!314 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !203, file: !203, line: 1649, type: !286, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !315)
!315 = !{!316}
!316 = !DILocalVariable(name: "timer", arg: 1, scope: !314, file: !203, line: 1650, type: !288)
!317 = !DILocation(line: 1650, column: 34, scope: !314)
!318 = !DILocation(line: 1652, column: 30, scope: !314)
!319 = !DILocation(line: 1652, column: 37, scope: !314)
!320 = !DILocation(line: 1652, column: 9, scope: !314)
!321 = !DILocation(line: 1652, column: 2, scope: !314)
!322 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !203, file: !203, line: 1689, type: !323, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !325)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !298, !92}
!325 = !{!326, !327}
!326 = !DILocalVariable(name: "timer", arg: 1, scope: !322, file: !203, line: 1689, type: !298)
!327 = !DILocalVariable(name: "user_data", arg: 2, scope: !322, file: !203, line: 1690, type: !92)
!328 = !DILocation(line: 1689, column: 65, scope: !322)
!329 = !DILocation(line: 1690, column: 19, scope: !322)
!330 = !DILocation(line: 1692, column: 21, scope: !322)
!331 = !DILocation(line: 1692, column: 2, scope: !322)
!332 = !DILocation(line: 1692, column: 9, scope: !322)
!333 = !DILocation(line: 1692, column: 19, scope: !322)
!334 = !DILocation(line: 1693, column: 1, scope: !322)
!335 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !203, file: !203, line: 1704, type: !336, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !338)
!336 = !DISubroutineType(types: !337)
!337 = !{!92, !288}
!338 = !{!339}
!339 = !DILocalVariable(name: "timer", arg: 1, scope: !335, file: !203, line: 1704, type: !288)
!340 = !DILocation(line: 1704, column: 72, scope: !335)
!341 = !DILocation(line: 1706, column: 9, scope: !335)
!342 = !DILocation(line: 1706, column: 16, scope: !335)
!343 = !DILocation(line: 1706, column: 2, scope: !335)
!344 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !203, file: !203, line: 2071, type: !345, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !365)
!345 = !DISubroutineType(types: !346)
!346 = !{!93, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !203, line: 1830, size: 128, elements: !349)
!349 = !{!350, !363, !364}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !348, file: !203, line: 1831, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !352, line: 60, baseType: !353)
!352 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !352, line: 53, size: 64, elements: !354)
!354 = !{!355, !362}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !353, file: !352, line: 54, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !352, line: 50, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !352, line: 44, size: 32, elements: !359)
!359 = !{!360}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !358, file: !352, line: 45, baseType: !361, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !352, line: 40, baseType: !169)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !353, file: !352, line: 55, baseType: !356, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !348, file: !203, line: 1832, baseType: !218, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !348, file: !203, line: 1833, baseType: !147, size: 64, offset: 64)
!365 = !{!366}
!366 = !DILocalVariable(name: "queue", arg: 1, scope: !344, file: !203, line: 2071, type: !347)
!367 = !DILocation(line: 2071, column: 59, scope: !344)
!368 = !DILocation(line: 2073, column: 35, scope: !344)
!369 = !DILocation(line: 2073, column: 42, scope: !344)
!370 = !DILocation(line: 2073, column: 14, scope: !344)
!371 = !DILocation(line: 2073, column: 9, scope: !344)
!372 = !DILocation(line: 2073, column: 2, scope: !344)
!373 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !203, file: !203, line: 3209, type: !374, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !382)
!374 = !DISubroutineType(types: !375)
!375 = !{!96, !376}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !203, line: 3092, size: 128, elements: !378)
!378 = !{!379, !380, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !377, file: !203, line: 3093, baseType: !147, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !377, file: !203, line: 3094, baseType: !96, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !377, file: !203, line: 3095, baseType: !96, size: 32, offset: 96)
!382 = !{!383}
!383 = !DILocalVariable(name: "sem", arg: 1, scope: !373, file: !203, line: 3209, type: !376)
!384 = !DILocation(line: 3209, column: 65, scope: !373)
!385 = !DILocation(line: 3211, column: 9, scope: !373)
!386 = !DILocation(line: 3211, column: 14, scope: !373)
!387 = !DILocation(line: 3211, column: 2, scope: !373)
!388 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !203, file: !203, line: 4649, type: !389, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !406)
!389 = !DISubroutineType(types: !390)
!390 = !{!169, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !203, line: 4390, size: 320, elements: !393)
!393 = !{!394, !395, !396, !397, !398, !401, !402, !403, !404, !405}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !392, file: !203, line: 4392, baseType: !147, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !392, file: !203, line: 4394, baseType: !218, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !392, file: !203, line: 4396, baseType: !214, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !392, file: !203, line: 4398, baseType: !169, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !392, file: !203, line: 4400, baseType: !399, size: 32, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !392, file: !203, line: 4402, baseType: !399, size: 32, offset: 160)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !392, file: !203, line: 4404, baseType: !399, size: 32, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !392, file: !203, line: 4406, baseType: !399, size: 32, offset: 224)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !392, file: !203, line: 4408, baseType: !169, size: 32, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !392, file: !203, line: 4413, baseType: !105, size: 8, offset: 288)
!406 = !{!407}
!407 = !DILocalVariable(name: "msgq", arg: 1, scope: !388, file: !203, line: 4649, type: !391)
!408 = !DILocation(line: 4649, column: 66, scope: !388)
!409 = !DILocation(line: 4651, column: 9, scope: !388)
!410 = !DILocation(line: 4651, column: 15, scope: !388)
!411 = !DILocation(line: 4651, column: 26, scope: !388)
!412 = !DILocation(line: 4651, column: 32, scope: !388)
!413 = !DILocation(line: 4651, column: 24, scope: !388)
!414 = !DILocation(line: 4651, column: 2, scope: !388)
!415 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !203, file: !203, line: 4665, type: !389, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !416)
!416 = !{!417}
!417 = !DILocalVariable(name: "msgq", arg: 1, scope: !415, file: !203, line: 4665, type: !391)
!418 = !DILocation(line: 4665, column: 66, scope: !415)
!419 = !DILocation(line: 4667, column: 9, scope: !415)
!420 = !DILocation(line: 4667, column: 15, scope: !415)
!421 = !DILocation(line: 4667, column: 2, scope: !415)
!422 = distinct !DISubprogram(name: "z_rb_get_minmax", scope: !4, file: !4, line: 100, type: !423, scopeLine: 101, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !436)
!423 = !DISubroutineType(types: !424)
!424 = !{!97, !425, !105}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbtree", file: !99, line: 91, size: 96, elements: !427)
!427 = !{!428, !429, !435}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !426, file: !99, line: 93, baseType: !97, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lessthan_fn", scope: !426, file: !99, line: 95, baseType: !430, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_lessthan_t", file: !99, line: 86, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 32)
!432 = !DISubroutineType(types: !433)
!433 = !{!434, !97, !97}
!434 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "max_depth", scope: !426, file: !99, line: 97, baseType: !93, size: 32, offset: 64)
!436 = !{!437, !438, !439}
!437 = !DILocalVariable(name: "tree", arg: 1, scope: !422, file: !4, line: 100, type: !425)
!438 = !DILocalVariable(name: "side", arg: 2, scope: !422, file: !4, line: 100, type: !105)
!439 = !DILocalVariable(name: "n", scope: !422, file: !4, line: 102, type: !97)
!440 = !DILocation(line: 100, column: 47, scope: !422)
!441 = !DILocation(line: 100, column: 61, scope: !422)
!442 = !DILocation(line: 102, column: 2, scope: !422)
!443 = !DILocation(line: 102, column: 17, scope: !422)
!444 = !DILocation(line: 104, column: 11, scope: !445)
!445 = distinct !DILexicalBlock(scope: !422, file: !4, line: 104, column: 2)
!446 = !DILocation(line: 104, column: 17, scope: !445)
!447 = !DILocation(line: 104, column: 9, scope: !445)
!448 = !DILocation(line: 104, column: 7, scope: !445)
!449 = !DILocation(line: 104, column: 24, scope: !450)
!450 = distinct !DILexicalBlock(scope: !445, file: !4, line: 104, column: 2)
!451 = !DILocation(line: 104, column: 26, scope: !450)
!452 = !DILocation(line: 104, column: 41, scope: !450)
!453 = !DILocation(line: 104, column: 55, scope: !450)
!454 = !DILocation(line: 104, column: 58, scope: !450)
!455 = !DILocation(line: 104, column: 45, scope: !450)
!456 = !DILocation(line: 104, column: 64, scope: !450)
!457 = !DILocation(line: 0, scope: !450)
!458 = !DILocation(line: 104, column: 2, scope: !445)
!459 = !DILocation(line: 107, column: 2, scope: !460)
!460 = distinct !DILexicalBlock(scope: !450, file: !4, line: 105, column: 28)
!461 = !DILocation(line: 105, column: 18, scope: !450)
!462 = !DILocation(line: 105, column: 21, scope: !450)
!463 = !DILocation(line: 105, column: 8, scope: !450)
!464 = !DILocation(line: 105, column: 6, scope: !450)
!465 = !DILocation(line: 104, column: 2, scope: !450)
!466 = distinct !{!466, !458, !467}
!467 = !DILocation(line: 107, column: 2, scope: !445)
!468 = !DILocation(line: 108, column: 9, scope: !422)
!469 = !DILocation(line: 109, column: 1, scope: !422)
!470 = !DILocation(line: 108, column: 2, scope: !422)
!471 = distinct !DISubprogram(name: "get_child", scope: !4, file: !4, line: 21, type: !472, scopeLine: 22, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !474)
!472 = !DISubroutineType(types: !473)
!473 = !{!97, !97, !105}
!474 = !{!475, !476, !477}
!475 = !DILocalVariable(name: "n", arg: 1, scope: !471, file: !4, line: 21, type: !97)
!476 = !DILocalVariable(name: "side", arg: 2, scope: !471, file: !4, line: 21, type: !105)
!477 = !DILocalVariable(name: "l", scope: !471, file: !4, line: 28, type: !94)
!478 = !DILocation(line: 21, column: 48, scope: !471)
!479 = !DILocation(line: 21, column: 59, scope: !471)
!480 = !DILocation(line: 24, column: 6, scope: !481)
!481 = distinct !DILexicalBlock(scope: !471, file: !4, line: 24, column: 6)
!482 = !DILocation(line: 24, column: 11, scope: !481)
!483 = !DILocation(line: 24, column: 6, scope: !471)
!484 = !DILocation(line: 25, column: 10, scope: !485)
!485 = distinct !DILexicalBlock(scope: !481, file: !4, line: 24, column: 18)
!486 = !DILocation(line: 25, column: 13, scope: !485)
!487 = !DILocation(line: 25, column: 3, scope: !485)
!488 = !DILocation(line: 28, column: 2, scope: !471)
!489 = !DILocation(line: 28, column: 12, scope: !471)
!490 = !DILocation(line: 28, column: 28, scope: !471)
!491 = !DILocation(line: 28, column: 31, scope: !471)
!492 = !DILocation(line: 28, column: 16, scope: !471)
!493 = !DILocation(line: 30, column: 4, scope: !471)
!494 = !DILocation(line: 31, column: 27, scope: !471)
!495 = !DILocation(line: 31, column: 9, scope: !471)
!496 = !DILocation(line: 31, column: 2, scope: !471)
!497 = !DILocation(line: 32, column: 1, scope: !471)
!498 = distinct !DISubprogram(name: "rb_insert", scope: !4, file: !4, line: 217, type: !499, scopeLine: 218, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !501)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !425, !97}
!501 = !{!502, !503, !504, !505, !509, !510, !511}
!502 = !DILocalVariable(name: "tree", arg: 1, scope: !498, file: !4, line: 217, type: !425)
!503 = !DILocalVariable(name: "node", arg: 2, scope: !498, file: !4, line: 217, type: !97)
!504 = !DILocalVariable(name: "__vla_expr0", scope: !498, type: !96, flags: DIFlagArtificial)
!505 = !DILocalVariable(name: "stack", scope: !498, file: !4, line: 232, type: !506)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: !504)
!509 = !DILocalVariable(name: "stacksz", scope: !498, file: !4, line: 235, type: !93)
!510 = !DILocalVariable(name: "parent", scope: !498, file: !4, line: 237, type: !97)
!511 = !DILocalVariable(name: "side", scope: !498, file: !4, line: 239, type: !105)
!512 = !DILocation(line: 217, column: 31, scope: !498)
!513 = !DILocation(line: 217, column: 52, scope: !498)
!514 = !DILocation(line: 219, column: 12, scope: !498)
!515 = !DILocation(line: 219, column: 2, scope: !498)
!516 = !DILocation(line: 220, column: 12, scope: !498)
!517 = !DILocation(line: 220, column: 2, scope: !498)
!518 = !DILocation(line: 222, column: 6, scope: !519)
!519 = distinct !DILexicalBlock(scope: !498, file: !4, line: 222, column: 6)
!520 = !DILocation(line: 222, column: 12, scope: !519)
!521 = !DILocation(line: 222, column: 17, scope: !519)
!522 = !DILocation(line: 222, column: 6, scope: !498)
!523 = !DILocation(line: 223, column: 16, scope: !524)
!524 = distinct !DILexicalBlock(scope: !519, file: !4, line: 222, column: 32)
!525 = !DILocation(line: 223, column: 3, scope: !524)
!526 = !DILocation(line: 223, column: 9, scope: !524)
!527 = !DILocation(line: 223, column: 14, scope: !524)
!528 = !DILocation(line: 224, column: 3, scope: !524)
!529 = !DILocation(line: 224, column: 9, scope: !524)
!530 = !DILocation(line: 224, column: 19, scope: !524)
!531 = !DILocation(line: 225, column: 13, scope: !524)
!532 = !DILocation(line: 225, column: 3, scope: !524)
!533 = !DILocation(line: 226, column: 3, scope: !524)
!534 = !DILocation(line: 232, column: 23, scope: !498)
!535 = !DILocation(line: 232, column: 29, scope: !498)
!536 = !DILocation(line: 232, column: 39, scope: !498)
!537 = !DILocation(line: 232, column: 2, scope: !498)
!538 = !DILocation(line: 0, scope: !498)
!539 = !DILocation(line: 232, column: 17, scope: !498)
!540 = !DILocation(line: 235, column: 2, scope: !498)
!541 = !DILocation(line: 235, column: 6, scope: !498)
!542 = !DILocation(line: 235, column: 31, scope: !498)
!543 = !DILocation(line: 235, column: 37, scope: !498)
!544 = !DILocation(line: 235, column: 16, scope: !498)
!545 = !DILocation(line: 237, column: 2, scope: !498)
!546 = !DILocation(line: 237, column: 17, scope: !498)
!547 = !DILocation(line: 237, column: 32, scope: !498)
!548 = !DILocation(line: 237, column: 40, scope: !498)
!549 = !DILocation(line: 237, column: 26, scope: !498)
!550 = !DILocation(line: 239, column: 2, scope: !498)
!551 = !DILocation(line: 239, column: 10, scope: !498)
!552 = !DILocation(line: 239, column: 17, scope: !498)
!553 = !DILocation(line: 239, column: 23, scope: !498)
!554 = !DILocation(line: 239, column: 35, scope: !498)
!555 = !DILocation(line: 239, column: 41, scope: !498)
!556 = !DILocation(line: 241, column: 12, scope: !498)
!557 = !DILocation(line: 241, column: 20, scope: !498)
!558 = !DILocation(line: 241, column: 26, scope: !498)
!559 = !DILocation(line: 241, column: 2, scope: !498)
!560 = !DILocation(line: 242, column: 12, scope: !498)
!561 = !DILocation(line: 242, column: 2, scope: !498)
!562 = !DILocation(line: 244, column: 21, scope: !498)
!563 = !DILocation(line: 244, column: 15, scope: !498)
!564 = !DILocation(line: 244, column: 2, scope: !498)
!565 = !DILocation(line: 244, column: 19, scope: !498)
!566 = !DILocation(line: 245, column: 23, scope: !498)
!567 = !DILocation(line: 245, column: 2, scope: !498)
!568 = !DILocation(line: 247, column: 6, scope: !569)
!569 = distinct !DILexicalBlock(scope: !498, file: !4, line: 247, column: 6)
!570 = !DILocation(line: 247, column: 16, scope: !569)
!571 = !DILocation(line: 247, column: 22, scope: !569)
!572 = !DILocation(line: 247, column: 14, scope: !569)
!573 = !DILocation(line: 247, column: 6, scope: !498)
!574 = !DILocation(line: 248, column: 21, scope: !575)
!575 = distinct !DILexicalBlock(scope: !569, file: !4, line: 247, column: 33)
!576 = !DILocation(line: 248, column: 3, scope: !575)
!577 = !DILocation(line: 248, column: 9, scope: !575)
!578 = !DILocation(line: 248, column: 19, scope: !575)
!579 = !DILocation(line: 249, column: 2, scope: !575)
!580 = !DILocation(line: 252, column: 15, scope: !498)
!581 = !DILocation(line: 252, column: 2, scope: !498)
!582 = !DILocation(line: 252, column: 8, scope: !498)
!583 = !DILocation(line: 252, column: 13, scope: !498)
!584 = !DILocation(line: 254, column: 1, scope: !498)
!585 = distinct !DISubprogram(name: "set_child", scope: !4, file: !4, line: 34, type: !586, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !588)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !97, !105, !92}
!588 = !{!589, !590, !591, !592, !595}
!589 = !DILocalVariable(name: "n", arg: 1, scope: !585, file: !4, line: 34, type: !97)
!590 = !DILocalVariable(name: "side", arg: 2, scope: !585, file: !4, line: 34, type: !105)
!591 = !DILocalVariable(name: "val", arg: 3, scope: !585, file: !4, line: 34, type: !92)
!592 = !DILocalVariable(name: "old", scope: !593, file: !4, line: 40, type: !94)
!593 = distinct !DILexicalBlock(scope: !594, file: !4, line: 39, column: 9)
!594 = distinct !DILexicalBlock(scope: !585, file: !4, line: 37, column: 6)
!595 = !DILocalVariable(name: "new", scope: !593, file: !4, line: 41, type: !94)
!596 = !DILocation(line: 34, column: 38, scope: !585)
!597 = !DILocation(line: 34, column: 49, scope: !585)
!598 = !DILocation(line: 34, column: 61, scope: !585)
!599 = !DILocation(line: 37, column: 6, scope: !594)
!600 = !DILocation(line: 37, column: 11, scope: !594)
!601 = !DILocation(line: 37, column: 6, scope: !585)
!602 = !DILocation(line: 38, column: 20, scope: !603)
!603 = distinct !DILexicalBlock(scope: !594, file: !4, line: 37, column: 18)
!604 = !DILocation(line: 38, column: 3, scope: !603)
!605 = !DILocation(line: 38, column: 6, scope: !603)
!606 = !DILocation(line: 38, column: 18, scope: !603)
!607 = !DILocation(line: 39, column: 2, scope: !603)
!608 = !DILocation(line: 40, column: 3, scope: !593)
!609 = !DILocation(line: 40, column: 13, scope: !593)
!610 = !DILocation(line: 40, column: 31, scope: !593)
!611 = !DILocation(line: 40, column: 34, scope: !593)
!612 = !DILocation(line: 40, column: 19, scope: !593)
!613 = !DILocation(line: 41, column: 3, scope: !593)
!614 = !DILocation(line: 41, column: 13, scope: !593)
!615 = !DILocation(line: 41, column: 31, scope: !593)
!616 = !DILocation(line: 41, column: 19, scope: !593)
!617 = !DILocation(line: 43, column: 30, scope: !593)
!618 = !DILocation(line: 43, column: 37, scope: !593)
!619 = !DILocation(line: 43, column: 41, scope: !593)
!620 = !DILocation(line: 43, column: 34, scope: !593)
!621 = !DILocation(line: 43, column: 20, scope: !593)
!622 = !DILocation(line: 43, column: 3, scope: !593)
!623 = !DILocation(line: 43, column: 6, scope: !593)
!624 = !DILocation(line: 43, column: 18, scope: !593)
!625 = !DILocation(line: 44, column: 2, scope: !594)
!626 = !DILocation(line: 45, column: 1, scope: !585)
!627 = distinct !DISubprogram(name: "set_color", scope: !4, file: !4, line: 63, type: !628, scopeLine: 64, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !630)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !97, !3}
!630 = !{!631, !632, !633}
!631 = !DILocalVariable(name: "n", arg: 1, scope: !627, file: !4, line: 63, type: !97)
!632 = !DILocalVariable(name: "color", arg: 2, scope: !627, file: !4, line: 63, type: !3)
!633 = !DILocalVariable(name: "p", scope: !627, file: !4, line: 67, type: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!635 = !DILocation(line: 63, column: 38, scope: !627)
!636 = !DILocation(line: 63, column: 55, scope: !627)
!637 = !DILocation(line: 67, column: 2, scope: !627)
!638 = !DILocation(line: 67, column: 13, scope: !627)
!639 = !DILocation(line: 67, column: 27, scope: !627)
!640 = !DILocation(line: 67, column: 30, scope: !627)
!641 = !DILocation(line: 69, column: 9, scope: !627)
!642 = !DILocation(line: 69, column: 8, scope: !627)
!643 = !DILocation(line: 69, column: 11, scope: !627)
!644 = !DILocation(line: 69, column: 30, scope: !627)
!645 = !DILocation(line: 69, column: 21, scope: !627)
!646 = !DILocation(line: 69, column: 19, scope: !627)
!647 = !DILocation(line: 69, column: 3, scope: !627)
!648 = !DILocation(line: 69, column: 5, scope: !627)
!649 = !DILocation(line: 70, column: 1, scope: !627)
!650 = distinct !DISubprogram(name: "find_and_stack", scope: !4, file: !4, line: 79, type: !651, scopeLine: 81, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !654)
!651 = !DISubroutineType(types: !652)
!652 = !{!93, !425, !97, !653}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!654 = !{!655, !656, !657, !658, !659, !661}
!655 = !DILocalVariable(name: "tree", arg: 1, scope: !650, file: !4, line: 79, type: !425)
!656 = !DILocalVariable(name: "node", arg: 2, scope: !650, file: !4, line: 79, type: !97)
!657 = !DILocalVariable(name: "stack", arg: 3, scope: !650, file: !4, line: 80, type: !653)
!658 = !DILocalVariable(name: "sz", scope: !650, file: !4, line: 82, type: !93)
!659 = !DILocalVariable(name: "side", scope: !660, file: !4, line: 87, type: !105)
!660 = distinct !DILexicalBlock(scope: !650, file: !4, line: 86, column: 32)
!661 = !DILocalVariable(name: "ch", scope: !660, file: !4, line: 88, type: !97)
!662 = !DILocation(line: 79, column: 42, scope: !650)
!663 = !DILocation(line: 79, column: 63, scope: !650)
!664 = !DILocation(line: 80, column: 22, scope: !650)
!665 = !DILocation(line: 82, column: 2, scope: !650)
!666 = !DILocation(line: 82, column: 6, scope: !650)
!667 = !DILocation(line: 84, column: 16, scope: !650)
!668 = !DILocation(line: 84, column: 22, scope: !650)
!669 = !DILocation(line: 84, column: 2, scope: !650)
!670 = !DILocation(line: 84, column: 10, scope: !650)
!671 = !DILocation(line: 84, column: 14, scope: !650)
!672 = !DILocation(line: 86, column: 2, scope: !650)
!673 = !DILocation(line: 86, column: 9, scope: !650)
!674 = !DILocation(line: 86, column: 15, scope: !650)
!675 = !DILocation(line: 86, column: 18, scope: !650)
!676 = !DILocation(line: 86, column: 26, scope: !650)
!677 = !DILocation(line: 86, column: 23, scope: !650)
!678 = !DILocation(line: 87, column: 3, scope: !660)
!679 = !DILocation(line: 87, column: 11, scope: !660)
!680 = !DILocation(line: 87, column: 18, scope: !660)
!681 = !DILocation(line: 87, column: 24, scope: !660)
!682 = !DILocation(line: 87, column: 36, scope: !660)
!683 = !DILocation(line: 87, column: 42, scope: !660)
!684 = !DILocation(line: 87, column: 48, scope: !660)
!685 = !DILocation(line: 87, column: 51, scope: !660)
!686 = !DILocation(line: 88, column: 3, scope: !660)
!687 = !DILocation(line: 88, column: 18, scope: !660)
!688 = !DILocation(line: 88, column: 33, scope: !660)
!689 = !DILocation(line: 88, column: 39, scope: !660)
!690 = !DILocation(line: 88, column: 42, scope: !660)
!691 = !DILocation(line: 88, column: 48, scope: !660)
!692 = !DILocation(line: 88, column: 23, scope: !660)
!693 = !DILocation(line: 90, column: 7, scope: !694)
!694 = distinct !DILexicalBlock(scope: !660, file: !4, line: 90, column: 7)
!695 = !DILocation(line: 90, column: 10, scope: !694)
!696 = !DILocation(line: 90, column: 7, scope: !660)
!697 = !DILocation(line: 91, column: 18, scope: !698)
!698 = distinct !DILexicalBlock(scope: !694, file: !4, line: 90, column: 25)
!699 = !DILocation(line: 91, column: 4, scope: !698)
!700 = !DILocation(line: 91, column: 12, scope: !698)
!701 = !DILocation(line: 91, column: 16, scope: !698)
!702 = !DILocation(line: 92, column: 3, scope: !698)
!703 = !DILocation(line: 93, column: 4, scope: !704)
!704 = distinct !DILexicalBlock(scope: !694, file: !4, line: 92, column: 10)
!705 = !DILocation(line: 95, column: 2, scope: !650)
!706 = distinct !{!706, !672, !705}
!707 = !DILocation(line: 97, column: 9, scope: !650)
!708 = !DILocation(line: 98, column: 1, scope: !650)
!709 = !DILocation(line: 97, column: 2, scope: !650)
!710 = distinct !DISubprogram(name: "fix_extra_red", scope: !4, file: !4, line: 155, type: !711, scopeLine: 156, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !713)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !653, !93}
!713 = !{!714, !715, !716, !718, !719, !720, !721, !722}
!714 = !DILocalVariable(name: "stack", arg: 1, scope: !710, file: !4, line: 155, type: !653)
!715 = !DILocalVariable(name: "stacksz", arg: 2, scope: !710, file: !4, line: 155, type: !93)
!716 = !DILocalVariable(name: "node", scope: !717, file: !4, line: 158, type: !97)
!717 = distinct !DILexicalBlock(scope: !710, file: !4, line: 157, column: 22)
!718 = !DILocalVariable(name: "parent", scope: !717, file: !4, line: 159, type: !97)
!719 = !DILocalVariable(name: "grandparent", scope: !717, file: !4, line: 176, type: !97)
!720 = !DILocalVariable(name: "side", scope: !717, file: !4, line: 177, type: !105)
!721 = !DILocalVariable(name: "aunt", scope: !717, file: !4, line: 178, type: !97)
!722 = !DILocalVariable(name: "parent_side", scope: !717, file: !4, line: 198, type: !105)
!723 = !DILocation(line: 155, column: 43, scope: !710)
!724 = !DILocation(line: 155, column: 54, scope: !710)
!725 = !DILocation(line: 157, column: 2, scope: !710)
!726 = !DILocation(line: 157, column: 9, scope: !710)
!727 = !DILocation(line: 157, column: 17, scope: !710)
!728 = !DILocation(line: 158, column: 3, scope: !717)
!729 = !DILocation(line: 158, column: 18, scope: !717)
!730 = !DILocation(line: 158, column: 25, scope: !717)
!731 = !DILocation(line: 158, column: 31, scope: !717)
!732 = !DILocation(line: 158, column: 39, scope: !717)
!733 = !DILocation(line: 159, column: 3, scope: !717)
!734 = !DILocation(line: 159, column: 18, scope: !717)
!735 = !DILocation(line: 159, column: 27, scope: !717)
!736 = !DILocation(line: 159, column: 33, scope: !717)
!737 = !DILocation(line: 159, column: 41, scope: !717)
!738 = !DILocation(line: 167, column: 16, scope: !739)
!739 = distinct !DILexicalBlock(scope: !717, file: !4, line: 167, column: 7)
!740 = !DILocation(line: 167, column: 7, scope: !739)
!741 = !DILocation(line: 167, column: 7, scope: !717)
!742 = !DILocation(line: 168, column: 4, scope: !743)
!743 = distinct !DILexicalBlock(scope: !739, file: !4, line: 167, column: 25)
!744 = !DILocation(line: 176, column: 3, scope: !717)
!745 = !DILocation(line: 176, column: 18, scope: !717)
!746 = !DILocation(line: 176, column: 32, scope: !717)
!747 = !DILocation(line: 176, column: 38, scope: !717)
!748 = !DILocation(line: 176, column: 46, scope: !717)
!749 = !DILocation(line: 177, column: 3, scope: !717)
!750 = !DILocation(line: 177, column: 11, scope: !717)
!751 = !DILocation(line: 177, column: 27, scope: !717)
!752 = !DILocation(line: 177, column: 40, scope: !717)
!753 = !DILocation(line: 177, column: 18, scope: !717)
!754 = !DILocation(line: 178, column: 3, scope: !717)
!755 = !DILocation(line: 178, column: 18, scope: !717)
!756 = !DILocation(line: 178, column: 35, scope: !717)
!757 = !DILocation(line: 179, column: 8, scope: !717)
!758 = !DILocation(line: 179, column: 13, scope: !717)
!759 = !DILocation(line: 179, column: 7, scope: !717)
!760 = !DILocation(line: 178, column: 25, scope: !717)
!761 = !DILocation(line: 181, column: 8, scope: !762)
!762 = distinct !DILexicalBlock(scope: !717, file: !4, line: 181, column: 7)
!763 = !DILocation(line: 181, column: 13, scope: !762)
!764 = !DILocation(line: 181, column: 28, scope: !762)
!765 = !DILocation(line: 181, column: 38, scope: !762)
!766 = !DILocation(line: 181, column: 31, scope: !762)
!767 = !DILocation(line: 181, column: 7, scope: !717)
!768 = !DILocation(line: 182, column: 14, scope: !769)
!769 = distinct !DILexicalBlock(scope: !762, file: !4, line: 181, column: 45)
!770 = !DILocation(line: 182, column: 4, scope: !769)
!771 = !DILocation(line: 183, column: 14, scope: !769)
!772 = !DILocation(line: 183, column: 4, scope: !769)
!773 = !DILocation(line: 184, column: 14, scope: !769)
!774 = !DILocation(line: 184, column: 4, scope: !769)
!775 = !DILocation(line: 190, column: 12, scope: !769)
!776 = !DILocation(line: 191, column: 4, scope: !769)
!777 = distinct !{!777, !725, !778}
!778 = !DILocation(line: 209, column: 2, scope: !710)
!779 = !DILocation(line: 198, column: 3, scope: !717)
!780 = !DILocation(line: 198, column: 11, scope: !717)
!781 = !DILocation(line: 198, column: 34, scope: !717)
!782 = !DILocation(line: 198, column: 42, scope: !717)
!783 = !DILocation(line: 198, column: 25, scope: !717)
!784 = !DILocation(line: 200, column: 7, scope: !785)
!785 = distinct !DILexicalBlock(scope: !717, file: !4, line: 200, column: 7)
!786 = !DILocation(line: 200, column: 22, scope: !785)
!787 = !DILocation(line: 200, column: 19, scope: !785)
!788 = !DILocation(line: 200, column: 7, scope: !717)
!789 = !DILocation(line: 201, column: 11, scope: !790)
!790 = distinct !DILexicalBlock(scope: !785, file: !4, line: 200, column: 28)
!791 = !DILocation(line: 201, column: 18, scope: !790)
!792 = !DILocation(line: 201, column: 4, scope: !790)
!793 = !DILocation(line: 202, column: 3, scope: !790)
!794 = !DILocation(line: 205, column: 10, scope: !717)
!795 = !DILocation(line: 205, column: 17, scope: !717)
!796 = !DILocation(line: 205, column: 25, scope: !717)
!797 = !DILocation(line: 205, column: 3, scope: !717)
!798 = !DILocation(line: 206, column: 13, scope: !717)
!799 = !DILocation(line: 206, column: 19, scope: !717)
!800 = !DILocation(line: 206, column: 27, scope: !717)
!801 = !DILocation(line: 206, column: 3, scope: !717)
!802 = !DILocation(line: 207, column: 13, scope: !717)
!803 = !DILocation(line: 207, column: 19, scope: !717)
!804 = !DILocation(line: 207, column: 27, scope: !717)
!805 = !DILocation(line: 207, column: 3, scope: !717)
!806 = !DILocation(line: 214, column: 12, scope: !710)
!807 = !DILocation(line: 214, column: 2, scope: !710)
!808 = !DILocation(line: 215, column: 1, scope: !710)
!809 = distinct !DISubprogram(name: "rb_remove", scope: !4, file: !4, line: 367, type: !499, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !810)
!810 = !{!811, !812, !813, !814, !815, !819, !820, !823, !824, !825, !826, !827, !828}
!811 = !DILocalVariable(name: "tree", arg: 1, scope: !809, file: !4, line: 367, type: !425)
!812 = !DILocalVariable(name: "node", arg: 2, scope: !809, file: !4, line: 367, type: !97)
!813 = !DILocalVariable(name: "tmp", scope: !809, file: !4, line: 369, type: !97)
!814 = !DILocalVariable(name: "__vla_expr0", scope: !809, type: !96, flags: DIFlagArtificial)
!815 = !DILocalVariable(name: "stack", scope: !809, file: !4, line: 373, type: !816)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: !814)
!819 = !DILocalVariable(name: "stacksz", scope: !809, file: !4, line: 376, type: !93)
!820 = !DILocalVariable(name: "stacksz0", scope: !821, file: !4, line: 388, type: !93)
!821 = distinct !DILexicalBlock(scope: !822, file: !4, line: 387, column: 82)
!822 = distinct !DILexicalBlock(scope: !809, file: !4, line: 387, column: 6)
!823 = !DILocalVariable(name: "hiparent", scope: !821, file: !4, line: 389, type: !97)
!824 = !DILocalVariable(name: "loparent", scope: !821, file: !4, line: 389, type: !97)
!825 = !DILocalVariable(name: "node2", scope: !821, file: !4, line: 390, type: !97)
!826 = !DILocalVariable(name: "ctmp", scope: !821, file: !4, line: 440, type: !3)
!827 = !DILocalVariable(name: "child", scope: !809, file: !4, line: 449, type: !97)
!828 = !DILocalVariable(name: "parent", scope: !809, file: !4, line: 466, type: !97)
!829 = !DILocation(line: 367, column: 31, scope: !809)
!830 = !DILocation(line: 367, column: 52, scope: !809)
!831 = !DILocation(line: 369, column: 2, scope: !809)
!832 = !DILocation(line: 369, column: 17, scope: !809)
!833 = !DILocation(line: 373, column: 23, scope: !809)
!834 = !DILocation(line: 373, column: 29, scope: !809)
!835 = !DILocation(line: 373, column: 39, scope: !809)
!836 = !DILocation(line: 373, column: 2, scope: !809)
!837 = !DILocation(line: 0, scope: !809)
!838 = !DILocation(line: 373, column: 17, scope: !809)
!839 = !DILocation(line: 376, column: 2, scope: !809)
!840 = !DILocation(line: 376, column: 6, scope: !809)
!841 = !DILocation(line: 376, column: 31, scope: !809)
!842 = !DILocation(line: 376, column: 37, scope: !809)
!843 = !DILocation(line: 376, column: 16, scope: !809)
!844 = !DILocation(line: 378, column: 6, scope: !845)
!845 = distinct !DILexicalBlock(scope: !809, file: !4, line: 378, column: 6)
!846 = !DILocation(line: 378, column: 20, scope: !845)
!847 = !DILocation(line: 378, column: 28, scope: !845)
!848 = !DILocation(line: 378, column: 14, scope: !845)
!849 = !DILocation(line: 378, column: 11, scope: !845)
!850 = !DILocation(line: 378, column: 6, scope: !809)
!851 = !DILocation(line: 379, column: 3, scope: !852)
!852 = distinct !DILexicalBlock(scope: !845, file: !4, line: 378, column: 34)
!853 = !DILocation(line: 387, column: 17, scope: !822)
!854 = !DILocation(line: 387, column: 7, scope: !822)
!855 = !DILocation(line: 387, column: 27, scope: !822)
!856 = !DILocation(line: 387, column: 42, scope: !822)
!857 = !DILocation(line: 387, column: 56, scope: !822)
!858 = !DILocation(line: 387, column: 46, scope: !822)
!859 = !DILocation(line: 387, column: 66, scope: !822)
!860 = !DILocation(line: 387, column: 6, scope: !809)
!861 = !DILocation(line: 388, column: 3, scope: !821)
!862 = !DILocation(line: 388, column: 7, scope: !821)
!863 = !DILocation(line: 388, column: 18, scope: !821)
!864 = !DILocation(line: 389, column: 3, scope: !821)
!865 = !DILocation(line: 389, column: 18, scope: !821)
!866 = !DILocation(line: 389, column: 29, scope: !821)
!867 = !DILocation(line: 390, column: 3, scope: !821)
!868 = !DILocation(line: 390, column: 18, scope: !821)
!869 = !DILocation(line: 390, column: 36, scope: !821)
!870 = !DILocation(line: 390, column: 26, scope: !821)
!871 = !DILocation(line: 392, column: 15, scope: !821)
!872 = !DILocation(line: 392, column: 23, scope: !821)
!873 = !DILocation(line: 392, column: 14, scope: !821)
!874 = !DILocation(line: 392, column: 36, scope: !821)
!875 = !DILocation(line: 392, column: 44, scope: !821)
!876 = !DILocation(line: 392, column: 30, scope: !821)
!877 = !DILocation(line: 392, column: 12, scope: !821)
!878 = !DILocation(line: 393, column: 22, scope: !821)
!879 = !DILocation(line: 393, column: 16, scope: !821)
!880 = !DILocation(line: 393, column: 3, scope: !821)
!881 = !DILocation(line: 393, column: 20, scope: !821)
!882 = !DILocation(line: 394, column: 3, scope: !821)
!883 = !DILocation(line: 394, column: 20, scope: !821)
!884 = !DILocation(line: 394, column: 10, scope: !821)
!885 = !DILocation(line: 394, column: 31, scope: !821)
!886 = !DILocation(line: 395, column: 22, scope: !887)
!887 = distinct !DILexicalBlock(scope: !821, file: !4, line: 394, column: 46)
!888 = !DILocation(line: 395, column: 12, scope: !887)
!889 = !DILocation(line: 395, column: 10, scope: !887)
!890 = !DILocation(line: 396, column: 23, scope: !887)
!891 = !DILocation(line: 396, column: 17, scope: !887)
!892 = !DILocation(line: 396, column: 4, scope: !887)
!893 = !DILocation(line: 396, column: 21, scope: !887)
!894 = distinct !{!894, !882, !895}
!895 = !DILocation(line: 397, column: 3, scope: !821)
!896 = !DILocation(line: 399, column: 20, scope: !821)
!897 = !DILocation(line: 399, column: 28, scope: !821)
!898 = !DILocation(line: 399, column: 14, scope: !821)
!899 = !DILocation(line: 399, column: 12, scope: !821)
!900 = !DILocation(line: 417, column: 7, scope: !901)
!901 = distinct !DILexicalBlock(scope: !821, file: !4, line: 417, column: 7)
!902 = !DILocation(line: 417, column: 16, scope: !901)
!903 = !DILocation(line: 417, column: 7, scope: !821)
!904 = !DILocation(line: 418, column: 14, scope: !905)
!905 = distinct !DILexicalBlock(scope: !901, file: !4, line: 417, column: 31)
!906 = !DILocation(line: 418, column: 33, scope: !905)
!907 = !DILocation(line: 418, column: 43, scope: !905)
!908 = !DILocation(line: 418, column: 24, scope: !905)
!909 = !DILocation(line: 418, column: 50, scope: !905)
!910 = !DILocation(line: 418, column: 4, scope: !905)
!911 = !DILocation(line: 419, column: 3, scope: !905)
!912 = !DILocation(line: 420, column: 17, scope: !913)
!913 = distinct !DILexicalBlock(scope: !901, file: !4, line: 419, column: 10)
!914 = !DILocation(line: 420, column: 4, scope: !913)
!915 = !DILocation(line: 420, column: 10, scope: !913)
!916 = !DILocation(line: 420, column: 15, scope: !913)
!917 = !DILocation(line: 423, column: 7, scope: !918)
!918 = distinct !DILexicalBlock(scope: !821, file: !4, line: 423, column: 7)
!919 = !DILocation(line: 423, column: 19, scope: !918)
!920 = !DILocation(line: 423, column: 16, scope: !918)
!921 = !DILocation(line: 423, column: 7, scope: !821)
!922 = !DILocation(line: 424, column: 14, scope: !923)
!923 = distinct !DILexicalBlock(scope: !918, file: !4, line: 423, column: 25)
!924 = !DILocation(line: 424, column: 34, scope: !923)
!925 = !DILocation(line: 424, column: 24, scope: !923)
!926 = !DILocation(line: 424, column: 4, scope: !923)
!927 = !DILocation(line: 425, column: 14, scope: !923)
!928 = !DILocation(line: 425, column: 25, scope: !923)
!929 = !DILocation(line: 425, column: 4, scope: !923)
!930 = !DILocation(line: 426, column: 3, scope: !923)
!931 = !DILocation(line: 427, column: 14, scope: !932)
!932 = distinct !DILexicalBlock(scope: !918, file: !4, line: 426, column: 10)
!933 = !DILocation(line: 427, column: 33, scope: !932)
!934 = !DILocation(line: 427, column: 43, scope: !932)
!935 = !DILocation(line: 427, column: 24, scope: !932)
!936 = !DILocation(line: 427, column: 51, scope: !932)
!937 = !DILocation(line: 427, column: 4, scope: !932)
!938 = !DILocation(line: 428, column: 20, scope: !932)
!939 = !DILocation(line: 428, column: 10, scope: !932)
!940 = !DILocation(line: 428, column: 8, scope: !932)
!941 = !DILocation(line: 429, column: 14, scope: !932)
!942 = !DILocation(line: 429, column: 34, scope: !932)
!943 = !DILocation(line: 429, column: 24, scope: !932)
!944 = !DILocation(line: 429, column: 4, scope: !932)
!945 = !DILocation(line: 430, column: 14, scope: !932)
!946 = !DILocation(line: 430, column: 25, scope: !932)
!947 = !DILocation(line: 430, column: 4, scope: !932)
!948 = !DILocation(line: 433, column: 13, scope: !821)
!949 = !DILocation(line: 433, column: 34, scope: !821)
!950 = !DILocation(line: 433, column: 24, scope: !821)
!951 = !DILocation(line: 433, column: 3, scope: !821)
!952 = !DILocation(line: 434, column: 13, scope: !821)
!953 = !DILocation(line: 434, column: 3, scope: !821)
!954 = !DILocation(line: 436, column: 15, scope: !821)
!955 = !DILocation(line: 436, column: 24, scope: !821)
!956 = !DILocation(line: 436, column: 9, scope: !821)
!957 = !DILocation(line: 436, column: 7, scope: !821)
!958 = !DILocation(line: 437, column: 31, scope: !821)
!959 = !DILocation(line: 437, column: 39, scope: !821)
!960 = !DILocation(line: 437, column: 25, scope: !821)
!961 = !DILocation(line: 437, column: 9, scope: !821)
!962 = !DILocation(line: 437, column: 18, scope: !821)
!963 = !DILocation(line: 437, column: 3, scope: !821)
!964 = !DILocation(line: 437, column: 23, scope: !821)
!965 = !DILocation(line: 438, column: 24, scope: !821)
!966 = !DILocation(line: 438, column: 9, scope: !821)
!967 = !DILocation(line: 438, column: 17, scope: !821)
!968 = !DILocation(line: 438, column: 3, scope: !821)
!969 = !DILocation(line: 438, column: 22, scope: !821)
!970 = !DILocation(line: 440, column: 3, scope: !821)
!971 = !DILocation(line: 440, column: 17, scope: !821)
!972 = !DILocation(line: 440, column: 34, scope: !821)
!973 = !DILocation(line: 440, column: 24, scope: !821)
!974 = !DILocation(line: 442, column: 13, scope: !821)
!975 = !DILocation(line: 442, column: 29, scope: !821)
!976 = !DILocation(line: 442, column: 19, scope: !821)
!977 = !DILocation(line: 442, column: 3, scope: !821)
!978 = !DILocation(line: 443, column: 13, scope: !821)
!979 = !DILocation(line: 443, column: 20, scope: !821)
!980 = !DILocation(line: 443, column: 3, scope: !821)
!981 = !DILocation(line: 444, column: 2, scope: !822)
!982 = !DILocation(line: 444, column: 2, scope: !821)
!983 = !DILocation(line: 449, column: 2, scope: !809)
!984 = !DILocation(line: 449, column: 17, scope: !809)
!985 = !DILocation(line: 449, column: 35, scope: !809)
!986 = !DILocation(line: 449, column: 25, scope: !809)
!987 = !DILocation(line: 451, column: 6, scope: !988)
!988 = distinct !DILexicalBlock(scope: !809, file: !4, line: 451, column: 6)
!989 = !DILocation(line: 451, column: 12, scope: !988)
!990 = !DILocation(line: 451, column: 6, scope: !809)
!991 = !DILocation(line: 452, column: 21, scope: !992)
!992 = distinct !DILexicalBlock(scope: !988, file: !4, line: 451, column: 27)
!993 = !DILocation(line: 452, column: 11, scope: !992)
!994 = !DILocation(line: 452, column: 9, scope: !992)
!995 = !DILocation(line: 453, column: 2, scope: !992)
!996 = !DILocation(line: 456, column: 6, scope: !997)
!997 = distinct !DILexicalBlock(scope: !809, file: !4, line: 456, column: 6)
!998 = !DILocation(line: 456, column: 14, scope: !997)
!999 = !DILocation(line: 456, column: 6, scope: !809)
!1000 = !DILocation(line: 457, column: 16, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !997, file: !4, line: 456, column: 19)
!1002 = !DILocation(line: 457, column: 3, scope: !1001)
!1003 = !DILocation(line: 457, column: 9, scope: !1001)
!1004 = !DILocation(line: 457, column: 14, scope: !1001)
!1005 = !DILocation(line: 458, column: 7, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1001, file: !4, line: 458, column: 7)
!1007 = !DILocation(line: 458, column: 13, scope: !1006)
!1008 = !DILocation(line: 458, column: 7, scope: !1001)
!1009 = !DILocation(line: 459, column: 14, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1006, file: !4, line: 458, column: 28)
!1011 = !DILocation(line: 459, column: 4, scope: !1010)
!1012 = !DILocation(line: 460, column: 3, scope: !1010)
!1013 = !DILocation(line: 461, column: 4, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1006, file: !4, line: 460, column: 10)
!1015 = !DILocation(line: 461, column: 10, scope: !1014)
!1016 = !DILocation(line: 461, column: 20, scope: !1014)
!1017 = !DILocation(line: 463, column: 3, scope: !1001)
!1018 = !DILocation(line: 466, column: 2, scope: !809)
!1019 = !DILocation(line: 466, column: 17, scope: !809)
!1020 = !DILocation(line: 466, column: 32, scope: !809)
!1021 = !DILocation(line: 466, column: 40, scope: !809)
!1022 = !DILocation(line: 466, column: 26, scope: !809)
!1023 = !DILocation(line: 473, column: 6, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !809, file: !4, line: 473, column: 6)
!1025 = !DILocation(line: 473, column: 12, scope: !1024)
!1026 = !DILocation(line: 473, column: 6, scope: !809)
!1027 = !DILocation(line: 474, column: 16, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !4, line: 474, column: 7)
!1029 = distinct !DILexicalBlock(scope: !1024, file: !4, line: 473, column: 27)
!1030 = !DILocation(line: 474, column: 7, scope: !1028)
!1031 = !DILocation(line: 474, column: 7, scope: !1029)
!1032 = !DILocation(line: 475, column: 29, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1028, file: !4, line: 474, column: 23)
!1034 = !DILocation(line: 475, column: 38, scope: !1033)
!1035 = !DILocation(line: 475, column: 4, scope: !1033)
!1036 = !DILocation(line: 476, column: 3, scope: !1033)
!1037 = !DILocation(line: 478, column: 14, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1028, file: !4, line: 476, column: 10)
!1039 = !DILocation(line: 478, column: 31, scope: !1038)
!1040 = !DILocation(line: 478, column: 39, scope: !1038)
!1041 = !DILocation(line: 478, column: 22, scope: !1038)
!1042 = !DILocation(line: 478, column: 4, scope: !1038)
!1043 = !DILocation(line: 480, column: 2, scope: !1029)
!1044 = !DILocation(line: 481, column: 13, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1024, file: !4, line: 480, column: 9)
!1046 = !DILocation(line: 481, column: 30, scope: !1045)
!1047 = !DILocation(line: 481, column: 38, scope: !1045)
!1048 = !DILocation(line: 481, column: 21, scope: !1045)
!1049 = !DILocation(line: 481, column: 45, scope: !1045)
!1050 = !DILocation(line: 481, column: 3, scope: !1045)
!1051 = !DILocation(line: 487, column: 14, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1045, file: !4, line: 487, column: 7)
!1053 = !DILocation(line: 487, column: 7, scope: !1052)
!1054 = !DILocation(line: 487, column: 20, scope: !1052)
!1055 = !DILocation(line: 487, column: 30, scope: !1052)
!1056 = !DILocation(line: 487, column: 23, scope: !1052)
!1057 = !DILocation(line: 487, column: 7, scope: !1045)
!1058 = !DILocation(line: 488, column: 14, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1052, file: !4, line: 487, column: 38)
!1060 = !DILocation(line: 488, column: 4, scope: !1059)
!1061 = !DILocation(line: 489, column: 3, scope: !1059)
!1062 = !DILocation(line: 493, column: 15, scope: !809)
!1063 = !DILocation(line: 493, column: 2, scope: !809)
!1064 = !DILocation(line: 493, column: 8, scope: !809)
!1065 = !DILocation(line: 493, column: 13, scope: !809)
!1066 = !DILocation(line: 494, column: 1, scope: !809)
!1067 = distinct !DISubprogram(name: "get_side", scope: !4, file: !4, line: 111, type: !1068, scopeLine: 112, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1070)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!105, !97, !97}
!1070 = !{!1071, !1072}
!1071 = !DILocalVariable(name: "parent", arg: 1, scope: !1067, file: !4, line: 111, type: !97)
!1072 = !DILocalVariable(name: "child", arg: 2, scope: !1067, file: !4, line: 111, type: !97)
!1073 = !DILocation(line: 111, column: 40, scope: !1067)
!1074 = !DILocation(line: 111, column: 63, scope: !1067)
!1075 = !DILocation(line: 115, column: 20, scope: !1067)
!1076 = !DILocation(line: 115, column: 10, scope: !1067)
!1077 = !DILocation(line: 115, column: 35, scope: !1067)
!1078 = !DILocation(line: 115, column: 32, scope: !1067)
!1079 = !DILocation(line: 115, column: 9, scope: !1067)
!1080 = !DILocation(line: 115, column: 2, scope: !1067)
!1081 = distinct !DISubprogram(name: "get_color", scope: !4, file: !4, line: 47, type: !1082, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1084)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!3, !97}
!1084 = !{!1085}
!1085 = !DILocalVariable(name: "n", arg: 1, scope: !1081, file: !4, line: 47, type: !97)
!1086 = !DILocation(line: 47, column: 47, scope: !1081)
!1087 = !DILocation(line: 50, column: 21, scope: !1081)
!1088 = !DILocation(line: 50, column: 24, scope: !1081)
!1089 = !DILocation(line: 50, column: 10, scope: !1081)
!1090 = !DILocation(line: 50, column: 37, scope: !1081)
!1091 = !DILocation(line: 50, column: 9, scope: !1081)
!1092 = !DILocation(line: 50, column: 2, scope: !1081)
!1093 = distinct !DISubprogram(name: "is_black", scope: !4, file: !4, line: 53, type: !1094, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1096)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!434, !97}
!1096 = !{!1097}
!1097 = !DILocalVariable(name: "n", arg: 1, scope: !1093, file: !4, line: 53, type: !97)
!1098 = !DILocation(line: 53, column: 38, scope: !1093)
!1099 = !DILocation(line: 55, column: 19, scope: !1093)
!1100 = !DILocation(line: 55, column: 9, scope: !1093)
!1101 = !DILocation(line: 55, column: 22, scope: !1093)
!1102 = !DILocation(line: 55, column: 2, scope: !1093)
!1103 = distinct !DISubprogram(name: "fix_missing_black", scope: !4, file: !4, line: 266, type: !1104, scopeLine: 268, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1106)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{null, !653, !93, !97}
!1106 = !{!1107, !1108, !1109, !1110, !1112, !1113, !1114, !1115, !1116, !1117, !1118}
!1107 = !DILocalVariable(name: "stack", arg: 1, scope: !1103, file: !4, line: 266, type: !653)
!1108 = !DILocalVariable(name: "stacksz", arg: 2, scope: !1103, file: !4, line: 266, type: !93)
!1109 = !DILocalVariable(name: "null_node", arg: 3, scope: !1103, file: !4, line: 267, type: !97)
!1110 = !DILocalVariable(name: "c0", scope: !1111, file: !4, line: 271, type: !97)
!1111 = distinct !DILexicalBlock(scope: !1103, file: !4, line: 270, column: 22)
!1112 = !DILocalVariable(name: "c1", scope: !1111, file: !4, line: 271, type: !97)
!1113 = !DILocalVariable(name: "inner", scope: !1111, file: !4, line: 271, type: !97)
!1114 = !DILocalVariable(name: "outer", scope: !1111, file: !4, line: 271, type: !97)
!1115 = !DILocalVariable(name: "n", scope: !1111, file: !4, line: 272, type: !97)
!1116 = !DILocalVariable(name: "parent", scope: !1111, file: !4, line: 273, type: !97)
!1117 = !DILocalVariable(name: "n_side", scope: !1111, file: !4, line: 274, type: !105)
!1118 = !DILocalVariable(name: "sib", scope: !1111, file: !4, line: 275, type: !97)
!1119 = !DILocation(line: 266, column: 47, scope: !1103)
!1120 = !DILocation(line: 266, column: 58, scope: !1103)
!1121 = !DILocation(line: 267, column: 25, scope: !1103)
!1122 = !DILocation(line: 270, column: 2, scope: !1103)
!1123 = !DILocation(line: 270, column: 9, scope: !1103)
!1124 = !DILocation(line: 270, column: 17, scope: !1103)
!1125 = !DILocation(line: 271, column: 3, scope: !1111)
!1126 = !DILocation(line: 271, column: 18, scope: !1111)
!1127 = !DILocation(line: 271, column: 23, scope: !1111)
!1128 = !DILocation(line: 271, column: 28, scope: !1111)
!1129 = !DILocation(line: 271, column: 36, scope: !1111)
!1130 = !DILocation(line: 272, column: 3, scope: !1111)
!1131 = !DILocation(line: 272, column: 18, scope: !1111)
!1132 = !DILocation(line: 272, column: 22, scope: !1111)
!1133 = !DILocation(line: 272, column: 28, scope: !1111)
!1134 = !DILocation(line: 272, column: 36, scope: !1111)
!1135 = !DILocation(line: 273, column: 3, scope: !1111)
!1136 = !DILocation(line: 273, column: 18, scope: !1111)
!1137 = !DILocation(line: 273, column: 27, scope: !1111)
!1138 = !DILocation(line: 273, column: 33, scope: !1111)
!1139 = !DILocation(line: 273, column: 41, scope: !1111)
!1140 = !DILocation(line: 274, column: 3, scope: !1111)
!1141 = !DILocation(line: 274, column: 11, scope: !1111)
!1142 = !DILocation(line: 274, column: 29, scope: !1111)
!1143 = !DILocation(line: 274, column: 37, scope: !1111)
!1144 = !DILocation(line: 274, column: 20, scope: !1111)
!1145 = !DILocation(line: 275, column: 3, scope: !1111)
!1146 = !DILocation(line: 275, column: 18, scope: !1111)
!1147 = !DILocation(line: 275, column: 34, scope: !1111)
!1148 = !DILocation(line: 276, column: 14, scope: !1111)
!1149 = !DILocation(line: 276, column: 21, scope: !1111)
!1150 = !DILocation(line: 276, column: 13, scope: !1111)
!1151 = !DILocation(line: 275, column: 24, scope: !1111)
!1152 = !DILocation(line: 285, column: 17, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1111, file: !4, line: 285, column: 7)
!1154 = !DILocation(line: 285, column: 8, scope: !1153)
!1155 = !DILocation(line: 285, column: 7, scope: !1111)
!1156 = !DILocation(line: 286, column: 25, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1153, file: !4, line: 285, column: 23)
!1158 = !DILocation(line: 286, column: 4, scope: !1157)
!1159 = !DILocation(line: 286, column: 10, scope: !1157)
!1160 = !DILocation(line: 286, column: 18, scope: !1157)
!1161 = !DILocation(line: 286, column: 23, scope: !1157)
!1162 = !DILocation(line: 287, column: 11, scope: !1157)
!1163 = !DILocation(line: 287, column: 18, scope: !1157)
!1164 = !DILocation(line: 287, column: 4, scope: !1157)
!1165 = !DILocation(line: 288, column: 14, scope: !1157)
!1166 = !DILocation(line: 288, column: 4, scope: !1157)
!1167 = !DILocation(line: 289, column: 14, scope: !1157)
!1168 = !DILocation(line: 289, column: 4, scope: !1157)
!1169 = !DILocation(line: 290, column: 23, scope: !1157)
!1170 = !DILocation(line: 290, column: 4, scope: !1157)
!1171 = !DILocation(line: 290, column: 17, scope: !1157)
!1172 = !DILocation(line: 290, column: 21, scope: !1157)
!1173 = !DILocation(line: 292, column: 13, scope: !1157)
!1174 = !DILocation(line: 292, column: 19, scope: !1157)
!1175 = !DILocation(line: 292, column: 27, scope: !1157)
!1176 = !DILocation(line: 292, column: 11, scope: !1157)
!1177 = !DILocation(line: 293, column: 20, scope: !1157)
!1178 = !DILocation(line: 293, column: 29, scope: !1157)
!1179 = !DILocation(line: 293, column: 36, scope: !1157)
!1180 = !DILocation(line: 293, column: 28, scope: !1157)
!1181 = !DILocation(line: 293, column: 10, scope: !1157)
!1182 = !DILocation(line: 293, column: 8, scope: !1157)
!1183 = !DILocation(line: 294, column: 3, scope: !1157)
!1184 = !DILocation(line: 301, column: 18, scope: !1111)
!1185 = !DILocation(line: 301, column: 8, scope: !1111)
!1186 = !DILocation(line: 301, column: 6, scope: !1111)
!1187 = !DILocation(line: 302, column: 18, scope: !1111)
!1188 = !DILocation(line: 302, column: 8, scope: !1111)
!1189 = !DILocation(line: 302, column: 6, scope: !1111)
!1190 = !DILocation(line: 303, column: 9, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1111, file: !4, line: 303, column: 7)
!1192 = !DILocation(line: 303, column: 12, scope: !1191)
!1193 = !DILocation(line: 303, column: 27, scope: !1191)
!1194 = !DILocation(line: 303, column: 39, scope: !1191)
!1195 = !DILocation(line: 303, column: 30, scope: !1191)
!1196 = !DILocation(line: 303, column: 44, scope: !1191)
!1197 = !DILocation(line: 303, column: 49, scope: !1191)
!1198 = !DILocation(line: 303, column: 52, scope: !1191)
!1199 = !DILocation(line: 303, column: 67, scope: !1191)
!1200 = !DILocation(line: 304, column: 15, scope: !1191)
!1201 = !DILocation(line: 304, column: 6, scope: !1191)
!1202 = !DILocation(line: 303, column: 7, scope: !1111)
!1203 = !DILocation(line: 305, column: 8, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1205, file: !4, line: 305, column: 8)
!1205 = distinct !DILexicalBlock(scope: !1191, file: !4, line: 304, column: 21)
!1206 = !DILocation(line: 305, column: 13, scope: !1204)
!1207 = !DILocation(line: 305, column: 10, scope: !1204)
!1208 = !DILocation(line: 305, column: 8, scope: !1205)
!1209 = !DILocation(line: 306, column: 15, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1204, file: !4, line: 305, column: 24)
!1211 = !DILocation(line: 306, column: 23, scope: !1210)
!1212 = !DILocation(line: 306, column: 5, scope: !1210)
!1213 = !DILocation(line: 307, column: 4, scope: !1210)
!1214 = !DILocation(line: 309, column: 14, scope: !1205)
!1215 = !DILocation(line: 309, column: 4, scope: !1205)
!1216 = !DILocation(line: 310, column: 17, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1205, file: !4, line: 310, column: 8)
!1218 = !DILocation(line: 310, column: 8, scope: !1217)
!1219 = !DILocation(line: 310, column: 8, scope: !1205)
!1220 = !DILocation(line: 316, column: 12, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1217, file: !4, line: 310, column: 26)
!1222 = !DILocation(line: 317, column: 5, scope: !1221)
!1223 = distinct !{!1223, !1122, !1224}
!1224 = !DILocation(line: 364, column: 2, scope: !1103)
!1225 = !DILocation(line: 320, column: 15, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1217, file: !4, line: 318, column: 11)
!1227 = !DILocation(line: 320, column: 5, scope: !1226)
!1228 = !DILocation(line: 321, column: 5, scope: !1226)
!1229 = !DILocation(line: 331, column: 21, scope: !1111)
!1230 = !DILocation(line: 331, column: 27, scope: !1111)
!1231 = !DILocation(line: 331, column: 34, scope: !1111)
!1232 = !DILocation(line: 331, column: 26, scope: !1111)
!1233 = !DILocation(line: 331, column: 11, scope: !1111)
!1234 = !DILocation(line: 331, column: 9, scope: !1111)
!1235 = !DILocation(line: 332, column: 10, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1111, file: !4, line: 332, column: 7)
!1237 = !DILocation(line: 332, column: 16, scope: !1236)
!1238 = !DILocation(line: 332, column: 31, scope: !1236)
!1239 = !DILocation(line: 332, column: 41, scope: !1236)
!1240 = !DILocation(line: 332, column: 34, scope: !1236)
!1241 = !DILocation(line: 332, column: 7, scope: !1111)
!1242 = !DILocation(line: 333, column: 22, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1236, file: !4, line: 332, column: 50)
!1244 = !DILocation(line: 333, column: 27, scope: !1243)
!1245 = !DILocation(line: 333, column: 12, scope: !1243)
!1246 = !DILocation(line: 333, column: 10, scope: !1243)
!1247 = !DILocation(line: 335, column: 25, scope: !1243)
!1248 = !DILocation(line: 335, column: 4, scope: !1243)
!1249 = !DILocation(line: 335, column: 10, scope: !1243)
!1250 = !DILocation(line: 335, column: 18, scope: !1243)
!1251 = !DILocation(line: 335, column: 23, scope: !1243)
!1252 = !DILocation(line: 336, column: 23, scope: !1243)
!1253 = !DILocation(line: 336, column: 4, scope: !1243)
!1254 = !DILocation(line: 336, column: 17, scope: !1243)
!1255 = !DILocation(line: 336, column: 21, scope: !1243)
!1256 = !DILocation(line: 337, column: 11, scope: !1243)
!1257 = !DILocation(line: 337, column: 18, scope: !1243)
!1258 = !DILocation(line: 337, column: 4, scope: !1243)
!1259 = !DILocation(line: 338, column: 14, scope: !1243)
!1260 = !DILocation(line: 338, column: 4, scope: !1243)
!1261 = !DILocation(line: 339, column: 14, scope: !1243)
!1262 = !DILocation(line: 339, column: 4, scope: !1243)
!1263 = !DILocation(line: 344, column: 10, scope: !1243)
!1264 = !DILocation(line: 344, column: 16, scope: !1243)
!1265 = !DILocation(line: 344, column: 24, scope: !1243)
!1266 = !DILocation(line: 344, column: 8, scope: !1243)
!1267 = !DILocation(line: 345, column: 22, scope: !1243)
!1268 = !DILocation(line: 345, column: 28, scope: !1243)
!1269 = !DILocation(line: 345, column: 35, scope: !1243)
!1270 = !DILocation(line: 345, column: 27, scope: !1243)
!1271 = !DILocation(line: 345, column: 12, scope: !1243)
!1272 = !DILocation(line: 345, column: 10, scope: !1243)
!1273 = !DILocation(line: 346, column: 25, scope: !1243)
!1274 = !DILocation(line: 346, column: 4, scope: !1243)
!1275 = !DILocation(line: 346, column: 10, scope: !1243)
!1276 = !DILocation(line: 346, column: 18, scope: !1243)
!1277 = !DILocation(line: 346, column: 23, scope: !1243)
!1278 = !DILocation(line: 347, column: 11, scope: !1243)
!1279 = !DILocation(line: 348, column: 3, scope: !1243)
!1280 = !DILocation(line: 355, column: 13, scope: !1111)
!1281 = !DILocation(line: 355, column: 28, scope: !1111)
!1282 = !DILocation(line: 355, column: 18, scope: !1111)
!1283 = !DILocation(line: 355, column: 3, scope: !1111)
!1284 = !DILocation(line: 356, column: 13, scope: !1111)
!1285 = !DILocation(line: 356, column: 3, scope: !1111)
!1286 = !DILocation(line: 357, column: 13, scope: !1111)
!1287 = !DILocation(line: 357, column: 3, scope: !1111)
!1288 = !DILocation(line: 358, column: 24, scope: !1111)
!1289 = !DILocation(line: 358, column: 3, scope: !1111)
!1290 = !DILocation(line: 358, column: 9, scope: !1111)
!1291 = !DILocation(line: 358, column: 17, scope: !1111)
!1292 = !DILocation(line: 358, column: 22, scope: !1111)
!1293 = !DILocation(line: 359, column: 10, scope: !1111)
!1294 = !DILocation(line: 359, column: 17, scope: !1111)
!1295 = !DILocation(line: 359, column: 3, scope: !1111)
!1296 = !DILocation(line: 360, column: 7, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1111, file: !4, line: 360, column: 7)
!1298 = !DILocation(line: 360, column: 12, scope: !1297)
!1299 = !DILocation(line: 360, column: 9, scope: !1297)
!1300 = !DILocation(line: 360, column: 7, scope: !1111)
!1301 = !DILocation(line: 361, column: 14, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1297, file: !4, line: 360, column: 23)
!1303 = !DILocation(line: 361, column: 22, scope: !1302)
!1304 = !DILocation(line: 361, column: 4, scope: !1302)
!1305 = !DILocation(line: 362, column: 3, scope: !1302)
!1306 = !DILocation(line: 363, column: 3, scope: !1111)
!1307 = !DILocation(line: 365, column: 1, scope: !1103)
!1308 = distinct !DISubprogram(name: "is_red", scope: !4, file: !4, line: 58, type: !1094, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1309)
!1309 = !{!1310}
!1310 = !DILocalVariable(name: "n", arg: 1, scope: !1308, file: !4, line: 58, type: !97)
!1311 = !DILocation(line: 58, column: 36, scope: !1308)
!1312 = !DILocation(line: 60, column: 19, scope: !1308)
!1313 = !DILocation(line: 60, column: 9, scope: !1308)
!1314 = !DILocation(line: 60, column: 22, scope: !1308)
!1315 = !DILocation(line: 60, column: 2, scope: !1308)
!1316 = distinct !DISubprogram(name: "z_rb_walk", scope: !4, file: !4, line: 497, type: !1317, scopeLine: 498, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1323)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{null, !97, !1319, !92}
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_visit_t", file: !99, line: 110, baseType: !1320)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 32)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{null, !97, !92}
!1323 = !{!1324, !1325, !1326}
!1324 = !DILocalVariable(name: "node", arg: 1, scope: !1316, file: !4, line: 497, type: !97)
!1325 = !DILocalVariable(name: "visit_fn", arg: 2, scope: !1316, file: !4, line: 497, type: !1319)
!1326 = !DILocalVariable(name: "cookie", arg: 3, scope: !1316, file: !4, line: 497, type: !92)
!1327 = !DILocation(line: 497, column: 31, scope: !1316)
!1328 = !DILocation(line: 497, column: 48, scope: !1316)
!1329 = !DILocation(line: 497, column: 64, scope: !1316)
!1330 = !DILocation(line: 499, column: 6, scope: !1331)
!1331 = distinct !DILexicalBlock(scope: !1316, file: !4, line: 499, column: 6)
!1332 = !DILocation(line: 499, column: 11, scope: !1331)
!1333 = !DILocation(line: 499, column: 6, scope: !1316)
!1334 = !DILocation(line: 500, column: 23, scope: !1335)
!1335 = distinct !DILexicalBlock(scope: !1331, file: !4, line: 499, column: 26)
!1336 = !DILocation(line: 500, column: 13, scope: !1335)
!1337 = !DILocation(line: 500, column: 34, scope: !1335)
!1338 = !DILocation(line: 500, column: 44, scope: !1335)
!1339 = !DILocation(line: 500, column: 3, scope: !1335)
!1340 = !DILocation(line: 501, column: 3, scope: !1335)
!1341 = !DILocation(line: 501, column: 12, scope: !1335)
!1342 = !DILocation(line: 501, column: 18, scope: !1335)
!1343 = !DILocation(line: 502, column: 23, scope: !1335)
!1344 = !DILocation(line: 502, column: 13, scope: !1335)
!1345 = !DILocation(line: 502, column: 34, scope: !1335)
!1346 = !DILocation(line: 502, column: 44, scope: !1335)
!1347 = !DILocation(line: 502, column: 3, scope: !1335)
!1348 = !DILocation(line: 503, column: 2, scope: !1335)
!1349 = !DILocation(line: 504, column: 1, scope: !1316)
!1350 = distinct !DISubprogram(name: "z_rb_child", scope: !4, file: !4, line: 507, type: !472, scopeLine: 508, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1351)
!1351 = !{!1352, !1353}
!1352 = !DILocalVariable(name: "node", arg: 1, scope: !1350, file: !4, line: 507, type: !97)
!1353 = !DILocalVariable(name: "side", arg: 2, scope: !1350, file: !4, line: 507, type: !105)
!1354 = !DILocation(line: 507, column: 42, scope: !1350)
!1355 = !DILocation(line: 507, column: 56, scope: !1350)
!1356 = !DILocation(line: 509, column: 19, scope: !1350)
!1357 = !DILocation(line: 509, column: 25, scope: !1350)
!1358 = !DILocation(line: 509, column: 9, scope: !1350)
!1359 = !DILocation(line: 509, column: 2, scope: !1350)
!1360 = distinct !DISubprogram(name: "z_rb_is_black", scope: !4, file: !4, line: 512, type: !1361, scopeLine: 513, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1363)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!93, !97}
!1363 = !{!1364}
!1364 = !DILocalVariable(name: "node", arg: 1, scope: !1360, file: !4, line: 512, type: !97)
!1365 = !DILocation(line: 512, column: 34, scope: !1360)
!1366 = !DILocation(line: 514, column: 18, scope: !1360)
!1367 = !DILocation(line: 514, column: 9, scope: !1360)
!1368 = !DILocation(line: 514, column: 2, scope: !1360)
!1369 = distinct !DISubprogram(name: "rb_contains", scope: !4, file: !4, line: 517, type: !1370, scopeLine: 518, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1372)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{!434, !425, !97}
!1372 = !{!1373, !1374, !1375}
!1373 = !DILocalVariable(name: "tree", arg: 1, scope: !1369, file: !4, line: 517, type: !425)
!1374 = !DILocalVariable(name: "node", arg: 2, scope: !1369, file: !4, line: 517, type: !97)
!1375 = !DILocalVariable(name: "n", scope: !1369, file: !4, line: 519, type: !97)
!1376 = !DILocation(line: 517, column: 34, scope: !1369)
!1377 = !DILocation(line: 517, column: 55, scope: !1369)
!1378 = !DILocation(line: 519, column: 2, scope: !1369)
!1379 = !DILocation(line: 519, column: 17, scope: !1369)
!1380 = !DILocation(line: 519, column: 21, scope: !1369)
!1381 = !DILocation(line: 519, column: 27, scope: !1369)
!1382 = !DILocation(line: 521, column: 2, scope: !1369)
!1383 = !DILocation(line: 521, column: 10, scope: !1369)
!1384 = !DILocation(line: 521, column: 12, scope: !1369)
!1385 = !DILocation(line: 521, column: 27, scope: !1369)
!1386 = !DILocation(line: 521, column: 31, scope: !1369)
!1387 = !DILocation(line: 521, column: 36, scope: !1369)
!1388 = !DILocation(line: 521, column: 33, scope: !1369)
!1389 = !DILocation(line: 0, scope: !1369)
!1390 = !DILocation(line: 522, column: 17, scope: !1391)
!1391 = distinct !DILexicalBlock(scope: !1369, file: !4, line: 521, column: 43)
!1392 = !DILocation(line: 522, column: 20, scope: !1391)
!1393 = !DILocation(line: 522, column: 26, scope: !1391)
!1394 = !DILocation(line: 522, column: 38, scope: !1391)
!1395 = !DILocation(line: 522, column: 41, scope: !1391)
!1396 = !DILocation(line: 522, column: 7, scope: !1391)
!1397 = !DILocation(line: 522, column: 5, scope: !1391)
!1398 = distinct !{!1398, !1382, !1399}
!1399 = !DILocation(line: 523, column: 2, scope: !1369)
!1400 = !DILocation(line: 525, column: 9, scope: !1369)
!1401 = !DILocation(line: 525, column: 14, scope: !1369)
!1402 = !DILocation(line: 525, column: 11, scope: !1369)
!1403 = !DILocation(line: 526, column: 1, scope: !1369)
!1404 = !DILocation(line: 525, column: 2, scope: !1369)
!1405 = distinct !DISubprogram(name: "z_rb_foreach_next", scope: !4, file: !4, line: 557, type: !1406, scopeLine: 558, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1416)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!97, !425, !1408}
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 32)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rb_foreach", file: !99, line: 172, size: 96, elements: !1410)
!1410 = !{!1411, !1412, !1414}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !1409, file: !99, line: 173, baseType: !653, size: 32)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "is_left", scope: !1409, file: !99, line: 174, baseType: !1413, size: 32, offset: 32)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1409, file: !99, line: 175, baseType: !1415, size: 32, offset: 64)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !95, line: 58, baseType: !93)
!1416 = !{!1417, !1418, !1419}
!1417 = !DILocalVariable(name: "tree", arg: 1, scope: !1405, file: !4, line: 557, type: !425)
!1418 = !DILocalVariable(name: "f", arg: 2, scope: !1405, file: !4, line: 557, type: !1408)
!1419 = !DILocalVariable(name: "n", scope: !1405, file: !4, line: 559, type: !97)
!1420 = !DILocation(line: 557, column: 49, scope: !1405)
!1421 = !DILocation(line: 557, column: 75, scope: !1405)
!1422 = !DILocation(line: 559, column: 2, scope: !1405)
!1423 = !DILocation(line: 559, column: 17, scope: !1405)
!1424 = !DILocation(line: 561, column: 6, scope: !1425)
!1425 = distinct !DILexicalBlock(scope: !1405, file: !4, line: 561, column: 6)
!1426 = !DILocation(line: 561, column: 12, scope: !1425)
!1427 = !DILocation(line: 561, column: 17, scope: !1425)
!1428 = !DILocation(line: 561, column: 6, scope: !1405)
!1429 = !DILocation(line: 562, column: 3, scope: !1430)
!1430 = distinct !DILexicalBlock(scope: !1425, file: !4, line: 561, column: 32)
!1431 = !DILocation(line: 568, column: 6, scope: !1432)
!1432 = distinct !DILexicalBlock(scope: !1405, file: !4, line: 568, column: 6)
!1433 = !DILocation(line: 568, column: 9, scope: !1432)
!1434 = !DILocation(line: 568, column: 13, scope: !1432)
!1435 = !DILocation(line: 568, column: 6, scope: !1405)
!1436 = !DILocation(line: 569, column: 26, scope: !1437)
!1437 = distinct !DILexicalBlock(scope: !1432, file: !4, line: 568, column: 20)
!1438 = !DILocation(line: 569, column: 32, scope: !1437)
!1439 = !DILocation(line: 569, column: 38, scope: !1437)
!1440 = !DILocation(line: 569, column: 10, scope: !1437)
!1441 = !DILocation(line: 569, column: 3, scope: !1437)
!1442 = !DILocation(line: 575, column: 16, scope: !1405)
!1443 = !DILocation(line: 575, column: 19, scope: !1405)
!1444 = !DILocation(line: 575, column: 25, scope: !1405)
!1445 = !DILocation(line: 575, column: 28, scope: !1405)
!1446 = !DILocation(line: 575, column: 6, scope: !1405)
!1447 = !DILocation(line: 575, column: 4, scope: !1405)
!1448 = !DILocation(line: 576, column: 6, scope: !1449)
!1449 = distinct !DILexicalBlock(scope: !1405, file: !4, line: 576, column: 6)
!1450 = !DILocation(line: 576, column: 8, scope: !1449)
!1451 = !DILocation(line: 576, column: 6, scope: !1405)
!1452 = !DILocation(line: 577, column: 26, scope: !1453)
!1453 = distinct !DILexicalBlock(scope: !1449, file: !4, line: 576, column: 23)
!1454 = !DILocation(line: 577, column: 29, scope: !1453)
!1455 = !DILocation(line: 577, column: 10, scope: !1453)
!1456 = !DILocation(line: 577, column: 3, scope: !1453)
!1457 = !DILocation(line: 585, column: 6, scope: !1458)
!1458 = distinct !DILexicalBlock(scope: !1405, file: !4, line: 585, column: 6)
!1459 = !DILocation(line: 585, column: 9, scope: !1458)
!1460 = !DILocation(line: 585, column: 17, scope: !1458)
!1461 = !DILocation(line: 585, column: 20, scope: !1458)
!1462 = !DILocation(line: 585, column: 25, scope: !1458)
!1463 = !DILocation(line: 585, column: 6, scope: !1405)
!1464 = !DILocation(line: 586, column: 10, scope: !1465)
!1465 = distinct !DILexicalBlock(scope: !1458, file: !4, line: 585, column: 32)
!1466 = !DILocation(line: 586, column: 13, scope: !1465)
!1467 = !DILocation(line: 586, column: 21, scope: !1465)
!1468 = !DILocation(line: 586, column: 24, scope: !1465)
!1469 = !DILocation(line: 586, column: 19, scope: !1465)
!1470 = !DILocation(line: 586, column: 3, scope: !1465)
!1471 = !DILocation(line: 593, column: 2, scope: !1405)
!1472 = !DILocation(line: 593, column: 10, scope: !1405)
!1473 = !DILocation(line: 593, column: 13, scope: !1405)
!1474 = !DILocation(line: 593, column: 17, scope: !1405)
!1475 = !DILocation(line: 593, column: 22, scope: !1405)
!1476 = !DILocation(line: 593, column: 26, scope: !1405)
!1477 = !DILocation(line: 593, column: 29, scope: !1405)
