; ModuleID = '../bc_files/reset_stm32.bc'
source_filename = "/home/sri/zephyrproject/zephyr/drivers/reset/reset_stm32.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.reset_stm32_config = type { i32 }
%struct.reset_driver_api = type { ptr, ptr, ptr, ptr }
%struct.device_state = type { i8, i8 }
%struct.device = type { ptr, ptr, ptr, ptr, ptr }
%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }

@.str = private unnamed_addr constant [17 x i8] c"reset-controller\00", align 1, !dbg !0
@reset_stm32_config = internal constant %struct.reset_stm32_config { i32 1073876992 }, align 4, !dbg !7
@reset_stm32_driver_api = internal constant %struct.reset_driver_api { ptr @reset_stm32_status, ptr @reset_stm32_line_assert, ptr @reset_stm32_line_deassert, ptr @reset_stm32_line_toggle }, align 4, !dbg !84
@__devstate_dts_ord_31 = internal global %struct.device_state zeroinitializer, section ".z_devstate", align 1, !dbg !82
@__device_dts_ord_31 = hidden constant %struct.device { ptr @.str, ptr @reset_stm32_config, ptr @reset_stm32_driver_api, ptr @__devstate_dts_ord_31, ptr null }, section "._device.static.1_35_", align 4, !dbg !62
@__init___device_dts_ord_31 = internal constant %struct.init_entry { %union.init_function zeroinitializer, ptr @__device_dts_ord_31 }, section ".z_init_PRE_KERNEL_135_00031_", align 4, !dbg !64

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 77, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "drivers/reset/reset_stm32.c", directory: "/home/sri/zephyrproject/zephyr")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!5 = !{!6}
!6 = !DISubrange(count: 17)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "reset_stm32_config", scope: !9, file: !2, line: 73, type: !86, isLocal: true, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !11, globals: !61, splitDebugInlining: false, nameTableKind: None)
!10 = !DIFile(filename: "reset_stm32.c", directory: "/home/sri/zephyrproject/zephyr/build")
!11 = !{!12, !46, !59}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reset_driver_api", file: !15, line: 140, size: 128, elements: !16)
!15 = !DIFile(filename: "include/zephyr/drivers/reset.h", directory: "/home/sri/zephyrproject/zephyr")
!16 = !{!17, !50, !55, !57}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !14, file: !15, line: 141, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "reset_api_status", file: !15, line: 114, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 32)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !47, !49}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !26, line: 381, size: 160, elements: !27)
!26 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!27 = !{!28, !31, !34, !35, !45}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !25, file: !26, line: 383, baseType: !29, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !25, file: !26, line: 385, baseType: !32, size: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !25, file: !26, line: 387, baseType: !32, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !25, file: !26, line: 389, baseType: !36, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !26, line: 354, size: 16, elements: !38)
!38 = !{!39, !43}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !37, file: !26, line: 362, baseType: !40, size: 8)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !41, line: 62, baseType: !42)
!41 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !37, file: !26, line: 367, baseType: !44, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!44 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !25, file: !26, line: 391, baseType: !46, size: 32, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !41, line: 64, baseType: !48)
!48 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "line_assert", scope: !14, file: !15, line: 142, baseType: !51, size: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "reset_api_line_assert", file: !15, line: 121, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!53 = !DISubroutineType(types: !54)
!54 = !{!22, !23, !47}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "line_deassert", scope: !14, file: !15, line: 143, baseType: !56, size: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "reset_api_line_deassert", file: !15, line: 128, baseType: !52)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "line_toggle", scope: !14, file: !15, line: 144, baseType: !58, size: 32, offset: 96)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "reset_api_line_toggle", file: !15, line: 135, baseType: !52)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !47)
!61 = !{!0, !62, !64, !82, !7, !84}
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "__device_dts_ord_31", scope: !9, file: !2, line: 77, type: !24, isLocal: false, isDefinition: true, align: 32)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_31", scope: !9, file: !2, line: 77, type: !66, isLocal: true, isDefinition: true, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !68, line: 92, size: 64, elements: !69)
!68 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!69 = !{!70, !81}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !67, file: !68, line: 94, baseType: !71, size: 32)
!71 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !68, line: 59, size: 32, elements: !72)
!72 = !{!73, !77}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !71, file: !68, line: 66, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DISubroutineType(types: !76)
!76 = !{!22}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !71, file: !68, line: 75, baseType: !78, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DISubroutineType(types: !80)
!80 = !{!22, !23}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !67, file: !68, line: 99, baseType: !23, size: 32, offset: 32)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_31", scope: !9, file: !2, line: 77, type: !37, isLocal: true, isDefinition: true, align: 8)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "reset_stm32_driver_api", scope: !9, file: !2, line: 66, type: !13, isLocal: true, isDefinition: true)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reset_stm32_config", file: !2, line: 18, size: 32, elements: !88)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !87, file: !2, line: 19, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !41, line: 102, baseType: !48)
!91 = !{i32 7, !"Dwarf Version", i32 4}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{i32 1, !"wchar_size", i32 4}
!94 = !{i32 1, !"static_rwdata", i32 1}
!95 = !{i32 1, !"enumsize_buildattr", i32 1}
!96 = !{i32 1, !"armlib_unavailable", i32 0}
!97 = !{i32 8, !"PIC Level", i32 2}
!98 = !{i32 7, !"PIE Level", i32 2}
!99 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!100 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !26, file: !26, line: 744, type: !101, scopeLine: 745, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !103)
!101 = !DISubroutineType(types: !102)
!102 = !{!44, !23}
!103 = !{}
!104 = !DILocalVariable(name: "dev", arg: 1, scope: !100, file: !26, line: 744, type: !23)
!105 = !DILocation(line: 744, column: 65, scope: !100)
!106 = !DILocation(line: 746, column: 27, scope: !100)
!107 = !DILocation(line: 746, column: 9, scope: !100)
!108 = !DILocation(line: 746, column: 2, scope: !100)
!109 = distinct !DISubprogram(name: "z_impl_reset_status", scope: !15, file: !15, line: 164, type: !20, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !103)
!110 = !DILocalVariable(name: "dev", arg: 1, scope: !109, file: !15, line: 164, type: !23)
!111 = !DILocation(line: 164, column: 60, scope: !109)
!112 = !DILocalVariable(name: "id", arg: 2, scope: !109, file: !15, line: 164, type: !47)
!113 = !DILocation(line: 164, column: 74, scope: !109)
!114 = !DILocalVariable(name: "status", arg: 3, scope: !109, file: !15, line: 164, type: !49)
!115 = !DILocation(line: 164, column: 87, scope: !109)
!116 = !DILocalVariable(name: "api", scope: !109, file: !15, line: 166, type: !12)
!117 = !DILocation(line: 166, column: 33, scope: !109)
!118 = !DILocation(line: 166, column: 72, scope: !109)
!119 = !DILocation(line: 166, column: 77, scope: !109)
!120 = !DILocation(line: 168, column: 6, scope: !121)
!121 = distinct !DILexicalBlock(scope: !109, file: !15, line: 168, column: 6)
!122 = !DILocation(line: 168, column: 11, scope: !121)
!123 = !DILocation(line: 168, column: 18, scope: !121)
!124 = !DILocation(line: 168, column: 6, scope: !109)
!125 = !DILocation(line: 169, column: 3, scope: !126)
!126 = distinct !DILexicalBlock(scope: !121, file: !15, line: 168, column: 33)
!127 = !DILocation(line: 172, column: 9, scope: !109)
!128 = !DILocation(line: 172, column: 14, scope: !109)
!129 = !DILocation(line: 172, column: 21, scope: !109)
!130 = !DILocation(line: 172, column: 26, scope: !109)
!131 = !DILocation(line: 172, column: 30, scope: !109)
!132 = !DILocation(line: 172, column: 2, scope: !109)
!133 = !DILocation(line: 173, column: 1, scope: !109)
!134 = distinct !DISubprogram(name: "z_impl_reset_line_assert", scope: !15, file: !15, line: 207, type: !53, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !103)
