; ModuleID = '../bc_files/stack.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/stack.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.z_kernel = type { [1 x %struct._cpu], %struct._ready_q }
%struct._cpu = type { i32, ptr, ptr, ptr, i8, %struct._cpu_arch }
%struct._cpu_arch = type {}
%struct._ready_q = type { ptr, %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }

!55 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!85 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!86 = !{!87, !89, !91, !92, !93, !90, !97, !113}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !88, line: 62, baseType: !5)
!88 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !88, line: 58, baseType: !90)
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!92 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_data_t", file: !94, line: 2738, baseType: !95)
!94 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !88, line: 102, baseType: !96)
!96 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !99, line: 55, baseType: !100)
!99 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !99, line: 37, size: 64, elements: !101)
!101 = !{!102, !108}
!102 = !DIDerivedType(tag: DW_TAG_member, scope: !100, file: !99, line: 38, baseType: !103, size: 32)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !99, line: 38, size: 32, elements: !104)
!104 = !{!105, !107}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !103, file: !99, line: 39, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !103, file: !99, line: 40, baseType: !106, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, scope: !100, file: !99, line: 42, baseType: !109, size: 32, offset: 32)
!109 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !99, line: 42, size: 32, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !109, file: !99, line: 43, baseType: !106, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !109, file: !99, line: 44, baseType: !106, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !115, line: 250, size: 896, elements: !116)
!115 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!116 = !{!117, !172, !185, !186, !187, !188, !208}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !114, file: !115, line: 252, baseType: !118, size: 384)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !115, line: 58, size: 384, elements: !119)
!119 = !{!120, !133, !141, !142, !143, !156, !158, !159}
!120 = !DIDerivedType(tag: DW_TAG_member, scope: !118, file: !115, line: 61, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !118, file: !115, line: 61, size: 64, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !121, file: !115, line: 62, baseType: !98, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !121, file: !115, line: 63, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !126, line: 58, size: 64, elements: !127)
!126 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !125, file: !126, line: 60, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 64, elements: !131)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!131 = !{!132}
!132 = !DISubrange(count: 2)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !118, file: !115, line: 69, baseType: !134, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !136, line: 243, baseType: !137)
!136 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 241, size: 64, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !137, file: !136, line: 242, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !99, line: 51, baseType: !100)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !118, file: !115, line: 72, baseType: !87, size: 8, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !118, file: !115, line: 75, baseType: !87, size: 8, offset: 104)
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !118, file: !115, line: 91, baseType: !144, size: 16, offset: 112)
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !118, file: !115, line: 91, size: 16, elements: !145)
!145 = !{!146, !153}
!146 = !DIDerivedType(tag: DW_TAG_member, scope: !144, file: !115, line: 92, baseType: !147, size: 16)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !144, file: !115, line: 92, size: 16, elements: !148)
!148 = !{!149, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !147, file: !115, line: 97, baseType: !150, size: 8)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !88, line: 56, baseType: !151)
!151 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !147, file: !115, line: 98, baseType: !87, size: 8, offset: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !144, file: !115, line: 101, baseType: !154, size: 16)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !88, line: 63, baseType: !155)
!155 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !118, file: !115, line: 108, baseType: !157, size: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !88, line: 64, baseType: !96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !118, file: !115, line: 132, baseType: !91, size: 32, offset: 160)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !118, file: !115, line: 136, baseType: !160, size: 192, offset: 192)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !136, line: 254, size: 192, elements: !161)
!161 = !{!162, !163, !169}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !160, file: !136, line: 255, baseType: !98, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !160, file: !136, line: 256, baseType: !164, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !136, line: 252, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !160, file: !136, line: 259, baseType: !170, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !88, line: 59, baseType: !171)
!171 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !114, file: !115, line: 255, baseType: !173, size: 288, offset: 384)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !174, line: 25, size: 288, elements: !175)
!174 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !173, file: !174, line: 26, baseType: !157, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !173, file: !174, line: 27, baseType: !157, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !173, file: !174, line: 28, baseType: !157, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !173, file: !174, line: 29, baseType: !157, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !173, file: !174, line: 30, baseType: !157, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !173, file: !174, line: 31, baseType: !157, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !173, file: !174, line: 32, baseType: !157, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !173, file: !174, line: 33, baseType: !157, size: 32, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !173, file: !174, line: 34, baseType: !157, size: 32, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !114, file: !115, line: 258, baseType: !91, size: 32, offset: 672)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !114, file: !115, line: 261, baseType: !135, size: 64, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !114, file: !115, line: 302, baseType: !90, size: 32, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !114, file: !115, line: 333, baseType: !189, size: 32, offset: 800)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !94, line: 5291, size: 160, elements: !191)
!191 = !{!192, !203, !204}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !190, file: !94, line: 5292, baseType: !193, size: 96)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !194, line: 56, size: 96, elements: !195)
!194 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!195 = !{!196, !199, !200}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !193, file: !194, line: 57, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !194, line: 57, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !193, file: !194, line: 58, baseType: !91, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !193, file: !194, line: 59, baseType: !201, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !202, line: 46, baseType: !96)
!202 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!203 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !190, file: !94, line: 5293, baseType: !135, size: 64, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !190, file: !94, line: 5294, baseType: !205, offset: 160)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !206, line: 45, elements: !207)
!206 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!207 = !{}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !114, file: !115, line: 355, baseType: !209, size: 64, offset: 832)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !174, line: 60, size: 64, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !209, file: !174, line: 63, baseType: !157, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !209, file: !174, line: 66, baseType: !157, size: 32, offset: 32)
!213 = !{i32 7, !"Dwarf Version", i32 4}
!214 = !{i32 2, !"Debug Info Version", i32 3}
!215 = !{i32 1, !"wchar_size", i32 4}
!216 = !{i32 1, !"static_rwdata", i32 1}
!217 = !{i32 1, !"enumsize_buildattr", i32 1}
!218 = !{i32 1, !"armlib_unavailable", i32 0}
!219 = !{i32 8, !"PIC Level", i32 2}
!220 = !{i32 7, !"PIE Level", i32 2}
!221 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!222 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !4, file: !4, line: 223, type: !223, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !225, !113}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!227 = !DILocalVariable(name: "object", arg: 1, scope: !222, file: !4, line: 223, type: !225)
!228 = !DILocation(line: 223, column: 61, scope: !222)
!229 = !DILocalVariable(name: "thread", arg: 2, scope: !222, file: !4, line: 224, type: !113)
!230 = !DILocation(line: 224, column: 24, scope: !222)
!231 = !DILocation(line: 226, column: 9, scope: !222)
!232 = !DILocation(line: 227, column: 9, scope: !222)
!233 = !DILocation(line: 228, column: 1, scope: !222)
!234 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !4, file: !4, line: 243, type: !235, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !225}
!237 = !DILocalVariable(name: "object", arg: 1, scope: !234, file: !4, line: 243, type: !225)
!238 = !DILocation(line: 243, column: 56, scope: !234)
!239 = !DILocation(line: 245, column: 9, scope: !234)
!240 = !DILocation(line: 246, column: 1, scope: !234)
!241 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !4, file: !4, line: 359, type: !242, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!242 = !DISubroutineType(types: !243)
!243 = !{!91, !3}
!244 = !DILocalVariable(name: "otype", arg: 1, scope: !241, file: !4, line: 359, type: !3)
!245 = !DILocation(line: 359, column: 58, scope: !241)
!246 = !DILocation(line: 361, column: 9, scope: !241)
!247 = !DILocation(line: 363, column: 2, scope: !241)
!248 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !4, file: !4, line: 366, type: !249, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!249 = !DISubroutineType(types: !250)
!250 = !{!91, !3, !201}
!251 = !DILocalVariable(name: "otype", arg: 1, scope: !248, file: !4, line: 366, type: !3)
!252 = !DILocation(line: 366, column: 63, scope: !248)
!253 = !DILocalVariable(name: "size", arg: 2, scope: !248, file: !4, line: 367, type: !201)
!254 = !DILocation(line: 367, column: 13, scope: !248)
!255 = !DILocation(line: 369, column: 9, scope: !248)
!256 = !DILocation(line: 370, column: 9, scope: !248)
!257 = !DILocation(line: 372, column: 2, scope: !248)
!258 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !94, file: !94, line: 656, type: !259, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!259 = !DISubroutineType(types: !260)
!260 = !{!261, !263}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !262, line: 46, baseType: !170)
!262 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!265 = !DILocalVariable(name: "t", arg: 1, scope: !258, file: !94, line: 657, type: !263)
!266 = !DILocation(line: 657, column: 30, scope: !258)
!267 = !DILocation(line: 659, column: 28, scope: !258)
!268 = !DILocation(line: 659, column: 31, scope: !258)
!269 = !DILocation(line: 659, column: 36, scope: !258)
!270 = !DILocation(line: 659, column: 9, scope: !258)
!271 = !DILocation(line: 659, column: 2, scope: !258)
!272 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !94, file: !94, line: 671, type: !259, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!273 = !DILocalVariable(name: "t", arg: 1, scope: !272, file: !94, line: 672, type: !263)
!274 = !DILocation(line: 672, column: 30, scope: !272)
!275 = !DILocation(line: 674, column: 30, scope: !272)
!276 = !DILocation(line: 674, column: 33, scope: !272)
!277 = !DILocation(line: 674, column: 38, scope: !272)
!278 = !DILocation(line: 674, column: 9, scope: !272)
!279 = !DILocation(line: 674, column: 2, scope: !272)
!280 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !94, file: !94, line: 1634, type: !281, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!281 = !DISubroutineType(types: !282)
!282 = !{!261, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !94, line: 1439, size: 448, elements: !286)
!286 = !{!287, !288, !289, !294, !295, !300, !301}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !285, file: !94, line: 1445, baseType: !160, size: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !285, file: !94, line: 1448, baseType: !135, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !285, file: !94, line: 1451, baseType: !290, size: 32, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !285, file: !94, line: 1454, baseType: !290, size: 32, offset: 288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !285, file: !94, line: 1457, baseType: !296, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !262, line: 67, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 65, size: 64, elements: !298)
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !297, file: !262, line: 66, baseType: !261, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !285, file: !94, line: 1460, baseType: !157, size: 32, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !285, file: !94, line: 1463, baseType: !91, size: 32, offset: 416)
!302 = !DILocalVariable(name: "timer", arg: 1, scope: !280, file: !94, line: 1635, type: !283)
!303 = !DILocation(line: 1635, column: 34, scope: !280)
!304 = !DILocation(line: 1637, column: 28, scope: !280)
!305 = !DILocation(line: 1637, column: 35, scope: !280)
!306 = !DILocation(line: 1637, column: 9, scope: !280)
!307 = !DILocation(line: 1637, column: 2, scope: !280)
!308 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !94, file: !94, line: 1649, type: !281, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!309 = !DILocalVariable(name: "timer", arg: 1, scope: !308, file: !94, line: 1650, type: !283)
!310 = !DILocation(line: 1650, column: 34, scope: !308)
!311 = !DILocation(line: 1652, column: 30, scope: !308)
!312 = !DILocation(line: 1652, column: 37, scope: !308)
!313 = !DILocation(line: 1652, column: 9, scope: !308)
!314 = !DILocation(line: 1652, column: 2, scope: !308)
!315 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !94, file: !94, line: 1689, type: !316, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !293, !91}
!318 = !DILocalVariable(name: "timer", arg: 1, scope: !315, file: !94, line: 1689, type: !293)
!319 = !DILocation(line: 1689, column: 65, scope: !315)
!320 = !DILocalVariable(name: "user_data", arg: 2, scope: !315, file: !94, line: 1690, type: !91)
!321 = !DILocation(line: 1690, column: 19, scope: !315)
!322 = !DILocation(line: 1692, column: 21, scope: !315)
!323 = !DILocation(line: 1692, column: 2, scope: !315)
!324 = !DILocation(line: 1692, column: 9, scope: !315)
!325 = !DILocation(line: 1692, column: 19, scope: !315)
!326 = !DILocation(line: 1693, column: 1, scope: !315)
!327 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !94, file: !94, line: 1704, type: !328, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!328 = !DISubroutineType(types: !329)
!329 = !{!91, !283}
!330 = !DILocalVariable(name: "timer", arg: 1, scope: !327, file: !94, line: 1704, type: !283)
!331 = !DILocation(line: 1704, column: 72, scope: !327)
!332 = !DILocation(line: 1706, column: 9, scope: !327)
!333 = !DILocation(line: 1706, column: 16, scope: !327)
!334 = !DILocation(line: 1706, column: 2, scope: !327)
!335 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !94, file: !94, line: 2071, type: !336, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!336 = !DISubroutineType(types: !337)
!337 = !{!90, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !94, line: 1830, size: 128, elements: !340)
!340 = !{!341, !354, !355}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !339, file: !94, line: 1831, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !343, line: 60, baseType: !344)
!343 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !343, line: 53, size: 64, elements: !345)
!345 = !{!346, !353}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !344, file: !343, line: 54, baseType: !347, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !343, line: 50, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !343, line: 44, size: 32, elements: !350)
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !349, file: !343, line: 45, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !343, line: 40, baseType: !157)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !344, file: !343, line: 55, baseType: !347, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !339, file: !94, line: 1832, baseType: !205, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !339, file: !94, line: 1833, baseType: !135, size: 64, offset: 64)
!356 = !DILocalVariable(name: "queue", arg: 1, scope: !335, file: !94, line: 2071, type: !338)
!357 = !DILocation(line: 2071, column: 59, scope: !335)
!358 = !DILocation(line: 2073, column: 35, scope: !335)
!359 = !DILocation(line: 2073, column: 42, scope: !335)
!360 = !DILocation(line: 2073, column: 14, scope: !335)
!361 = !DILocation(line: 2073, column: 9, scope: !335)
!362 = !DILocation(line: 2073, column: 2, scope: !335)
!363 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !94, file: !94, line: 3209, type: !364, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!364 = !DISubroutineType(types: !365)
!365 = !{!96, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !94, line: 3092, size: 128, elements: !368)
!368 = !{!369, !370, !371}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !367, file: !94, line: 3093, baseType: !135, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !367, file: !94, line: 3094, baseType: !96, size: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !367, file: !94, line: 3095, baseType: !96, size: 32, offset: 96)
!372 = !DILocalVariable(name: "sem", arg: 1, scope: !363, file: !94, line: 3209, type: !366)
!373 = !DILocation(line: 3209, column: 65, scope: !363)
!374 = !DILocation(line: 3211, column: 9, scope: !363)
!375 = !DILocation(line: 3211, column: 14, scope: !363)
!376 = !DILocation(line: 3211, column: 2, scope: !363)
!377 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !94, file: !94, line: 4649, type: !378, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!378 = !DISubroutineType(types: !379)
!379 = !{!157, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !94, line: 4390, size: 320, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !390, !391, !392, !393, !394}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !381, file: !94, line: 4392, baseType: !135, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !381, file: !94, line: 4394, baseType: !205, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !381, file: !94, line: 4396, baseType: !201, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !381, file: !94, line: 4398, baseType: !157, size: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !381, file: !94, line: 4400, baseType: !388, size: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !381, file: !94, line: 4402, baseType: !388, size: 32, offset: 160)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !381, file: !94, line: 4404, baseType: !388, size: 32, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !381, file: !94, line: 4406, baseType: !388, size: 32, offset: 224)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !381, file: !94, line: 4408, baseType: !157, size: 32, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !381, file: !94, line: 4413, baseType: !87, size: 8, offset: 288)
!395 = !DILocalVariable(name: "msgq", arg: 1, scope: !377, file: !94, line: 4649, type: !380)
!396 = !DILocation(line: 4649, column: 66, scope: !377)
!397 = !DILocation(line: 4651, column: 9, scope: !377)
!398 = !DILocation(line: 4651, column: 15, scope: !377)
!399 = !DILocation(line: 4651, column: 26, scope: !377)
!400 = !DILocation(line: 4651, column: 32, scope: !377)
!401 = !DILocation(line: 4651, column: 24, scope: !377)
!402 = !DILocation(line: 4651, column: 2, scope: !377)
!403 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !94, file: !94, line: 4665, type: !378, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!404 = !DILocalVariable(name: "msgq", arg: 1, scope: !403, file: !94, line: 4665, type: !380)
!405 = !DILocation(line: 4665, column: 66, scope: !403)
!406 = !DILocation(line: 4667, column: 9, scope: !403)
!407 = !DILocation(line: 4667, column: 15, scope: !403)
!408 = !DILocation(line: 4667, column: 2, scope: !403)
!409 = distinct !DISubprogram(name: "k_stack_init", scope: !410, file: !410, line: 26, type: !411, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !207)
!410 = !DIFile(filename: "kernel/stack.c", directory: "/home/sri/zephyrproject/zephyr")
!411 = !DISubroutineType(types: !412)
!412 = !{null, !413, !419, !157}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_stack", file: !94, line: 2740, size: 192, elements: !415)
!415 = !{!416, !417, !418, !420, !421, !422}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !414, file: !94, line: 2741, baseType: !135, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !414, file: !94, line: 2742, baseType: !205, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !414, file: !94, line: 2743, baseType: !419, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !414, file: !94, line: 2743, baseType: !419, size: 32, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !414, file: !94, line: 2743, baseType: !419, size: 32, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !414, file: !94, line: 2745, baseType: !87, size: 8, offset: 160)
!423 = !DILocalVariable(name: "stack", arg: 1, scope: !409, file: !410, line: 26, type: !413)
!424 = !DILocation(line: 26, column: 35, scope: !409)
!425 = !DILocalVariable(name: "buffer", arg: 2, scope: !409, file: !410, line: 26, type: !419)
!426 = !DILocation(line: 26, column: 56, scope: !409)
!427 = !DILocalVariable(name: "num_entries", arg: 3, scope: !409, file: !410, line: 27, type: !157)
!428 = !DILocation(line: 27, column: 14, scope: !409)
!429 = !DILocation(line: 29, column: 16, scope: !409)
!430 = !DILocation(line: 29, column: 23, scope: !409)
!431 = !DILocation(line: 29, column: 2, scope: !409)
!432 = !DILocation(line: 30, column: 2, scope: !409)
!433 = !DILocation(line: 30, column: 9, scope: !409)
!434 = !DILocation(line: 30, column: 16, scope: !409)
!435 = !DILocation(line: 31, column: 30, scope: !409)
!436 = !DILocation(line: 31, column: 16, scope: !409)
!437 = !DILocation(line: 31, column: 23, scope: !409)
!438 = !DILocation(line: 31, column: 28, scope: !409)
!439 = !DILocation(line: 31, column: 2, scope: !409)
!440 = !DILocation(line: 31, column: 9, scope: !409)
!441 = !DILocation(line: 31, column: 14, scope: !409)
!442 = !DILocation(line: 32, column: 15, scope: !409)
!443 = !DILocation(line: 32, column: 22, scope: !409)
!444 = !DILocation(line: 32, column: 29, scope: !409)
!445 = !DILocation(line: 32, column: 27, scope: !409)
!446 = !DILocation(line: 32, column: 2, scope: !409)
!447 = !DILocation(line: 32, column: 9, scope: !409)
!448 = !DILocation(line: 32, column: 13, scope: !409)
!449 = !DILocation(line: 34, column: 2, scope: !409)
!450 = !DILocation(line: 34, column: 7, scope: !451)
!451 = distinct !DILexicalBlock(scope: !409, file: !410, line: 34, column: 5)
!452 = !DILocation(line: 35, column: 16, scope: !409)
!453 = !DILocation(line: 35, column: 2, scope: !409)
!454 = !DILocation(line: 40, column: 1, scope: !409)
!455 = distinct !DISubprogram(name: "z_waitq_init", scope: !456, file: !456, line: 47, type: !457, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!456 = !DIFile(filename: "kernel/include/wait_q.h", directory: "/home/sri/zephyrproject/zephyr")
!457 = !DISubroutineType(types: !458)
!458 = !{null, !134}
!459 = !DILocalVariable(name: "w", arg: 1, scope: !455, file: !456, line: 47, type: !134)
!460 = !DILocation(line: 47, column: 44, scope: !455)
!461 = !DILocation(line: 49, column: 18, scope: !455)
!462 = !DILocation(line: 49, column: 21, scope: !455)
!463 = !DILocation(line: 49, column: 2, scope: !455)
!464 = !DILocation(line: 50, column: 1, scope: !455)
!465 = distinct !DISubprogram(name: "z_object_init", scope: !4, file: !4, line: 215, type: !235, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!466 = !DILocalVariable(name: "obj", arg: 1, scope: !465, file: !4, line: 215, type: !225)
!467 = !DILocation(line: 215, column: 46, scope: !465)
!468 = !DILocation(line: 217, column: 9, scope: !465)
!469 = !DILocation(line: 218, column: 1, scope: !465)
!470 = distinct !DISubprogram(name: "z_impl_k_stack_alloc_init", scope: !410, file: !410, line: 42, type: !471, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !207)
!471 = !DISubroutineType(types: !472)
!472 = !{!89, !413, !157}
!473 = !DILocalVariable(name: "stack", arg: 1, scope: !470, file: !410, line: 42, type: !413)
!474 = !DILocation(line: 42, column: 51, scope: !470)
!475 = !DILocalVariable(name: "num_entries", arg: 2, scope: !470, file: !410, line: 42, type: !157)
!476 = !DILocation(line: 42, column: 67, scope: !470)
!477 = !DILocalVariable(name: "buffer", scope: !470, file: !410, line: 44, type: !91)
!478 = !DILocation(line: 44, column: 8, scope: !470)
!479 = !DILocalVariable(name: "ret", scope: !470, file: !410, line: 45, type: !89)
