; ModuleID = '../bc_files/stack.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/stack.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.z_kernel = type { [1 x %struct._cpu], %struct._ready_q }
%struct._cpu = type { i32, ptr, ptr, ptr, i8, %struct._cpu_arch }
%struct._cpu_arch = type {}
%struct._ready_q = type { ptr, %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }

!55 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!85 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!86 = !{!87, !89, !91, !92, !93, !90, !97, !113}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !88, line: 62, baseType: !5)
!88 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !88, line: 58, baseType: !90)
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!92 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack_data_t", file: !94, line: 2738, baseType: !95)
!94 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !88, line: 102, baseType: !96)
!96 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !99, line: 55, baseType: !100)
!99 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !99, line: 37, size: 64, elements: !101)
!101 = !{!102, !108}
!102 = !DIDerivedType(tag: DW_TAG_member, scope: !100, file: !99, line: 38, baseType: !103, size: 32)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !99, line: 38, size: 32, elements: !104)
!104 = !{!105, !107}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !103, file: !99, line: 39, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !103, file: !99, line: 40, baseType: !106, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, scope: !100, file: !99, line: 42, baseType: !109, size: 32, offset: 32)
!109 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !99, line: 42, size: 32, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !109, file: !99, line: 43, baseType: !106, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !109, file: !99, line: 44, baseType: !106, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !115, line: 250, size: 896, elements: !116)
!115 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!116 = !{!117, !172, !185, !186, !187, !188, !208}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !114, file: !115, line: 252, baseType: !118, size: 384)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !115, line: 58, size: 384, elements: !119)
!119 = !{!120, !133, !141, !142, !143, !156, !158, !159}
!120 = !DIDerivedType(tag: DW_TAG_member, scope: !118, file: !115, line: 61, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !118, file: !115, line: 61, size: 64, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !121, file: !115, line: 62, baseType: !98, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !121, file: !115, line: 63, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !126, line: 58, size: 64, elements: !127)
!126 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !125, file: !126, line: 60, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 64, elements: !131)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!131 = !{!132}
!132 = !DISubrange(count: 2)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !118, file: !115, line: 69, baseType: !134, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !136, line: 243, baseType: !137)
!136 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 241, size: 64, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !137, file: !136, line: 242, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !99, line: 51, baseType: !100)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !118, file: !115, line: 72, baseType: !87, size: 8, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !118, file: !115, line: 75, baseType: !87, size: 8, offset: 104)
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !118, file: !115, line: 91, baseType: !144, size: 16, offset: 112)
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !118, file: !115, line: 91, size: 16, elements: !145)
!145 = !{!146, !153}
!146 = !DIDerivedType(tag: DW_TAG_member, scope: !144, file: !115, line: 92, baseType: !147, size: 16)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !144, file: !115, line: 92, size: 16, elements: !148)
!148 = !{!149, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !147, file: !115, line: 97, baseType: !150, size: 8)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !88, line: 56, baseType: !151)
!151 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !147, file: !115, line: 98, baseType: !87, size: 8, offset: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !144, file: !115, line: 101, baseType: !154, size: 16)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !88, line: 63, baseType: !155)
!155 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !118, file: !115, line: 108, baseType: !157, size: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !88, line: 64, baseType: !96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !118, file: !115, line: 132, baseType: !91, size: 32, offset: 160)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !118, file: !115, line: 136, baseType: !160, size: 192, offset: 192)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !136, line: 254, size: 192, elements: !161)
!161 = !{!162, !163, !169}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !160, file: !136, line: 255, baseType: !98, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !160, file: !136, line: 256, baseType: !164, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !136, line: 252, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !160, file: !136, line: 259, baseType: !170, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !88, line: 59, baseType: !171)
!171 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !114, file: !115, line: 255, baseType: !173, size: 288, offset: 384)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !174, line: 25, size: 288, elements: !175)
!174 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !173, file: !174, line: 26, baseType: !157, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !173, file: !174, line: 27, baseType: !157, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !173, file: !174, line: 28, baseType: !157, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !173, file: !174, line: 29, baseType: !157, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !173, file: !174, line: 30, baseType: !157, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !173, file: !174, line: 31, baseType: !157, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !173, file: !174, line: 32, baseType: !157, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !173, file: !174, line: 33, baseType: !157, size: 32, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !173, file: !174, line: 34, baseType: !157, size: 32, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !114, file: !115, line: 258, baseType: !91, size: 32, offset: 672)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !114, file: !115, line: 261, baseType: !135, size: 64, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !114, file: !115, line: 302, baseType: !90, size: 32, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !114, file: !115, line: 333, baseType: !189, size: 32, offset: 800)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !94, line: 5291, size: 160, elements: !191)
!191 = !{!192, !203, !204}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !190, file: !94, line: 5292, baseType: !193, size: 96)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !194, line: 56, size: 96, elements: !195)
!194 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!195 = !{!196, !199, !200}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !193, file: !194, line: 57, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !194, line: 57, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !193, file: !194, line: 58, baseType: !91, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !193, file: !194, line: 59, baseType: !201, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !202, line: 46, baseType: !96)
!202 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!203 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !190, file: !94, line: 5293, baseType: !135, size: 64, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !190, file: !94, line: 5294, baseType: !205, offset: 160)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !206, line: 45, elements: !207)
!206 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!207 = !{}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !114, file: !115, line: 355, baseType: !209, size: 64, offset: 832)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !174, line: 60, size: 64, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !209, file: !174, line: 63, baseType: !157, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !209, file: !174, line: 66, baseType: !157, size: 32, offset: 32)
!213 = !{i32 7, !"Dwarf Version", i32 4}
!214 = !{i32 2, !"Debug Info Version", i32 3}
!215 = !{i32 1, !"wchar_size", i32 4}
!216 = !{i32 1, !"static_rwdata", i32 1}
!217 = !{i32 1, !"enumsize_buildattr", i32 1}
!218 = !{i32 1, !"armlib_unavailable", i32 0}
!219 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!220 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !4, file: !4, line: 223, type: !221, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !225)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !223, !113}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!225 = !{!226, !227}
!226 = !DILocalVariable(name: "object", arg: 1, scope: !220, file: !4, line: 223, type: !223)
!227 = !DILocalVariable(name: "thread", arg: 2, scope: !220, file: !4, line: 224, type: !113)
!228 = !DILocation(line: 223, column: 61, scope: !220)
!229 = !DILocation(line: 224, column: 24, scope: !220)
!230 = !DILocation(line: 226, column: 9, scope: !220)
!231 = !DILocation(line: 227, column: 9, scope: !220)
!232 = !DILocation(line: 228, column: 1, scope: !220)
!233 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !4, file: !4, line: 243, type: !234, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !236)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !223}
!236 = !{!237}
!237 = !DILocalVariable(name: "object", arg: 1, scope: !233, file: !4, line: 243, type: !223)
!238 = !DILocation(line: 243, column: 56, scope: !233)
!239 = !DILocation(line: 245, column: 9, scope: !233)
!240 = !DILocation(line: 246, column: 1, scope: !233)
!241 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !4, file: !4, line: 359, type: !242, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !244)
!242 = !DISubroutineType(types: !243)
!243 = !{!91, !3}
!244 = !{!245}
!245 = !DILocalVariable(name: "otype", arg: 1, scope: !241, file: !4, line: 359, type: !3)
!246 = !DILocation(line: 359, column: 58, scope: !241)
!247 = !DILocation(line: 361, column: 9, scope: !241)
!248 = !DILocation(line: 363, column: 2, scope: !241)
!249 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !4, file: !4, line: 366, type: !250, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !252)
!250 = !DISubroutineType(types: !251)
!251 = !{!91, !3, !201}
!252 = !{!253, !254}
!253 = !DILocalVariable(name: "otype", arg: 1, scope: !249, file: !4, line: 366, type: !3)
!254 = !DILocalVariable(name: "size", arg: 2, scope: !249, file: !4, line: 367, type: !201)
!255 = !DILocation(line: 366, column: 63, scope: !249)
!256 = !DILocation(line: 367, column: 13, scope: !249)
!257 = !DILocation(line: 369, column: 9, scope: !249)
!258 = !DILocation(line: 370, column: 9, scope: !249)
!259 = !DILocation(line: 372, column: 2, scope: !249)
!260 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !94, file: !94, line: 656, type: !261, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !267)
!261 = !DISubroutineType(types: !262)
!262 = !{!263, !265}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !264, line: 46, baseType: !170)
!264 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!267 = !{!268}
!268 = !DILocalVariable(name: "t", arg: 1, scope: !260, file: !94, line: 657, type: !265)
!269 = !DILocation(line: 657, column: 30, scope: !260)
!270 = !DILocation(line: 659, column: 28, scope: !260)
!271 = !DILocation(line: 659, column: 31, scope: !260)
!272 = !DILocation(line: 659, column: 36, scope: !260)
!273 = !DILocation(line: 659, column: 9, scope: !260)
!274 = !DILocation(line: 659, column: 2, scope: !260)
!275 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !94, file: !94, line: 671, type: !261, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !276)
!276 = !{!277}
!277 = !DILocalVariable(name: "t", arg: 1, scope: !275, file: !94, line: 672, type: !265)
!278 = !DILocation(line: 672, column: 30, scope: !275)
!279 = !DILocation(line: 674, column: 30, scope: !275)
!280 = !DILocation(line: 674, column: 33, scope: !275)
!281 = !DILocation(line: 674, column: 38, scope: !275)
!282 = !DILocation(line: 674, column: 9, scope: !275)
!283 = !DILocation(line: 674, column: 2, scope: !275)
!284 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !94, file: !94, line: 1634, type: !285, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !306)
!285 = !DISubroutineType(types: !286)
!286 = !{!263, !287}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !94, line: 1439, size: 448, elements: !290)
!290 = !{!291, !292, !293, !298, !299, !304, !305}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !289, file: !94, line: 1445, baseType: !160, size: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !289, file: !94, line: 1448, baseType: !135, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !289, file: !94, line: 1451, baseType: !294, size: 32, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !289, file: !94, line: 1454, baseType: !294, size: 32, offset: 288)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !289, file: !94, line: 1457, baseType: !300, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !264, line: 67, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !264, line: 65, size: 64, elements: !302)
!302 = !{!303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !301, file: !264, line: 66, baseType: !263, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !289, file: !94, line: 1460, baseType: !157, size: 32, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !289, file: !94, line: 1463, baseType: !91, size: 32, offset: 416)
!306 = !{!307}
!307 = !DILocalVariable(name: "timer", arg: 1, scope: !284, file: !94, line: 1635, type: !287)
!308 = !DILocation(line: 1635, column: 34, scope: !284)
!309 = !DILocation(line: 1637, column: 28, scope: !284)
!310 = !DILocation(line: 1637, column: 35, scope: !284)
!311 = !DILocation(line: 1637, column: 9, scope: !284)
!312 = !DILocation(line: 1637, column: 2, scope: !284)
!313 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !94, file: !94, line: 1649, type: !285, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !314)
!314 = !{!315}
!315 = !DILocalVariable(name: "timer", arg: 1, scope: !313, file: !94, line: 1650, type: !287)
!316 = !DILocation(line: 1650, column: 34, scope: !313)
!317 = !DILocation(line: 1652, column: 30, scope: !313)
!318 = !DILocation(line: 1652, column: 37, scope: !313)
!319 = !DILocation(line: 1652, column: 9, scope: !313)
!320 = !DILocation(line: 1652, column: 2, scope: !313)
!321 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !94, file: !94, line: 1689, type: !322, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !324)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !297, !91}
!324 = !{!325, !326}
!325 = !DILocalVariable(name: "timer", arg: 1, scope: !321, file: !94, line: 1689, type: !297)
!326 = !DILocalVariable(name: "user_data", arg: 2, scope: !321, file: !94, line: 1690, type: !91)
!327 = !DILocation(line: 1689, column: 65, scope: !321)
!328 = !DILocation(line: 1690, column: 19, scope: !321)
!329 = !DILocation(line: 1692, column: 21, scope: !321)
!330 = !DILocation(line: 1692, column: 2, scope: !321)
!331 = !DILocation(line: 1692, column: 9, scope: !321)
!332 = !DILocation(line: 1692, column: 19, scope: !321)
!333 = !DILocation(line: 1693, column: 1, scope: !321)
!334 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !94, file: !94, line: 1704, type: !335, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !337)
!335 = !DISubroutineType(types: !336)
!336 = !{!91, !287}
!337 = !{!338}
!338 = !DILocalVariable(name: "timer", arg: 1, scope: !334, file: !94, line: 1704, type: !287)
!339 = !DILocation(line: 1704, column: 72, scope: !334)
!340 = !DILocation(line: 1706, column: 9, scope: !334)
!341 = !DILocation(line: 1706, column: 16, scope: !334)
!342 = !DILocation(line: 1706, column: 2, scope: !334)
!343 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !94, file: !94, line: 2071, type: !344, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !364)
!344 = !DISubroutineType(types: !345)
!345 = !{!90, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !94, line: 1830, size: 128, elements: !348)
!348 = !{!349, !362, !363}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !347, file: !94, line: 1831, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !351, line: 60, baseType: !352)
!351 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !351, line: 53, size: 64, elements: !353)
!353 = !{!354, !361}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !352, file: !351, line: 54, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !351, line: 50, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !351, line: 44, size: 32, elements: !358)
!358 = !{!359}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !357, file: !351, line: 45, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !351, line: 40, baseType: !157)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !352, file: !351, line: 55, baseType: !355, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !347, file: !94, line: 1832, baseType: !205, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !347, file: !94, line: 1833, baseType: !135, size: 64, offset: 64)
!364 = !{!365}
!365 = !DILocalVariable(name: "queue", arg: 1, scope: !343, file: !94, line: 2071, type: !346)
!366 = !DILocation(line: 2071, column: 59, scope: !343)
!367 = !DILocation(line: 2073, column: 35, scope: !343)
!368 = !DILocation(line: 2073, column: 42, scope: !343)
!369 = !DILocation(line: 2073, column: 14, scope: !343)
!370 = !DILocation(line: 2073, column: 9, scope: !343)
!371 = !DILocation(line: 2073, column: 2, scope: !343)
!372 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !94, file: !94, line: 3209, type: !373, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !381)
!373 = !DISubroutineType(types: !374)
!374 = !{!96, !375}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !94, line: 3092, size: 128, elements: !377)
!377 = !{!378, !379, !380}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !376, file: !94, line: 3093, baseType: !135, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !376, file: !94, line: 3094, baseType: !96, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !376, file: !94, line: 3095, baseType: !96, size: 32, offset: 96)
!381 = !{!382}
!382 = !DILocalVariable(name: "sem", arg: 1, scope: !372, file: !94, line: 3209, type: !375)
!383 = !DILocation(line: 3209, column: 65, scope: !372)
!384 = !DILocation(line: 3211, column: 9, scope: !372)
!385 = !DILocation(line: 3211, column: 14, scope: !372)
!386 = !DILocation(line: 3211, column: 2, scope: !372)
!387 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !94, file: !94, line: 4649, type: !388, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !405)
!388 = !DISubroutineType(types: !389)
!389 = !{!157, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !94, line: 4390, size: 320, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !400, !401, !402, !403, !404}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !391, file: !94, line: 4392, baseType: !135, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !391, file: !94, line: 4394, baseType: !205, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !391, file: !94, line: 4396, baseType: !201, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !391, file: !94, line: 4398, baseType: !157, size: 32, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !391, file: !94, line: 4400, baseType: !398, size: 32, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !391, file: !94, line: 4402, baseType: !398, size: 32, offset: 160)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !391, file: !94, line: 4404, baseType: !398, size: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !391, file: !94, line: 4406, baseType: !398, size: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !391, file: !94, line: 4408, baseType: !157, size: 32, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !391, file: !94, line: 4413, baseType: !87, size: 8, offset: 288)
!405 = !{!406}
!406 = !DILocalVariable(name: "msgq", arg: 1, scope: !387, file: !94, line: 4649, type: !390)
!407 = !DILocation(line: 4649, column: 66, scope: !387)
!408 = !DILocation(line: 4651, column: 9, scope: !387)
!409 = !DILocation(line: 4651, column: 15, scope: !387)
!410 = !DILocation(line: 4651, column: 26, scope: !387)
!411 = !DILocation(line: 4651, column: 32, scope: !387)
!412 = !DILocation(line: 4651, column: 24, scope: !387)
!413 = !DILocation(line: 4651, column: 2, scope: !387)
!414 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !94, file: !94, line: 4665, type: !388, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !415)
!415 = !{!416}
!416 = !DILocalVariable(name: "msgq", arg: 1, scope: !414, file: !94, line: 4665, type: !390)
!417 = !DILocation(line: 4665, column: 66, scope: !414)
!418 = !DILocation(line: 4667, column: 9, scope: !414)
!419 = !DILocation(line: 4667, column: 15, scope: !414)
!420 = !DILocation(line: 4667, column: 2, scope: !414)
!421 = distinct !DISubprogram(name: "k_stack_init", scope: !422, file: !422, line: 26, type: !423, scopeLine: 28, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !435)
!422 = !DIFile(filename: "kernel/stack.c", directory: "/home/sri/zephyrproject/zephyr")
!423 = !DISubroutineType(types: !424)
!424 = !{null, !425, !431, !157}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_stack", file: !94, line: 2740, size: 192, elements: !427)
!427 = !{!428, !429, !430, !432, !433, !434}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !426, file: !94, line: 2741, baseType: !135, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !426, file: !94, line: 2742, baseType: !205, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !426, file: !94, line: 2743, baseType: !431, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !426, file: !94, line: 2743, baseType: !431, size: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !426, file: !94, line: 2743, baseType: !431, size: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !426, file: !94, line: 2745, baseType: !87, size: 8, offset: 160)
!435 = !{!436, !437, !438}
!436 = !DILocalVariable(name: "stack", arg: 1, scope: !421, file: !422, line: 26, type: !425)
!437 = !DILocalVariable(name: "buffer", arg: 2, scope: !421, file: !422, line: 26, type: !431)
!438 = !DILocalVariable(name: "num_entries", arg: 3, scope: !421, file: !422, line: 27, type: !157)
!439 = !DILocation(line: 26, column: 35, scope: !421)
!440 = !DILocation(line: 26, column: 56, scope: !421)
!441 = !DILocation(line: 27, column: 14, scope: !421)
!442 = !DILocation(line: 29, column: 16, scope: !421)
!443 = !DILocation(line: 29, column: 23, scope: !421)
!444 = !DILocation(line: 29, column: 2, scope: !421)
!445 = !DILocation(line: 30, column: 2, scope: !421)
!446 = !DILocation(line: 30, column: 9, scope: !421)
!447 = !DILocation(line: 30, column: 16, scope: !421)
!448 = !DILocation(line: 31, column: 30, scope: !421)
!449 = !DILocation(line: 31, column: 16, scope: !421)
!450 = !DILocation(line: 31, column: 23, scope: !421)
!451 = !DILocation(line: 31, column: 28, scope: !421)
!452 = !DILocation(line: 31, column: 2, scope: !421)
!453 = !DILocation(line: 31, column: 9, scope: !421)
!454 = !DILocation(line: 31, column: 14, scope: !421)
!455 = !DILocation(line: 32, column: 15, scope: !421)
!456 = !DILocation(line: 32, column: 22, scope: !421)
!457 = !DILocation(line: 32, column: 29, scope: !421)
!458 = !DILocation(line: 32, column: 27, scope: !421)
!459 = !DILocation(line: 32, column: 2, scope: !421)
!460 = !DILocation(line: 32, column: 9, scope: !421)
!461 = !DILocation(line: 32, column: 13, scope: !421)
!462 = !DILocation(line: 34, column: 2, scope: !421)
!463 = !DILocation(line: 34, column: 7, scope: !464)
!464 = distinct !DILexicalBlock(scope: !421, file: !422, line: 34, column: 5)
!465 = !DILocation(line: 35, column: 16, scope: !421)
!466 = !DILocation(line: 35, column: 2, scope: !421)
!467 = !DILocation(line: 40, column: 1, scope: !421)
!468 = distinct !DISubprogram(name: "z_waitq_init", scope: !469, file: !469, line: 47, type: !470, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !472)
!469 = !DIFile(filename: "kernel/include/wait_q.h", directory: "/home/sri/zephyrproject/zephyr")
!470 = !DISubroutineType(types: !471)
!471 = !{null, !134}
!472 = !{!473}
!473 = !DILocalVariable(name: "w", arg: 1, scope: !468, file: !469, line: 47, type: !134)
!474 = !DILocation(line: 47, column: 44, scope: !468)
!475 = !DILocation(line: 49, column: 18, scope: !468)
!476 = !DILocation(line: 49, column: 21, scope: !468)
!477 = !DILocation(line: 49, column: 2, scope: !468)
!478 = !DILocation(line: 50, column: 1, scope: !468)
!479 = distinct !DISubprogram(name: "z_object_init", scope: !4, file: !4, line: 215, type: !234, scopeLine: 216, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !480)
!480 = !{!481}
!481 = !DILocalVariable(name: "obj", arg: 1, scope: !479, file: !4, line: 215, type: !223)
!482 = !DILocation(line: 215, column: 46, scope: !479)
!483 = !DILocation(line: 217, column: 9, scope: !479)
!484 = !DILocation(line: 218, column: 1, scope: !479)
!485 = distinct !DISubprogram(name: "z_impl_k_stack_alloc_init", scope: !422, file: !422, line: 42, type: !486, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !488)
!486 = !DISubroutineType(types: !487)
!487 = !{!89, !425, !157}
!488 = !{!489, !490, !491, !492}
!489 = !DILocalVariable(name: "stack", arg: 1, scope: !485, file: !422, line: 42, type: !425)
!490 = !DILocalVariable(name: "num_entries", arg: 2, scope: !485, file: !422, line: 42, type: !157)
!491 = !DILocalVariable(name: "buffer", scope: !485, file: !422, line: 44, type: !91)
