; ModuleID = '../bc_files/stm32f0xx_hal.bc'
source_filename = "/home/sri/zephyrproject/modules/hal/stm32/stm32cube/stm32f0xx/drivers/src/stm32f0xx_hal.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.RCC_TypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.DBGMCU_TypeDef = type { i32, i32, i32, i32 }

@uwTickPrio = hidden global i32 4, align 4, !dbg !0
@uwTickFreq = hidden global i8 1, align 1, !dbg !116
@SystemCoreClock = external dso_local global i32, align 4
@uwTick = hidden global i32 0, align 4, !dbg !120

; Function Attrs: nounwind optsize
define hidden zeroext i8 @HAL_Init() #0 !dbg !129 {
  %1 = load volatile i32, ptr inttoptr (i32 1073881088 to ptr), align 4, !dbg !134
  %2 = or i32 %1, 16, !dbg !134
  store volatile i32 %2, ptr inttoptr (i32 1073881088 to ptr), align 4, !dbg !134
  %3 = call zeroext i8 @HAL_InitTick(i32 noundef 3) #4, !dbg !135
  call void @HAL_MspInit() #4, !dbg !136
  ret i8 0, !dbg !137
}

; Function Attrs: nounwind optsize
define weak hidden zeroext i8 @HAL_InitTick(i32 noundef %0) #0 !dbg !138 {
  %2 = alloca i8, align 1
  %3 = alloca i32, align 4
  store i32 %0, ptr %3, align 4
  call void @llvm.dbg.declare(metadata ptr %3, metadata !142, metadata !DIExpression()), !dbg !143
  %4 = load i32, ptr @SystemCoreClock, align 4, !dbg !144
  %5 = load i8, ptr @uwTickFreq, align 1, !dbg !146
  %6 = zext i8 %5 to i32, !dbg !146

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "uwTickPrio", scope: !2, file: !118, line: 84, type: !67, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !60, globals: !115, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "stm32f0xx_hal.c", directory: "/home/sri/zephyrproject/zephyr/build")
!4 = !{!5, !13, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 79, baseType: !7, size: 8, elements: !8)
!6 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal.h", directory: "/home/sri/zephyrproject")
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "HAL_TICK_FREQ_10HZ", value: 100)
!10 = !DIEnumerator(name: "HAL_TICK_FREQ_100HZ", value: 10)
!11 = !DIEnumerator(name: "HAL_TICK_FREQ_1KHZ", value: 1)
!12 = !DIEnumerator(name: "HAL_TICK_FREQ_DEFAULT", value: 1)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 38, baseType: !7, size: 8, elements: !15)
!14 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal_def.h", directory: "/home/sri/zephyrproject")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "HAL_OK", value: 0)
!17 = !DIEnumerator(name: "HAL_ERROR", value: 1)
!18 = !DIEnumerator(name: "HAL_BUSY", value: 2)
!19 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 66, baseType: !22, size: 8, elements: !23)
!21 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!22 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!24 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!25 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!26 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!27 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!28 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!29 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!30 = !DIEnumerator(name: "PVD_VDDIO2_IRQn", value: 1)
!31 = !DIEnumerator(name: "RTC_IRQn", value: 2)
!32 = !DIEnumerator(name: "FLASH_IRQn", value: 3)
!33 = !DIEnumerator(name: "RCC_CRS_IRQn", value: 4)
!34 = !DIEnumerator(name: "EXTI0_1_IRQn", value: 5)
!35 = !DIEnumerator(name: "EXTI2_3_IRQn", value: 6)
!36 = !DIEnumerator(name: "EXTI4_15_IRQn", value: 7)
!37 = !DIEnumerator(name: "TSC_IRQn", value: 8)
!38 = !DIEnumerator(name: "DMA1_Ch1_IRQn", value: 9)
!39 = !DIEnumerator(name: "DMA1_Ch2_3_DMA2_Ch1_2_IRQn", value: 10)
!40 = !DIEnumerator(name: "DMA1_Ch4_7_DMA2_Ch3_5_IRQn", value: 11)
!41 = !DIEnumerator(name: "ADC1_COMP_IRQn", value: 12)
!42 = !DIEnumerator(name: "TIM1_BRK_UP_TRG_COM_IRQn", value: 13)
!43 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 14)
!44 = !DIEnumerator(name: "TIM2_IRQn", value: 15)
!45 = !DIEnumerator(name: "TIM3_IRQn", value: 16)
!46 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 17)
!47 = !DIEnumerator(name: "TIM7_IRQn", value: 18)
!48 = !DIEnumerator(name: "TIM14_IRQn", value: 19)
!49 = !DIEnumerator(name: "TIM15_IRQn", value: 20)
!50 = !DIEnumerator(name: "TIM16_IRQn", value: 21)
!51 = !DIEnumerator(name: "TIM17_IRQn", value: 22)
!52 = !DIEnumerator(name: "I2C1_IRQn", value: 23)
!53 = !DIEnumerator(name: "I2C2_IRQn", value: 24)
!54 = !DIEnumerator(name: "SPI1_IRQn", value: 25)
!55 = !DIEnumerator(name: "SPI2_IRQn", value: 26)
!56 = !DIEnumerator(name: "USART1_IRQn", value: 27)
!57 = !DIEnumerator(name: "USART2_IRQn", value: 28)
!58 = !DIEnumerator(name: "USART3_8_IRQn", value: 29)
!59 = !DIEnumerator(name: "CEC_CAN_IRQn", value: 30)
!60 = !{!61, !67, !78, !96, !106, !114}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !21, line: 350, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 339, size: 288, elements: !64)
!64 = !{!65, !70, !71, !72, !73, !74, !75, !76, !77}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !63, file: !21, line: 341, baseType: !66, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !68, line: 64, baseType: !69)
!68 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!69 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !63, file: !21, line: 342, baseType: !66, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !63, file: !21, line: 343, baseType: !66, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !63, file: !21, line: 344, baseType: !66, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !63, file: !21, line: 345, baseType: !66, size: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !63, file: !21, line: 346, baseType: !66, size: 32, offset: 160)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !63, file: !21, line: 347, baseType: !66, size: 32, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !63, file: !21, line: 348, baseType: !66, size: 32, offset: 224)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !63, file: !21, line: 349, baseType: !66, size: 32, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !21, line: 461, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 445, size: 448, elements: !81)
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !80, file: !21, line: 447, baseType: !66, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !80, file: !21, line: 448, baseType: !66, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !80, file: !21, line: 449, baseType: !66, size: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !80, file: !21, line: 450, baseType: !66, size: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !80, file: !21, line: 451, baseType: !66, size: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !80, file: !21, line: 452, baseType: !66, size: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !80, file: !21, line: 453, baseType: !66, size: 32, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !80, file: !21, line: 454, baseType: !66, size: 32, offset: 224)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !80, file: !21, line: 455, baseType: !66, size: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !80, file: !21, line: 456, baseType: !66, size: 32, offset: 288)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !80, file: !21, line: 457, baseType: !66, size: 32, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR2", scope: !80, file: !21, line: 458, baseType: !66, size: 32, offset: 352)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR3", scope: !80, file: !21, line: 459, baseType: !66, size: 32, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !80, file: !21, line: 460, baseType: !66, size: 32, offset: 416)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !98, line: 454, baseType: !99)
!98 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/sri/zephyrproject")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 448, size: 128, elements: !100)
!100 = !{!101, !102, !103, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !99, file: !98, line: 450, baseType: !66, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !99, file: !98, line: 451, baseType: !66, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !99, file: !98, line: 452, baseType: !66, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !99, file: !98, line: 453, baseType: !105, size: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBGMCU_TypeDef", file: !21, line: 300, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 294, size: 128, elements: !109)
!109 = !{!110, !111, !112, !113}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "IDCODE", scope: !108, file: !21, line: 296, baseType: !66, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !108, file: !21, line: 297, baseType: !66, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "APB1FZ", scope: !108, file: !21, line: 298, baseType: !66, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "APB2FZ", scope: !108, file: !21, line: 299, baseType: !66, size: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!115 = !{!0, !116, !120}
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "uwTickFreq", scope: !2, file: !118, line: 85, type: !119, isLocal: false, isDefinition: true)
!118 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/src/stm32f0xx_hal.c", directory: "/home/sri/zephyrproject")
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_TickFreqTypeDef", file: !6, line: 85, baseType: !5)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "uwTick", scope: !2, file: !118, line: 83, type: !66, isLocal: false, isDefinition: true)
!122 = !{i32 7, !"Dwarf Version", i32 4}
!123 = !{i32 2, !"Debug Info Version", i32 3}
!124 = !{i32 1, !"wchar_size", i32 4}
!125 = !{i32 1, !"static_rwdata", i32 1}
!126 = !{i32 1, !"enumsize_buildattr", i32 1}
!127 = !{i32 1, !"armlib_unavailable", i32 0}
!128 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!129 = distinct !DISubprogram(name: "HAL_Init", scope: !118, file: !118, line: 141, type: !130, scopeLine: 142, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !133)
!130 = !DISubroutineType(types: !131)
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_StatusTypeDef", file: !14, line: 44, baseType: !13)
!133 = !{}
!134 = !DILocation(line: 145, column: 76, scope: !129)
!135 = !DILocation(line: 150, column: 3, scope: !129)
!136 = !DILocation(line: 153, column: 3, scope: !129)
!137 = !DILocation(line: 156, column: 3, scope: !129)
!138 = distinct !DISubprogram(name: "HAL_InitTick", scope: !118, file: !118, line: 222, type: !139, scopeLine: 223, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !141)
!139 = !DISubroutineType(types: !140)
!140 = !{!132, !67}
!141 = !{!142}
!142 = !DILocalVariable(name: "TickPriority", arg: 1, scope: !138, file: !118, line: 222, type: !67)
!143 = !DILocation(line: 222, column: 63, scope: !138)
!144 = !DILocation(line: 225, column: 26, scope: !145)
!145 = distinct !DILexicalBlock(scope: !138, file: !118, line: 225, column: 7)
!146 = !DILocation(line: 225, column: 53, scope: !145)
!147 = !DILocation(line: 225, column: 51, scope: !145)
!148 = !DILocation(line: 225, column: 42, scope: !145)
!149 = !DILocation(line: 225, column: 7, scope: !145)
!150 = !DILocation(line: 225, column: 66, scope: !145)
!151 = !DILocation(line: 225, column: 7, scope: !138)
!152 = !DILocation(line: 227, column: 5, scope: !153)
!153 = distinct !DILexicalBlock(scope: !145, file: !118, line: 226, column: 3)
!154 = !DILocation(line: 231, column: 7, scope: !155)
!155 = distinct !DILexicalBlock(scope: !138, file: !118, line: 231, column: 7)
!156 = !DILocation(line: 231, column: 20, scope: !155)
!157 = !DILocation(line: 231, column: 7, scope: !138)
!158 = !DILocation(line: 233, column: 40, scope: !159)
!159 = distinct !DILexicalBlock(scope: !155, file: !118, line: 232, column: 3)
!160 = !DILocation(line: 233, column: 5, scope: !159)
!161 = !DILocation(line: 234, column: 18, scope: !159)
!162 = !DILocation(line: 234, column: 16, scope: !159)
!163 = !DILocation(line: 235, column: 3, scope: !159)
!164 = !DILocation(line: 238, column: 5, scope: !165)
!165 = distinct !DILexicalBlock(scope: !155, file: !118, line: 237, column: 3)
!166 = !DILocation(line: 242, column: 3, scope: !138)
!167 = !DILocation(line: 243, column: 1, scope: !138)
!168 = distinct !DISubprogram(name: "HAL_MspInit", scope: !118, file: !118, line: 188, type: !169, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !133)
