; ModuleID = '../bc_files/stm32f0xx_ll_utils.bc'
source_filename = "/home/sri/zephyrproject/modules/hal/stm32/stm32cube/stm32f0xx/drivers/src/stm32f0xx_ll_utils.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.SysTick_Type = type { i32, i32, i32, i32 }
%struct.LL_UTILS_PLLInitTypeDef = type { i32, i32 }
%struct.RCC_TypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.LL_UTILS_ClkInitTypeDef = type { i32, i32 }

@SystemCoreClock = external global i32, align 4
@AHBPrescTable = external constant [16 x i8], align 1

; Function Attrs: noinline nounwind optnone
define hidden void @LL_Init1msTick(i32 noundef %0) #0 !dbg !65 {
  %2 = alloca i32, align 4
  store i32 %0, ptr %2, align 4
  call void @llvm.dbg.declare(metadata ptr %2, metadata !70, metadata !DIExpression()), !dbg !71
  %3 = load i32, ptr %2, align 4, !dbg !72
  call void @LL_InitTick(i32 noundef %3, i32 noundef 1000), !dbg !73
  ret void, !dbg !74
}

; Function Attrs: nocallback nofree nosync nounwind speculatable willreturn memory(none)
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: noinline nounwind optnone
define internal void @LL_InitTick(i32 noundef %0, i32 noundef %1) #0 !dbg !75 {
  %3 = alloca i32, align 4
  %4 = alloca i32, align 4
  store i32 %0, ptr %3, align 4
  call void @llvm.dbg.declare(metadata ptr %3, metadata !79, metadata !DIExpression()), !dbg !80

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "stm32f0xx_ll_utils.c", directory: "/home/sri/zephyrproject/zephyr/build")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 180, baseType: !5, size: 8, elements: !6)
!4 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f0xx.h", directory: "/home/sri/zephyrproject")
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "SUCCESS", value: 0)
!8 = !DIEnumerator(name: "ERROR", value: 1)
!9 = !{!10, !17, !24, !38}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !12, line: 454, baseType: !13)
!12 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/sri/zephyrproject")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 448, size: 128, elements: !14)
!14 = !{!15, !20, !21, !22}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !13, file: !12, line: 450, baseType: !16, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !17)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 64, baseType: !19)
!18 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !13, file: !12, line: 451, baseType: !16, size: 32, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !13, file: !12, line: 452, baseType: !16, size: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !13, file: !12, line: 453, baseType: !23, size: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !26, line: 350, baseType: !27)
!26 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 339, size: 288, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !27, file: !26, line: 341, baseType: !16, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !27, file: !26, line: 342, baseType: !16, size: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !27, file: !26, line: 343, baseType: !16, size: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !27, file: !26, line: 344, baseType: !16, size: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !27, file: !26, line: 345, baseType: !16, size: 32, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !27, file: !26, line: 346, baseType: !16, size: 32, offset: 160)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !27, file: !26, line: 347, baseType: !16, size: 32, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !27, file: !26, line: 348, baseType: !16, size: 32, offset: 224)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !27, file: !26, line: 349, baseType: !16, size: 32, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !26, line: 461, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 445, size: 448, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !40, file: !26, line: 447, baseType: !16, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !40, file: !26, line: 448, baseType: !16, size: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !40, file: !26, line: 449, baseType: !16, size: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !40, file: !26, line: 450, baseType: !16, size: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !40, file: !26, line: 451, baseType: !16, size: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !40, file: !26, line: 452, baseType: !16, size: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !40, file: !26, line: 453, baseType: !16, size: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !40, file: !26, line: 454, baseType: !16, size: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !40, file: !26, line: 455, baseType: !16, size: 32, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !40, file: !26, line: 456, baseType: !16, size: 32, offset: 288)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !40, file: !26, line: 457, baseType: !16, size: 32, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR2", scope: !40, file: !26, line: 458, baseType: !16, size: 32, offset: 352)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR3", scope: !40, file: !26, line: 459, baseType: !16, size: 32, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !40, file: !26, line: 460, baseType: !16, size: 32, offset: 416)
!56 = !{i32 7, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{i32 1, !"wchar_size", i32 4}
!59 = !{i32 1, !"static_rwdata", i32 1}
!60 = !{i32 1, !"enumsize_buildattr", i32 1}
!61 = !{i32 1, !"armlib_unavailable", i32 0}
!62 = !{i32 8, !"PIC Level", i32 2}
!63 = !{i32 7, !"PIE Level", i32 2}
!64 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!65 = distinct !DISubprogram(name: "LL_Init1msTick", scope: !66, file: !66, line: 141, type: !67, scopeLine: 142, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !69)
!66 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/src/stm32f0xx_ll_utils.c", directory: "/home/sri/zephyrproject")
!67 = !DISubroutineType(types: !68)
!68 = !{null, !17}
!69 = !{}
!70 = !DILocalVariable(name: "HCLKFrequency", arg: 1, scope: !65, file: !66, line: 141, type: !17)
!71 = !DILocation(line: 141, column: 30, scope: !65)
!72 = !DILocation(line: 144, column: 15, scope: !65)
!73 = !DILocation(line: 144, column: 3, scope: !65)
!74 = !DILocation(line: 145, column: 1, scope: !65)
!75 = distinct !DISubprogram(name: "LL_InitTick", scope: !76, file: !76, line: 219, type: !77, scopeLine: 220, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !69)
!76 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_ll_utils.h", directory: "/home/sri/zephyrproject")
!77 = !DISubroutineType(types: !78)
!78 = !{null, !17, !17}
!79 = !DILocalVariable(name: "HCLKFrequency", arg: 1, scope: !75, file: !76, line: 219, type: !17)
!80 = !DILocation(line: 219, column: 43, scope: !75)
!81 = !DILocalVariable(name: "Ticks", arg: 2, scope: !75, file: !76, line: 219, type: !17)
!82 = !DILocation(line: 219, column: 67, scope: !75)
!83 = !DILocation(line: 222, column: 71, scope: !75)
!84 = !DILocation(line: 222, column: 87, scope: !75)
!85 = !DILocation(line: 222, column: 85, scope: !75)
!86 = !DILocation(line: 222, column: 94, scope: !75)
!87 = !DILocation(line: 222, column: 57, scope: !75)
!88 = !DILocation(line: 223, column: 56, scope: !75)
!89 = !DILocation(line: 224, column: 57, scope: !75)
!90 = !DILocation(line: 226, column: 1, scope: !75)
!91 = distinct !DISubprogram(name: "LL_mDelay", scope: !66, file: !66, line: 157, type: !67, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !69)
!92 = !DILocalVariable(name: "Delay", arg: 1, scope: !91, file: !66, line: 157, type: !17)
!93 = !DILocation(line: 157, column: 25, scope: !91)
!94 = !DILocalVariable(name: "tmp", scope: !91, file: !66, line: 159, type: !16)
!95 = !DILocation(line: 159, column: 21, scope: !91)
!96 = !DILocation(line: 159, column: 76, scope: !91)
!97 = !DILocation(line: 161, column: 10, scope: !91)
!98 = !DILocation(line: 164, column: 7, scope: !99)
!99 = distinct !DILexicalBlock(scope: !91, file: !66, line: 164, column: 7)
!100 = !DILocation(line: 164, column: 13, scope: !99)
!101 = !DILocation(line: 164, column: 7, scope: !91)
!102 = !DILocation(line: 166, column: 10, scope: !103)
!103 = distinct !DILexicalBlock(scope: !99, file: !66, line: 165, column: 3)
!104 = !DILocation(line: 167, column: 3, scope: !103)
!105 = !DILocation(line: 169, column: 3, scope: !91)
!106 = !DILocation(line: 169, column: 10, scope: !91)
!107 = !DILocation(line: 171, column: 59, scope: !108)
!108 = distinct !DILexicalBlock(scope: !109, file: !66, line: 171, column: 9)
!109 = distinct !DILexicalBlock(scope: !91, file: !66, line: 170, column: 3)
!110 = !DILocation(line: 171, column: 64, scope: !108)
!111 = !DILocation(line: 171, column: 80, scope: !108)
!112 = !DILocation(line: 171, column: 9, scope: !109)
!113 = !DILocation(line: 173, column: 12, scope: !114)
!114 = distinct !DILexicalBlock(scope: !108, file: !66, line: 172, column: 5)
!115 = !DILocation(line: 174, column: 5, scope: !114)
!116 = distinct !{!116, !105, !117}
!117 = !DILocation(line: 175, column: 3, scope: !91)
!118 = !DILocation(line: 176, column: 1, scope: !91)
!119 = distinct !DISubprogram(name: "LL_SetSystemCoreClock", scope: !66, file: !66, line: 213, type: !67, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !69)
!120 = !DILocalVariable(name: "HCLKFrequency", arg: 1, scope: !119, file: !66, line: 213, type: !17)
!121 = !DILocation(line: 213, column: 37, scope: !119)
!122 = !DILocation(line: 216, column: 21, scope: !119)
!123 = !DILocation(line: 216, column: 19, scope: !119)
!124 = !DILocation(line: 217, column: 1, scope: !119)
!125 = distinct !DISubprogram(name: "LL_SetFlashLatency", scope: !66, file: !66, line: 228, type: !126, scopeLine: 229, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !69)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !17}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorStatus", file: !4, line: 184, baseType: !3)
!129 = !DILocalVariable(name: "Frequency", arg: 1, scope: !125, file: !66, line: 228, type: !17)
!130 = !DILocation(line: 228, column: 41, scope: !125)
!131 = !DILocalVariable(name: "timeout", scope: !125, file: !66, line: 230, type: !17)
!132 = !DILocation(line: 230, column: 12, scope: !125)
!133 = !DILocalVariable(name: "getlatency", scope: !125, file: !66, line: 231, type: !17)
!134 = !DILocation(line: 231, column: 12, scope: !125)
!135 = !DILocalVariable(name: "latency", scope: !125, file: !66, line: 232, type: !17)
!136 = !DILocation(line: 232, column: 12, scope: !125)
!137 = !DILocalVariable(name: "status", scope: !125, file: !66, line: 233, type: !128)
!138 = !DILocation(line: 233, column: 15, scope: !125)
!139 = !DILocation(line: 236, column: 7, scope: !140)
!140 = distinct !DILexicalBlock(scope: !125, file: !66, line: 236, column: 7)
!141 = !DILocation(line: 236, column: 17, scope: !140)
!142 = !DILocation(line: 236, column: 7, scope: !125)
!143 = !DILocation(line: 238, column: 12, scope: !144)
!144 = distinct !DILexicalBlock(scope: !140, file: !66, line: 237, column: 3)
!145 = !DILocation(line: 239, column: 3, scope: !144)
!146 = !DILocation(line: 242, column: 9, scope: !147)
!147 = distinct !DILexicalBlock(scope: !148, file: !66, line: 242, column: 9)
!148 = distinct !DILexicalBlock(scope: !140, file: !66, line: 241, column: 3)
!149 = !DILocation(line: 242, column: 19, scope: !147)
!150 = !DILocation(line: 242, column: 9, scope: !148)
!151 = !DILocation(line: 245, column: 15, scope: !152)
!152 = distinct !DILexicalBlock(scope: !147, file: !66, line: 243, column: 5)
!153 = !DILocation(line: 246, column: 5, scope: !152)
!154 = !DILocation(line: 250, column: 15, scope: !155)
!155 = distinct !DILexicalBlock(scope: !147, file: !66, line: 248, column: 5)
!156 = !DILocation(line: 252, column: 9, scope: !157)
!157 = distinct !DILexicalBlock(scope: !148, file: !66, line: 252, column: 9)
!158 = !DILocation(line: 252, column: 16, scope: !157)
!159 = !DILocation(line: 252, column: 9, scope: !148)
!160 = !DILocation(line: 254, column: 27, scope: !161)
!161 = distinct !DILexicalBlock(scope: !157, file: !66, line: 253, column: 5)
!162 = !DILocation(line: 254, column: 7, scope: !161)
!163 = !DILocation(line: 258, column: 15, scope: !161)
!164 = !DILocation(line: 259, column: 7, scope: !161)
!165 = !DILocation(line: 262, column: 20, scope: !166)
!166 = distinct !DILexicalBlock(scope: !161, file: !66, line: 260, column: 7)
!167 = !DILocation(line: 262, column: 18, scope: !166)
!168 = !DILocation(line: 263, column: 14, scope: !166)
!169 = !DILocation(line: 264, column: 7, scope: !166)
!170 = !DILocation(line: 264, column: 17, scope: !161)
!171 = !DILocation(line: 264, column: 31, scope: !161)
!172 = !DILocation(line: 264, column: 28, scope: !161)
!173 = !DILocation(line: 264, column: 40, scope: !161)
!174 = !DILocation(line: 264, column: 44, scope: !161)
!175 = !DILocation(line: 264, column: 52, scope: !161)
!176 = !DILocation(line: 0, scope: !161)
!177 = distinct !{!177, !164, !178}
!178 = !DILocation(line: 264, column: 56, scope: !161)
!179 = !DILocation(line: 266, column: 10, scope: !180)
!180 = distinct !DILexicalBlock(scope: !161, file: !66, line: 266, column: 10)
!181 = !DILocation(line: 266, column: 24, scope: !180)
!182 = !DILocation(line: 266, column: 21, scope: !180)
!183 = !DILocation(line: 266, column: 10, scope: !161)
!184 = !DILocation(line: 268, column: 16, scope: !185)
!185 = distinct !DILexicalBlock(scope: !180, file: !66, line: 267, column: 7)
!186 = !DILocation(line: 269, column: 7, scope: !185)
!187 = !DILocation(line: 272, column: 16, scope: !188)
!188 = distinct !DILexicalBlock(scope: !180, file: !66, line: 271, column: 7)
!189 = !DILocation(line: 274, column: 5, scope: !161)
!190 = !DILocation(line: 277, column: 10, scope: !125)
!191 = !DILocation(line: 277, column: 3, scope: !125)
!192 = distinct !DISubprogram(name: "LL_FLASH_SetLatency", scope: !193, file: !193, line: 1778, type: !67, scopeLine: 1779, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !69)
!193 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_ll_system.h", directory: "/home/sri/zephyrproject")
!194 = !DILocalVariable(name: "Latency", arg: 1, scope: !192, file: !193, line: 1778, type: !17)
!195 = !DILocation(line: 1778, column: 51, scope: !192)
!196 = !DILocation(line: 1780, column: 156, scope: !192)
!197 = !DILocation(line: 1780, column: 163, scope: !192)
!198 = !DILocation(line: 1780, column: 190, scope: !192)
!199 = !DILocation(line: 1780, column: 187, scope: !192)
!200 = !DILocation(line: 1780, column: 80, scope: !192)
!201 = !DILocation(line: 1781, column: 1, scope: !192)
!202 = distinct !DISubprogram(name: "LL_FLASH_GetLatency", scope: !193, file: !193, line: 1790, type: !203, scopeLine: 1791, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !69)
!203 = !DISubroutineType(types: !204)
!204 = !{!17}
!205 = !DILocation(line: 1792, column: 91, scope: !202)
!206 = !DILocation(line: 1792, column: 96, scope: !202)
!207 = !DILocation(line: 1792, column: 3, scope: !202)
!208 = distinct !DISubprogram(name: "LL_PLL_ConfigSystemClock_HSI", scope: !66, file: !66, line: 298, type: !209, scopeLine: 300, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !69)
!209 = !DISubroutineType(types: !210)
!210 = !{!128, !211, !217}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "LL_UTILS_PLLInitTypeDef", file: !76, line: 111, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !76, line: 90, size: 64, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "PLLMul", scope: !213, file: !76, line: 92, baseType: !17, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "PLLDiv", scope: !213, file: !76, line: 99, baseType: !17, size: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "LL_UTILS_ClkInitTypeDef", file: !76, line: 129, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !76, line: 116, size: 64, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "AHBCLKDivider", scope: !219, file: !76, line: 118, baseType: !17, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "APB1CLKDivider", scope: !219, file: !76, line: 124, baseType: !17, size: 32, offset: 32)
!223 = !DILocalVariable(name: "UTILS_PLLInitStruct", arg: 1, scope: !208, file: !66, line: 298, type: !211)
!224 = !DILocation(line: 298, column: 67, scope: !208)
!225 = !DILocalVariable(name: "UTILS_ClkInitStruct", arg: 2, scope: !208, file: !66, line: 299, type: !217)
!226 = !DILocation(line: 299, column: 67, scope: !208)
!227 = !DILocalVariable(name: "status", scope: !208, file: !66, line: 301, type: !128)
!228 = !DILocation(line: 301, column: 15, scope: !208)
!229 = !DILocalVariable(name: "pllfreq", scope: !208, file: !66, line: 302, type: !17)
!230 = !DILocation(line: 302, column: 12, scope: !208)
!231 = !DILocation(line: 305, column: 7, scope: !232)
!232 = distinct !DILexicalBlock(scope: !208, file: !66, line: 305, column: 7)
!233 = !DILocation(line: 305, column: 26, scope: !232)
!234 = !DILocation(line: 305, column: 7, scope: !208)
!235 = !DILocation(line: 315, column: 53, scope: !236)
!236 = distinct !DILexicalBlock(scope: !232, file: !66, line: 306, column: 3)
!237 = !DILocation(line: 315, column: 15, scope: !236)
!238 = !DILocation(line: 315, column: 13, scope: !236)
!239 = !DILocation(line: 318, column: 9, scope: !240)
!240 = distinct !DILexicalBlock(scope: !236, file: !66, line: 318, column: 9)
!241 = !DILocation(line: 318, column: 30, scope: !240)
!242 = !DILocation(line: 318, column: 9, scope: !236)
!243 = !DILocation(line: 320, column: 7, scope: !244)
!244 = distinct !DILexicalBlock(scope: !240, file: !66, line: 319, column: 5)
!245 = !DILocation(line: 321, column: 7, scope: !244)
!246 = !DILocation(line: 321, column: 14, scope: !244)
!247 = !DILocation(line: 321, column: 35, scope: !244)
!248 = distinct !{!248, !245, !249}
!249 = !DILocation(line: 324, column: 7, scope: !244)
!250 = !DILocation(line: 325, column: 5, scope: !244)
!251 = !DILocation(line: 329, column: 48, scope: !236)
!252 = !DILocation(line: 329, column: 69, scope: !236)
!253 = !DILocation(line: 329, column: 77, scope: !236)
!254 = !DILocation(line: 329, column: 98, scope: !236)
!255 = !DILocation(line: 329, column: 5, scope: !236)
!256 = !DILocation(line: 335, column: 45, scope: !236)
!257 = !DILocation(line: 335, column: 54, scope: !236)
!258 = !DILocation(line: 335, column: 14, scope: !236)
!259 = !DILocation(line: 335, column: 12, scope: !236)
!260 = !DILocation(line: 336, column: 3, scope: !236)
!261 = !DILocation(line: 340, column: 12, scope: !262)
!262 = distinct !DILexicalBlock(scope: !232, file: !66, line: 338, column: 3)
!263 = !DILocation(line: 343, column: 10, scope: !208)
!264 = !DILocation(line: 343, column: 3, scope: !208)
!265 = distinct !DISubprogram(name: "UTILS_PLL_IsBusy", scope: !66, file: !66, line: 530, type: !266, scopeLine: 531, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !69)
!266 = !DISubroutineType(types: !267)
!267 = !{!128}
!268 = !DILocalVariable(name: "status", scope: !265, file: !66, line: 532, type: !128)
!269 = !DILocation(line: 532, column: 15, scope: !265)
!270 = !DILocation(line: 535, column: 7, scope: !271)
!271 = distinct !DILexicalBlock(scope: !265, file: !66, line: 535, column: 7)
!272 = !DILocation(line: 535, column: 28, scope: !271)
!273 = !DILocation(line: 535, column: 7, scope: !265)
!274 = !DILocation(line: 538, column: 12, scope: !275)
!275 = distinct !DILexicalBlock(scope: !271, file: !66, line: 536, column: 3)
!276 = !DILocation(line: 539, column: 3, scope: !275)
!277 = !DILocation(line: 541, column: 10, scope: !265)
!278 = !DILocation(line: 541, column: 3, scope: !265)
!279 = distinct !DISubprogram(name: "UTILS_GetPLLOutputFrequency", scope: !66, file: !66, line: 504, type: !280, scopeLine: 505, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !69)
!280 = !DISubroutineType(types: !281)
!281 = !{!17, !17, !211}
