; ModuleID = '../bc_files/stm32f0xx_hal_rcc.bc'
source_filename = "/home/sri/zephyrproject/modules/hal/stm32/stm32cube/stm32f0xx/drivers/src/stm32f0xx_hal_rcc.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.RCC_TypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.RCC_OscInitTypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.RCC_PLLInitTypeDef }
%struct.RCC_PLLInitTypeDef = type { i32, i32, i32, i32 }
%struct.RCC_ClkInitTypeDef = type { i32, i32, i32, i32 }
%struct.GPIO_InitTypeDef = type { i32, i32, i32, i32, i32 }

@SystemCoreClock = external global i32, align 4
@uwTickPrio = external global i32, align 4
@AHBPrescTable = external constant [16 x i8], align 1
@HAL_RCC_GetSysClockFreq.aPLLMULFactorTable = internal constant [16 x i8] c"\02\03\04\05\06\07\08\09\0A\0B\0C\0D\0E\0F\10\10", align 1, !dbg !0
@HAL_RCC_GetSysClockFreq.aPredivFactorTable = internal constant [16 x i8] c"\01\02\03\04\05\06\07\08\09\0A\0B\0C\0D\0E\0F\10", align 1, !dbg !91
@APBPrescTable = external constant [8 x i8], align 1

; Function Attrs: noinline nounwind optnone
define hidden zeroext i8 @HAL_RCC_DeInit() #0 !dbg !107 {
  %1 = alloca i8, align 1
  %2 = alloca i32, align 4
  call void @llvm.dbg.declare(metadata ptr %2, metadata !111, metadata !DIExpression()), !dbg !112
  %3 = call i32 @HAL_GetTick(), !dbg !113
  store i32 %3, ptr %2, align 4, !dbg !114

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "aPLLMULFactorTable", scope: !2, file: !3, line: 1097, type: !93, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "HAL_RCC_GetSysClockFreq", scope: !3, file: !3, line: 1095, type: !4, scopeLine: 1096, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !97)
!3 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/src/stm32f0xx_hal_rcc.c", directory: "/home/sri/zephyrproject")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !7, line: 64, baseType: !8)
!7 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!8 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !25, globals: !90, splitDebugInlining: false, nameTableKind: None)
!10 = !DIFile(filename: "stm32f0xx_hal_rcc.c", directory: "/home/sri/zephyrproject/zephyr/build")
!11 = !{!12, !20}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 38, baseType: !14, size: 8, elements: !15)
!13 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal_def.h", directory: "/home/sri/zephyrproject")
!14 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "HAL_OK", value: 0)
!17 = !DIEnumerator(name: "HAL_ERROR", value: 1)
!18 = !DIEnumerator(name: "HAL_BUSY", value: 2)
!19 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 167, baseType: !14, size: 8, elements: !22)
!21 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f0xx.h", directory: "/home/sri/zephyrproject")
!22 = !{!23, !24}
!23 = !DIEnumerator(name: "RESET", value: 0)
!24 = !DIEnumerator(name: "SET", value: 1)
!25 = !{!26, !46, !6, !47, !48, !54, !67, !69, !86, !88}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !28, line: 461, baseType: !29)
!28 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 445, size: 448, elements: !30)
!30 = !{!31, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !29, file: !28, line: 447, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !29, file: !28, line: 448, baseType: !32, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !29, file: !28, line: 449, baseType: !32, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !29, file: !28, line: 450, baseType: !32, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !29, file: !28, line: 451, baseType: !32, size: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !29, file: !28, line: 452, baseType: !32, size: 32, offset: 160)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !29, file: !28, line: 453, baseType: !32, size: 32, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !29, file: !28, line: 454, baseType: !32, size: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !29, file: !28, line: 455, baseType: !32, size: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !29, file: !28, line: 456, baseType: !32, size: 32, offset: 288)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !29, file: !28, line: 457, baseType: !32, size: 32, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR2", scope: !29, file: !28, line: 458, baseType: !32, size: 32, offset: 352)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR3", scope: !29, file: !28, line: 459, baseType: !32, size: 32, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !29, file: !28, line: 460, baseType: !32, size: 32, offset: 416)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !7, line: 62, baseType: !14)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !28, line: 439, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 435, size: 64, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !50, file: !28, line: 437, baseType: !32, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !50, file: !28, line: 438, baseType: !32, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !28, line: 350, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 339, size: 288, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !56, file: !28, line: 341, baseType: !32, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !56, file: !28, line: 342, baseType: !32, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !56, file: !28, line: 343, baseType: !32, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !56, file: !28, line: 344, baseType: !32, size: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !56, file: !28, line: 345, baseType: !32, size: 32, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !56, file: !28, line: 346, baseType: !32, size: 32, offset: 160)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !56, file: !28, line: 347, baseType: !32, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !56, file: !28, line: 348, baseType: !32, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !56, file: !28, line: 349, baseType: !32, size: 32, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !7, line: 63, baseType: !68)
!68 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !28, line: 383, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 371, size: 352, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !85}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !71, file: !28, line: 373, baseType: !32, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !71, file: !28, line: 374, baseType: !32, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !71, file: !28, line: 375, baseType: !32, size: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !71, file: !28, line: 376, baseType: !32, size: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !71, file: !28, line: 377, baseType: !32, size: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !71, file: !28, line: 378, baseType: !32, size: 32, offset: 160)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !71, file: !28, line: 379, baseType: !32, size: 32, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !71, file: !28, line: 380, baseType: !32, size: 32, offset: 224)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !71, file: !28, line: 381, baseType: !82, size: 64, offset: 256)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 2)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !71, file: !28, line: 382, baseType: !32, size: 32, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !7, line: 65, baseType: !87)
!87 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !47)
!90 = !{!0, !91}
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "aPredivFactorTable", scope: !2, file: !3, line: 1099, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 128, elements: !95)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!95 = !{!96}
!96 = !DISubrange(count: 16)
!97 = !{}
!98 = !{i32 7, !"Dwarf Version", i32 4}
!99 = !{i32 2, !"Debug Info Version", i32 3}
!100 = !{i32 1, !"wchar_size", i32 4}
!101 = !{i32 1, !"static_rwdata", i32 1}
!102 = !{i32 1, !"enumsize_buildattr", i32 1}
!103 = !{i32 1, !"armlib_unavailable", i32 0}
!104 = !{i32 8, !"PIC Level", i32 2}
!105 = !{i32 7, !"PIE Level", i32 2}
!106 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!107 = distinct !DISubprogram(name: "HAL_RCC_DeInit", scope: !3, file: !3, line: 208, type: !108, scopeLine: 209, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !97)
!108 = !DISubroutineType(types: !109)
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_StatusTypeDef", file: !13, line: 44, baseType: !12)
!111 = !DILocalVariable(name: "tickstart", scope: !107, file: !3, line: 210, type: !6)
!112 = !DILocation(line: 210, column: 12, scope: !107)
!113 = !DILocation(line: 213, column: 15, scope: !107)
!114 = !DILocation(line: 213, column: 13, scope: !107)
!115 = !DILocation(line: 216, column: 75, scope: !107)
!116 = !DILocation(line: 219, column: 3, scope: !107)
!117 = !DILocation(line: 219, column: 78, scope: !107)
!118 = !DILocation(line: 219, column: 82, scope: !107)
!119 = !DILocation(line: 219, column: 103, scope: !107)
!120 = !DILocation(line: 221, column: 10, scope: !121)
!121 = distinct !DILexicalBlock(scope: !122, file: !3, line: 221, column: 9)
!122 = distinct !DILexicalBlock(scope: !107, file: !3, line: 220, column: 3)
!123 = !DILocation(line: 221, column: 26, scope: !121)
!124 = !DILocation(line: 221, column: 24, scope: !121)
!125 = !DILocation(line: 221, column: 37, scope: !121)
!126 = !DILocation(line: 221, column: 9, scope: !122)
!127 = !DILocation(line: 223, column: 7, scope: !128)
!128 = distinct !DILexicalBlock(scope: !121, file: !3, line: 222, column: 5)
!129 = distinct !{!129, !116, !130}
!130 = !DILocation(line: 225, column: 3, scope: !107)
!131 = !DILocation(line: 228, column: 77, scope: !107)
!132 = !DILocation(line: 231, column: 3, scope: !107)
!133 = !DILocation(line: 231, column: 78, scope: !107)
!134 = !DILocation(line: 231, column: 84, scope: !107)
!135 = !DILocation(line: 231, column: 105, scope: !107)
!136 = !DILocation(line: 233, column: 10, scope: !137)
!137 = distinct !DILexicalBlock(scope: !138, file: !3, line: 233, column: 9)
!138 = distinct !DILexicalBlock(scope: !107, file: !3, line: 232, column: 3)
!139 = !DILocation(line: 233, column: 26, scope: !137)
!140 = !DILocation(line: 233, column: 24, scope: !137)
!141 = !DILocation(line: 233, column: 37, scope: !137)
!142 = !DILocation(line: 233, column: 9, scope: !138)
!143 = !DILocation(line: 235, column: 7, scope: !144)
!144 = distinct !DILexicalBlock(scope: !137, file: !3, line: 234, column: 5)
!145 = distinct !{!145, !132, !146}
!146 = !DILocation(line: 237, column: 3, scope: !107)
!147 = !DILocation(line: 240, column: 19, scope: !107)
!148 = !DILocation(line: 243, column: 20, scope: !149)
!149 = distinct !DILexicalBlock(scope: !107, file: !3, line: 243, column: 7)
!150 = !DILocation(line: 243, column: 7, scope: !149)
!151 = !DILocation(line: 243, column: 32, scope: !149)
!152 = !DILocation(line: 243, column: 7, scope: !107)
!153 = !DILocation(line: 245, column: 5, scope: !154)
!154 = distinct !DILexicalBlock(scope: !149, file: !3, line: 244, column: 3)
!155 = !DILocation(line: 249, column: 75, scope: !107)
!156 = !DILocation(line: 252, column: 75, scope: !107)
!157 = !DILocation(line: 255, column: 15, scope: !107)
!158 = !DILocation(line: 255, column: 13, scope: !107)
!159 = !DILocation(line: 258, column: 3, scope: !107)
!160 = !DILocation(line: 258, column: 77, scope: !107)
!161 = !DILocation(line: 258, column: 81, scope: !107)
!162 = !DILocation(line: 258, column: 103, scope: !107)
!163 = !DILocation(line: 260, column: 9, scope: !164)
!164 = distinct !DILexicalBlock(scope: !165, file: !3, line: 260, column: 8)
!165 = distinct !DILexicalBlock(scope: !107, file: !3, line: 259, column: 3)
!166 = !DILocation(line: 260, column: 25, scope: !164)
!167 = !DILocation(line: 260, column: 23, scope: !164)
!168 = !DILocation(line: 260, column: 36, scope: !164)
!169 = !DILocation(line: 260, column: 8, scope: !165)
!170 = !DILocation(line: 262, column: 7, scope: !171)
!171 = distinct !DILexicalBlock(scope: !164, file: !3, line: 261, column: 5)
!172 = distinct !{!172, !159, !173}
!173 = !DILocation(line: 264, column: 3, scope: !107)
!174 = !DILocation(line: 267, column: 77, scope: !107)
!175 = !DILocation(line: 270, column: 78, scope: !107)
!176 = !DILocation(line: 273, column: 78, scope: !107)
!177 = !DILocation(line: 276, column: 76, scope: !107)
!178 = !DILocation(line: 279, column: 74, scope: !107)
!179 = !DILocation(line: 281, column: 3, scope: !107)
!180 = !DILocation(line: 282, column: 1, scope: !107)
!181 = distinct !DISubprogram(name: "HAL_RCC_OscConfig", scope: !3, file: !3, line: 298, type: !182, scopeLine: 299, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !97)
!182 = !DISubroutineType(types: !183)
!183 = !{!110, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_OscInitTypeDef", file: !186, line: 245, baseType: !187)
!186 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal_rcc.h", directory: "/home/sri/zephyrproject")
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !186, line: 212, size: 416, elements: !188)
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "OscillatorType", scope: !187, file: !186, line: 214, baseType: !6, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "HSEState", scope: !187, file: !186, line: 217, baseType: !6, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "LSEState", scope: !187, file: !186, line: 220, baseType: !6, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "HSIState", scope: !187, file: !186, line: 223, baseType: !6, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "HSICalibrationValue", scope: !187, file: !186, line: 226, baseType: !6, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "HSI14State", scope: !187, file: !186, line: 229, baseType: !6, size: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "HSI14CalibrationValue", scope: !187, file: !186, line: 232, baseType: !6, size: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "LSIState", scope: !187, file: !186, line: 235, baseType: !6, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "HSI48State", scope: !187, file: !186, line: 239, baseType: !6, size: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "PLL", scope: !187, file: !186, line: 243, baseType: !199, size: 128, offset: 288)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_PLLInitTypeDef", file: !186, line: 207, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !186, line: 193, size: 128, elements: !201)
!201 = !{!202, !203, !204, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "PLLState", scope: !200, file: !186, line: 195, baseType: !6, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "PLLSource", scope: !200, file: !186, line: 198, baseType: !6, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "PLLMUL", scope: !200, file: !186, line: 201, baseType: !6, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "PREDIV", scope: !200, file: !186, line: 204, baseType: !6, size: 32, offset: 96)
!206 = !DILocalVariable(name: "RCC_OscInitStruct", arg: 1, scope: !181, file: !3, line: 298, type: !184)
!207 = !DILocation(line: 298, column: 57, scope: !181)
!208 = !DILocalVariable(name: "tickstart", scope: !181, file: !3, line: 300, type: !6)
!209 = !DILocation(line: 300, column: 12, scope: !181)
!210 = !DILocalVariable(name: "pll_config", scope: !181, file: !3, line: 301, type: !6)
!211 = !DILocation(line: 301, column: 12, scope: !181)
!212 = !DILocalVariable(name: "pll_config2", scope: !181, file: !3, line: 302, type: !6)
!213 = !DILocation(line: 302, column: 12, scope: !181)
!214 = !DILocation(line: 305, column: 6, scope: !215)
!215 = distinct !DILexicalBlock(scope: !181, file: !3, line: 305, column: 6)
!216 = !DILocation(line: 305, column: 24, scope: !215)
!217 = !DILocation(line: 305, column: 6, scope: !181)
!218 = !DILocation(line: 307, column: 5, scope: !219)
!219 = distinct !DILexicalBlock(scope: !215, file: !3, line: 306, column: 3)
!220 = !DILocation(line: 314, column: 8, scope: !221)
!221 = distinct !DILexicalBlock(scope: !181, file: !3, line: 314, column: 6)
!222 = !DILocation(line: 314, column: 27, scope: !221)
!223 = !DILocation(line: 314, column: 43, scope: !221)
!224 = !DILocation(line: 314, column: 60, scope: !221)
!225 = !DILocation(line: 314, column: 6, scope: !181)
!226 = !DILocation(line: 320, column: 87, scope: !227)
!227 = distinct !DILexicalBlock(scope: !228, file: !3, line: 320, column: 8)
!228 = distinct !DILexicalBlock(scope: !221, file: !3, line: 315, column: 3)
!229 = !DILocation(line: 320, column: 92, scope: !227)
!230 = !DILocation(line: 320, column: 112, scope: !227)
!231 = !DILocation(line: 321, column: 8, scope: !227)
!232 = !DILocation(line: 321, column: 91, scope: !227)
!233 = !DILocation(line: 321, column: 96, scope: !227)
!234 = !DILocation(line: 321, column: 116, scope: !227)
!235 = !DILocation(line: 321, column: 134, scope: !227)
!236 = !DILocation(line: 321, column: 218, scope: !227)
!237 = !DILocation(line: 321, column: 224, scope: !227)
!238 = !DILocation(line: 321, column: 248, scope: !227)
!239 = !DILocation(line: 320, column: 8, scope: !228)
!240 = !DILocation(line: 323, column: 149, scope: !241)
!241 = distinct !DILexicalBlock(scope: !242, file: !3, line: 323, column: 10)
!242 = distinct !DILexicalBlock(scope: !227, file: !3, line: 322, column: 5)
!243 = !DILocation(line: 323, column: 511, scope: !241)
!244 = !DILocation(line: 323, column: 585, scope: !241)
!245 = !DILocation(line: 323, column: 595, scope: !241)
!246 = !DILocation(line: 323, column: 599, scope: !241)
!247 = !DILocation(line: 323, column: 618, scope: !241)
!248 = !DILocation(line: 323, column: 627, scope: !241)
!249 = !DILocation(line: 323, column: 10, scope: !242)
!250 = !DILocation(line: 325, column: 9, scope: !251)
!251 = distinct !DILexicalBlock(scope: !241, file: !3, line: 324, column: 7)
!252 = !DILocation(line: 327, column: 5, scope: !242)
!253 = !DILocation(line: 331, column: 7, scope: !254)
!254 = distinct !DILexicalBlock(scope: !227, file: !3, line: 329, column: 5)
!255 = !DILocation(line: 331, column: 16, scope: !256)
!256 = distinct !DILexicalBlock(scope: !257, file: !3, line: 331, column: 15)
!257 = distinct !DILexicalBlock(scope: !254, file: !3, line: 331, column: 9)
!258 = !DILocation(line: 331, column: 35, scope: !256)
!259 = !DILocation(line: 331, column: 45, scope: !256)
!260 = !DILocation(line: 331, column: 15, scope: !257)
!261 = !DILocation(line: 331, column: 137, scope: !262)
!262 = distinct !DILexicalBlock(scope: !256, file: !3, line: 331, column: 63)
!263 = !DILocation(line: 331, column: 161, scope: !262)
!264 = !DILocation(line: 331, column: 173, scope: !265)
!265 = distinct !DILexicalBlock(scope: !256, file: !3, line: 331, column: 172)
!266 = !DILocation(line: 331, column: 192, scope: !265)
!267 = !DILocation(line: 331, column: 202, scope: !265)
!268 = !DILocation(line: 331, column: 172, scope: !256)
!269 = !DILocation(line: 331, column: 294, scope: !270)
!270 = distinct !DILexicalBlock(scope: !265, file: !3, line: 331, column: 220)
!271 = !DILocation(line: 331, column: 391, scope: !270)
!272 = !DILocation(line: 331, column: 416, scope: !270)
!273 = !DILocation(line: 331, column: 428, scope: !274)
!274 = distinct !DILexicalBlock(scope: !265, file: !3, line: 331, column: 427)
!275 = !DILocation(line: 331, column: 447, scope: !274)
!276 = !DILocation(line: 331, column: 457, scope: !274)
!277 = !DILocation(line: 331, column: 427, scope: !265)
!278 = !DILocation(line: 331, column: 549, scope: !279)
!279 = distinct !DILexicalBlock(scope: !274, file: !3, line: 331, column: 475)
!280 = !DILocation(line: 331, column: 645, scope: !279)
!281 = !DILocation(line: 331, column: 669, scope: !279)
!282 = !DILocation(line: 331, column: 750, scope: !283)
!283 = distinct !DILexicalBlock(scope: !274, file: !3, line: 331, column: 676)
!284 = !DILocation(line: 331, column: 847, scope: !283)
!285 = !DILocation(line: 331, column: 874, scope: !257)
!286 = !DILocation(line: 335, column: 10, scope: !287)
!287 = distinct !DILexicalBlock(scope: !254, file: !3, line: 335, column: 10)
!288 = !DILocation(line: 335, column: 29, scope: !287)
!289 = !DILocation(line: 335, column: 38, scope: !287)
!290 = !DILocation(line: 335, column: 10, scope: !254)
!291 = !DILocation(line: 338, column: 21, scope: !292)
!292 = distinct !DILexicalBlock(scope: !287, file: !3, line: 336, column: 7)
!293 = !DILocation(line: 338, column: 19, scope: !292)
!294 = !DILocation(line: 341, column: 9, scope: !292)
!295 = !DILocation(line: 341, column: 153, scope: !292)
!296 = !DILocation(line: 341, column: 515, scope: !292)
!297 = !DILocation(line: 341, column: 589, scope: !292)
!298 = !DILocation(line: 343, column: 15, scope: !299)
!299 = distinct !DILexicalBlock(scope: !300, file: !3, line: 343, column: 14)
!300 = distinct !DILexicalBlock(scope: !292, file: !3, line: 342, column: 9)
!301 = !DILocation(line: 343, column: 31, scope: !299)
!302 = !DILocation(line: 343, column: 29, scope: !299)
!303 = !DILocation(line: 343, column: 43, scope: !299)
!304 = !DILocation(line: 343, column: 14, scope: !300)
!305 = !DILocation(line: 345, column: 13, scope: !306)
!306 = distinct !DILexicalBlock(scope: !299, file: !3, line: 344, column: 11)
!307 = distinct !{!307, !294, !308}
!308 = !DILocation(line: 347, column: 9, scope: !292)
!309 = !DILocation(line: 348, column: 7, scope: !292)
!310 = !DILocation(line: 352, column: 21, scope: !311)
!311 = distinct !DILexicalBlock(scope: !287, file: !3, line: 350, column: 7)
!312 = !DILocation(line: 352, column: 19, scope: !311)
!313 = !DILocation(line: 355, column: 9, scope: !311)
!314 = !DILocation(line: 355, column: 153, scope: !311)
!315 = !DILocation(line: 355, column: 515, scope: !311)
!316 = !DILocation(line: 355, column: 589, scope: !311)
!317 = !DILocation(line: 357, column: 16, scope: !318)
!318 = distinct !DILexicalBlock(scope: !319, file: !3, line: 357, column: 15)
!319 = distinct !DILexicalBlock(scope: !311, file: !3, line: 356, column: 9)
!320 = !DILocation(line: 357, column: 32, scope: !318)
!321 = !DILocation(line: 357, column: 30, scope: !318)
!322 = !DILocation(line: 357, column: 44, scope: !318)
!323 = !DILocation(line: 357, column: 15, scope: !319)
!324 = !DILocation(line: 359, column: 13, scope: !325)
!325 = distinct !DILexicalBlock(scope: !318, file: !3, line: 358, column: 11)
!326 = distinct !{!326, !313, !327}
!327 = !DILocation(line: 361, column: 9, scope: !311)
!328 = !DILocation(line: 364, column: 3, scope: !228)
!329 = !DILocation(line: 366, column: 8, scope: !330)
!330 = distinct !DILexicalBlock(scope: !181, file: !3, line: 366, column: 6)
!331 = !DILocation(line: 366, column: 27, scope: !330)
!332 = !DILocation(line: 366, column: 43, scope: !330)
!333 = !DILocation(line: 366, column: 60, scope: !330)
!334 = !DILocation(line: 366, column: 6, scope: !181)
!335 = !DILocation(line: 373, column: 87, scope: !336)
!336 = distinct !DILexicalBlock(scope: !337, file: !3, line: 373, column: 8)
!337 = distinct !DILexicalBlock(scope: !330, file: !3, line: 367, column: 3)
!338 = !DILocation(line: 373, column: 92, scope: !336)
!339 = !DILocation(line: 373, column: 112, scope: !336)
!340 = !DILocation(line: 374, column: 8, scope: !336)
!341 = !DILocation(line: 374, column: 91, scope: !336)
!342 = !DILocation(line: 374, column: 96, scope: !336)
!343 = !DILocation(line: 374, column: 116, scope: !336)
!344 = !DILocation(line: 374, column: 134, scope: !336)
!345 = !DILocation(line: 374, column: 218, scope: !336)
!346 = !DILocation(line: 374, column: 224, scope: !336)
!347 = !DILocation(line: 374, column: 248, scope: !336)
!348 = !DILocation(line: 373, column: 8, scope: !337)
!349 = !DILocation(line: 377, column: 148, scope: !350)
!350 = distinct !DILexicalBlock(scope: !351, file: !3, line: 377, column: 10)
!351 = distinct !DILexicalBlock(scope: !336, file: !3, line: 375, column: 5)
!352 = !DILocation(line: 377, column: 508, scope: !350)
!353 = !DILocation(line: 377, column: 581, scope: !350)
!354 = !DILocation(line: 377, column: 591, scope: !350)
!355 = !DILocation(line: 377, column: 595, scope: !350)
!356 = !DILocation(line: 377, column: 614, scope: !350)
!357 = !DILocation(line: 377, column: 623, scope: !350)
!358 = !DILocation(line: 377, column: 10, scope: !351)
!359 = !DILocation(line: 379, column: 9, scope: !360)
!360 = distinct !DILexicalBlock(scope: !350, file: !3, line: 378, column: 7)
!361 = !DILocation(line: 385, column: 157, scope: !362)
!362 = distinct !DILexicalBlock(scope: !350, file: !3, line: 383, column: 7)
!363 = !DILocation(line: 385, column: 163, scope: !362)
!364 = !DILocation(line: 385, column: 202, scope: !362)
!365 = !DILocation(line: 385, column: 221, scope: !362)
!366 = !DILocation(line: 385, column: 242, scope: !362)
!367 = !DILocation(line: 385, column: 188, scope: !362)
!368 = !DILocation(line: 385, column: 83, scope: !362)
!369 = !DILocation(line: 387, column: 5, scope: !351)
!370 = !DILocation(line: 391, column: 10, scope: !371)
!371 = distinct !DILexicalBlock(scope: !372, file: !3, line: 391, column: 10)
!372 = distinct !DILexicalBlock(scope: !336, file: !3, line: 389, column: 5)
!373 = !DILocation(line: 391, column: 29, scope: !371)
!374 = !DILocation(line: 391, column: 38, scope: !371)
!375 = !DILocation(line: 391, column: 10, scope: !372)
!376 = !DILocation(line: 394, column: 81, scope: !377)
!377 = distinct !DILexicalBlock(scope: !371, file: !3, line: 392, column: 7)
!378 = !DILocation(line: 397, column: 21, scope: !377)
!379 = !DILocation(line: 397, column: 19, scope: !377)
!380 = !DILocation(line: 400, column: 9, scope: !377)
!381 = !DILocation(line: 400, column: 152, scope: !377)
!382 = !DILocation(line: 400, column: 512, scope: !377)
!383 = !DILocation(line: 400, column: 585, scope: !377)
!384 = !DILocation(line: 402, column: 15, scope: !385)
!385 = distinct !DILexicalBlock(scope: !386, file: !3, line: 402, column: 14)
!386 = distinct !DILexicalBlock(scope: !377, file: !3, line: 401, column: 9)
!387 = !DILocation(line: 402, column: 31, scope: !385)
!388 = !DILocation(line: 402, column: 29, scope: !385)
!389 = !DILocation(line: 402, column: 43, scope: !385)
!390 = !DILocation(line: 402, column: 14, scope: !386)
!391 = !DILocation(line: 404, column: 13, scope: !392)
!392 = distinct !DILexicalBlock(scope: !385, file: !3, line: 403, column: 11)
!393 = distinct !{!393, !380, !394}
!394 = !DILocation(line: 406, column: 9, scope: !377)
!395 = !DILocation(line: 409, column: 157, scope: !377)
!396 = !DILocation(line: 409, column: 163, scope: !377)
!397 = !DILocation(line: 409, column: 202, scope: !377)
!398 = !DILocation(line: 409, column: 221, scope: !377)
!399 = !DILocation(line: 409, column: 242, scope: !377)
!400 = !DILocation(line: 409, column: 188, scope: !377)
!401 = !DILocation(line: 409, column: 83, scope: !377)
!402 = !DILocation(line: 410, column: 7, scope: !377)
!403 = !DILocation(line: 414, column: 81, scope: !404)
!404 = distinct !DILexicalBlock(scope: !371, file: !3, line: 412, column: 7)
!405 = !DILocation(line: 417, column: 21, scope: !404)
!406 = !DILocation(line: 417, column: 19, scope: !404)
!407 = !DILocation(line: 420, column: 9, scope: !404)
!408 = !DILocation(line: 420, column: 152, scope: !404)
!409 = !DILocation(line: 420, column: 512, scope: !404)
!410 = !DILocation(line: 420, column: 585, scope: !404)
!411 = !DILocation(line: 422, column: 15, scope: !412)
!412 = distinct !DILexicalBlock(scope: !413, file: !3, line: 422, column: 14)
!413 = distinct !DILexicalBlock(scope: !404, file: !3, line: 421, column: 9)
!414 = !DILocation(line: 422, column: 31, scope: !412)
!415 = !DILocation(line: 422, column: 29, scope: !412)
!416 = !DILocation(line: 422, column: 43, scope: !412)
!417 = !DILocation(line: 422, column: 14, scope: !413)
!418 = !DILocation(line: 424, column: 13, scope: !419)
!419 = distinct !DILexicalBlock(scope: !412, file: !3, line: 423, column: 11)
!420 = distinct !{!420, !407, !421}
!421 = !DILocation(line: 426, column: 9, scope: !404)
!422 = !DILocation(line: 429, column: 3, scope: !337)
!423 = !DILocation(line: 431, column: 8, scope: !424)
!424 = distinct !DILexicalBlock(scope: !181, file: !3, line: 431, column: 6)
!425 = !DILocation(line: 431, column: 27, scope: !424)
!426 = !DILocation(line: 431, column: 43, scope: !424)
!427 = !DILocation(line: 431, column: 60, scope: !424)
!428 = !DILocation(line: 431, column: 6, scope: !181)
!429 = !DILocation(line: 437, column: 8, scope: !430)
!430 = distinct !DILexicalBlock(scope: !431, file: !3, line: 437, column: 8)
!431 = distinct !DILexicalBlock(scope: !424, file: !3, line: 432, column: 3)
!432 = !DILocation(line: 437, column: 27, scope: !430)
!433 = !DILocation(line: 437, column: 36, scope: !430)
!434 = !DILocation(line: 437, column: 8, scope: !431)
!435 = !DILocation(line: 440, column: 80, scope: !436)
!436 = distinct !DILexicalBlock(scope: !430, file: !3, line: 438, column: 5)
!437 = !DILocation(line: 443, column: 19, scope: !436)
!438 = !DILocation(line: 443, column: 17, scope: !436)
!439 = !DILocation(line: 446, column: 7, scope: !436)
!440 = !DILocation(line: 446, column: 505, scope: !436)
!441 = !DILocation(line: 446, column: 510, scope: !436)
!442 = !DILocation(line: 446, column: 583, scope: !436)
!443 = !DILocation(line: 448, column: 13, scope: !444)
!444 = distinct !DILexicalBlock(scope: !445, file: !3, line: 448, column: 12)
!445 = distinct !DILexicalBlock(scope: !436, file: !3, line: 447, column: 7)
!446 = !DILocation(line: 448, column: 29, scope: !444)
!447 = !DILocation(line: 448, column: 27, scope: !444)
!448 = !DILocation(line: 448, column: 41, scope: !444)
!449 = !DILocation(line: 448, column: 12, scope: !445)
!450 = !DILocation(line: 450, column: 11, scope: !451)
!451 = distinct !DILexicalBlock(scope: !444, file: !3, line: 449, column: 9)
!452 = distinct !{!452, !439, !453}
!453 = !DILocation(line: 452, column: 7, scope: !436)
!454 = !DILocation(line: 453, column: 5, scope: !436)
!455 = !DILocation(line: 457, column: 80, scope: !456)
!456 = distinct !DILexicalBlock(scope: !430, file: !3, line: 455, column: 5)
!457 = !DILocation(line: 460, column: 19, scope: !456)
!458 = !DILocation(line: 460, column: 17, scope: !456)
!459 = !DILocation(line: 463, column: 7, scope: !456)
!460 = !DILocation(line: 463, column: 505, scope: !456)
!461 = !DILocation(line: 463, column: 510, scope: !456)
!462 = !DILocation(line: 463, column: 583, scope: !456)
!463 = !DILocation(line: 465, column: 13, scope: !464)
!464 = distinct !DILexicalBlock(scope: !465, file: !3, line: 465, column: 12)
!465 = distinct !DILexicalBlock(scope: !456, file: !3, line: 464, column: 7)
!466 = !DILocation(line: 465, column: 29, scope: !464)
!467 = !DILocation(line: 465, column: 27, scope: !464)
!468 = !DILocation(line: 465, column: 41, scope: !464)
!469 = !DILocation(line: 465, column: 12, scope: !465)
!470 = !DILocation(line: 467, column: 11, scope: !471)
!471 = distinct !DILexicalBlock(scope: !464, file: !3, line: 466, column: 9)
!472 = distinct !{!472, !459, !473}
!473 = !DILocation(line: 469, column: 7, scope: !456)
!474 = !DILocation(line: 471, column: 3, scope: !431)
!475 = !DILocation(line: 473, column: 8, scope: !476)
!476 = distinct !DILexicalBlock(scope: !181, file: !3, line: 473, column: 6)
!477 = !DILocation(line: 473, column: 27, scope: !476)
!478 = !DILocation(line: 473, column: 43, scope: !476)
!479 = !DILocation(line: 473, column: 60, scope: !476)
!480 = !DILocation(line: 473, column: 6, scope: !181)
!481 = !DILocalVariable(name: "pwrclkchanged", scope: !482, file: !3, line: 475, type: !483)
!482 = distinct !DILexicalBlock(scope: !476, file: !3, line: 474, column: 3)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "FlagStatus", file: !21, line: 171, baseType: !20)
!484 = !DILocation(line: 475, column: 16, scope: !482)
!485 = !DILocation(line: 482, column: 76, scope: !486)
!486 = distinct !DILexicalBlock(scope: !482, file: !3, line: 482, column: 8)
!487 = !DILocation(line: 482, column: 84, scope: !486)
!488 = !DILocation(line: 482, column: 106, scope: !486)
!489 = !DILocation(line: 482, column: 8, scope: !482)
!490 = !DILocation(line: 484, column: 7, scope: !491)
!491 = distinct !DILexicalBlock(scope: !486, file: !3, line: 483, column: 5)
!492 = !DILocalVariable(name: "tmpreg", scope: !493, file: !3, line: 484, type: !32)
!493 = distinct !DILexicalBlock(scope: !491, file: !3, line: 484, column: 10)
!494 = !DILocation(line: 484, column: 30, scope: !493)
!495 = !DILocation(line: 484, column: 115, scope: !493)
!496 = !DILocation(line: 484, column: 216, scope: !493)
!497 = !DILocation(line: 484, column: 225, scope: !493)
!498 = !DILocation(line: 484, column: 146, scope: !493)
!499 = !DILocation(line: 484, column: 254, scope: !493)
!500 = !DILocation(line: 484, column: 262, scope: !493)
!501 = !DILocation(line: 485, column: 21, scope: !491)
!502 = !DILocation(line: 486, column: 5, scope: !491)
!503 = !DILocation(line: 488, column: 60, scope: !504)
!504 = distinct !DILexicalBlock(scope: !482, file: !3, line: 488, column: 8)
!505 = !DILocation(line: 488, column: 64, scope: !504)
!506 = !DILocation(line: 488, column: 85, scope: !504)
!507 = !DILocation(line: 488, column: 8, scope: !482)
!508 = !DILocation(line: 491, column: 62, scope: !509)
!509 = distinct !DILexicalBlock(scope: !504, file: !3, line: 489, column: 5)
!510 = !DILocation(line: 494, column: 19, scope: !509)
!511 = !DILocation(line: 494, column: 17, scope: !509)
!512 = !DILocation(line: 496, column: 7, scope: !509)
!513 = !DILocation(line: 496, column: 65, scope: !509)
!514 = !DILocation(line: 496, column: 69, scope: !509)
!515 = !DILocation(line: 496, column: 90, scope: !509)
!516 = !DILocation(line: 498, column: 13, scope: !517)
!517 = distinct !DILexicalBlock(scope: !518, file: !3, line: 498, column: 12)
!518 = distinct !DILexicalBlock(scope: !509, file: !3, line: 497, column: 7)
!519 = !DILocation(line: 498, column: 29, scope: !517)
!520 = !DILocation(line: 498, column: 27, scope: !517)
!521 = !DILocation(line: 498, column: 40, scope: !517)
!522 = !DILocation(line: 498, column: 12, scope: !518)
!523 = !DILocation(line: 500, column: 11, scope: !524)
!524 = distinct !DILexicalBlock(scope: !517, file: !3, line: 499, column: 9)
!525 = distinct !{!525, !512, !526}
!526 = !DILocation(line: 502, column: 7, scope: !509)
!527 = !DILocation(line: 503, column: 5, scope: !509)
!528 = !DILocation(line: 506, column: 5, scope: !482)
!529 = !DILocation(line: 506, column: 14, scope: !530)
!530 = distinct !DILexicalBlock(scope: !531, file: !3, line: 506, column: 13)
!531 = distinct !DILexicalBlock(scope: !482, file: !3, line: 506, column: 7)
!532 = !DILocation(line: 506, column: 33, scope: !530)
!533 = !DILocation(line: 506, column: 43, scope: !530)
!534 = !DILocation(line: 506, column: 13, scope: !531)
!535 = !DILocation(line: 506, column: 137, scope: !536)
!536 = distinct !DILexicalBlock(scope: !530, file: !3, line: 506, column: 61)
!537 = !DILocation(line: 506, column: 160, scope: !536)
!538 = !DILocation(line: 506, column: 172, scope: !539)
!539 = distinct !DILexicalBlock(scope: !530, file: !3, line: 506, column: 171)
!540 = !DILocation(line: 506, column: 191, scope: !539)
!541 = !DILocation(line: 506, column: 201, scope: !539)
!542 = !DILocation(line: 506, column: 171, scope: !530)
!543 = !DILocation(line: 506, column: 295, scope: !544)
!544 = distinct !DILexicalBlock(scope: !539, file: !3, line: 506, column: 219)
!545 = !DILocation(line: 506, column: 393, scope: !544)
!546 = !DILocation(line: 506, column: 417, scope: !544)
!547 = !DILocation(line: 506, column: 429, scope: !548)
!548 = distinct !DILexicalBlock(scope: !539, file: !3, line: 506, column: 428)
!549 = !DILocation(line: 506, column: 448, scope: !548)
!550 = !DILocation(line: 506, column: 458, scope: !548)
!551 = !DILocation(line: 506, column: 428, scope: !539)
!552 = !DILocation(line: 506, column: 552, scope: !553)
!553 = distinct !DILexicalBlock(scope: !548, file: !3, line: 506, column: 476)
!554 = !DILocation(line: 506, column: 649, scope: !553)
!555 = !DILocation(line: 506, column: 672, scope: !553)
!556 = !DILocation(line: 506, column: 755, scope: !557)
!557 = distinct !DILexicalBlock(scope: !548, file: !3, line: 506, column: 679)
!558 = !DILocation(line: 506, column: 853, scope: !557)
!559 = !DILocation(line: 506, column: 879, scope: !531)
!560 = !DILocation(line: 508, column: 8, scope: !561)
!561 = distinct !DILexicalBlock(scope: !482, file: !3, line: 508, column: 8)
!562 = !DILocation(line: 508, column: 27, scope: !561)
!563 = !DILocation(line: 508, column: 36, scope: !561)
!564 = !DILocation(line: 508, column: 8, scope: !482)
!565 = !DILocation(line: 511, column: 19, scope: !566)
!566 = distinct !DILexicalBlock(scope: !561, file: !3, line: 509, column: 5)
!567 = !DILocation(line: 511, column: 17, scope: !566)
!568 = !DILocation(line: 514, column: 7, scope: !566)
!569 = !DILocation(line: 514, column: 432, scope: !566)
!570 = !DILocation(line: 514, column: 510, scope: !566)
!571 = !DILocation(line: 514, column: 583, scope: !566)
!572 = !DILocation(line: 516, column: 13, scope: !573)
!573 = distinct !DILexicalBlock(scope: !574, file: !3, line: 516, column: 12)
!574 = distinct !DILexicalBlock(scope: !566, file: !3, line: 515, column: 7)
!575 = !DILocation(line: 516, column: 29, scope: !573)
!576 = !DILocation(line: 516, column: 27, scope: !573)
!577 = !DILocation(line: 516, column: 41, scope: !573)
!578 = !DILocation(line: 516, column: 12, scope: !574)
!579 = !DILocation(line: 518, column: 11, scope: !580)
!580 = distinct !DILexicalBlock(scope: !573, file: !3, line: 517, column: 9)
!581 = distinct !{!581, !568, !582}
!582 = !DILocation(line: 520, column: 7, scope: !566)
!583 = !DILocation(line: 521, column: 5, scope: !566)
!584 = !DILocation(line: 525, column: 19, scope: !585)
!585 = distinct !DILexicalBlock(scope: !561, file: !3, line: 523, column: 5)
!586 = !DILocation(line: 525, column: 17, scope: !585)
!587 = !DILocation(line: 528, column: 7, scope: !585)
!588 = !DILocation(line: 528, column: 432, scope: !585)
!589 = !DILocation(line: 528, column: 510, scope: !585)
!590 = !DILocation(line: 528, column: 583, scope: !585)
!591 = !DILocation(line: 530, column: 13, scope: !592)
!592 = distinct !DILexicalBlock(scope: !593, file: !3, line: 530, column: 12)
!593 = distinct !DILexicalBlock(scope: !585, file: !3, line: 529, column: 7)
!594 = !DILocation(line: 530, column: 29, scope: !592)
!595 = !DILocation(line: 530, column: 27, scope: !592)
!596 = !DILocation(line: 530, column: 41, scope: !592)
!597 = !DILocation(line: 530, column: 12, scope: !593)
!598 = !DILocation(line: 532, column: 11, scope: !599)
!599 = distinct !DILexicalBlock(scope: !592, file: !3, line: 531, column: 9)
!600 = distinct !{!600, !587, !601}
!601 = !DILocation(line: 534, column: 7, scope: !585)
!602 = !DILocation(line: 538, column: 8, scope: !603)
!603 = distinct !DILexicalBlock(scope: !482, file: !3, line: 538, column: 8)
!604 = !DILocation(line: 538, column: 22, scope: !603)
!605 = !DILocation(line: 538, column: 8, scope: !482)
!606 = !DILocation(line: 540, column: 82, scope: !607)
!607 = distinct !DILexicalBlock(scope: !603, file: !3, line: 539, column: 5)
!608 = !DILocation(line: 541, column: 5, scope: !607)
!609 = !DILocation(line: 542, column: 3, scope: !482)
!610 = !DILocation(line: 545, column: 8, scope: !611)
!611 = distinct !DILexicalBlock(scope: !181, file: !3, line: 545, column: 6)
!612 = !DILocation(line: 545, column: 27, scope: !611)
!613 = !DILocation(line: 545, column: 43, scope: !611)
!614 = !DILocation(line: 545, column: 60, scope: !611)
!615 = !DILocation(line: 545, column: 6, scope: !181)
!616 = !DILocation(line: 552, column: 8, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !3, line: 552, column: 8)
!618 = distinct !DILexicalBlock(scope: !611, file: !3, line: 546, column: 3)
!619 = !DILocation(line: 552, column: 27, scope: !617)
!620 = !DILocation(line: 552, column: 38, scope: !617)
!621 = !DILocation(line: 552, column: 8, scope: !618)
!622 = !DILocation(line: 555, column: 80, scope: !623)
!623 = distinct !DILexicalBlock(scope: !617, file: !3, line: 553, column: 5)
!624 = !DILocation(line: 558, column: 80, scope: !623)
!625 = !DILocation(line: 561, column: 19, scope: !623)
!626 = !DILocation(line: 561, column: 17, scope: !623)
!627 = !DILocation(line: 564, column: 7, scope: !623)
!628 = !DILocation(line: 564, column: 290, scope: !623)
!629 = !DILocation(line: 564, column: 510, scope: !623)
!630 = !DILocation(line: 564, column: 583, scope: !623)
!631 = !DILocation(line: 566, column: 13, scope: !632)
!632 = distinct !DILexicalBlock(scope: !633, file: !3, line: 566, column: 12)
!633 = distinct !DILexicalBlock(scope: !623, file: !3, line: 565, column: 7)
!634 = !DILocation(line: 566, column: 29, scope: !632)
!635 = !DILocation(line: 566, column: 27, scope: !632)
!636 = !DILocation(line: 566, column: 40, scope: !632)
!637 = !DILocation(line: 566, column: 12, scope: !633)
!638 = !DILocation(line: 568, column: 11, scope: !639)
!639 = distinct !DILexicalBlock(scope: !632, file: !3, line: 567, column: 9)
!640 = distinct !{!640, !627, !641}
!641 = !DILocation(line: 570, column: 7, scope: !623)
!642 = !DILocation(line: 573, column: 156, scope: !623)
!643 = !DILocation(line: 573, column: 163, scope: !623)
!644 = !DILocation(line: 573, column: 202, scope: !623)
!645 = !DILocation(line: 573, column: 221, scope: !623)
!646 = !DILocation(line: 573, column: 244, scope: !623)
!647 = !DILocation(line: 573, column: 188, scope: !623)
!648 = !DILocation(line: 573, column: 82, scope: !623)
!649 = !DILocation(line: 574, column: 5, scope: !623)
!650 = !DILocation(line: 575, column: 13, scope: !651)
!651 = distinct !DILexicalBlock(scope: !617, file: !3, line: 575, column: 13)
!652 = !DILocation(line: 575, column: 32, scope: !651)
!653 = !DILocation(line: 575, column: 43, scope: !651)
!654 = !DILocation(line: 575, column: 13, scope: !617)
!655 = !DILocation(line: 578, column: 80, scope: !656)
!656 = distinct !DILexicalBlock(scope: !651, file: !3, line: 576, column: 5)
!657 = !DILocation(line: 581, column: 156, scope: !656)
!658 = !DILocation(line: 581, column: 163, scope: !656)
!659 = !DILocation(line: 581, column: 202, scope: !656)
!660 = !DILocation(line: 581, column: 221, scope: !656)
!661 = !DILocation(line: 581, column: 244, scope: !656)
!662 = !DILocation(line: 581, column: 188, scope: !656)
!663 = !DILocation(line: 581, column: 82, scope: !656)
!664 = !DILocation(line: 582, column: 5, scope: !656)
!665 = !DILocation(line: 586, column: 80, scope: !666)
!666 = distinct !DILexicalBlock(scope: !651, file: !3, line: 584, column: 5)
!667 = !DILocation(line: 589, column: 80, scope: !666)
!668 = !DILocation(line: 592, column: 19, scope: !666)
!669 = !DILocation(line: 592, column: 17, scope: !666)
!670 = !DILocation(line: 595, column: 7, scope: !666)
!671 = !DILocation(line: 595, column: 290, scope: !666)
!672 = !DILocation(line: 595, column: 510, scope: !666)
!673 = !DILocation(line: 595, column: 583, scope: !666)
!674 = !DILocation(line: 597, column: 13, scope: !675)
!675 = distinct !DILexicalBlock(scope: !676, file: !3, line: 597, column: 12)
!676 = distinct !DILexicalBlock(scope: !666, file: !3, line: 596, column: 7)
!677 = !DILocation(line: 597, column: 29, scope: !675)
!678 = !DILocation(line: 597, column: 27, scope: !675)
!679 = !DILocation(line: 597, column: 40, scope: !675)
!680 = !DILocation(line: 597, column: 12, scope: !676)
!681 = !DILocation(line: 599, column: 11, scope: !682)
!682 = distinct !DILexicalBlock(scope: !675, file: !3, line: 598, column: 9)
!683 = distinct !{!683, !670, !684}
!684 = !DILocation(line: 601, column: 7, scope: !666)
!685 = !DILocation(line: 603, column: 3, scope: !618)
!686 = !DILocation(line: 607, column: 8, scope: !687)
!687 = distinct !DILexicalBlock(scope: !181, file: !3, line: 607, column: 6)
!688 = !DILocation(line: 607, column: 27, scope: !687)
!689 = !DILocation(line: 607, column: 43, scope: !687)
!690 = !DILocation(line: 607, column: 60, scope: !687)
!691 = !DILocation(line: 607, column: 6, scope: !181)
!692 = !DILocation(line: 613, column: 87, scope: !693)
!693 = distinct !DILexicalBlock(scope: !694, file: !3, line: 613, column: 8)
!694 = distinct !DILexicalBlock(scope: !687, file: !3, line: 608, column: 3)
!695 = !DILocation(line: 613, column: 92, scope: !693)
!696 = !DILocation(line: 613, column: 112, scope: !693)
!697 = !DILocation(line: 613, column: 130, scope: !693)
!698 = !DILocation(line: 614, column: 88, scope: !693)
!699 = !DILocation(line: 614, column: 93, scope: !693)
!700 = !DILocation(line: 614, column: 113, scope: !693)
!701 = !DILocation(line: 614, column: 131, scope: !693)
!702 = !DILocation(line: 614, column: 215, scope: !693)
!703 = !DILocation(line: 614, column: 221, scope: !693)
!704 = !DILocation(line: 614, column: 245, scope: !693)
!705 = !DILocation(line: 613, column: 8, scope: !694)
!706 = !DILocation(line: 616, column: 290, scope: !707)
!707 = distinct !DILexicalBlock(scope: !708, file: !3, line: 616, column: 10)
!708 = distinct !DILexicalBlock(scope: !693, file: !3, line: 615, column: 5)
!709 = !DILocation(line: 616, column: 511, scope: !707)
!710 = !DILocation(line: 616, column: 585, scope: !707)
!711 = !DILocation(line: 616, column: 595, scope: !707)
!712 = !DILocation(line: 616, column: 599, scope: !707)
!713 = !DILocation(line: 616, column: 618, scope: !707)
!714 = !DILocation(line: 616, column: 629, scope: !707)
!715 = !DILocation(line: 616, column: 10, scope: !708)
!716 = !DILocation(line: 618, column: 9, scope: !717)
!717 = distinct !DILexicalBlock(scope: !707, file: !3, line: 617, column: 7)
!718 = !DILocation(line: 620, column: 5, scope: !708)
!719 = !DILocation(line: 624, column: 10, scope: !720)
!720 = distinct !DILexicalBlock(scope: !721, file: !3, line: 624, column: 10)
!721 = distinct !DILexicalBlock(scope: !693, file: !3, line: 622, column: 5)
!722 = !DILocation(line: 624, column: 29, scope: !720)
!723 = !DILocation(line: 624, column: 40, scope: !720)
!724 = !DILocation(line: 624, column: 10, scope: !721)
!725 = !DILocation(line: 627, column: 82, scope: !726)
!726 = distinct !DILexicalBlock(scope: !720, file: !3, line: 625, column: 7)
!727 = !DILocation(line: 630, column: 21, scope: !726)
!728 = !DILocation(line: 630, column: 19, scope: !726)
!729 = !DILocation(line: 633, column: 9, scope: !726)
!730 = !DILocation(line: 633, column: 294, scope: !726)
!731 = !DILocation(line: 633, column: 515, scope: !726)
!732 = !DILocation(line: 633, column: 589, scope: !726)
!733 = !DILocation(line: 635, column: 15, scope: !734)
!734 = distinct !DILexicalBlock(scope: !735, file: !3, line: 635, column: 14)
!735 = distinct !DILexicalBlock(scope: !726, file: !3, line: 634, column: 9)
!736 = !DILocation(line: 635, column: 31, scope: !734)
!737 = !DILocation(line: 635, column: 29, scope: !734)
!738 = !DILocation(line: 635, column: 42, scope: !734)
!739 = !DILocation(line: 635, column: 14, scope: !735)
!740 = !DILocation(line: 637, column: 13, scope: !741)
!741 = distinct !DILexicalBlock(scope: !734, file: !3, line: 636, column: 11)
!742 = distinct !{!742, !729, !743}
!743 = !DILocation(line: 639, column: 9, scope: !726)
!744 = !DILocation(line: 640, column: 7, scope: !726)
!745 = !DILocation(line: 644, column: 82, scope: !746)
!746 = distinct !DILexicalBlock(scope: !720, file: !3, line: 642, column: 7)
!747 = !DILocation(line: 647, column: 21, scope: !746)
!748 = !DILocation(line: 647, column: 19, scope: !746)
!749 = !DILocation(line: 650, column: 9, scope: !746)
!750 = !DILocation(line: 650, column: 294, scope: !746)
!751 = !DILocation(line: 650, column: 515, scope: !746)
!752 = !DILocation(line: 650, column: 589, scope: !746)
!753 = !DILocation(line: 652, column: 15, scope: !754)
!754 = distinct !DILexicalBlock(scope: !755, file: !3, line: 652, column: 14)
!755 = distinct !DILexicalBlock(scope: !746, file: !3, line: 651, column: 9)
!756 = !DILocation(line: 652, column: 31, scope: !754)
!757 = !DILocation(line: 652, column: 29, scope: !754)
!758 = !DILocation(line: 652, column: 42, scope: !754)
!759 = !DILocation(line: 652, column: 14, scope: !755)
!760 = !DILocation(line: 654, column: 13, scope: !761)
!761 = distinct !DILexicalBlock(scope: !754, file: !3, line: 653, column: 11)
!762 = distinct !{!762, !749, !763}
!763 = !DILocation(line: 656, column: 9, scope: !746)
!764 = !DILocation(line: 659, column: 3, scope: !694)
!765 = !DILocation(line: 665, column: 8, scope: !766)
!766 = distinct !DILexicalBlock(scope: !181, file: !3, line: 665, column: 7)
!767 = !DILocation(line: 665, column: 27, scope: !766)
!768 = !DILocation(line: 665, column: 31, scope: !766)
!769 = !DILocation(line: 665, column: 41, scope: !766)
!770 = !DILocation(line: 665, column: 7, scope: !181)
!771 = !DILocation(line: 668, column: 86, scope: !772)
!772 = distinct !DILexicalBlock(scope: !773, file: !3, line: 668, column: 8)
!773 = distinct !DILexicalBlock(scope: !766, file: !3, line: 666, column: 3)
!774 = !DILocation(line: 668, column: 91, scope: !772)
!775 = !DILocation(line: 668, column: 111, scope: !772)
!776 = !DILocation(line: 668, column: 8, scope: !773)
!777 = !DILocation(line: 670, column: 11, scope: !778)
!778 = distinct !DILexicalBlock(scope: !779, file: !3, line: 670, column: 10)
!779 = distinct !DILexicalBlock(scope: !772, file: !3, line: 669, column: 5)
!780 = !DILocation(line: 670, column: 30, scope: !778)
!781 = !DILocation(line: 670, column: 34, scope: !778)
!782 = !DILocation(line: 670, column: 44, scope: !778)
!783 = !DILocation(line: 670, column: 10, scope: !779)
!784 = !DILocation(line: 678, column: 81, scope: !785)
!785 = distinct !DILexicalBlock(scope: !778, file: !3, line: 671, column: 7)
!786 = !DILocation(line: 681, column: 21, scope: !785)
!787 = !DILocation(line: 681, column: 19, scope: !785)
!788 = !DILocation(line: 684, column: 9, scope: !785)
!789 = !DILocation(line: 684, column: 153, scope: !785)
!790 = !DILocation(line: 684, column: 515, scope: !785)
!791 = !DILocation(line: 684, column: 589, scope: !785)
!792 = !DILocation(line: 686, column: 15, scope: !793)
!793 = distinct !DILexicalBlock(scope: !794, file: !3, line: 686, column: 14)
!794 = distinct !DILexicalBlock(scope: !785, file: !3, line: 685, column: 9)
!795 = !DILocation(line: 686, column: 31, scope: !793)
!796 = !DILocation(line: 686, column: 29, scope: !793)
!797 = !DILocation(line: 686, column: 43, scope: !793)
!798 = !DILocation(line: 686, column: 14, scope: !794)
!799 = !DILocation(line: 688, column: 13, scope: !800)
!800 = distinct !DILexicalBlock(scope: !793, file: !3, line: 687, column: 11)
!801 = distinct !{!801, !788, !802}
!802 = !DILocation(line: 690, column: 9, scope: !785)
!803 = !DILocation(line: 693, column: 9, scope: !785)
!804 = !DILocation(line: 693, column: 165, scope: !805)
!805 = distinct !DILexicalBlock(scope: !785, file: !3, line: 693, column: 12)
!806 = !DILocation(line: 693, column: 174, scope: !805)
!807 = !DILocation(line: 693, column: 202, scope: !805)
!808 = !DILocation(line: 693, column: 221, scope: !805)
!809 = !DILocation(line: 693, column: 225, scope: !805)
!810 = !DILocation(line: 693, column: 198, scope: !805)
!811 = !DILocation(line: 693, column: 91, scope: !805)
!812 = !DILocation(line: 693, column: 388, scope: !805)
!813 = !DILocation(line: 693, column: 396, scope: !805)
!814 = !DILocation(line: 693, column: 455, scope: !805)
!815 = !DILocation(line: 693, column: 474, scope: !805)
!816 = !DILocation(line: 693, column: 478, scope: !805)
!817 = !DILocation(line: 693, column: 487, scope: !805)
!818 = !DILocation(line: 693, column: 506, scope: !805)
!819 = !DILocation(line: 693, column: 510, scope: !805)
!820 = !DILocation(line: 693, column: 485, scope: !805)
!821 = !DILocation(line: 693, column: 440, scope: !805)
!822 = !DILocation(line: 693, column: 314, scope: !805)
!823 = !DILocation(line: 693, column: 527, scope: !805)
!824 = !DILocation(line: 697, column: 81, scope: !785)
!825 = !DILocation(line: 700, column: 21, scope: !785)
!826 = !DILocation(line: 700, column: 19, scope: !785)
!827 = !DILocation(line: 703, column: 9, scope: !785)
!828 = !DILocation(line: 703, column: 153, scope: !785)
!829 = !DILocation(line: 703, column: 515, scope: !785)
!830 = !DILocation(line: 703, column: 589, scope: !785)
!831 = !DILocation(line: 705, column: 15, scope: !832)
!832 = distinct !DILexicalBlock(scope: !833, file: !3, line: 705, column: 14)
!833 = distinct !DILexicalBlock(scope: !785, file: !3, line: 704, column: 9)
!834 = !DILocation(line: 705, column: 31, scope: !832)
!835 = !DILocation(line: 705, column: 29, scope: !832)
!836 = !DILocation(line: 705, column: 43, scope: !832)
!837 = !DILocation(line: 705, column: 14, scope: !833)
!838 = !DILocation(line: 707, column: 13, scope: !839)
!839 = distinct !DILexicalBlock(scope: !832, file: !3, line: 706, column: 11)
!840 = distinct !{!840, !827, !841}
!841 = !DILocation(line: 709, column: 9, scope: !785)
!842 = !DILocation(line: 710, column: 7, scope: !785)
!843 = !DILocation(line: 714, column: 81, scope: !844)
!844 = distinct !DILexicalBlock(scope: !778, file: !3, line: 712, column: 7)
!845 = !DILocation(line: 717, column: 21, scope: !844)
!846 = !DILocation(line: 717, column: 19, scope: !844)
!847 = !DILocation(line: 720, column: 9, scope: !844)
!848 = !DILocation(line: 720, column: 153, scope: !844)
!849 = !DILocation(line: 720, column: 515, scope: !844)
!850 = !DILocation(line: 720, column: 589, scope: !844)
!851 = !DILocation(line: 722, column: 15, scope: !852)
!852 = distinct !DILexicalBlock(scope: !853, file: !3, line: 722, column: 14)
!853 = distinct !DILexicalBlock(scope: !844, file: !3, line: 721, column: 9)
!854 = !DILocation(line: 722, column: 31, scope: !852)
!855 = !DILocation(line: 722, column: 29, scope: !852)
!856 = !DILocation(line: 722, column: 43, scope: !852)
!857 = !DILocation(line: 722, column: 14, scope: !853)
!858 = !DILocation(line: 724, column: 13, scope: !859)
!859 = distinct !DILexicalBlock(scope: !852, file: !3, line: 723, column: 11)
!860 = distinct !{!860, !847, !861}
!861 = !DILocation(line: 726, column: 9, scope: !844)
!862 = !DILocation(line: 728, column: 5, scope: !779)
!863 = !DILocation(line: 732, column: 11, scope: !864)
!864 = distinct !DILexicalBlock(scope: !865, file: !3, line: 732, column: 10)
!865 = distinct !DILexicalBlock(scope: !772, file: !3, line: 730, column: 5)
!866 = !DILocation(line: 732, column: 30, scope: !864)
!867 = !DILocation(line: 732, column: 34, scope: !864)
!868 = !DILocation(line: 732, column: 44, scope: !864)
!869 = !DILocation(line: 732, column: 10, scope: !865)
!870 = !DILocation(line: 734, column: 9, scope: !871)
!871 = distinct !DILexicalBlock(scope: !864, file: !3, line: 733, column: 7)
!872 = !DILocation(line: 739, column: 88, scope: !873)
!873 = distinct !DILexicalBlock(scope: !864, file: !3, line: 737, column: 7)
!874 = !DILocation(line: 739, column: 20, scope: !873)
!875 = !DILocation(line: 740, column: 89, scope: !873)
!876 = !DILocation(line: 740, column: 21, scope: !873)
!877 = !DILocation(line: 741, column: 15, scope: !878)
!878 = distinct !DILexicalBlock(scope: !873, file: !3, line: 741, column: 12)
!879 = !DILocation(line: 741, column: 27, scope: !878)
!880 = !DILocation(line: 741, column: 52, scope: !878)
!881 = !DILocation(line: 741, column: 71, scope: !878)
!882 = !DILocation(line: 741, column: 75, scope: !878)
!883 = !DILocation(line: 741, column: 49, scope: !878)
!884 = !DILocation(line: 741, column: 86, scope: !878)
!885 = !DILocation(line: 742, column: 15, scope: !878)
!886 = !DILocation(line: 742, column: 28, scope: !878)
!887 = !DILocation(line: 742, column: 52, scope: !878)
!888 = !DILocation(line: 742, column: 71, scope: !878)
!889 = !DILocation(line: 742, column: 75, scope: !878)
!890 = !DILocation(line: 742, column: 49, scope: !878)
!891 = !DILocation(line: 742, column: 83, scope: !878)
!892 = !DILocation(line: 743, column: 15, scope: !878)
!893 = !DILocation(line: 743, column: 27, scope: !878)
!894 = !DILocation(line: 743, column: 52, scope: !878)
!895 = !DILocation(line: 743, column: 71, scope: !878)
!896 = !DILocation(line: 743, column: 75, scope: !878)
!897 = !DILocation(line: 743, column: 49, scope: !878)
!898 = !DILocation(line: 741, column: 12, scope: !873)
!899 = !DILocation(line: 745, column: 11, scope: !900)
!900 = distinct !DILexicalBlock(scope: !878, file: !3, line: 744, column: 9)
!901 = !DILocation(line: 749, column: 3, scope: !773)
!902 = !DILocation(line: 751, column: 3, scope: !181)
!903 = !DILocation(line: 752, column: 1, scope: !181)
!904 = distinct !DISubprogram(name: "HAL_RCC_ClockConfig", scope: !3, file: !3, line: 777, type: !905, scopeLine: 778, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !97)
!905 = !DISubroutineType(types: !906)
!906 = !{!110, !907, !6}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_ClkInitTypeDef", file: !186, line: 264, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !186, line: 250, size: 128, elements: !910)
!910 = !{!911, !912, !913, !914}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ClockType", scope: !909, file: !186, line: 252, baseType: !6, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCLKSource", scope: !909, file: !186, line: 255, baseType: !6, size: 32, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "AHBCLKDivider", scope: !909, file: !186, line: 258, baseType: !6, size: 32, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "APB1CLKDivider", scope: !909, file: !186, line: 261, baseType: !6, size: 32, offset: 96)
!915 = !DILocalVariable(name: "RCC_ClkInitStruct", arg: 1, scope: !904, file: !3, line: 777, type: !907)
!916 = !DILocation(line: 777, column: 59, scope: !904)
!917 = !DILocalVariable(name: "FLatency", arg: 2, scope: !904, file: !3, line: 777, type: !6)
!918 = !DILocation(line: 777, column: 87, scope: !904)
!919 = !DILocalVariable(name: "tickstart", scope: !904, file: !3, line: 779, type: !6)
!920 = !DILocation(line: 779, column: 12, scope: !904)
!921 = !DILocation(line: 782, column: 6, scope: !922)
!922 = distinct !DILexicalBlock(scope: !904, file: !3, line: 782, column: 6)
!923 = !DILocation(line: 782, column: 24, scope: !922)
!924 = !DILocation(line: 782, column: 6, scope: !904)
!925 = !DILocation(line: 784, column: 5, scope: !926)
!926 = distinct !DILexicalBlock(scope: !922, file: !3, line: 783, column: 3)
!927 = !DILocation(line: 796, column: 6, scope: !928)
!928 = distinct !DILexicalBlock(scope: !904, file: !3, line: 796, column: 6)
!929 = !DILocation(line: 796, column: 89, scope: !928)
!930 = !DILocation(line: 796, column: 95, scope: !928)
!931 = !DILocation(line: 796, column: 15, scope: !928)
!932 = !DILocation(line: 796, column: 6, scope: !904)
!933 = !DILocation(line: 799, column: 149, scope: !934)
!934 = distinct !DILexicalBlock(scope: !928, file: !3, line: 797, column: 3)
!935 = !DILocation(line: 799, column: 152, scope: !934)
!936 = !DILocation(line: 799, column: 176, scope: !934)
!937 = !DILocation(line: 799, column: 173, scope: !934)
!938 = !DILocation(line: 799, column: 78, scope: !934)
!939 = !DILocation(line: 803, column: 80, scope: !940)
!940 = distinct !DILexicalBlock(scope: !934, file: !3, line: 803, column: 8)
!941 = !DILocation(line: 803, column: 86, scope: !940)
!942 = !DILocation(line: 803, column: 111, scope: !940)
!943 = !DILocation(line: 803, column: 108, scope: !940)
!944 = !DILocation(line: 803, column: 8, scope: !934)
!945 = !DILocation(line: 805, column: 7, scope: !946)
!946 = distinct !DILexicalBlock(scope: !940, file: !3, line: 804, column: 5)
!947 = !DILocation(line: 807, column: 3, scope: !934)
!948 = !DILocation(line: 810, column: 8, scope: !949)
!949 = distinct !DILexicalBlock(scope: !904, file: !3, line: 810, column: 6)
!950 = !DILocation(line: 810, column: 27, scope: !949)
!951 = !DILocation(line: 810, column: 38, scope: !949)
!952 = !DILocation(line: 810, column: 55, scope: !949)
!953 = !DILocation(line: 810, column: 6, scope: !904)
!954 = !DILocation(line: 814, column: 10, scope: !955)
!955 = distinct !DILexicalBlock(scope: !956, file: !3, line: 814, column: 8)
!956 = distinct !DILexicalBlock(scope: !949, file: !3, line: 811, column: 3)
!957 = !DILocation(line: 814, column: 29, scope: !955)
!958 = !DILocation(line: 814, column: 40, scope: !955)
!959 = !DILocation(line: 814, column: 57, scope: !955)
!960 = !DILocation(line: 814, column: 8, scope: !956)
!961 = !DILocation(line: 816, column: 157, scope: !962)
!962 = distinct !DILexicalBlock(scope: !955, file: !3, line: 815, column: 5)
!963 = !DILocation(line: 816, column: 165, scope: !962)
!964 = !DILocation(line: 816, column: 189, scope: !962)
!965 = !DILocation(line: 816, column: 83, scope: !962)
!966 = !DILocation(line: 817, column: 5, scope: !962)
!967 = !DILocation(line: 821, column: 155, scope: !956)
!968 = !DILocation(line: 821, column: 163, scope: !956)
!969 = !DILocation(line: 821, column: 190, scope: !956)
!970 = !DILocation(line: 821, column: 209, scope: !956)
!971 = !DILocation(line: 821, column: 187, scope: !956)
!972 = !DILocation(line: 821, column: 81, scope: !956)
!973 = !DILocation(line: 822, column: 3, scope: !956)
!974 = !DILocation(line: 825, column: 8, scope: !975)
!975 = distinct !DILexicalBlock(scope: !904, file: !3, line: 825, column: 6)
!976 = !DILocation(line: 825, column: 27, scope: !975)
!977 = !DILocation(line: 825, column: 38, scope: !975)
!978 = !DILocation(line: 825, column: 55, scope: !975)
!979 = !DILocation(line: 825, column: 6, scope: !904)
!980 = !DILocation(line: 830, column: 8, scope: !981)
!981 = distinct !DILexicalBlock(scope: !982, file: !3, line: 830, column: 8)
!982 = distinct !DILexicalBlock(scope: !975, file: !3, line: 826, column: 3)
!983 = !DILocation(line: 830, column: 27, scope: !981)
!984 = !DILocation(line: 830, column: 40, scope: !981)
!985 = !DILocation(line: 830, column: 8, scope: !982)
!986 = !DILocation(line: 833, column: 148, scope: !987)
!987 = distinct !DILexicalBlock(scope: !988, file: !3, line: 833, column: 10)
!988 = distinct !DILexicalBlock(scope: !981, file: !3, line: 831, column: 5)
!989 = !DILocation(line: 833, column: 510, scope: !987)
!990 = !DILocation(line: 833, column: 584, scope: !987)
!991 = !DILocation(line: 833, column: 10, scope: !988)
!992 = !DILocation(line: 835, column: 9, scope: !993)
!993 = distinct !DILexicalBlock(scope: !987, file: !3, line: 834, column: 7)
!994 = !DILocation(line: 837, column: 5, scope: !988)
!995 = !DILocation(line: 839, column: 13, scope: !996)
!996 = distinct !DILexicalBlock(scope: !981, file: !3, line: 839, column: 13)
!997 = !DILocation(line: 839, column: 32, scope: !996)
!998 = !DILocation(line: 839, column: 45, scope: !996)
!999 = !DILocation(line: 839, column: 13, scope: !981)
!1000 = !DILocation(line: 842, column: 148, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 842, column: 10)
!1002 = distinct !DILexicalBlock(scope: !996, file: !3, line: 840, column: 5)
!1003 = !DILocation(line: 842, column: 510, scope: !1001)
!1004 = !DILocation(line: 842, column: 584, scope: !1001)
!1005 = !DILocation(line: 842, column: 10, scope: !1002)
!1006 = !DILocation(line: 844, column: 9, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 843, column: 7)
!1008 = !DILocation(line: 846, column: 5, scope: !1002)
!1009 = !DILocation(line: 849, column: 13, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !996, file: !3, line: 849, column: 13)
!1011 = !DILocation(line: 849, column: 32, scope: !1010)
!1012 = !DILocation(line: 849, column: 45, scope: !1010)
!1013 = !DILocation(line: 849, column: 13, scope: !996)
!1014 = !DILocation(line: 852, column: 289, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 852, column: 10)
!1016 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 850, column: 5)
!1017 = !DILocation(line: 852, column: 510, scope: !1015)
!1018 = !DILocation(line: 852, column: 584, scope: !1015)
!1019 = !DILocation(line: 852, column: 10, scope: !1016)
!1020 = !DILocation(line: 854, column: 9, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 853, column: 7)
!1022 = !DILocation(line: 856, column: 5, scope: !1016)
!1023 = !DILocation(line: 862, column: 147, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 862, column: 10)
!1025 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 860, column: 5)
!1026 = !DILocation(line: 862, column: 507, scope: !1024)
!1027 = !DILocation(line: 862, column: 580, scope: !1024)
!1028 = !DILocation(line: 862, column: 10, scope: !1025)
!1029 = !DILocation(line: 864, column: 9, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 863, column: 7)
!1031 = !DILocation(line: 867, column: 155, scope: !982)
!1032 = !DILocation(line: 867, column: 163, scope: !982)
!1033 = !DILocation(line: 867, column: 191, scope: !982)
!1034 = !DILocation(line: 867, column: 210, scope: !982)
!1035 = !DILocation(line: 867, column: 187, scope: !982)
!1036 = !DILocation(line: 867, column: 81, scope: !982)
!1037 = !DILocation(line: 870, column: 17, scope: !982)
!1038 = !DILocation(line: 870, column: 15, scope: !982)
!1039 = !DILocation(line: 872, column: 5, scope: !982)
!1040 = !DILocation(line: 872, column: 90, scope: !982)
!1041 = !DILocation(line: 872, column: 95, scope: !982)
!1042 = !DILocation(line: 872, column: 119, scope: !982)
!1043 = !DILocation(line: 872, column: 138, scope: !982)
!1044 = !DILocation(line: 872, column: 151, scope: !982)
!1045 = !DILocation(line: 872, column: 115, scope: !982)
!1046 = !DILocation(line: 874, column: 11, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 874, column: 10)
!1048 = distinct !DILexicalBlock(scope: !982, file: !3, line: 873, column: 5)
!1049 = !DILocation(line: 874, column: 27, scope: !1047)
!1050 = !DILocation(line: 874, column: 25, scope: !1047)
!1051 = !DILocation(line: 874, column: 39, scope: !1047)
!1052 = !DILocation(line: 874, column: 10, scope: !1048)
!1053 = !DILocation(line: 876, column: 9, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 875, column: 7)
!1055 = distinct !{!1055, !1039, !1056}
!1056 = !DILocation(line: 878, column: 5, scope: !982)
!1057 = !DILocation(line: 879, column: 3, scope: !982)
!1058 = !DILocation(line: 882, column: 6, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !904, file: !3, line: 882, column: 6)
!1060 = !DILocation(line: 882, column: 89, scope: !1059)
!1061 = !DILocation(line: 882, column: 95, scope: !1059)
!1062 = !DILocation(line: 882, column: 15, scope: !1059)
!1063 = !DILocation(line: 882, column: 6, scope: !904)
!1064 = !DILocation(line: 885, column: 149, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 883, column: 3)
!1066 = !DILocation(line: 885, column: 152, scope: !1065)
!1067 = !DILocation(line: 885, column: 176, scope: !1065)
!1068 = !DILocation(line: 885, column: 173, scope: !1065)
!1069 = !DILocation(line: 885, column: 78, scope: !1065)
!1070 = !DILocation(line: 889, column: 80, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 889, column: 8)
!1072 = !DILocation(line: 889, column: 86, scope: !1071)
!1073 = !DILocation(line: 889, column: 111, scope: !1071)
!1074 = !DILocation(line: 889, column: 108, scope: !1071)
!1075 = !DILocation(line: 889, column: 8, scope: !1065)
!1076 = !DILocation(line: 891, column: 7, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 890, column: 5)
!1078 = !DILocation(line: 893, column: 3, scope: !1065)
!1079 = !DILocation(line: 896, column: 8, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !904, file: !3, line: 896, column: 6)
!1081 = !DILocation(line: 896, column: 27, scope: !1080)
!1082 = !DILocation(line: 896, column: 38, scope: !1080)
!1083 = !DILocation(line: 896, column: 55, scope: !1080)
!1084 = !DILocation(line: 896, column: 6, scope: !904)
!1085 = !DILocation(line: 899, column: 155, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 897, column: 3)
!1087 = !DILocation(line: 899, column: 163, scope: !1086)
!1088 = !DILocation(line: 899, column: 190, scope: !1086)
!1089 = !DILocation(line: 899, column: 209, scope: !1086)
!1090 = !DILocation(line: 899, column: 187, scope: !1086)
!1091 = !DILocation(line: 899, column: 81, scope: !1086)
!1092 = !DILocation(line: 900, column: 3, scope: !1086)
!1093 = !DILocation(line: 903, column: 21, scope: !904)
!1094 = !DILocation(line: 903, column: 131, scope: !904)
!1095 = !DILocation(line: 903, column: 136, scope: !904)
!1096 = !DILocation(line: 903, column: 154, scope: !904)
!1097 = !DILocation(line: 903, column: 50, scope: !904)
!1098 = !DILocation(line: 903, column: 47, scope: !904)
!1099 = !DILocation(line: 903, column: 19, scope: !904)
!1100 = !DILocation(line: 906, column: 3, scope: !904)
!1101 = !DILocation(line: 908, column: 3, scope: !904)
!1102 = !DILocation(line: 909, column: 1, scope: !904)
!1103 = !DILocalVariable(name: "tmpreg", scope: !2, file: !3, line: 1102, type: !6)
!1104 = !DILocation(line: 1102, column: 12, scope: !2)
!1105 = !DILocalVariable(name: "prediv", scope: !2, file: !3, line: 1102, type: !6)
!1106 = !DILocation(line: 1102, column: 25, scope: !2)
!1107 = !DILocalVariable(name: "pllclk", scope: !2, file: !3, line: 1102, type: !6)
!1108 = !DILocation(line: 1102, column: 38, scope: !2)
!1109 = !DILocalVariable(name: "pllmul", scope: !2, file: !3, line: 1102, type: !6)
!1110 = !DILocation(line: 1102, column: 51, scope: !2)
!1111 = !DILocalVariable(name: "sysclockfreq", scope: !2, file: !3, line: 1103, type: !6)
!1112 = !DILocation(line: 1103, column: 12, scope: !2)
!1113 = !DILocation(line: 1105, column: 78, scope: !2)
!1114 = !DILocation(line: 1105, column: 10, scope: !2)
!1115 = !DILocation(line: 1108, column: 11, scope: !2)
!1116 = !DILocation(line: 1108, column: 18, scope: !2)
!1117 = !DILocation(line: 1108, column: 3, scope: !2)
!1118 = !DILocation(line: 1112, column: 20, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 1111, column: 5)
!1120 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1109, column: 3)
!1121 = !DILocation(line: 1113, column: 7, scope: !1119)
!1122 = !DILocation(line: 1117, column: 46, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 1116, column: 5)
!1124 = !DILocation(line: 1117, column: 53, scope: !1123)
!1125 = !DILocation(line: 1117, column: 73, scope: !1123)
!1126 = !DILocation(line: 1117, column: 16, scope: !1123)
!1127 = !DILocation(line: 1117, column: 14, scope: !1123)
!1128 = !DILocation(line: 1118, column: 112, scope: !1123)
!1129 = !DILocation(line: 1118, column: 118, scope: !1123)
!1130 = !DILocation(line: 1118, column: 137, scope: !1123)
!1131 = !DILocation(line: 1118, column: 16, scope: !1123)
!1132 = !DILocation(line: 1118, column: 14, scope: !1123)
!1133 = !DILocation(line: 1119, column: 12, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 1119, column: 11)
!1135 = !DILocation(line: 1119, column: 19, scope: !1134)
!1136 = !DILocation(line: 1119, column: 39, scope: !1134)
!1137 = !DILocation(line: 1119, column: 11, scope: !1123)
!1138 = !DILocation(line: 1122, column: 62, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 1120, column: 7)
!1140 = !DILocation(line: 1122, column: 50, scope: !1139)
!1141 = !DILocation(line: 1122, column: 48, scope: !1139)
!1142 = !DILocation(line: 1122, column: 18, scope: !1139)
!1143 = !DILocation(line: 1122, column: 85, scope: !1139)
!1144 = !DILocation(line: 1122, column: 74, scope: !1139)
!1145 = !DILocation(line: 1122, column: 71, scope: !1139)
!1146 = !DILocation(line: 1122, column: 16, scope: !1139)
!1147 = !DILocation(line: 1123, column: 7, scope: !1139)
!1148 = !DILocation(line: 1125, column: 17, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 1125, column: 16)
!1150 = !DILocation(line: 1125, column: 24, scope: !1149)
!1151 = !DILocation(line: 1125, column: 44, scope: !1149)
!1152 = !DILocation(line: 1125, column: 16, scope: !1134)
!1153 = !DILocation(line: 1128, column: 64, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1149, file: !3, line: 1126, column: 7)
!1155 = !DILocation(line: 1128, column: 52, scope: !1154)
!1156 = !DILocation(line: 1128, column: 50, scope: !1154)
!1157 = !DILocation(line: 1128, column: 18, scope: !1154)
!1158 = !DILocation(line: 1128, column: 87, scope: !1154)
!1159 = !DILocation(line: 1128, column: 76, scope: !1154)
!1160 = !DILocation(line: 1128, column: 73, scope: !1154)
!1161 = !DILocation(line: 1128, column: 16, scope: !1154)
!1162 = !DILocation(line: 1129, column: 7, scope: !1154)
!1163 = !DILocation(line: 1135, column: 63, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1149, file: !3, line: 1132, column: 7)
!1165 = !DILocation(line: 1135, column: 51, scope: !1164)
!1166 = !DILocation(line: 1135, column: 49, scope: !1164)
!1167 = !DILocation(line: 1135, column: 18, scope: !1164)
!1168 = !DILocation(line: 1135, column: 86, scope: !1164)
!1169 = !DILocation(line: 1135, column: 75, scope: !1164)
!1170 = !DILocation(line: 1135, column: 72, scope: !1164)
!1171 = !DILocation(line: 1135, column: 16, scope: !1164)
!1172 = !DILocation(line: 1141, column: 22, scope: !1123)
!1173 = !DILocation(line: 1141, column: 20, scope: !1123)
!1174 = !DILocation(line: 1142, column: 7, scope: !1123)
!1175 = !DILocation(line: 1147, column: 20, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 1146, column: 5)
!1177 = !DILocation(line: 1148, column: 7, scope: !1176)
!1178 = !DILocation(line: 1151, column: 5, scope: !1120)
!1179 = !DILocation(line: 1154, column: 20, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 1153, column: 5)
!1181 = !DILocation(line: 1155, column: 7, scope: !1180)
!1182 = !DILocation(line: 1158, column: 10, scope: !2)
!1183 = !DILocation(line: 1158, column: 3, scope: !2)
!1184 = distinct !DISubprogram(name: "HAL_RCC_MCOConfig", scope: !3, file: !3, line: 1016, type: !1185, scopeLine: 1017, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !97)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{null, !6, !6, !6}
!1187 = !DILocalVariable(name: "RCC_MCOx", arg: 1, scope: !1184, file: !3, line: 1016, type: !6)
!1188 = !DILocation(line: 1016, column: 33, scope: !1184)
!1189 = !DILocalVariable(name: "RCC_MCOSource", arg: 2, scope: !1184, file: !3, line: 1016, type: !6)
!1190 = !DILocation(line: 1016, column: 52, scope: !1184)
!1191 = !DILocalVariable(name: "RCC_MCODiv", arg: 3, scope: !1184, file: !3, line: 1016, type: !6)
!1192 = !DILocation(line: 1016, column: 76, scope: !1184)
!1193 = !DILocalVariable(name: "gpio", scope: !1184, file: !3, line: 1018, type: !1194)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_InitTypeDef", file: !1195, line: 62, baseType: !1196)
!1195 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal_gpio.h", directory: "/home/sri/zephyrproject")
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1195, line: 46, size: 160, elements: !1197)
!1197 = !{!1198, !1199, !1200, !1201, !1202}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "Pin", scope: !1196, file: !1195, line: 48, baseType: !6, size: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !1196, file: !1195, line: 51, baseType: !6, size: 32, offset: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "Pull", scope: !1196, file: !1195, line: 54, baseType: !6, size: 32, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "Speed", scope: !1196, file: !1195, line: 57, baseType: !6, size: 32, offset: 96)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "Alternate", scope: !1196, file: !1195, line: 60, baseType: !6, size: 32, offset: 128)
!1203 = !DILocation(line: 1018, column: 20, scope: !1184)
!1204 = !DILocation(line: 1026, column: 8, scope: !1184)
!1205 = !DILocation(line: 1026, column: 13, scope: !1184)
!1206 = !DILocation(line: 1027, column: 8, scope: !1184)
!1207 = !DILocation(line: 1027, column: 14, scope: !1184)
!1208 = !DILocation(line: 1028, column: 8, scope: !1184)
!1209 = !DILocation(line: 1028, column: 13, scope: !1184)
!1210 = !DILocation(line: 1029, column: 8, scope: !1184)
!1211 = !DILocation(line: 1029, column: 12, scope: !1184)
!1212 = !DILocation(line: 1030, column: 8, scope: !1184)
!1213 = !DILocation(line: 1030, column: 18, scope: !1184)
!1214 = !DILocation(line: 1033, column: 3, scope: !1184)
!1215 = !DILocalVariable(name: "tmpreg", scope: !1216, file: !3, line: 1033, type: !32)
!1216 = distinct !DILexicalBlock(scope: !1184, file: !3, line: 1033, column: 6)
!1217 = !DILocation(line: 1033, column: 26, scope: !1216)
!1218 = !DILocation(line: 1033, column: 110, scope: !1216)
!1219 = !DILocation(line: 1033, column: 211, scope: !1216)
!1220 = !DILocation(line: 1033, column: 219, scope: !1216)
!1221 = !DILocation(line: 1033, column: 141, scope: !1216)
!1222 = !DILocation(line: 1033, column: 248, scope: !1216)
!1223 = !DILocation(line: 1033, column: 256, scope: !1216)
!1224 = !DILocation(line: 1035, column: 3, scope: !1184)
!1225 = !DILocation(line: 1038, column: 153, scope: !1184)
!1226 = !DILocation(line: 1038, column: 161, scope: !1184)
!1227 = !DILocation(line: 1038, column: 212, scope: !1184)
!1228 = !DILocation(line: 1038, column: 230, scope: !1184)
!1229 = !DILocation(line: 1038, column: 227, scope: !1184)
!1230 = !DILocation(line: 1038, column: 207, scope: !1184)
!1231 = !DILocation(line: 1038, column: 79, scope: !1184)
!1232 = !DILocation(line: 1039, column: 1, scope: !1184)
!1233 = distinct !DISubprogram(name: "HAL_RCC_EnableCSS", scope: !3, file: !3, line: 1050, type: !1234, scopeLine: 1051, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !97)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{null}
!1236 = !DILocation(line: 1052, column: 75, scope: !1233)
!1237 = !DILocation(line: 1053, column: 1, scope: !1233)
!1238 = distinct !DISubprogram(name: "HAL_RCC_DisableCSS", scope: !3, file: !3, line: 1059, type: !1234, scopeLine: 1060, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !97)
!1239 = !DILocation(line: 1061, column: 75, scope: !1238)
!1240 = !DILocation(line: 1062, column: 1, scope: !1238)
!1241 = distinct !DISubprogram(name: "HAL_RCC_GetHCLKFreq", scope: !3, file: !3, line: 1170, type: !4, scopeLine: 1171, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !97)
!1242 = !DILocation(line: 1172, column: 10, scope: !1241)
!1243 = !DILocation(line: 1172, column: 3, scope: !1241)
!1244 = distinct !DISubprogram(name: "HAL_RCC_GetPCLK1Freq", scope: !3, file: !3, line: 1181, type: !4, scopeLine: 1182, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !97)
!1245 = !DILocation(line: 1184, column: 11, scope: !1244)
!1246 = !DILocation(line: 1184, column: 117, scope: !1244)
!1247 = !DILocation(line: 1184, column: 122, scope: !1244)
!1248 = !DILocation(line: 1184, column: 141, scope: !1244)
!1249 = !DILocation(line: 1184, column: 36, scope: !1244)
!1250 = !DILocation(line: 1184, column: 33, scope: !1244)
!1251 = !DILocation(line: 1184, column: 3, scope: !1244)
!1252 = distinct !DISubprogram(name: "HAL_RCC_GetOscConfig", scope: !3, file: !3, line: 1194, type: !1253, scopeLine: 1195, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !97)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{null, !184}
!1255 = !DILocalVariable(name: "RCC_OscInitStruct", arg: 1, scope: !1252, file: !3, line: 1194, type: !184)
!1256 = !DILocation(line: 1194, column: 47, scope: !1252)
