; ModuleID = '../bc_files/stm32f0xx_hal_rcc.bc'
source_filename = "/home/sri/zephyrproject/modules/hal/stm32/stm32cube/stm32f0xx/drivers/src/stm32f0xx_hal_rcc.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.RCC_TypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.RCC_OscInitTypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.RCC_PLLInitTypeDef }
%struct.RCC_PLLInitTypeDef = type { i32, i32, i32, i32 }
%struct.RCC_ClkInitTypeDef = type { i32, i32, i32, i32 }
%struct.GPIO_InitTypeDef = type { i32, i32, i32, i32, i32 }

@SystemCoreClock = external dso_local global i32, align 4
@uwTickPrio = external dso_local global i32, align 4
@AHBPrescTable = external dso_local constant [16 x i8], align 1
@HAL_RCC_GetSysClockFreq.aPLLMULFactorTable = internal constant [16 x i8] c"\02\03\04\05\06\07\08\09\0A\0B\0C\0D\0E\0F\10\10", align 1, !dbg !0
@HAL_RCC_GetSysClockFreq.aPredivFactorTable = internal constant [16 x i8] c"\01\02\03\04\05\06\07\08\09\0A\0B\0C\0D\0E\0F\10", align 1, !dbg !91
@APBPrescTable = external dso_local constant [8 x i8], align 1

; Function Attrs: nounwind optsize
define hidden zeroext i8 @HAL_RCC_DeInit() #0 !dbg !110 {
  %1 = alloca i8, align 1
  %2 = alloca i32, align 4
  %3 = alloca i32, align 4
  call void @llvm.lifetime.start.p0(i64 4, ptr %2) #4, !dbg !116

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "aPLLMULFactorTable", scope: !2, file: !3, line: 1097, type: !93, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "HAL_RCC_GetSysClockFreq", scope: !3, file: !3, line: 1095, type: !4, scopeLine: 1096, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !97)
!3 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/src/stm32f0xx_hal_rcc.c", directory: "/home/sri/zephyrproject")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !7, line: 64, baseType: !8)
!7 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!8 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !25, globals: !90, splitDebugInlining: false, nameTableKind: None)
!10 = !DIFile(filename: "stm32f0xx_hal_rcc.c", directory: "/home/sri/zephyrproject/zephyr/build")
!11 = !{!12, !20}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 38, baseType: !14, size: 8, elements: !15)
!13 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal_def.h", directory: "/home/sri/zephyrproject")
!14 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "HAL_OK", value: 0)
!17 = !DIEnumerator(name: "HAL_ERROR", value: 1)
!18 = !DIEnumerator(name: "HAL_BUSY", value: 2)
!19 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 167, baseType: !14, size: 8, elements: !22)
!21 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f0xx.h", directory: "/home/sri/zephyrproject")
!22 = !{!23, !24}
!23 = !DIEnumerator(name: "RESET", value: 0)
!24 = !DIEnumerator(name: "SET", value: 1)
!25 = !{!26, !46, !6, !47, !48, !54, !67, !69, !86, !88}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !28, line: 461, baseType: !29)
!28 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 445, size: 448, elements: !30)
!30 = !{!31, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !29, file: !28, line: 447, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !29, file: !28, line: 448, baseType: !32, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !29, file: !28, line: 449, baseType: !32, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !29, file: !28, line: 450, baseType: !32, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !29, file: !28, line: 451, baseType: !32, size: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !29, file: !28, line: 452, baseType: !32, size: 32, offset: 160)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !29, file: !28, line: 453, baseType: !32, size: 32, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !29, file: !28, line: 454, baseType: !32, size: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !29, file: !28, line: 455, baseType: !32, size: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !29, file: !28, line: 456, baseType: !32, size: 32, offset: 288)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !29, file: !28, line: 457, baseType: !32, size: 32, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR2", scope: !29, file: !28, line: 458, baseType: !32, size: 32, offset: 352)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR3", scope: !29, file: !28, line: 459, baseType: !32, size: 32, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !29, file: !28, line: 460, baseType: !32, size: 32, offset: 416)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !7, line: 62, baseType: !14)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !28, line: 439, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 435, size: 64, elements: !51)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !50, file: !28, line: 437, baseType: !32, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !50, file: !28, line: 438, baseType: !32, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !28, line: 350, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 339, size: 288, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !56, file: !28, line: 341, baseType: !32, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !56, file: !28, line: 342, baseType: !32, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !56, file: !28, line: 343, baseType: !32, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !56, file: !28, line: 344, baseType: !32, size: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !56, file: !28, line: 345, baseType: !32, size: 32, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !56, file: !28, line: 346, baseType: !32, size: 32, offset: 160)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !56, file: !28, line: 347, baseType: !32, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !56, file: !28, line: 348, baseType: !32, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !56, file: !28, line: 349, baseType: !32, size: 32, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !7, line: 63, baseType: !68)
!68 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !28, line: 383, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 371, size: 352, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !85}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !71, file: !28, line: 373, baseType: !32, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !71, file: !28, line: 374, baseType: !32, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !71, file: !28, line: 375, baseType: !32, size: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !71, file: !28, line: 376, baseType: !32, size: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !71, file: !28, line: 377, baseType: !32, size: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !71, file: !28, line: 378, baseType: !32, size: 32, offset: 160)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !71, file: !28, line: 379, baseType: !32, size: 32, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !71, file: !28, line: 380, baseType: !32, size: 32, offset: 224)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !71, file: !28, line: 381, baseType: !82, size: 64, offset: 256)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 2)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !71, file: !28, line: 382, baseType: !32, size: 32, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !7, line: 65, baseType: !87)
!87 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !47)
!90 = !{!0, !91}
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "aPredivFactorTable", scope: !2, file: !3, line: 1099, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 128, elements: !95)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!95 = !{!96}
!96 = !DISubrange(count: 16)
!97 = !{!98, !99, !100, !101, !102}
!98 = !DILocalVariable(name: "tmpreg", scope: !2, file: !3, line: 1102, type: !6)
!99 = !DILocalVariable(name: "prediv", scope: !2, file: !3, line: 1102, type: !6)
!100 = !DILocalVariable(name: "pllclk", scope: !2, file: !3, line: 1102, type: !6)
!101 = !DILocalVariable(name: "pllmul", scope: !2, file: !3, line: 1102, type: !6)
!102 = !DILocalVariable(name: "sysclockfreq", scope: !2, file: !3, line: 1103, type: !6)
!103 = !{i32 7, !"Dwarf Version", i32 4}
!104 = !{i32 2, !"Debug Info Version", i32 3}
!105 = !{i32 1, !"wchar_size", i32 4}
!106 = !{i32 1, !"static_rwdata", i32 1}
!107 = !{i32 1, !"enumsize_buildattr", i32 1}
!108 = !{i32 1, !"armlib_unavailable", i32 0}
!109 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!110 = distinct !DISubprogram(name: "HAL_RCC_DeInit", scope: !3, file: !3, line: 208, type: !111, scopeLine: 209, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !114)
!111 = !DISubroutineType(types: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_StatusTypeDef", file: !13, line: 44, baseType: !12)
!114 = !{!115}
!115 = !DILocalVariable(name: "tickstart", scope: !110, file: !3, line: 210, type: !6)
!116 = !DILocation(line: 210, column: 3, scope: !110)
!117 = !DILocation(line: 210, column: 12, scope: !110)
!118 = !DILocation(line: 213, column: 15, scope: !110)
!119 = !DILocation(line: 213, column: 13, scope: !110)
!120 = !DILocation(line: 216, column: 75, scope: !110)
!121 = !DILocation(line: 219, column: 3, scope: !110)
!122 = !DILocation(line: 219, column: 78, scope: !110)
!123 = !DILocation(line: 219, column: 82, scope: !110)
!124 = !DILocation(line: 219, column: 103, scope: !110)
!125 = !DILocation(line: 221, column: 10, scope: !126)
!126 = distinct !DILexicalBlock(scope: !127, file: !3, line: 221, column: 9)
!127 = distinct !DILexicalBlock(scope: !110, file: !3, line: 220, column: 3)
!128 = !DILocation(line: 221, column: 26, scope: !126)
!129 = !DILocation(line: 221, column: 24, scope: !126)
!130 = !DILocation(line: 221, column: 37, scope: !126)
!131 = !DILocation(line: 221, column: 9, scope: !127)
!132 = !DILocation(line: 223, column: 7, scope: !133)
!133 = distinct !DILexicalBlock(scope: !126, file: !3, line: 222, column: 5)
!134 = distinct !{!134, !121, !135}
!135 = !DILocation(line: 225, column: 3, scope: !110)
!136 = !DILocation(line: 228, column: 77, scope: !110)
!137 = !DILocation(line: 231, column: 3, scope: !110)
!138 = !DILocation(line: 231, column: 78, scope: !110)
!139 = !DILocation(line: 231, column: 84, scope: !110)
!140 = !DILocation(line: 231, column: 105, scope: !110)
!141 = !DILocation(line: 233, column: 10, scope: !142)
!142 = distinct !DILexicalBlock(scope: !143, file: !3, line: 233, column: 9)
!143 = distinct !DILexicalBlock(scope: !110, file: !3, line: 232, column: 3)
!144 = !DILocation(line: 233, column: 26, scope: !142)
!145 = !DILocation(line: 233, column: 24, scope: !142)
!146 = !DILocation(line: 233, column: 37, scope: !142)
!147 = !DILocation(line: 233, column: 9, scope: !143)
!148 = !DILocation(line: 235, column: 7, scope: !149)
!149 = distinct !DILexicalBlock(scope: !142, file: !3, line: 234, column: 5)
!150 = distinct !{!150, !137, !151}
!151 = !DILocation(line: 237, column: 3, scope: !110)
!152 = !DILocation(line: 240, column: 19, scope: !110)
!153 = !DILocation(line: 243, column: 20, scope: !154)
!154 = distinct !DILexicalBlock(scope: !110, file: !3, line: 243, column: 7)
!155 = !DILocation(line: 243, column: 7, scope: !154)
!156 = !DILocation(line: 243, column: 32, scope: !154)
!157 = !DILocation(line: 243, column: 7, scope: !110)
!158 = !DILocation(line: 245, column: 5, scope: !159)
!159 = distinct !DILexicalBlock(scope: !154, file: !3, line: 244, column: 3)
!160 = !DILocation(line: 249, column: 75, scope: !110)
!161 = !DILocation(line: 252, column: 75, scope: !110)
!162 = !DILocation(line: 255, column: 15, scope: !110)
!163 = !DILocation(line: 255, column: 13, scope: !110)
!164 = !DILocation(line: 258, column: 3, scope: !110)
!165 = !DILocation(line: 258, column: 77, scope: !110)
!166 = !DILocation(line: 258, column: 81, scope: !110)
!167 = !DILocation(line: 258, column: 103, scope: !110)
!168 = !DILocation(line: 260, column: 9, scope: !169)
!169 = distinct !DILexicalBlock(scope: !170, file: !3, line: 260, column: 8)
!170 = distinct !DILexicalBlock(scope: !110, file: !3, line: 259, column: 3)
!171 = !DILocation(line: 260, column: 25, scope: !169)
!172 = !DILocation(line: 260, column: 23, scope: !169)
!173 = !DILocation(line: 260, column: 36, scope: !169)
!174 = !DILocation(line: 260, column: 8, scope: !170)
!175 = !DILocation(line: 262, column: 7, scope: !176)
!176 = distinct !DILexicalBlock(scope: !169, file: !3, line: 261, column: 5)
!177 = distinct !{!177, !164, !178}
!178 = !DILocation(line: 264, column: 3, scope: !110)
!179 = !DILocation(line: 267, column: 77, scope: !110)
!180 = !DILocation(line: 270, column: 78, scope: !110)
!181 = !DILocation(line: 273, column: 78, scope: !110)
!182 = !DILocation(line: 276, column: 76, scope: !110)
!183 = !DILocation(line: 279, column: 74, scope: !110)
!184 = !DILocation(line: 281, column: 3, scope: !110)
!185 = !DILocation(line: 282, column: 1, scope: !110)
!186 = !DISubprogram(name: "HAL_GetTick", scope: !187, file: !187, line: 546, type: !4, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !188)
!187 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal.h", directory: "/home/sri/zephyrproject")
!188 = !{}
!189 = !DISubprogram(name: "HAL_InitTick", scope: !187, file: !187, line: 523, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !188)
!190 = !DISubroutineType(types: !191)
!191 = !{!113, !6}
!192 = distinct !DISubprogram(name: "HAL_RCC_OscConfig", scope: !3, file: !3, line: 298, type: !193, scopeLine: 299, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !217)
!193 = !DISubroutineType(types: !194)
!194 = !{!113, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_OscInitTypeDef", file: !197, line: 245, baseType: !198)
!197 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal_rcc.h", directory: "/home/sri/zephyrproject")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !197, line: 212, size: 416, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208, !209}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "OscillatorType", scope: !198, file: !197, line: 214, baseType: !6, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "HSEState", scope: !198, file: !197, line: 217, baseType: !6, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "LSEState", scope: !198, file: !197, line: 220, baseType: !6, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "HSIState", scope: !198, file: !197, line: 223, baseType: !6, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "HSICalibrationValue", scope: !198, file: !197, line: 226, baseType: !6, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "HSI14State", scope: !198, file: !197, line: 229, baseType: !6, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "HSI14CalibrationValue", scope: !198, file: !197, line: 232, baseType: !6, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "LSIState", scope: !198, file: !197, line: 235, baseType: !6, size: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "HSI48State", scope: !198, file: !197, line: 239, baseType: !6, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "PLL", scope: !198, file: !197, line: 243, baseType: !210, size: 128, offset: 288)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_PLLInitTypeDef", file: !197, line: 207, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !197, line: 193, size: 128, elements: !212)
!212 = !{!213, !214, !215, !216}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "PLLState", scope: !211, file: !197, line: 195, baseType: !6, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "PLLSource", scope: !211, file: !197, line: 198, baseType: !6, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "PLLMUL", scope: !211, file: !197, line: 201, baseType: !6, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "PREDIV", scope: !211, file: !197, line: 204, baseType: !6, size: 32, offset: 96)
!217 = !{!218, !219, !220, !221, !222, !226}
!218 = !DILocalVariable(name: "RCC_OscInitStruct", arg: 1, scope: !192, file: !3, line: 298, type: !195)
!219 = !DILocalVariable(name: "tickstart", scope: !192, file: !3, line: 300, type: !6)
!220 = !DILocalVariable(name: "pll_config", scope: !192, file: !3, line: 301, type: !6)
!221 = !DILocalVariable(name: "pll_config2", scope: !192, file: !3, line: 302, type: !6)
!222 = !DILocalVariable(name: "pwrclkchanged", scope: !223, file: !3, line: 475, type: !225)
!223 = distinct !DILexicalBlock(scope: !224, file: !3, line: 474, column: 3)
!224 = distinct !DILexicalBlock(scope: !192, file: !3, line: 473, column: 6)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "FlagStatus", file: !21, line: 171, baseType: !20)
!226 = !DILocalVariable(name: "tmpreg", scope: !227, file: !3, line: 484, type: !32)
!227 = distinct !DILexicalBlock(scope: !228, file: !3, line: 484, column: 10)
!228 = distinct !DILexicalBlock(scope: !229, file: !3, line: 483, column: 5)
!229 = distinct !DILexicalBlock(scope: !223, file: !3, line: 482, column: 8)
!230 = !DILocation(line: 298, column: 57, scope: !192)
!231 = !DILocation(line: 300, column: 3, scope: !192)
!232 = !DILocation(line: 300, column: 12, scope: !192)
!233 = !DILocation(line: 301, column: 3, scope: !192)
!234 = !DILocation(line: 301, column: 12, scope: !192)
!235 = !DILocation(line: 302, column: 3, scope: !192)
!236 = !DILocation(line: 302, column: 12, scope: !192)
!237 = !DILocation(line: 305, column: 6, scope: !238)
!238 = distinct !DILexicalBlock(scope: !192, file: !3, line: 305, column: 6)
!239 = !DILocation(line: 305, column: 24, scope: !238)
!240 = !DILocation(line: 305, column: 6, scope: !192)
!241 = !DILocation(line: 307, column: 5, scope: !242)
!242 = distinct !DILexicalBlock(scope: !238, file: !3, line: 306, column: 3)
!243 = !DILocation(line: 314, column: 8, scope: !244)
!244 = distinct !DILexicalBlock(scope: !192, file: !3, line: 314, column: 6)
!245 = !DILocation(line: 314, column: 27, scope: !244)
!246 = !DILocation(line: 314, column: 43, scope: !244)
!247 = !DILocation(line: 314, column: 60, scope: !244)
!248 = !DILocation(line: 314, column: 6, scope: !192)
!249 = !DILocation(line: 320, column: 87, scope: !250)
!250 = distinct !DILexicalBlock(scope: !251, file: !3, line: 320, column: 8)
!251 = distinct !DILexicalBlock(scope: !244, file: !3, line: 315, column: 3)
!252 = !DILocation(line: 320, column: 92, scope: !250)
!253 = !DILocation(line: 320, column: 112, scope: !250)
!254 = !DILocation(line: 321, column: 8, scope: !250)
!255 = !DILocation(line: 321, column: 91, scope: !250)
!256 = !DILocation(line: 321, column: 96, scope: !250)
!257 = !DILocation(line: 321, column: 116, scope: !250)
!258 = !DILocation(line: 321, column: 134, scope: !250)
!259 = !DILocation(line: 321, column: 218, scope: !250)
!260 = !DILocation(line: 321, column: 224, scope: !250)
!261 = !DILocation(line: 321, column: 248, scope: !250)
!262 = !DILocation(line: 320, column: 8, scope: !251)
!263 = !DILocation(line: 323, column: 149, scope: !264)
!264 = distinct !DILexicalBlock(scope: !265, file: !3, line: 323, column: 10)
!265 = distinct !DILexicalBlock(scope: !250, file: !3, line: 322, column: 5)
!266 = !DILocation(line: 323, column: 511, scope: !264)
!267 = !DILocation(line: 323, column: 585, scope: !264)
!268 = !DILocation(line: 323, column: 595, scope: !264)
!269 = !DILocation(line: 323, column: 599, scope: !264)
!270 = !DILocation(line: 323, column: 618, scope: !264)
!271 = !DILocation(line: 323, column: 627, scope: !264)
!272 = !DILocation(line: 323, column: 10, scope: !265)
!273 = !DILocation(line: 325, column: 9, scope: !274)
!274 = distinct !DILexicalBlock(scope: !264, file: !3, line: 324, column: 7)
!275 = !DILocation(line: 327, column: 5, scope: !265)
!276 = !DILocation(line: 331, column: 7, scope: !277)
!277 = distinct !DILexicalBlock(scope: !250, file: !3, line: 329, column: 5)
!278 = !DILocation(line: 331, column: 16, scope: !279)
!279 = distinct !DILexicalBlock(scope: !280, file: !3, line: 331, column: 15)
!280 = distinct !DILexicalBlock(scope: !277, file: !3, line: 331, column: 9)
!281 = !DILocation(line: 331, column: 35, scope: !279)
!282 = !DILocation(line: 331, column: 45, scope: !279)
!283 = !DILocation(line: 331, column: 15, scope: !280)
!284 = !DILocation(line: 331, column: 137, scope: !285)
!285 = distinct !DILexicalBlock(scope: !279, file: !3, line: 331, column: 63)
!286 = !DILocation(line: 331, column: 161, scope: !285)
!287 = !DILocation(line: 331, column: 173, scope: !288)
!288 = distinct !DILexicalBlock(scope: !279, file: !3, line: 331, column: 172)
!289 = !DILocation(line: 331, column: 192, scope: !288)
!290 = !DILocation(line: 331, column: 202, scope: !288)
!291 = !DILocation(line: 331, column: 172, scope: !279)
!292 = !DILocation(line: 331, column: 294, scope: !293)
!293 = distinct !DILexicalBlock(scope: !288, file: !3, line: 331, column: 220)
!294 = !DILocation(line: 331, column: 391, scope: !293)
!295 = !DILocation(line: 331, column: 416, scope: !293)
!296 = !DILocation(line: 331, column: 428, scope: !297)
!297 = distinct !DILexicalBlock(scope: !288, file: !3, line: 331, column: 427)
!298 = !DILocation(line: 331, column: 447, scope: !297)
!299 = !DILocation(line: 331, column: 457, scope: !297)
!300 = !DILocation(line: 331, column: 427, scope: !288)
!301 = !DILocation(line: 331, column: 549, scope: !302)
!302 = distinct !DILexicalBlock(scope: !297, file: !3, line: 331, column: 475)
!303 = !DILocation(line: 331, column: 645, scope: !302)
!304 = !DILocation(line: 331, column: 669, scope: !302)
!305 = !DILocation(line: 331, column: 750, scope: !306)
!306 = distinct !DILexicalBlock(scope: !297, file: !3, line: 331, column: 676)
!307 = !DILocation(line: 331, column: 847, scope: !306)
!308 = !DILocation(line: 331, column: 874, scope: !280)
!309 = !DILocation(line: 335, column: 10, scope: !310)
!310 = distinct !DILexicalBlock(scope: !277, file: !3, line: 335, column: 10)
!311 = !DILocation(line: 335, column: 29, scope: !310)
!312 = !DILocation(line: 335, column: 38, scope: !310)
!313 = !DILocation(line: 335, column: 10, scope: !277)
!314 = !DILocation(line: 338, column: 21, scope: !315)
!315 = distinct !DILexicalBlock(scope: !310, file: !3, line: 336, column: 7)
!316 = !DILocation(line: 338, column: 19, scope: !315)
!317 = !DILocation(line: 341, column: 9, scope: !315)
!318 = !DILocation(line: 341, column: 153, scope: !315)
!319 = !DILocation(line: 341, column: 515, scope: !315)
!320 = !DILocation(line: 341, column: 589, scope: !315)
!321 = !DILocation(line: 343, column: 15, scope: !322)
!322 = distinct !DILexicalBlock(scope: !323, file: !3, line: 343, column: 14)
!323 = distinct !DILexicalBlock(scope: !315, file: !3, line: 342, column: 9)
!324 = !DILocation(line: 343, column: 31, scope: !322)
!325 = !DILocation(line: 343, column: 29, scope: !322)
!326 = !DILocation(line: 343, column: 43, scope: !322)
!327 = !DILocation(line: 343, column: 14, scope: !323)
!328 = !DILocation(line: 345, column: 13, scope: !329)
!329 = distinct !DILexicalBlock(scope: !322, file: !3, line: 344, column: 11)
!330 = distinct !{!330, !317, !331}
!331 = !DILocation(line: 347, column: 9, scope: !315)
!332 = !DILocation(line: 348, column: 7, scope: !315)
!333 = !DILocation(line: 352, column: 21, scope: !334)
!334 = distinct !DILexicalBlock(scope: !310, file: !3, line: 350, column: 7)
!335 = !DILocation(line: 352, column: 19, scope: !334)
!336 = !DILocation(line: 355, column: 9, scope: !334)
!337 = !DILocation(line: 355, column: 153, scope: !334)
!338 = !DILocation(line: 355, column: 515, scope: !334)
!339 = !DILocation(line: 355, column: 589, scope: !334)
!340 = !DILocation(line: 357, column: 16, scope: !341)
!341 = distinct !DILexicalBlock(scope: !342, file: !3, line: 357, column: 15)
!342 = distinct !DILexicalBlock(scope: !334, file: !3, line: 356, column: 9)
!343 = !DILocation(line: 357, column: 32, scope: !341)
!344 = !DILocation(line: 357, column: 30, scope: !341)
!345 = !DILocation(line: 357, column: 44, scope: !341)
!346 = !DILocation(line: 357, column: 15, scope: !342)
!347 = !DILocation(line: 359, column: 13, scope: !348)
!348 = distinct !DILexicalBlock(scope: !341, file: !3, line: 358, column: 11)
!349 = distinct !{!349, !336, !350}
!350 = !DILocation(line: 361, column: 9, scope: !334)
!351 = !DILocation(line: 364, column: 3, scope: !251)
!352 = !DILocation(line: 366, column: 8, scope: !353)
!353 = distinct !DILexicalBlock(scope: !192, file: !3, line: 366, column: 6)
!354 = !DILocation(line: 366, column: 27, scope: !353)
!355 = !DILocation(line: 366, column: 43, scope: !353)
!356 = !DILocation(line: 366, column: 60, scope: !353)
!357 = !DILocation(line: 366, column: 6, scope: !192)
!358 = !DILocation(line: 373, column: 87, scope: !359)
!359 = distinct !DILexicalBlock(scope: !360, file: !3, line: 373, column: 8)
!360 = distinct !DILexicalBlock(scope: !353, file: !3, line: 367, column: 3)
!361 = !DILocation(line: 373, column: 92, scope: !359)
!362 = !DILocation(line: 373, column: 112, scope: !359)
!363 = !DILocation(line: 374, column: 8, scope: !359)
!364 = !DILocation(line: 374, column: 91, scope: !359)
!365 = !DILocation(line: 374, column: 96, scope: !359)
!366 = !DILocation(line: 374, column: 116, scope: !359)
!367 = !DILocation(line: 374, column: 134, scope: !359)
!368 = !DILocation(line: 374, column: 218, scope: !359)
!369 = !DILocation(line: 374, column: 224, scope: !359)
!370 = !DILocation(line: 374, column: 248, scope: !359)
!371 = !DILocation(line: 373, column: 8, scope: !360)
!372 = !DILocation(line: 377, column: 148, scope: !373)
!373 = distinct !DILexicalBlock(scope: !374, file: !3, line: 377, column: 10)
!374 = distinct !DILexicalBlock(scope: !359, file: !3, line: 375, column: 5)
!375 = !DILocation(line: 377, column: 508, scope: !373)
!376 = !DILocation(line: 377, column: 581, scope: !373)
!377 = !DILocation(line: 377, column: 591, scope: !373)
!378 = !DILocation(line: 377, column: 595, scope: !373)
!379 = !DILocation(line: 377, column: 614, scope: !373)
!380 = !DILocation(line: 377, column: 623, scope: !373)
!381 = !DILocation(line: 377, column: 10, scope: !374)
!382 = !DILocation(line: 379, column: 9, scope: !383)
!383 = distinct !DILexicalBlock(scope: !373, file: !3, line: 378, column: 7)
!384 = !DILocation(line: 385, column: 157, scope: !385)
!385 = distinct !DILexicalBlock(scope: !373, file: !3, line: 383, column: 7)
!386 = !DILocation(line: 385, column: 163, scope: !385)
!387 = !DILocation(line: 385, column: 202, scope: !385)
!388 = !DILocation(line: 385, column: 221, scope: !385)
!389 = !DILocation(line: 385, column: 242, scope: !385)
!390 = !DILocation(line: 385, column: 188, scope: !385)
!391 = !DILocation(line: 385, column: 83, scope: !385)
!392 = !DILocation(line: 387, column: 5, scope: !374)
!393 = !DILocation(line: 391, column: 10, scope: !394)
!394 = distinct !DILexicalBlock(scope: !395, file: !3, line: 391, column: 10)
!395 = distinct !DILexicalBlock(scope: !359, file: !3, line: 389, column: 5)
!396 = !DILocation(line: 391, column: 29, scope: !394)
!397 = !DILocation(line: 391, column: 38, scope: !394)
!398 = !DILocation(line: 391, column: 10, scope: !395)
!399 = !DILocation(line: 394, column: 81, scope: !400)
!400 = distinct !DILexicalBlock(scope: !394, file: !3, line: 392, column: 7)
!401 = !DILocation(line: 397, column: 21, scope: !400)
!402 = !DILocation(line: 397, column: 19, scope: !400)
!403 = !DILocation(line: 400, column: 9, scope: !400)
!404 = !DILocation(line: 400, column: 152, scope: !400)
!405 = !DILocation(line: 400, column: 512, scope: !400)
!406 = !DILocation(line: 400, column: 585, scope: !400)
!407 = !DILocation(line: 402, column: 15, scope: !408)
!408 = distinct !DILexicalBlock(scope: !409, file: !3, line: 402, column: 14)
!409 = distinct !DILexicalBlock(scope: !400, file: !3, line: 401, column: 9)
!410 = !DILocation(line: 402, column: 31, scope: !408)
!411 = !DILocation(line: 402, column: 29, scope: !408)
!412 = !DILocation(line: 402, column: 43, scope: !408)
!413 = !DILocation(line: 402, column: 14, scope: !409)
!414 = !DILocation(line: 404, column: 13, scope: !415)
!415 = distinct !DILexicalBlock(scope: !408, file: !3, line: 403, column: 11)
!416 = distinct !{!416, !403, !417}
!417 = !DILocation(line: 406, column: 9, scope: !400)
!418 = !DILocation(line: 409, column: 157, scope: !400)
!419 = !DILocation(line: 409, column: 163, scope: !400)
!420 = !DILocation(line: 409, column: 202, scope: !400)
!421 = !DILocation(line: 409, column: 221, scope: !400)
!422 = !DILocation(line: 409, column: 242, scope: !400)
!423 = !DILocation(line: 409, column: 188, scope: !400)
!424 = !DILocation(line: 409, column: 83, scope: !400)
!425 = !DILocation(line: 410, column: 7, scope: !400)
!426 = !DILocation(line: 414, column: 81, scope: !427)
!427 = distinct !DILexicalBlock(scope: !394, file: !3, line: 412, column: 7)
!428 = !DILocation(line: 417, column: 21, scope: !427)
!429 = !DILocation(line: 417, column: 19, scope: !427)
!430 = !DILocation(line: 420, column: 9, scope: !427)
!431 = !DILocation(line: 420, column: 152, scope: !427)
!432 = !DILocation(line: 420, column: 512, scope: !427)
!433 = !DILocation(line: 420, column: 585, scope: !427)
!434 = !DILocation(line: 422, column: 15, scope: !435)
!435 = distinct !DILexicalBlock(scope: !436, file: !3, line: 422, column: 14)
!436 = distinct !DILexicalBlock(scope: !427, file: !3, line: 421, column: 9)
!437 = !DILocation(line: 422, column: 31, scope: !435)
!438 = !DILocation(line: 422, column: 29, scope: !435)
!439 = !DILocation(line: 422, column: 43, scope: !435)
!440 = !DILocation(line: 422, column: 14, scope: !436)
!441 = !DILocation(line: 424, column: 13, scope: !442)
!442 = distinct !DILexicalBlock(scope: !435, file: !3, line: 423, column: 11)
!443 = distinct !{!443, !430, !444}
!444 = !DILocation(line: 426, column: 9, scope: !427)
!445 = !DILocation(line: 429, column: 3, scope: !360)
!446 = !DILocation(line: 431, column: 8, scope: !447)
!447 = distinct !DILexicalBlock(scope: !192, file: !3, line: 431, column: 6)
!448 = !DILocation(line: 431, column: 27, scope: !447)
!449 = !DILocation(line: 431, column: 43, scope: !447)
!450 = !DILocation(line: 431, column: 60, scope: !447)
!451 = !DILocation(line: 431, column: 6, scope: !192)
!452 = !DILocation(line: 437, column: 8, scope: !453)
!453 = distinct !DILexicalBlock(scope: !454, file: !3, line: 437, column: 8)
!454 = distinct !DILexicalBlock(scope: !447, file: !3, line: 432, column: 3)
!455 = !DILocation(line: 437, column: 27, scope: !453)
!456 = !DILocation(line: 437, column: 36, scope: !453)
!457 = !DILocation(line: 437, column: 8, scope: !454)
!458 = !DILocation(line: 440, column: 80, scope: !459)
!459 = distinct !DILexicalBlock(scope: !453, file: !3, line: 438, column: 5)
!460 = !DILocation(line: 443, column: 19, scope: !459)
!461 = !DILocation(line: 443, column: 17, scope: !459)
!462 = !DILocation(line: 446, column: 7, scope: !459)
!463 = !DILocation(line: 446, column: 505, scope: !459)
!464 = !DILocation(line: 446, column: 510, scope: !459)
!465 = !DILocation(line: 446, column: 583, scope: !459)
!466 = !DILocation(line: 448, column: 13, scope: !467)
!467 = distinct !DILexicalBlock(scope: !468, file: !3, line: 448, column: 12)
!468 = distinct !DILexicalBlock(scope: !459, file: !3, line: 447, column: 7)
!469 = !DILocation(line: 448, column: 29, scope: !467)
!470 = !DILocation(line: 448, column: 27, scope: !467)
!471 = !DILocation(line: 448, column: 41, scope: !467)
!472 = !DILocation(line: 448, column: 12, scope: !468)
!473 = !DILocation(line: 450, column: 11, scope: !474)
!474 = distinct !DILexicalBlock(scope: !467, file: !3, line: 449, column: 9)
!475 = distinct !{!475, !462, !476}
!476 = !DILocation(line: 452, column: 7, scope: !459)
!477 = !DILocation(line: 453, column: 5, scope: !459)
!478 = !DILocation(line: 457, column: 80, scope: !479)
!479 = distinct !DILexicalBlock(scope: !453, file: !3, line: 455, column: 5)
!480 = !DILocation(line: 460, column: 19, scope: !479)
!481 = !DILocation(line: 460, column: 17, scope: !479)
!482 = !DILocation(line: 463, column: 7, scope: !479)
!483 = !DILocation(line: 463, column: 505, scope: !479)
!484 = !DILocation(line: 463, column: 510, scope: !479)
!485 = !DILocation(line: 463, column: 583, scope: !479)
!486 = !DILocation(line: 465, column: 13, scope: !487)
!487 = distinct !DILexicalBlock(scope: !488, file: !3, line: 465, column: 12)
!488 = distinct !DILexicalBlock(scope: !479, file: !3, line: 464, column: 7)
!489 = !DILocation(line: 465, column: 29, scope: !487)
!490 = !DILocation(line: 465, column: 27, scope: !487)
!491 = !DILocation(line: 465, column: 41, scope: !487)
!492 = !DILocation(line: 465, column: 12, scope: !488)
!493 = !DILocation(line: 467, column: 11, scope: !494)
!494 = distinct !DILexicalBlock(scope: !487, file: !3, line: 466, column: 9)
!495 = distinct !{!495, !482, !496}
!496 = !DILocation(line: 469, column: 7, scope: !479)
!497 = !DILocation(line: 471, column: 3, scope: !454)
!498 = !DILocation(line: 473, column: 8, scope: !224)
!499 = !DILocation(line: 473, column: 27, scope: !224)
!500 = !DILocation(line: 473, column: 43, scope: !224)
!501 = !DILocation(line: 473, column: 60, scope: !224)
!502 = !DILocation(line: 473, column: 6, scope: !192)
!503 = !DILocation(line: 475, column: 5, scope: !223)
!504 = !DILocation(line: 475, column: 16, scope: !223)
!505 = !DILocation(line: 482, column: 76, scope: !229)
!506 = !DILocation(line: 482, column: 84, scope: !229)
!507 = !DILocation(line: 482, column: 106, scope: !229)
!508 = !DILocation(line: 482, column: 8, scope: !223)
!509 = !DILocation(line: 484, column: 7, scope: !228)
!510 = !DILocation(line: 484, column: 12, scope: !227)
!511 = !DILocation(line: 484, column: 30, scope: !227)
!512 = !DILocation(line: 484, column: 115, scope: !227)
!513 = !DILocation(line: 484, column: 216, scope: !227)
!514 = !DILocation(line: 484, column: 225, scope: !227)
!515 = !DILocation(line: 484, column: 146, scope: !227)
!516 = !DILocation(line: 484, column: 254, scope: !227)
!517 = !DILocation(line: 484, column: 262, scope: !228)
!518 = !DILocation(line: 484, column: 262, scope: !227)
!519 = !DILocation(line: 485, column: 21, scope: !228)
!520 = !DILocation(line: 486, column: 5, scope: !228)
!521 = !DILocation(line: 488, column: 60, scope: !522)
!522 = distinct !DILexicalBlock(scope: !223, file: !3, line: 488, column: 8)
!523 = !DILocation(line: 488, column: 64, scope: !522)
!524 = !DILocation(line: 488, column: 85, scope: !522)
!525 = !DILocation(line: 488, column: 8, scope: !223)
!526 = !DILocation(line: 491, column: 62, scope: !527)
!527 = distinct !DILexicalBlock(scope: !522, file: !3, line: 489, column: 5)
!528 = !DILocation(line: 494, column: 19, scope: !527)
!529 = !DILocation(line: 494, column: 17, scope: !527)
!530 = !DILocation(line: 496, column: 7, scope: !527)
!531 = !DILocation(line: 496, column: 65, scope: !527)
!532 = !DILocation(line: 496, column: 69, scope: !527)
!533 = !DILocation(line: 496, column: 90, scope: !527)
!534 = !DILocation(line: 498, column: 13, scope: !535)
!535 = distinct !DILexicalBlock(scope: !536, file: !3, line: 498, column: 12)
!536 = distinct !DILexicalBlock(scope: !527, file: !3, line: 497, column: 7)
!537 = !DILocation(line: 498, column: 29, scope: !535)
!538 = !DILocation(line: 498, column: 27, scope: !535)
!539 = !DILocation(line: 498, column: 40, scope: !535)
!540 = !DILocation(line: 498, column: 12, scope: !536)
!541 = !DILocation(line: 500, column: 11, scope: !542)
!542 = distinct !DILexicalBlock(scope: !535, file: !3, line: 499, column: 9)
!543 = distinct !{!543, !530, !544}
!544 = !DILocation(line: 502, column: 7, scope: !527)
!545 = !DILocation(line: 503, column: 5, scope: !527)
!546 = !DILocation(line: 506, column: 5, scope: !223)
!547 = !DILocation(line: 506, column: 14, scope: !548)
!548 = distinct !DILexicalBlock(scope: !549, file: !3, line: 506, column: 13)
!549 = distinct !DILexicalBlock(scope: !223, file: !3, line: 506, column: 7)
!550 = !DILocation(line: 506, column: 33, scope: !548)
!551 = !DILocation(line: 506, column: 43, scope: !548)
!552 = !DILocation(line: 506, column: 13, scope: !549)
!553 = !DILocation(line: 506, column: 137, scope: !554)
!554 = distinct !DILexicalBlock(scope: !548, file: !3, line: 506, column: 61)
!555 = !DILocation(line: 506, column: 160, scope: !554)
!556 = !DILocation(line: 506, column: 172, scope: !557)
!557 = distinct !DILexicalBlock(scope: !548, file: !3, line: 506, column: 171)
!558 = !DILocation(line: 506, column: 191, scope: !557)
!559 = !DILocation(line: 506, column: 201, scope: !557)
!560 = !DILocation(line: 506, column: 171, scope: !548)
!561 = !DILocation(line: 506, column: 295, scope: !562)
!562 = distinct !DILexicalBlock(scope: !557, file: !3, line: 506, column: 219)
!563 = !DILocation(line: 506, column: 393, scope: !562)
!564 = !DILocation(line: 506, column: 417, scope: !562)
!565 = !DILocation(line: 506, column: 429, scope: !566)
!566 = distinct !DILexicalBlock(scope: !557, file: !3, line: 506, column: 428)
!567 = !DILocation(line: 506, column: 448, scope: !566)
!568 = !DILocation(line: 506, column: 458, scope: !566)
!569 = !DILocation(line: 506, column: 428, scope: !557)
!570 = !DILocation(line: 506, column: 552, scope: !571)
!571 = distinct !DILexicalBlock(scope: !566, file: !3, line: 506, column: 476)
!572 = !DILocation(line: 506, column: 649, scope: !571)
!573 = !DILocation(line: 506, column: 672, scope: !571)
!574 = !DILocation(line: 506, column: 755, scope: !575)
!575 = distinct !DILexicalBlock(scope: !566, file: !3, line: 506, column: 679)
!576 = !DILocation(line: 506, column: 853, scope: !575)
!577 = !DILocation(line: 506, column: 879, scope: !549)
!578 = !DILocation(line: 508, column: 8, scope: !579)
!579 = distinct !DILexicalBlock(scope: !223, file: !3, line: 508, column: 8)
!580 = !DILocation(line: 508, column: 27, scope: !579)
!581 = !DILocation(line: 508, column: 36, scope: !579)
!582 = !DILocation(line: 508, column: 8, scope: !223)
!583 = !DILocation(line: 511, column: 19, scope: !584)
!584 = distinct !DILexicalBlock(scope: !579, file: !3, line: 509, column: 5)
!585 = !DILocation(line: 511, column: 17, scope: !584)
!586 = !DILocation(line: 514, column: 7, scope: !584)
!587 = !DILocation(line: 514, column: 432, scope: !584)
!588 = !DILocation(line: 514, column: 510, scope: !584)
!589 = !DILocation(line: 514, column: 583, scope: !584)
!590 = !DILocation(line: 516, column: 13, scope: !591)
!591 = distinct !DILexicalBlock(scope: !592, file: !3, line: 516, column: 12)
!592 = distinct !DILexicalBlock(scope: !584, file: !3, line: 515, column: 7)
!593 = !DILocation(line: 516, column: 29, scope: !591)
!594 = !DILocation(line: 516, column: 27, scope: !591)
!595 = !DILocation(line: 516, column: 41, scope: !591)
!596 = !DILocation(line: 516, column: 12, scope: !592)
!597 = !DILocation(line: 518, column: 11, scope: !598)
!598 = distinct !DILexicalBlock(scope: !591, file: !3, line: 517, column: 9)
!599 = distinct !{!599, !586, !600}
!600 = !DILocation(line: 520, column: 7, scope: !584)
!601 = !DILocation(line: 521, column: 5, scope: !584)
!602 = !DILocation(line: 525, column: 19, scope: !603)
!603 = distinct !DILexicalBlock(scope: !579, file: !3, line: 523, column: 5)
!604 = !DILocation(line: 525, column: 17, scope: !603)
!605 = !DILocation(line: 528, column: 7, scope: !603)
!606 = !DILocation(line: 528, column: 432, scope: !603)
!607 = !DILocation(line: 528, column: 510, scope: !603)
!608 = !DILocation(line: 528, column: 583, scope: !603)
!609 = !DILocation(line: 530, column: 13, scope: !610)
!610 = distinct !DILexicalBlock(scope: !611, file: !3, line: 530, column: 12)
!611 = distinct !DILexicalBlock(scope: !603, file: !3, line: 529, column: 7)
!612 = !DILocation(line: 530, column: 29, scope: !610)
!613 = !DILocation(line: 530, column: 27, scope: !610)
!614 = !DILocation(line: 530, column: 41, scope: !610)
!615 = !DILocation(line: 530, column: 12, scope: !611)
!616 = !DILocation(line: 532, column: 11, scope: !617)
!617 = distinct !DILexicalBlock(scope: !610, file: !3, line: 531, column: 9)
!618 = distinct !{!618, !605, !619}
!619 = !DILocation(line: 534, column: 7, scope: !603)
!620 = !DILocation(line: 538, column: 8, scope: !621)
!621 = distinct !DILexicalBlock(scope: !223, file: !3, line: 538, column: 8)
!622 = !DILocation(line: 538, column: 22, scope: !621)
!623 = !DILocation(line: 538, column: 8, scope: !223)
!624 = !DILocation(line: 540, column: 82, scope: !625)
!625 = distinct !DILexicalBlock(scope: !621, file: !3, line: 539, column: 5)
!626 = !DILocation(line: 541, column: 5, scope: !625)
!627 = !DILocation(line: 542, column: 3, scope: !224)
!628 = !DILocation(line: 542, column: 3, scope: !223)
!629 = !DILocation(line: 545, column: 8, scope: !630)
!630 = distinct !DILexicalBlock(scope: !192, file: !3, line: 545, column: 6)
!631 = !DILocation(line: 545, column: 27, scope: !630)
!632 = !DILocation(line: 545, column: 43, scope: !630)
!633 = !DILocation(line: 545, column: 60, scope: !630)
!634 = !DILocation(line: 545, column: 6, scope: !192)
!635 = !DILocation(line: 552, column: 8, scope: !636)
!636 = distinct !DILexicalBlock(scope: !637, file: !3, line: 552, column: 8)
!637 = distinct !DILexicalBlock(scope: !630, file: !3, line: 546, column: 3)
!638 = !DILocation(line: 552, column: 27, scope: !636)
!639 = !DILocation(line: 552, column: 38, scope: !636)
!640 = !DILocation(line: 552, column: 8, scope: !637)
!641 = !DILocation(line: 555, column: 80, scope: !642)
!642 = distinct !DILexicalBlock(scope: !636, file: !3, line: 553, column: 5)
!643 = !DILocation(line: 558, column: 80, scope: !642)
!644 = !DILocation(line: 561, column: 19, scope: !642)
!645 = !DILocation(line: 561, column: 17, scope: !642)
!646 = !DILocation(line: 564, column: 7, scope: !642)
!647 = !DILocation(line: 564, column: 290, scope: !642)
!648 = !DILocation(line: 564, column: 510, scope: !642)
!649 = !DILocation(line: 564, column: 583, scope: !642)
!650 = !DILocation(line: 566, column: 13, scope: !651)
!651 = distinct !DILexicalBlock(scope: !652, file: !3, line: 566, column: 12)
!652 = distinct !DILexicalBlock(scope: !642, file: !3, line: 565, column: 7)
!653 = !DILocation(line: 566, column: 29, scope: !651)
!654 = !DILocation(line: 566, column: 27, scope: !651)
!655 = !DILocation(line: 566, column: 40, scope: !651)
!656 = !DILocation(line: 566, column: 12, scope: !652)
!657 = !DILocation(line: 568, column: 11, scope: !658)
!658 = distinct !DILexicalBlock(scope: !651, file: !3, line: 567, column: 9)
!659 = distinct !{!659, !646, !660}
!660 = !DILocation(line: 570, column: 7, scope: !642)
!661 = !DILocation(line: 573, column: 156, scope: !642)
!662 = !DILocation(line: 573, column: 163, scope: !642)
!663 = !DILocation(line: 573, column: 202, scope: !642)
!664 = !DILocation(line: 573, column: 221, scope: !642)
!665 = !DILocation(line: 573, column: 244, scope: !642)
!666 = !DILocation(line: 573, column: 188, scope: !642)
!667 = !DILocation(line: 573, column: 82, scope: !642)
!668 = !DILocation(line: 574, column: 5, scope: !642)
!669 = !DILocation(line: 575, column: 13, scope: !670)
!670 = distinct !DILexicalBlock(scope: !636, file: !3, line: 575, column: 13)
!671 = !DILocation(line: 575, column: 32, scope: !670)
!672 = !DILocation(line: 575, column: 43, scope: !670)
!673 = !DILocation(line: 575, column: 13, scope: !636)
!674 = !DILocation(line: 578, column: 80, scope: !675)
!675 = distinct !DILexicalBlock(scope: !670, file: !3, line: 576, column: 5)
!676 = !DILocation(line: 581, column: 156, scope: !675)
!677 = !DILocation(line: 581, column: 163, scope: !675)
!678 = !DILocation(line: 581, column: 202, scope: !675)
!679 = !DILocation(line: 581, column: 221, scope: !675)
!680 = !DILocation(line: 581, column: 244, scope: !675)
!681 = !DILocation(line: 581, column: 188, scope: !675)
!682 = !DILocation(line: 581, column: 82, scope: !675)
!683 = !DILocation(line: 582, column: 5, scope: !675)
!684 = !DILocation(line: 586, column: 80, scope: !685)
!685 = distinct !DILexicalBlock(scope: !670, file: !3, line: 584, column: 5)
!686 = !DILocation(line: 589, column: 80, scope: !685)
!687 = !DILocation(line: 592, column: 19, scope: !685)
!688 = !DILocation(line: 592, column: 17, scope: !685)
!689 = !DILocation(line: 595, column: 7, scope: !685)
!690 = !DILocation(line: 595, column: 290, scope: !685)
!691 = !DILocation(line: 595, column: 510, scope: !685)
!692 = !DILocation(line: 595, column: 583, scope: !685)
!693 = !DILocation(line: 597, column: 13, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !3, line: 597, column: 12)
!695 = distinct !DILexicalBlock(scope: !685, file: !3, line: 596, column: 7)
!696 = !DILocation(line: 597, column: 29, scope: !694)
!697 = !DILocation(line: 597, column: 27, scope: !694)
!698 = !DILocation(line: 597, column: 40, scope: !694)
!699 = !DILocation(line: 597, column: 12, scope: !695)
!700 = !DILocation(line: 599, column: 11, scope: !701)
!701 = distinct !DILexicalBlock(scope: !694, file: !3, line: 598, column: 9)
!702 = distinct !{!702, !689, !703}
!703 = !DILocation(line: 601, column: 7, scope: !685)
!704 = !DILocation(line: 603, column: 3, scope: !637)
!705 = !DILocation(line: 607, column: 8, scope: !706)
!706 = distinct !DILexicalBlock(scope: !192, file: !3, line: 607, column: 6)
!707 = !DILocation(line: 607, column: 27, scope: !706)
!708 = !DILocation(line: 607, column: 43, scope: !706)
!709 = !DILocation(line: 607, column: 60, scope: !706)
!710 = !DILocation(line: 607, column: 6, scope: !192)
!711 = !DILocation(line: 613, column: 87, scope: !712)
!712 = distinct !DILexicalBlock(scope: !713, file: !3, line: 613, column: 8)
!713 = distinct !DILexicalBlock(scope: !706, file: !3, line: 608, column: 3)
!714 = !DILocation(line: 613, column: 92, scope: !712)
!715 = !DILocation(line: 613, column: 112, scope: !712)
!716 = !DILocation(line: 613, column: 130, scope: !712)
!717 = !DILocation(line: 614, column: 88, scope: !712)
!718 = !DILocation(line: 614, column: 93, scope: !712)
!719 = !DILocation(line: 614, column: 113, scope: !712)
!720 = !DILocation(line: 614, column: 131, scope: !712)
!721 = !DILocation(line: 614, column: 215, scope: !712)
!722 = !DILocation(line: 614, column: 221, scope: !712)
!723 = !DILocation(line: 614, column: 245, scope: !712)
!724 = !DILocation(line: 613, column: 8, scope: !713)
!725 = !DILocation(line: 616, column: 290, scope: !726)
!726 = distinct !DILexicalBlock(scope: !727, file: !3, line: 616, column: 10)
!727 = distinct !DILexicalBlock(scope: !712, file: !3, line: 615, column: 5)
!728 = !DILocation(line: 616, column: 511, scope: !726)
!729 = !DILocation(line: 616, column: 585, scope: !726)
!730 = !DILocation(line: 616, column: 595, scope: !726)
!731 = !DILocation(line: 616, column: 599, scope: !726)
!732 = !DILocation(line: 616, column: 618, scope: !726)
!733 = !DILocation(line: 616, column: 629, scope: !726)
!734 = !DILocation(line: 616, column: 10, scope: !727)
!735 = !DILocation(line: 618, column: 9, scope: !736)
!736 = distinct !DILexicalBlock(scope: !726, file: !3, line: 617, column: 7)
!737 = !DILocation(line: 620, column: 5, scope: !727)
!738 = !DILocation(line: 624, column: 10, scope: !739)
!739 = distinct !DILexicalBlock(scope: !740, file: !3, line: 624, column: 10)
!740 = distinct !DILexicalBlock(scope: !712, file: !3, line: 622, column: 5)
!741 = !DILocation(line: 624, column: 29, scope: !739)
!742 = !DILocation(line: 624, column: 40, scope: !739)
!743 = !DILocation(line: 624, column: 10, scope: !740)
!744 = !DILocation(line: 627, column: 82, scope: !745)
!745 = distinct !DILexicalBlock(scope: !739, file: !3, line: 625, column: 7)
!746 = !DILocation(line: 630, column: 21, scope: !745)
!747 = !DILocation(line: 630, column: 19, scope: !745)
!748 = !DILocation(line: 633, column: 9, scope: !745)
!749 = !DILocation(line: 633, column: 294, scope: !745)
!750 = !DILocation(line: 633, column: 515, scope: !745)
!751 = !DILocation(line: 633, column: 589, scope: !745)
!752 = !DILocation(line: 635, column: 15, scope: !753)
!753 = distinct !DILexicalBlock(scope: !754, file: !3, line: 635, column: 14)
!754 = distinct !DILexicalBlock(scope: !745, file: !3, line: 634, column: 9)
!755 = !DILocation(line: 635, column: 31, scope: !753)
!756 = !DILocation(line: 635, column: 29, scope: !753)
!757 = !DILocation(line: 635, column: 42, scope: !753)
!758 = !DILocation(line: 635, column: 14, scope: !754)
!759 = !DILocation(line: 637, column: 13, scope: !760)
!760 = distinct !DILexicalBlock(scope: !753, file: !3, line: 636, column: 11)
!761 = distinct !{!761, !748, !762}
!762 = !DILocation(line: 639, column: 9, scope: !745)
!763 = !DILocation(line: 640, column: 7, scope: !745)
!764 = !DILocation(line: 644, column: 82, scope: !765)
!765 = distinct !DILexicalBlock(scope: !739, file: !3, line: 642, column: 7)
!766 = !DILocation(line: 647, column: 21, scope: !765)
!767 = !DILocation(line: 647, column: 19, scope: !765)
!768 = !DILocation(line: 650, column: 9, scope: !765)
!769 = !DILocation(line: 650, column: 294, scope: !765)
!770 = !DILocation(line: 650, column: 515, scope: !765)
!771 = !DILocation(line: 650, column: 589, scope: !765)
!772 = !DILocation(line: 652, column: 15, scope: !773)
!773 = distinct !DILexicalBlock(scope: !774, file: !3, line: 652, column: 14)
!774 = distinct !DILexicalBlock(scope: !765, file: !3, line: 651, column: 9)
!775 = !DILocation(line: 652, column: 31, scope: !773)
!776 = !DILocation(line: 652, column: 29, scope: !773)
!777 = !DILocation(line: 652, column: 42, scope: !773)
!778 = !DILocation(line: 652, column: 14, scope: !774)
!779 = !DILocation(line: 654, column: 13, scope: !780)
!780 = distinct !DILexicalBlock(scope: !773, file: !3, line: 653, column: 11)
!781 = distinct !{!781, !768, !782}
!782 = !DILocation(line: 656, column: 9, scope: !765)
!783 = !DILocation(line: 659, column: 3, scope: !713)
!784 = !DILocation(line: 665, column: 8, scope: !785)
!785 = distinct !DILexicalBlock(scope: !192, file: !3, line: 665, column: 7)
!786 = !DILocation(line: 665, column: 27, scope: !785)
!787 = !DILocation(line: 665, column: 31, scope: !785)
!788 = !DILocation(line: 665, column: 41, scope: !785)
!789 = !DILocation(line: 665, column: 7, scope: !192)
!790 = !DILocation(line: 668, column: 86, scope: !791)
!791 = distinct !DILexicalBlock(scope: !792, file: !3, line: 668, column: 8)
!792 = distinct !DILexicalBlock(scope: !785, file: !3, line: 666, column: 3)
!793 = !DILocation(line: 668, column: 91, scope: !791)
!794 = !DILocation(line: 668, column: 111, scope: !791)
!795 = !DILocation(line: 668, column: 8, scope: !792)
!796 = !DILocation(line: 670, column: 11, scope: !797)
!797 = distinct !DILexicalBlock(scope: !798, file: !3, line: 670, column: 10)
!798 = distinct !DILexicalBlock(scope: !791, file: !3, line: 669, column: 5)
!799 = !DILocation(line: 670, column: 30, scope: !797)
!800 = !DILocation(line: 670, column: 34, scope: !797)
!801 = !DILocation(line: 670, column: 44, scope: !797)
!802 = !DILocation(line: 670, column: 10, scope: !798)
!803 = !DILocation(line: 678, column: 81, scope: !804)
!804 = distinct !DILexicalBlock(scope: !797, file: !3, line: 671, column: 7)
!805 = !DILocation(line: 681, column: 21, scope: !804)
!806 = !DILocation(line: 681, column: 19, scope: !804)
!807 = !DILocation(line: 684, column: 9, scope: !804)
!808 = !DILocation(line: 684, column: 153, scope: !804)
!809 = !DILocation(line: 684, column: 515, scope: !804)
!810 = !DILocation(line: 684, column: 589, scope: !804)
!811 = !DILocation(line: 686, column: 15, scope: !812)
!812 = distinct !DILexicalBlock(scope: !813, file: !3, line: 686, column: 14)
!813 = distinct !DILexicalBlock(scope: !804, file: !3, line: 685, column: 9)
!814 = !DILocation(line: 686, column: 31, scope: !812)
!815 = !DILocation(line: 686, column: 29, scope: !812)
!816 = !DILocation(line: 686, column: 43, scope: !812)
!817 = !DILocation(line: 686, column: 14, scope: !813)
!818 = !DILocation(line: 688, column: 13, scope: !819)
!819 = distinct !DILexicalBlock(scope: !812, file: !3, line: 687, column: 11)
!820 = distinct !{!820, !807, !821}
!821 = !DILocation(line: 690, column: 9, scope: !804)
!822 = !DILocation(line: 693, column: 9, scope: !804)
!823 = !DILocation(line: 693, column: 165, scope: !824)
!824 = distinct !DILexicalBlock(scope: !804, file: !3, line: 693, column: 12)
!825 = !DILocation(line: 693, column: 174, scope: !824)
!826 = !DILocation(line: 693, column: 202, scope: !824)
!827 = !DILocation(line: 693, column: 221, scope: !824)
!828 = !DILocation(line: 693, column: 225, scope: !824)
!829 = !DILocation(line: 693, column: 198, scope: !824)
!830 = !DILocation(line: 693, column: 91, scope: !824)
!831 = !DILocation(line: 693, column: 388, scope: !824)
!832 = !DILocation(line: 693, column: 396, scope: !824)
!833 = !DILocation(line: 693, column: 455, scope: !824)
!834 = !DILocation(line: 693, column: 474, scope: !824)
!835 = !DILocation(line: 693, column: 478, scope: !824)
!836 = !DILocation(line: 693, column: 487, scope: !824)
!837 = !DILocation(line: 693, column: 506, scope: !824)
!838 = !DILocation(line: 693, column: 510, scope: !824)
!839 = !DILocation(line: 693, column: 485, scope: !824)
!840 = !DILocation(line: 693, column: 440, scope: !824)
!841 = !DILocation(line: 693, column: 314, scope: !824)
!842 = !DILocation(line: 693, column: 527, scope: !824)
!843 = !DILocation(line: 697, column: 81, scope: !804)
!844 = !DILocation(line: 700, column: 21, scope: !804)
!845 = !DILocation(line: 700, column: 19, scope: !804)
!846 = !DILocation(line: 703, column: 9, scope: !804)
!847 = !DILocation(line: 703, column: 153, scope: !804)
!848 = !DILocation(line: 703, column: 515, scope: !804)
!849 = !DILocation(line: 703, column: 589, scope: !804)
!850 = !DILocation(line: 705, column: 15, scope: !851)
!851 = distinct !DILexicalBlock(scope: !852, file: !3, line: 705, column: 14)
!852 = distinct !DILexicalBlock(scope: !804, file: !3, line: 704, column: 9)
!853 = !DILocation(line: 705, column: 31, scope: !851)
!854 = !DILocation(line: 705, column: 29, scope: !851)
!855 = !DILocation(line: 705, column: 43, scope: !851)
!856 = !DILocation(line: 705, column: 14, scope: !852)
!857 = !DILocation(line: 707, column: 13, scope: !858)
!858 = distinct !DILexicalBlock(scope: !851, file: !3, line: 706, column: 11)
!859 = distinct !{!859, !846, !860}
!860 = !DILocation(line: 709, column: 9, scope: !804)
!861 = !DILocation(line: 710, column: 7, scope: !804)
!862 = !DILocation(line: 714, column: 81, scope: !863)
!863 = distinct !DILexicalBlock(scope: !797, file: !3, line: 712, column: 7)
!864 = !DILocation(line: 717, column: 21, scope: !863)
!865 = !DILocation(line: 717, column: 19, scope: !863)
!866 = !DILocation(line: 720, column: 9, scope: !863)
!867 = !DILocation(line: 720, column: 153, scope: !863)
!868 = !DILocation(line: 720, column: 515, scope: !863)
!869 = !DILocation(line: 720, column: 589, scope: !863)
!870 = !DILocation(line: 722, column: 15, scope: !871)
!871 = distinct !DILexicalBlock(scope: !872, file: !3, line: 722, column: 14)
!872 = distinct !DILexicalBlock(scope: !863, file: !3, line: 721, column: 9)
!873 = !DILocation(line: 722, column: 31, scope: !871)
!874 = !DILocation(line: 722, column: 29, scope: !871)
!875 = !DILocation(line: 722, column: 43, scope: !871)
!876 = !DILocation(line: 722, column: 14, scope: !872)
!877 = !DILocation(line: 724, column: 13, scope: !878)
!878 = distinct !DILexicalBlock(scope: !871, file: !3, line: 723, column: 11)
!879 = distinct !{!879, !866, !880}
!880 = !DILocation(line: 726, column: 9, scope: !863)
!881 = !DILocation(line: 728, column: 5, scope: !798)
!882 = !DILocation(line: 732, column: 11, scope: !883)
!883 = distinct !DILexicalBlock(scope: !884, file: !3, line: 732, column: 10)
!884 = distinct !DILexicalBlock(scope: !791, file: !3, line: 730, column: 5)
!885 = !DILocation(line: 732, column: 30, scope: !883)
!886 = !DILocation(line: 732, column: 34, scope: !883)
!887 = !DILocation(line: 732, column: 44, scope: !883)
!888 = !DILocation(line: 732, column: 10, scope: !884)
!889 = !DILocation(line: 734, column: 9, scope: !890)
!890 = distinct !DILexicalBlock(scope: !883, file: !3, line: 733, column: 7)
!891 = !DILocation(line: 739, column: 88, scope: !892)
!892 = distinct !DILexicalBlock(scope: !883, file: !3, line: 737, column: 7)
!893 = !DILocation(line: 739, column: 20, scope: !892)
!894 = !DILocation(line: 740, column: 89, scope: !892)
!895 = !DILocation(line: 740, column: 21, scope: !892)
!896 = !DILocation(line: 741, column: 15, scope: !897)
!897 = distinct !DILexicalBlock(scope: !892, file: !3, line: 741, column: 12)
!898 = !DILocation(line: 741, column: 27, scope: !897)
!899 = !DILocation(line: 741, column: 52, scope: !897)
!900 = !DILocation(line: 741, column: 71, scope: !897)
!901 = !DILocation(line: 741, column: 75, scope: !897)
!902 = !DILocation(line: 741, column: 49, scope: !897)
!903 = !DILocation(line: 741, column: 86, scope: !897)
!904 = !DILocation(line: 742, column: 15, scope: !897)
!905 = !DILocation(line: 742, column: 28, scope: !897)
!906 = !DILocation(line: 742, column: 52, scope: !897)
!907 = !DILocation(line: 742, column: 71, scope: !897)
!908 = !DILocation(line: 742, column: 75, scope: !897)
!909 = !DILocation(line: 742, column: 49, scope: !897)
!910 = !DILocation(line: 742, column: 83, scope: !897)
!911 = !DILocation(line: 743, column: 15, scope: !897)
!912 = !DILocation(line: 743, column: 27, scope: !897)
!913 = !DILocation(line: 743, column: 52, scope: !897)
!914 = !DILocation(line: 743, column: 71, scope: !897)
!915 = !DILocation(line: 743, column: 75, scope: !897)
!916 = !DILocation(line: 743, column: 49, scope: !897)
!917 = !DILocation(line: 741, column: 12, scope: !892)
!918 = !DILocation(line: 745, column: 11, scope: !919)
!919 = distinct !DILexicalBlock(scope: !897, file: !3, line: 744, column: 9)
!920 = !DILocation(line: 749, column: 3, scope: !792)
!921 = !DILocation(line: 751, column: 3, scope: !192)
!922 = !DILocation(line: 752, column: 1, scope: !192)
!923 = distinct !DISubprogram(name: "HAL_RCC_ClockConfig", scope: !3, file: !3, line: 777, type: !924, scopeLine: 778, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !934)
!924 = !DISubroutineType(types: !925)
!925 = !{!113, !926, !6}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_ClkInitTypeDef", file: !197, line: 264, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !197, line: 250, size: 128, elements: !929)
!929 = !{!930, !931, !932, !933}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ClockType", scope: !928, file: !197, line: 252, baseType: !6, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCLKSource", scope: !928, file: !197, line: 255, baseType: !6, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "AHBCLKDivider", scope: !928, file: !197, line: 258, baseType: !6, size: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "APB1CLKDivider", scope: !928, file: !197, line: 261, baseType: !6, size: 32, offset: 96)
!934 = !{!935, !936, !937}
!935 = !DILocalVariable(name: "RCC_ClkInitStruct", arg: 1, scope: !923, file: !3, line: 777, type: !926)
!936 = !DILocalVariable(name: "FLatency", arg: 2, scope: !923, file: !3, line: 777, type: !6)
!937 = !DILocalVariable(name: "tickstart", scope: !923, file: !3, line: 779, type: !6)
!938 = !DILocation(line: 777, column: 59, scope: !923)
!939 = !DILocation(line: 777, column: 87, scope: !923)
!940 = !DILocation(line: 779, column: 3, scope: !923)
!941 = !DILocation(line: 779, column: 12, scope: !923)
!942 = !DILocation(line: 782, column: 6, scope: !943)
!943 = distinct !DILexicalBlock(scope: !923, file: !3, line: 782, column: 6)
!944 = !DILocation(line: 782, column: 24, scope: !943)
!945 = !DILocation(line: 782, column: 6, scope: !923)
!946 = !DILocation(line: 784, column: 5, scope: !947)
!947 = distinct !DILexicalBlock(scope: !943, file: !3, line: 783, column: 3)
!948 = !DILocation(line: 796, column: 6, scope: !949)
!949 = distinct !DILexicalBlock(scope: !923, file: !3, line: 796, column: 6)
!950 = !DILocation(line: 796, column: 89, scope: !949)
!951 = !DILocation(line: 796, column: 95, scope: !949)
!952 = !DILocation(line: 796, column: 15, scope: !949)
!953 = !DILocation(line: 796, column: 6, scope: !923)
!954 = !DILocation(line: 799, column: 149, scope: !955)
!955 = distinct !DILexicalBlock(scope: !949, file: !3, line: 797, column: 3)
!956 = !DILocation(line: 799, column: 152, scope: !955)
!957 = !DILocation(line: 799, column: 176, scope: !955)
!958 = !DILocation(line: 799, column: 173, scope: !955)
!959 = !DILocation(line: 799, column: 78, scope: !955)
!960 = !DILocation(line: 803, column: 80, scope: !961)
!961 = distinct !DILexicalBlock(scope: !955, file: !3, line: 803, column: 8)
!962 = !DILocation(line: 803, column: 86, scope: !961)
!963 = !DILocation(line: 803, column: 111, scope: !961)
!964 = !DILocation(line: 803, column: 108, scope: !961)
!965 = !DILocation(line: 803, column: 8, scope: !955)
!966 = !DILocation(line: 805, column: 7, scope: !967)
!967 = distinct !DILexicalBlock(scope: !961, file: !3, line: 804, column: 5)
!968 = !DILocation(line: 807, column: 3, scope: !955)
!969 = !DILocation(line: 810, column: 8, scope: !970)
!970 = distinct !DILexicalBlock(scope: !923, file: !3, line: 810, column: 6)
!971 = !DILocation(line: 810, column: 27, scope: !970)
!972 = !DILocation(line: 810, column: 38, scope: !970)
!973 = !DILocation(line: 810, column: 55, scope: !970)
!974 = !DILocation(line: 810, column: 6, scope: !923)
!975 = !DILocation(line: 814, column: 10, scope: !976)
!976 = distinct !DILexicalBlock(scope: !977, file: !3, line: 814, column: 8)
!977 = distinct !DILexicalBlock(scope: !970, file: !3, line: 811, column: 3)
!978 = !DILocation(line: 814, column: 29, scope: !976)
!979 = !DILocation(line: 814, column: 40, scope: !976)
!980 = !DILocation(line: 814, column: 57, scope: !976)
!981 = !DILocation(line: 814, column: 8, scope: !977)
!982 = !DILocation(line: 816, column: 157, scope: !983)
!983 = distinct !DILexicalBlock(scope: !976, file: !3, line: 815, column: 5)
!984 = !DILocation(line: 816, column: 165, scope: !983)
!985 = !DILocation(line: 816, column: 189, scope: !983)
!986 = !DILocation(line: 816, column: 83, scope: !983)
!987 = !DILocation(line: 817, column: 5, scope: !983)
!988 = !DILocation(line: 821, column: 155, scope: !977)
!989 = !DILocation(line: 821, column: 163, scope: !977)
!990 = !DILocation(line: 821, column: 190, scope: !977)
!991 = !DILocation(line: 821, column: 209, scope: !977)
!992 = !DILocation(line: 821, column: 187, scope: !977)
!993 = !DILocation(line: 821, column: 81, scope: !977)
!994 = !DILocation(line: 822, column: 3, scope: !977)
!995 = !DILocation(line: 825, column: 8, scope: !996)
!996 = distinct !DILexicalBlock(scope: !923, file: !3, line: 825, column: 6)
!997 = !DILocation(line: 825, column: 27, scope: !996)
!998 = !DILocation(line: 825, column: 38, scope: !996)
!999 = !DILocation(line: 825, column: 55, scope: !996)
!1000 = !DILocation(line: 825, column: 6, scope: !923)
!1001 = !DILocation(line: 830, column: 8, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 830, column: 8)
!1003 = distinct !DILexicalBlock(scope: !996, file: !3, line: 826, column: 3)
!1004 = !DILocation(line: 830, column: 27, scope: !1002)
!1005 = !DILocation(line: 830, column: 40, scope: !1002)
!1006 = !DILocation(line: 830, column: 8, scope: !1003)
!1007 = !DILocation(line: 833, column: 148, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 833, column: 10)
!1009 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 831, column: 5)
!1010 = !DILocation(line: 833, column: 510, scope: !1008)
!1011 = !DILocation(line: 833, column: 584, scope: !1008)
!1012 = !DILocation(line: 833, column: 10, scope: !1009)
!1013 = !DILocation(line: 835, column: 9, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 834, column: 7)
!1015 = !DILocation(line: 837, column: 5, scope: !1009)
!1016 = !DILocation(line: 839, column: 13, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 839, column: 13)
!1018 = !DILocation(line: 839, column: 32, scope: !1017)
!1019 = !DILocation(line: 839, column: 45, scope: !1017)
!1020 = !DILocation(line: 839, column: 13, scope: !1002)
!1021 = !DILocation(line: 842, column: 148, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 842, column: 10)
!1023 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 840, column: 5)
!1024 = !DILocation(line: 842, column: 510, scope: !1022)
!1025 = !DILocation(line: 842, column: 584, scope: !1022)
!1026 = !DILocation(line: 842, column: 10, scope: !1023)
!1027 = !DILocation(line: 844, column: 9, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 843, column: 7)
!1029 = !DILocation(line: 846, column: 5, scope: !1023)
!1030 = !DILocation(line: 849, column: 13, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 849, column: 13)
!1032 = !DILocation(line: 849, column: 32, scope: !1031)
!1033 = !DILocation(line: 849, column: 45, scope: !1031)
!1034 = !DILocation(line: 849, column: 13, scope: !1017)
!1035 = !DILocation(line: 852, column: 289, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 852, column: 10)
!1037 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 850, column: 5)
!1038 = !DILocation(line: 852, column: 510, scope: !1036)
!1039 = !DILocation(line: 852, column: 584, scope: !1036)
!1040 = !DILocation(line: 852, column: 10, scope: !1037)
!1041 = !DILocation(line: 854, column: 9, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 853, column: 7)
!1043 = !DILocation(line: 856, column: 5, scope: !1037)
!1044 = !DILocation(line: 862, column: 147, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 862, column: 10)
!1046 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 860, column: 5)
!1047 = !DILocation(line: 862, column: 507, scope: !1045)
!1048 = !DILocation(line: 862, column: 580, scope: !1045)
!1049 = !DILocation(line: 862, column: 10, scope: !1046)
!1050 = !DILocation(line: 864, column: 9, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 863, column: 7)
!1052 = !DILocation(line: 867, column: 155, scope: !1003)
!1053 = !DILocation(line: 867, column: 163, scope: !1003)
!1054 = !DILocation(line: 867, column: 191, scope: !1003)
!1055 = !DILocation(line: 867, column: 210, scope: !1003)
!1056 = !DILocation(line: 867, column: 187, scope: !1003)
!1057 = !DILocation(line: 867, column: 81, scope: !1003)
!1058 = !DILocation(line: 870, column: 17, scope: !1003)
!1059 = !DILocation(line: 870, column: 15, scope: !1003)
!1060 = !DILocation(line: 872, column: 5, scope: !1003)
!1061 = !DILocation(line: 872, column: 90, scope: !1003)
!1062 = !DILocation(line: 872, column: 95, scope: !1003)
!1063 = !DILocation(line: 872, column: 119, scope: !1003)
!1064 = !DILocation(line: 872, column: 138, scope: !1003)
!1065 = !DILocation(line: 872, column: 151, scope: !1003)
!1066 = !DILocation(line: 872, column: 115, scope: !1003)
!1067 = !DILocation(line: 874, column: 11, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 874, column: 10)
!1069 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 873, column: 5)
!1070 = !DILocation(line: 874, column: 27, scope: !1068)
!1071 = !DILocation(line: 874, column: 25, scope: !1068)
!1072 = !DILocation(line: 874, column: 39, scope: !1068)
!1073 = !DILocation(line: 874, column: 10, scope: !1069)
!1074 = !DILocation(line: 876, column: 9, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1068, file: !3, line: 875, column: 7)
!1076 = distinct !{!1076, !1060, !1077}
!1077 = !DILocation(line: 878, column: 5, scope: !1003)
!1078 = !DILocation(line: 879, column: 3, scope: !1003)
!1079 = !DILocation(line: 882, column: 6, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !923, file: !3, line: 882, column: 6)
!1081 = !DILocation(line: 882, column: 89, scope: !1080)
!1082 = !DILocation(line: 882, column: 95, scope: !1080)
!1083 = !DILocation(line: 882, column: 15, scope: !1080)
!1084 = !DILocation(line: 882, column: 6, scope: !923)
!1085 = !DILocation(line: 885, column: 149, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 883, column: 3)
!1087 = !DILocation(line: 885, column: 152, scope: !1086)
!1088 = !DILocation(line: 885, column: 176, scope: !1086)
!1089 = !DILocation(line: 885, column: 173, scope: !1086)
!1090 = !DILocation(line: 885, column: 78, scope: !1086)
!1091 = !DILocation(line: 889, column: 80, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1086, file: !3, line: 889, column: 8)
!1093 = !DILocation(line: 889, column: 86, scope: !1092)
!1094 = !DILocation(line: 889, column: 111, scope: !1092)
!1095 = !DILocation(line: 889, column: 108, scope: !1092)
!1096 = !DILocation(line: 889, column: 8, scope: !1086)
!1097 = !DILocation(line: 891, column: 7, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 890, column: 5)
!1099 = !DILocation(line: 893, column: 3, scope: !1086)
!1100 = !DILocation(line: 896, column: 8, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !923, file: !3, line: 896, column: 6)
!1102 = !DILocation(line: 896, column: 27, scope: !1101)
!1103 = !DILocation(line: 896, column: 38, scope: !1101)
!1104 = !DILocation(line: 896, column: 55, scope: !1101)
!1105 = !DILocation(line: 896, column: 6, scope: !923)
!1106 = !DILocation(line: 899, column: 155, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 897, column: 3)
!1108 = !DILocation(line: 899, column: 163, scope: !1107)
!1109 = !DILocation(line: 899, column: 190, scope: !1107)
!1110 = !DILocation(line: 899, column: 209, scope: !1107)
!1111 = !DILocation(line: 899, column: 187, scope: !1107)
!1112 = !DILocation(line: 899, column: 81, scope: !1107)
!1113 = !DILocation(line: 900, column: 3, scope: !1107)
!1114 = !DILocation(line: 903, column: 21, scope: !923)
!1115 = !DILocation(line: 903, column: 131, scope: !923)
!1116 = !DILocation(line: 903, column: 136, scope: !923)
!1117 = !DILocation(line: 903, column: 154, scope: !923)
!1118 = !DILocation(line: 903, column: 50, scope: !923)
!1119 = !DILocation(line: 903, column: 47, scope: !923)
!1120 = !DILocation(line: 903, column: 19, scope: !923)
!1121 = !DILocation(line: 906, column: 3, scope: !923)
!1122 = !DILocation(line: 908, column: 3, scope: !923)
!1123 = !DILocation(line: 909, column: 1, scope: !923)
!1124 = !DILocation(line: 1102, column: 3, scope: !2)
!1125 = !DILocation(line: 1102, column: 12, scope: !2)
!1126 = !DILocation(line: 1102, column: 25, scope: !2)
!1127 = !DILocation(line: 1102, column: 38, scope: !2)
!1128 = !DILocation(line: 1102, column: 51, scope: !2)
!1129 = !DILocation(line: 1103, column: 3, scope: !2)
!1130 = !DILocation(line: 1103, column: 12, scope: !2)
!1131 = !DILocation(line: 1105, column: 78, scope: !2)
!1132 = !DILocation(line: 1105, column: 10, scope: !2)
!1133 = !DILocation(line: 1108, column: 11, scope: !2)
!1134 = !DILocation(line: 1108, column: 18, scope: !2)
!1135 = !DILocation(line: 1108, column: 3, scope: !2)
!1136 = !DILocation(line: 1112, column: 20, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 1111, column: 5)
!1138 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1109, column: 3)
!1139 = !DILocation(line: 1113, column: 7, scope: !1137)
!1140 = !DILocation(line: 1117, column: 46, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 1116, column: 5)
!1142 = !DILocation(line: 1117, column: 53, scope: !1141)
!1143 = !DILocation(line: 1117, column: 73, scope: !1141)
!1144 = !DILocation(line: 1117, column: 16, scope: !1141)
!1145 = !DILocation(line: 1117, column: 14, scope: !1141)
!1146 = !DILocation(line: 1118, column: 112, scope: !1141)
!1147 = !DILocation(line: 1118, column: 118, scope: !1141)
!1148 = !DILocation(line: 1118, column: 137, scope: !1141)
!1149 = !DILocation(line: 1118, column: 16, scope: !1141)
!1150 = !DILocation(line: 1118, column: 14, scope: !1141)
!1151 = !DILocation(line: 1119, column: 12, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 1119, column: 11)
!1153 = !DILocation(line: 1119, column: 19, scope: !1152)
!1154 = !DILocation(line: 1119, column: 39, scope: !1152)
!1155 = !DILocation(line: 1119, column: 11, scope: !1141)
!1156 = !DILocation(line: 1122, column: 62, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 1120, column: 7)
!1158 = !DILocation(line: 1122, column: 50, scope: !1157)
!1159 = !DILocation(line: 1122, column: 48, scope: !1157)
!1160 = !DILocation(line: 1122, column: 18, scope: !1157)
!1161 = !DILocation(line: 1122, column: 85, scope: !1157)
!1162 = !DILocation(line: 1122, column: 74, scope: !1157)
!1163 = !DILocation(line: 1122, column: 71, scope: !1157)
!1164 = !DILocation(line: 1122, column: 16, scope: !1157)
!1165 = !DILocation(line: 1123, column: 7, scope: !1157)
!1166 = !DILocation(line: 1125, column: 17, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1152, file: !3, line: 1125, column: 16)
!1168 = !DILocation(line: 1125, column: 24, scope: !1167)
!1169 = !DILocation(line: 1125, column: 44, scope: !1167)
!1170 = !DILocation(line: 1125, column: 16, scope: !1152)
!1171 = !DILocation(line: 1128, column: 64, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 1126, column: 7)
!1173 = !DILocation(line: 1128, column: 52, scope: !1172)
!1174 = !DILocation(line: 1128, column: 50, scope: !1172)
!1175 = !DILocation(line: 1128, column: 18, scope: !1172)
!1176 = !DILocation(line: 1128, column: 87, scope: !1172)
!1177 = !DILocation(line: 1128, column: 76, scope: !1172)
!1178 = !DILocation(line: 1128, column: 73, scope: !1172)
!1179 = !DILocation(line: 1128, column: 16, scope: !1172)
!1180 = !DILocation(line: 1129, column: 7, scope: !1172)
!1181 = !DILocation(line: 1135, column: 63, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 1132, column: 7)
!1183 = !DILocation(line: 1135, column: 51, scope: !1182)
!1184 = !DILocation(line: 1135, column: 49, scope: !1182)
!1185 = !DILocation(line: 1135, column: 18, scope: !1182)
!1186 = !DILocation(line: 1135, column: 86, scope: !1182)
!1187 = !DILocation(line: 1135, column: 75, scope: !1182)
!1188 = !DILocation(line: 1135, column: 72, scope: !1182)
!1189 = !DILocation(line: 1135, column: 16, scope: !1182)
!1190 = !DILocation(line: 1141, column: 22, scope: !1141)
!1191 = !DILocation(line: 1141, column: 20, scope: !1141)
!1192 = !DILocation(line: 1142, column: 7, scope: !1141)
!1193 = !DILocation(line: 1147, column: 20, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 1146, column: 5)
!1195 = !DILocation(line: 1148, column: 7, scope: !1194)
!1196 = !DILocation(line: 1151, column: 5, scope: !1138)
!1197 = !DILocation(line: 1154, column: 20, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 1153, column: 5)
!1199 = !DILocation(line: 1155, column: 7, scope: !1198)
!1200 = !DILocation(line: 1158, column: 10, scope: !2)
!1201 = !DILocation(line: 1159, column: 1, scope: !2)
!1202 = !DILocation(line: 1158, column: 3, scope: !2)
!1203 = distinct !DISubprogram(name: "HAL_RCC_MCOConfig", scope: !3, file: !3, line: 1016, type: !1204, scopeLine: 1017, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !1206)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{null, !6, !6, !6}
!1206 = !{!1207, !1208, !1209, !1210, !1220}
!1207 = !DILocalVariable(name: "RCC_MCOx", arg: 1, scope: !1203, file: !3, line: 1016, type: !6)
!1208 = !DILocalVariable(name: "RCC_MCOSource", arg: 2, scope: !1203, file: !3, line: 1016, type: !6)
!1209 = !DILocalVariable(name: "RCC_MCODiv", arg: 3, scope: !1203, file: !3, line: 1016, type: !6)
!1210 = !DILocalVariable(name: "gpio", scope: !1203, file: !3, line: 1018, type: !1211)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_InitTypeDef", file: !1212, line: 62, baseType: !1213)
!1212 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal_gpio.h", directory: "/home/sri/zephyrproject")
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1212, line: 46, size: 160, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1219}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "Pin", scope: !1213, file: !1212, line: 48, baseType: !6, size: 32)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !1213, file: !1212, line: 51, baseType: !6, size: 32, offset: 32)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "Pull", scope: !1213, file: !1212, line: 54, baseType: !6, size: 32, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "Speed", scope: !1213, file: !1212, line: 57, baseType: !6, size: 32, offset: 96)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "Alternate", scope: !1213, file: !1212, line: 60, baseType: !6, size: 32, offset: 128)
!1220 = !DILocalVariable(name: "tmpreg", scope: !1221, file: !3, line: 1033, type: !32)
!1221 = distinct !DILexicalBlock(scope: !1203, file: !3, line: 1033, column: 6)
!1222 = !DILocation(line: 1016, column: 33, scope: !1203)
!1223 = !DILocation(line: 1016, column: 52, scope: !1203)
!1224 = !DILocation(line: 1016, column: 76, scope: !1203)
!1225 = !DILocation(line: 1018, column: 3, scope: !1203)
!1226 = !DILocation(line: 1018, column: 20, scope: !1203)
!1227 = !DILocation(line: 1026, column: 8, scope: !1203)
!1228 = !DILocation(line: 1026, column: 13, scope: !1203)
!1229 = !DILocation(line: 1027, column: 8, scope: !1203)
!1230 = !DILocation(line: 1027, column: 14, scope: !1203)
!1231 = !DILocation(line: 1028, column: 8, scope: !1203)
!1232 = !DILocation(line: 1028, column: 13, scope: !1203)
!1233 = !DILocation(line: 1029, column: 8, scope: !1203)
!1234 = !DILocation(line: 1029, column: 12, scope: !1203)
!1235 = !DILocation(line: 1030, column: 8, scope: !1203)
!1236 = !DILocation(line: 1030, column: 18, scope: !1203)
!1237 = !DILocation(line: 1033, column: 3, scope: !1203)
!1238 = !DILocation(line: 1033, column: 8, scope: !1221)
!1239 = !DILocation(line: 1033, column: 26, scope: !1221)
!1240 = !DILocation(line: 1033, column: 110, scope: !1221)
!1241 = !DILocation(line: 1033, column: 211, scope: !1221)
!1242 = !DILocation(line: 1033, column: 219, scope: !1221)
!1243 = !DILocation(line: 1033, column: 141, scope: !1221)
!1244 = !DILocation(line: 1033, column: 248, scope: !1221)
!1245 = !DILocation(line: 1033, column: 256, scope: !1203)
!1246 = !DILocation(line: 1033, column: 256, scope: !1221)
!1247 = !DILocation(line: 1035, column: 3, scope: !1203)
!1248 = !DILocation(line: 1038, column: 153, scope: !1203)
!1249 = !DILocation(line: 1038, column: 161, scope: !1203)
!1250 = !DILocation(line: 1038, column: 212, scope: !1203)
!1251 = !DILocation(line: 1038, column: 230, scope: !1203)
!1252 = !DILocation(line: 1038, column: 227, scope: !1203)
!1253 = !DILocation(line: 1038, column: 207, scope: !1203)
!1254 = !DILocation(line: 1038, column: 79, scope: !1203)
!1255 = !DILocation(line: 1039, column: 1, scope: !1203)
!1256 = !DISubprogram(name: "HAL_GPIO_Init", scope: !1212, file: !1212, line: 280, type: !1257, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !188)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{null, !69, !1259}
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 32)
!1260 = distinct !DISubprogram(name: "HAL_RCC_EnableCSS", scope: !3, file: !3, line: 1050, type: !1261, scopeLine: 1051, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !188)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{null}
!1263 = !DILocation(line: 1052, column: 75, scope: !1260)
!1264 = !DILocation(line: 1053, column: 1, scope: !1260)
!1265 = distinct !DISubprogram(name: "HAL_RCC_DisableCSS", scope: !3, file: !3, line: 1059, type: !1261, scopeLine: 1060, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !188)
!1266 = !DILocation(line: 1061, column: 75, scope: !1265)
!1267 = !DILocation(line: 1062, column: 1, scope: !1265)
!1268 = distinct !DISubprogram(name: "HAL_RCC_GetHCLKFreq", scope: !3, file: !3, line: 1170, type: !4, scopeLine: 1171, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !188)
!1269 = !DILocation(line: 1172, column: 10, scope: !1268)
!1270 = !DILocation(line: 1172, column: 3, scope: !1268)
!1271 = distinct !DISubprogram(name: "HAL_RCC_GetPCLK1Freq", scope: !3, file: !3, line: 1181, type: !4, scopeLine: 1182, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !188)
