; ModuleID = '../bc_files/stm32f0xx_hal_rcc_ex.bc'
source_filename = "/home/sri/zephyrproject/modules/hal/stm32/stm32cube/stm32f0xx/drivers/src/stm32f0xx_hal_rcc_ex.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.RCC_PeriphCLKInitTypeDef = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.RCC_TypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.RCC_CRSInitTypeDef = type { i32, i32, i32, i32, i32, i32 }
%struct.CRS_TypeDef = type { i32, i32, i32, i32 }
%struct.RCC_CRSSynchroInfoTypeDef = type { i32, i32, i32, i32 }

; Function Attrs: noinline nounwind optnone
define hidden zeroext i8 @HAL_RCCEx_PeriphCLKConfig(ptr noundef %0) #0 !dbg !64 {
  %2 = alloca i8, align 1
  %3 = alloca ptr, align 4
  %4 = alloca i32, align 4
  %5 = alloca i32, align 4
  %6 = alloca i8, align 1
  %7 = alloca i32, align 4
  store ptr %0, ptr %3, align 4
  call void @llvm.dbg.declare(metadata ptr %3, metadata !82, metadata !DIExpression()), !dbg !83
  call void @llvm.dbg.declare(metadata ptr %4, metadata !84, metadata !DIExpression()), !dbg !85
  store i32 0, ptr %4, align 4, !dbg !85
  call void @llvm.dbg.declare(metadata ptr %5, metadata !86, metadata !DIExpression()), !dbg !87
  store i32 0, ptr %5, align 4, !dbg !87
  %8 = load ptr, ptr %3, align 4, !dbg !88
  %9 = getelementptr inbounds %struct.RCC_PeriphCLKInitTypeDef, ptr %8, i32 0, i32 0, !dbg !90

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !16, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "stm32f0xx_hal_rcc_ex.c", directory: "/home/sri/zephyrproject/zephyr/build")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 38, baseType: !5, size: 8, elements: !6)
!4 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal_def.h", directory: "/home/sri/zephyrproject")
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "HAL_OK", value: 0)
!8 = !DIEnumerator(name: "HAL_ERROR", value: 1)
!9 = !DIEnumerator(name: "HAL_BUSY", value: 2)
!10 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 167, baseType: !5, size: 8, elements: !13)
!12 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f0xx.h", directory: "/home/sri/zephyrproject")
!13 = !{!14, !15}
!14 = !DIEnumerator(name: "RESET", value: 0)
!15 = !DIEnumerator(name: "SET", value: 1)
!16 = !{!17, !40, !46, !24, !47}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 461, baseType: !20)
!19 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 445, size: 448, elements: !21)
!21 = !{!22, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !20, file: !19, line: 447, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !25, line: 64, baseType: !26)
!25 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!26 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !20, file: !19, line: 448, baseType: !23, size: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !20, file: !19, line: 449, baseType: !23, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !20, file: !19, line: 450, baseType: !23, size: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !20, file: !19, line: 451, baseType: !23, size: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !20, file: !19, line: 452, baseType: !23, size: 32, offset: 160)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !20, file: !19, line: 453, baseType: !23, size: 32, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !20, file: !19, line: 454, baseType: !23, size: 32, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !20, file: !19, line: 455, baseType: !23, size: 32, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !20, file: !19, line: 456, baseType: !23, size: 32, offset: 288)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !20, file: !19, line: 457, baseType: !23, size: 32, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR2", scope: !20, file: !19, line: 458, baseType: !23, size: 32, offset: 352)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR3", scope: !20, file: !19, line: 459, baseType: !23, size: 32, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !20, file: !19, line: 460, baseType: !23, size: 32, offset: 416)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !19, line: 439, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 435, size: 64, elements: !43)
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !42, file: !19, line: 437, baseType: !23, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !42, file: !19, line: 438, baseType: !23, size: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !25, line: 62, baseType: !5)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRS_TypeDef", file: !19, line: 266, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 260, size: 128, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !49, file: !19, line: 262, baseType: !23, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !49, file: !19, line: 263, baseType: !23, size: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !49, file: !19, line: 264, baseType: !23, size: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ICR", scope: !49, file: !19, line: 265, baseType: !23, size: 32, offset: 96)
!55 = !{i32 7, !"Dwarf Version", i32 4}
!56 = !{i32 2, !"Debug Info Version", i32 3}
!57 = !{i32 1, !"wchar_size", i32 4}
!58 = !{i32 1, !"static_rwdata", i32 1}
!59 = !{i32 1, !"enumsize_buildattr", i32 1}
!60 = !{i32 1, !"armlib_unavailable", i32 0}
!61 = !{i32 8, !"PIC Level", i32 2}
!62 = !{i32 7, !"PIE Level", i32 2}
!63 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!64 = distinct !DISubprogram(name: "HAL_RCCEx_PeriphCLKConfig", scope: !65, file: !65, line: 102, type: !66, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !81)
!65 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/src/stm32f0xx_hal_rcc_ex.c", directory: "/home/sri/zephyrproject")
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_StatusTypeDef", file: !4, line: 44, baseType: !3)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_PeriphCLKInitTypeDef", file: !71, line: 546, baseType: !72)
!71 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal_rcc_ex.h", directory: "/home/sri/zephyrproject")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 523, size: 224, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "PeriphClockSelection", scope: !72, file: !71, line: 525, baseType: !24, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "RTCClockSelection", scope: !72, file: !71, line: 528, baseType: !24, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Usart1ClockSelection", scope: !72, file: !71, line: 531, baseType: !24, size: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Usart2ClockSelection", scope: !72, file: !71, line: 534, baseType: !24, size: 32, offset: 96)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Usart3ClockSelection", scope: !72, file: !71, line: 537, baseType: !24, size: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "I2c1ClockSelection", scope: !72, file: !71, line: 540, baseType: !24, size: 32, offset: 160)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "CecClockSelection", scope: !72, file: !71, line: 543, baseType: !24, size: 32, offset: 192)
!81 = !{}
!82 = !DILocalVariable(name: "PeriphClkInit", arg: 1, scope: !64, file: !65, line: 102, type: !69)
!83 = !DILocation(line: 102, column: 71, scope: !64)
!84 = !DILocalVariable(name: "tickstart", scope: !64, file: !65, line: 104, type: !24)
!85 = !DILocation(line: 104, column: 12, scope: !64)
!86 = !DILocalVariable(name: "temp_reg", scope: !64, file: !65, line: 105, type: !24)
!87 = !DILocation(line: 105, column: 12, scope: !64)
!88 = !DILocation(line: 111, column: 8, scope: !89)
!89 = distinct !DILexicalBlock(scope: !64, file: !65, line: 111, column: 6)
!90 = !DILocation(line: 111, column: 23, scope: !89)
!91 = !DILocation(line: 111, column: 45, scope: !89)
!92 = !DILocation(line: 111, column: 62, scope: !89)
!93 = !DILocation(line: 111, column: 6, scope: !64)
!94 = !DILocalVariable(name: "pwrclkchanged", scope: !95, file: !65, line: 116, type: !96)
!95 = distinct !DILexicalBlock(scope: !89, file: !65, line: 112, column: 3)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "FlagStatus", file: !12, line: 171, baseType: !11)
!97 = !DILocation(line: 116, column: 16, scope: !95)
!98 = !DILocation(line: 121, column: 76, scope: !99)
!99 = distinct !DILexicalBlock(scope: !95, file: !65, line: 121, column: 8)
!100 = !DILocation(line: 121, column: 84, scope: !99)
!101 = !DILocation(line: 121, column: 106, scope: !99)
!102 = !DILocation(line: 121, column: 8, scope: !95)
!103 = !DILocation(line: 123, column: 5, scope: !104)
!104 = distinct !DILexicalBlock(scope: !99, file: !65, line: 122, column: 5)
!105 = !DILocalVariable(name: "tmpreg", scope: !106, file: !65, line: 123, type: !23)
!106 = distinct !DILexicalBlock(scope: !104, file: !65, line: 123, column: 8)
!107 = !DILocation(line: 123, column: 28, scope: !106)
!108 = !DILocation(line: 123, column: 113, scope: !106)
!109 = !DILocation(line: 123, column: 214, scope: !106)
!110 = !DILocation(line: 123, column: 223, scope: !106)
!111 = !DILocation(line: 123, column: 144, scope: !106)
!112 = !DILocation(line: 123, column: 252, scope: !106)
!113 = !DILocation(line: 123, column: 260, scope: !106)
!114 = !DILocation(line: 124, column: 21, scope: !104)
!115 = !DILocation(line: 125, column: 5, scope: !104)
!116 = !DILocation(line: 127, column: 60, scope: !117)
!117 = distinct !DILexicalBlock(scope: !95, file: !65, line: 127, column: 8)
!118 = !DILocation(line: 127, column: 64, scope: !117)
!119 = !DILocation(line: 127, column: 85, scope: !117)
!120 = !DILocation(line: 127, column: 8, scope: !95)
!121 = !DILocation(line: 130, column: 62, scope: !122)
!122 = distinct !DILexicalBlock(scope: !117, file: !65, line: 128, column: 5)
!123 = !DILocation(line: 133, column: 19, scope: !122)
!124 = !DILocation(line: 133, column: 17, scope: !122)
!125 = !DILocation(line: 135, column: 7, scope: !122)
!126 = !DILocation(line: 135, column: 65, scope: !122)
!127 = !DILocation(line: 135, column: 69, scope: !122)
!128 = !DILocation(line: 135, column: 90, scope: !122)
!129 = !DILocation(line: 137, column: 13, scope: !130)
!130 = distinct !DILexicalBlock(scope: !131, file: !65, line: 137, column: 12)
!131 = distinct !DILexicalBlock(scope: !122, file: !65, line: 136, column: 7)
!132 = !DILocation(line: 137, column: 29, scope: !130)
!133 = !DILocation(line: 137, column: 27, scope: !130)
!134 = !DILocation(line: 137, column: 40, scope: !130)
!135 = !DILocation(line: 137, column: 12, scope: !131)
!136 = !DILocation(line: 139, column: 11, scope: !137)
!137 = distinct !DILexicalBlock(scope: !130, file: !65, line: 138, column: 9)
!138 = distinct !{!138, !125, !139}
!139 = !DILocation(line: 141, column: 7, scope: !122)
!140 = !DILocation(line: 142, column: 5, scope: !122)
!141 = !DILocation(line: 145, column: 83, scope: !95)
!142 = !DILocation(line: 145, column: 88, scope: !95)
!143 = !DILocation(line: 145, column: 14, scope: !95)
!144 = !DILocation(line: 146, column: 9, scope: !145)
!145 = distinct !DILexicalBlock(scope: !95, file: !65, line: 146, column: 8)
!146 = !DILocation(line: 146, column: 18, scope: !145)
!147 = !DILocation(line: 146, column: 34, scope: !145)
!148 = !DILocation(line: 146, column: 38, scope: !145)
!149 = !DILocation(line: 146, column: 51, scope: !145)
!150 = !DILocation(line: 146, column: 66, scope: !145)
!151 = !DILocation(line: 146, column: 84, scope: !145)
!152 = !DILocation(line: 146, column: 47, scope: !145)
!153 = !DILocation(line: 146, column: 8, scope: !95)
!154 = !DILocation(line: 149, column: 85, scope: !155)
!155 = distinct !DILexicalBlock(scope: !145, file: !65, line: 147, column: 5)
!156 = !DILocation(line: 149, column: 90, scope: !155)
!157 = !DILocation(line: 149, column: 16, scope: !155)
!158 = !DILocation(line: 151, column: 81, scope: !155)
!159 = !DILocation(line: 152, column: 81, scope: !155)
!160 = !DILocation(line: 154, column: 80, scope: !155)
!161 = !DILocation(line: 154, column: 78, scope: !155)
!162 = !DILocation(line: 157, column: 14, scope: !163)
!163 = distinct !DILexicalBlock(scope: !155, file: !65, line: 157, column: 11)
!164 = !DILocation(line: 157, column: 24, scope: !163)
!165 = !DILocation(line: 157, column: 45, scope: !163)
!166 = !DILocation(line: 157, column: 11, scope: !155)
!167 = !DILocation(line: 160, column: 21, scope: !168)
!168 = distinct !DILexicalBlock(scope: !163, file: !65, line: 158, column: 7)
!169 = !DILocation(line: 160, column: 19, scope: !168)
!170 = !DILocation(line: 163, column: 9, scope: !168)
!171 = !DILocation(line: 163, column: 434, scope: !168)
!172 = !DILocation(line: 163, column: 512, scope: !168)
!173 = !DILocation(line: 163, column: 585, scope: !168)
!174 = !DILocation(line: 165, column: 15, scope: !175)
!175 = distinct !DILexicalBlock(scope: !176, file: !65, line: 165, column: 14)
!176 = distinct !DILexicalBlock(scope: !168, file: !65, line: 164, column: 9)
!177 = !DILocation(line: 165, column: 31, scope: !175)
!178 = !DILocation(line: 165, column: 29, scope: !175)
!179 = !DILocation(line: 165, column: 42, scope: !175)
!180 = !DILocation(line: 165, column: 14, scope: !176)
!181 = !DILocation(line: 167, column: 13, scope: !182)
!182 = distinct !DILexicalBlock(scope: !175, file: !65, line: 166, column: 11)
!183 = distinct !{!183, !170, !184}
!184 = !DILocation(line: 169, column: 9, scope: !168)
!185 = !DILocation(line: 170, column: 7, scope: !168)
!186 = !DILocation(line: 171, column: 5, scope: !155)
!187 = !DILocation(line: 172, column: 155, scope: !95)
!188 = !DILocation(line: 172, column: 163, scope: !95)
!189 = !DILocation(line: 172, column: 191, scope: !95)
!190 = !DILocation(line: 172, column: 206, scope: !95)
!191 = !DILocation(line: 172, column: 187, scope: !95)
!192 = !DILocation(line: 172, column: 81, scope: !95)
!193 = !DILocation(line: 175, column: 8, scope: !194)
!194 = distinct !DILexicalBlock(scope: !95, file: !65, line: 175, column: 8)
!195 = !DILocation(line: 175, column: 22, scope: !194)
!196 = !DILocation(line: 175, column: 8, scope: !95)
!197 = !DILocation(line: 177, column: 82, scope: !198)
!198 = distinct !DILexicalBlock(scope: !194, file: !65, line: 176, column: 5)
!199 = !DILocation(line: 178, column: 5, scope: !198)
!200 = !DILocation(line: 179, column: 3, scope: !95)
!201 = !DILocation(line: 182, column: 8, scope: !202)
!202 = distinct !DILexicalBlock(scope: !64, file: !65, line: 182, column: 6)
!203 = !DILocation(line: 182, column: 23, scope: !202)
!204 = !DILocation(line: 182, column: 45, scope: !202)
!205 = !DILocation(line: 182, column: 62, scope: !202)
!206 = !DILocation(line: 182, column: 6, scope: !64)
!207 = !DILocation(line: 188, column: 156, scope: !208)
!208 = distinct !DILexicalBlock(scope: !202, file: !65, line: 183, column: 3)
!209 = !DILocation(line: 188, column: 165, scope: !208)
!210 = !DILocation(line: 188, column: 203, scope: !208)
!211 = !DILocation(line: 188, column: 218, scope: !208)
!212 = !DILocation(line: 188, column: 189, scope: !208)
!213 = !DILocation(line: 188, column: 82, scope: !208)
!214 = !DILocation(line: 189, column: 3, scope: !208)
!215 = !DILocation(line: 194, column: 8, scope: !216)
!216 = distinct !DILexicalBlock(scope: !64, file: !65, line: 194, column: 6)
!217 = !DILocation(line: 194, column: 23, scope: !216)
!218 = !DILocation(line: 194, column: 45, scope: !216)
!219 = !DILocation(line: 194, column: 62, scope: !216)
!220 = !DILocation(line: 194, column: 6, scope: !64)
!221 = !DILocation(line: 200, column: 156, scope: !222)
!222 = distinct !DILexicalBlock(scope: !216, file: !65, line: 195, column: 3)
!223 = !DILocation(line: 200, column: 165, scope: !222)
!224 = !DILocation(line: 200, column: 204, scope: !222)
!225 = !DILocation(line: 200, column: 219, scope: !222)
!226 = !DILocation(line: 200, column: 190, scope: !222)
!227 = !DILocation(line: 200, column: 82, scope: !222)
!228 = !DILocation(line: 201, column: 3, scope: !222)
!229 = !DILocation(line: 207, column: 8, scope: !230)
!230 = distinct !DILexicalBlock(scope: !64, file: !65, line: 207, column: 6)
!231 = !DILocation(line: 207, column: 23, scope: !230)
!232 = !DILocation(line: 207, column: 45, scope: !230)
!233 = !DILocation(line: 207, column: 62, scope: !230)
!234 = !DILocation(line: 207, column: 6, scope: !64)
!235 = !DILocation(line: 213, column: 156, scope: !236)
!236 = distinct !DILexicalBlock(scope: !230, file: !65, line: 208, column: 3)
!237 = !DILocation(line: 213, column: 165, scope: !236)
!238 = !DILocation(line: 213, column: 204, scope: !236)
!239 = !DILocation(line: 213, column: 219, scope: !236)
!240 = !DILocation(line: 213, column: 190, scope: !236)
!241 = !DILocation(line: 213, column: 82, scope: !236)
!242 = !DILocation(line: 214, column: 3, scope: !236)
!243 = !DILocation(line: 218, column: 8, scope: !244)
!244 = distinct !DILexicalBlock(scope: !64, file: !65, line: 218, column: 6)
!245 = !DILocation(line: 218, column: 23, scope: !244)
!246 = !DILocation(line: 218, column: 45, scope: !244)
!247 = !DILocation(line: 218, column: 62, scope: !244)
!248 = !DILocation(line: 218, column: 6, scope: !64)
!249 = !DILocation(line: 224, column: 156, scope: !250)
!250 = distinct !DILexicalBlock(scope: !244, file: !65, line: 219, column: 3)
!251 = !DILocation(line: 224, column: 165, scope: !250)
!252 = !DILocation(line: 224, column: 203, scope: !250)
!253 = !DILocation(line: 224, column: 218, scope: !250)
!254 = !DILocation(line: 224, column: 189, scope: !250)
!255 = !DILocation(line: 224, column: 82, scope: !250)
!256 = !DILocation(line: 225, column: 3, scope: !250)
!257 = !DILocation(line: 244, column: 8, scope: !258)
!258 = distinct !DILexicalBlock(scope: !64, file: !65, line: 244, column: 6)
!259 = !DILocation(line: 244, column: 23, scope: !258)
!260 = !DILocation(line: 244, column: 45, scope: !258)
!261 = !DILocation(line: 244, column: 62, scope: !258)
!262 = !DILocation(line: 244, column: 6, scope: !64)
!263 = !DILocation(line: 250, column: 156, scope: !264)
!264 = distinct !DILexicalBlock(scope: !258, file: !65, line: 245, column: 3)
!265 = !DILocation(line: 250, column: 165, scope: !264)
!266 = !DILocation(line: 250, column: 203, scope: !264)
!267 = !DILocation(line: 250, column: 218, scope: !264)
!268 = !DILocation(line: 250, column: 189, scope: !264)
!269 = !DILocation(line: 250, column: 82, scope: !264)
!270 = !DILocation(line: 251, column: 3, scope: !264)
!271 = !DILocation(line: 257, column: 3, scope: !64)
!272 = !DILocation(line: 258, column: 1, scope: !64)
!273 = distinct !DISubprogram(name: "HAL_RCCEx_GetPeriphCLKConfig", scope: !65, file: !65, line: 268, type: !274, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !81)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !69}
!276 = !DILocalVariable(name: "PeriphClkInit", arg: 1, scope: !273, file: !65, line: 268, type: !69)
!277 = !DILocation(line: 268, column: 61, scope: !273)
!278 = !DILocation(line: 272, column: 3, scope: !273)
!279 = !DILocation(line: 272, column: 18, scope: !273)
!280 = !DILocation(line: 272, column: 39, scope: !273)
!281 = !DILocation(line: 274, column: 107, scope: !273)
!282 = !DILocation(line: 274, column: 113, scope: !273)
!283 = !DILocation(line: 274, column: 3, scope: !273)
!284 = !DILocation(line: 274, column: 18, scope: !273)
!285 = !DILocation(line: 274, column: 36, scope: !273)
!286 = !DILocation(line: 276, column: 121, scope: !273)
!287 = !DILocation(line: 276, column: 128, scope: !273)
!288 = !DILocation(line: 276, column: 3, scope: !273)
!289 = !DILocation(line: 276, column: 18, scope: !273)
!290 = !DILocation(line: 276, column: 39, scope: !273)
!291 = !DILocation(line: 278, column: 119, scope: !273)
!292 = !DILocation(line: 278, column: 126, scope: !273)
!293 = !DILocation(line: 278, column: 3, scope: !273)
!294 = !DILocation(line: 278, column: 18, scope: !273)
!295 = !DILocation(line: 278, column: 37, scope: !273)
!296 = !DILocation(line: 282, column: 3, scope: !273)
!297 = !DILocation(line: 282, column: 18, scope: !273)
!298 = !DILocation(line: 282, column: 39, scope: !273)
!299 = !DILocation(line: 284, column: 121, scope: !273)
!300 = !DILocation(line: 284, column: 128, scope: !273)
!301 = !DILocation(line: 284, column: 3, scope: !273)
!302 = !DILocation(line: 284, column: 18, scope: !273)
!303 = !DILocation(line: 284, column: 39, scope: !273)
!304 = !DILocation(line: 289, column: 3, scope: !273)
!305 = !DILocation(line: 289, column: 18, scope: !273)
!306 = !DILocation(line: 289, column: 39, scope: !273)
!307 = !DILocation(line: 291, column: 121, scope: !273)
!308 = !DILocation(line: 291, column: 128, scope: !273)
!309 = !DILocation(line: 291, column: 3, scope: !273)
!310 = !DILocation(line: 291, column: 18, scope: !273)
!311 = !DILocation(line: 291, column: 39, scope: !273)
!312 = !DILocation(line: 304, column: 3, scope: !273)
!313 = !DILocation(line: 304, column: 18, scope: !273)
!314 = !DILocation(line: 304, column: 39, scope: !273)
!315 = !DILocation(line: 306, column: 118, scope: !273)
!316 = !DILocation(line: 306, column: 125, scope: !273)
!317 = !DILocation(line: 306, column: 3, scope: !273)
!318 = !DILocation(line: 306, column: 18, scope: !273)
!319 = !DILocation(line: 306, column: 36, scope: !273)
!320 = !DILocation(line: 312, column: 1, scope: !273)
!321 = distinct !DISubprogram(name: "HAL_RCCEx_GetPeriphCLKFreq", scope: !65, file: !65, line: 368, type: !322, scopeLine: 369, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !81)
!322 = !DISubroutineType(types: !323)
!323 = !{!24, !24}
!324 = !DILocalVariable(name: "PeriphClk", arg: 1, scope: !321, file: !65, line: 368, type: !24)
!325 = !DILocation(line: 368, column: 46, scope: !321)
!326 = !DILocalVariable(name: "frequency", scope: !321, file: !65, line: 371, type: !24)
!327 = !DILocation(line: 371, column: 12, scope: !321)
!328 = !DILocalVariable(name: "srcclk", scope: !321, file: !65, line: 373, type: !24)
!329 = !DILocation(line: 373, column: 12, scope: !321)
!330 = !DILocation(line: 381, column: 11, scope: !321)
!331 = !DILocation(line: 381, column: 3, scope: !321)
!332 = !DILocation(line: 386, column: 85, scope: !333)
!333 = distinct !DILexicalBlock(scope: !334, file: !65, line: 384, column: 5)
!334 = distinct !DILexicalBlock(scope: !321, file: !65, line: 382, column: 3)
!335 = !DILocation(line: 386, column: 91, scope: !333)
!336 = !DILocation(line: 386, column: 14, scope: !333)
!337 = !DILocation(line: 389, column: 12, scope: !338)
!338 = distinct !DILexicalBlock(scope: !333, file: !65, line: 389, column: 11)
!339 = !DILocation(line: 389, column: 19, scope: !338)
!340 = !DILocation(line: 389, column: 37, scope: !338)
!341 = !DILocation(line: 389, column: 110, scope: !338)
!342 = !DILocation(line: 389, column: 116, scope: !338)
!343 = !DILocation(line: 389, column: 137, scope: !338)
!344 = !DILocation(line: 389, column: 11, scope: !333)
!345 = !DILocation(line: 391, column: 19, scope: !346)
!346 = distinct !DILexicalBlock(scope: !338, file: !65, line: 390, column: 7)
!347 = !DILocation(line: 392, column: 7, scope: !346)
!348 = !DILocation(line: 394, column: 17, scope: !349)
!349 = distinct !DILexicalBlock(scope: !338, file: !65, line: 394, column: 16)
!350 = !DILocation(line: 394, column: 24, scope: !349)
!351 = !DILocation(line: 394, column: 42, scope: !349)
!352 = !DILocation(line: 394, column: 115, scope: !349)
!353 = !DILocation(line: 394, column: 120, scope: !349)
!354 = !DILocation(line: 394, column: 141, scope: !349)
!355 = !DILocation(line: 394, column: 16, scope: !338)
!356 = !DILocation(line: 396, column: 19, scope: !357)
!357 = distinct !DILexicalBlock(scope: !349, file: !65, line: 395, column: 7)
!358 = !DILocation(line: 397, column: 7, scope: !357)
!359 = !DILocation(line: 399, column: 17, scope: !360)
!360 = distinct !DILexicalBlock(scope: !349, file: !65, line: 399, column: 16)
!361 = !DILocation(line: 399, column: 24, scope: !360)
!362 = !DILocation(line: 399, column: 42, scope: !360)
!363 = !DILocation(line: 399, column: 115, scope: !360)
!364 = !DILocation(line: 399, column: 119, scope: !360)
!365 = !DILocation(line: 399, column: 141, scope: !360)
!366 = !DILocation(line: 399, column: 16, scope: !349)
!367 = !DILocation(line: 401, column: 19, scope: !368)
!368 = distinct !DILexicalBlock(scope: !360, file: !65, line: 400, column: 7)
!369 = !DILocation(line: 402, column: 7, scope: !368)
!370 = !DILocation(line: 403, column: 7, scope: !333)
!371 = !DILocation(line: 408, column: 96, scope: !372)
!372 = distinct !DILexicalBlock(scope: !334, file: !65, line: 406, column: 5)
!373 = !DILocation(line: 408, column: 103, scope: !372)
!374 = !DILocation(line: 408, column: 14, scope: !372)
!375 = !DILocation(line: 411, column: 11, scope: !376)
!376 = distinct !DILexicalBlock(scope: !372, file: !65, line: 411, column: 11)
!377 = !DILocation(line: 411, column: 18, scope: !376)
!378 = !DILocation(line: 411, column: 11, scope: !372)
!379 = !DILocation(line: 413, column: 21, scope: !380)
!380 = distinct !DILexicalBlock(scope: !376, file: !65, line: 412, column: 7)
!381 = !DILocation(line: 413, column: 19, scope: !380)
!382 = !DILocation(line: 414, column: 7, scope: !380)
!383 = !DILocation(line: 416, column: 17, scope: !384)
!384 = distinct !DILexicalBlock(scope: !376, file: !65, line: 416, column: 16)
!385 = !DILocation(line: 416, column: 24, scope: !384)
!386 = !DILocation(line: 416, column: 42, scope: !384)
!387 = !DILocation(line: 416, column: 115, scope: !384)
!388 = !DILocation(line: 416, column: 119, scope: !384)
!389 = !DILocation(line: 416, column: 140, scope: !384)
!390 = !DILocation(line: 416, column: 16, scope: !376)
!391 = !DILocation(line: 418, column: 19, scope: !392)
!392 = distinct !DILexicalBlock(scope: !384, file: !65, line: 417, column: 7)
!393 = !DILocation(line: 419, column: 7, scope: !392)
!394 = !DILocation(line: 421, column: 16, scope: !395)
!395 = distinct !DILexicalBlock(scope: !384, file: !65, line: 421, column: 16)
!396 = !DILocation(line: 421, column: 23, scope: !395)
!397 = !DILocation(line: 421, column: 16, scope: !384)
!398 = !DILocation(line: 423, column: 21, scope: !399)
!399 = distinct !DILexicalBlock(scope: !395, file: !65, line: 422, column: 7)
!400 = !DILocation(line: 423, column: 19, scope: !399)
!401 = !DILocation(line: 424, column: 7, scope: !399)
!402 = !DILocation(line: 426, column: 17, scope: !403)
!403 = distinct !DILexicalBlock(scope: !395, file: !65, line: 426, column: 16)
!404 = !DILocation(line: 426, column: 24, scope: !403)
!405 = !DILocation(line: 426, column: 42, scope: !403)
!406 = !DILocation(line: 426, column: 115, scope: !403)
!407 = !DILocation(line: 426, column: 121, scope: !403)
!408 = !DILocation(line: 426, column: 142, scope: !403)
!409 = !DILocation(line: 426, column: 16, scope: !395)
!410 = !DILocation(line: 428, column: 19, scope: !411)
!411 = distinct !DILexicalBlock(scope: !403, file: !65, line: 427, column: 7)
!412 = !DILocation(line: 429, column: 7, scope: !411)
!413 = !DILocation(line: 430, column: 7, scope: !372)
!414 = !DILocation(line: 436, column: 96, scope: !415)
!415 = distinct !DILexicalBlock(scope: !334, file: !65, line: 434, column: 5)
!416 = !DILocation(line: 436, column: 103, scope: !415)
!417 = !DILocation(line: 436, column: 14, scope: !415)
!418 = !DILocation(line: 439, column: 11, scope: !419)
!419 = distinct !DILexicalBlock(scope: !415, file: !65, line: 439, column: 11)
!420 = !DILocation(line: 439, column: 18, scope: !419)
!421 = !DILocation(line: 439, column: 11, scope: !415)
!422 = !DILocation(line: 441, column: 21, scope: !423)
!423 = distinct !DILexicalBlock(scope: !419, file: !65, line: 440, column: 7)
!424 = !DILocation(line: 441, column: 19, scope: !423)
!425 = !DILocation(line: 442, column: 7, scope: !423)
!426 = !DILocation(line: 444, column: 17, scope: !427)
!427 = distinct !DILexicalBlock(scope: !419, file: !65, line: 444, column: 16)
!428 = !DILocation(line: 444, column: 24, scope: !427)
!429 = !DILocation(line: 444, column: 42, scope: !427)
!430 = !DILocation(line: 444, column: 115, scope: !427)
!431 = !DILocation(line: 444, column: 119, scope: !427)
!432 = !DILocation(line: 444, column: 140, scope: !427)
!433 = !DILocation(line: 444, column: 16, scope: !419)
!434 = !DILocation(line: 446, column: 19, scope: !435)
!435 = distinct !DILexicalBlock(scope: !427, file: !65, line: 445, column: 7)
!436 = !DILocation(line: 447, column: 7, scope: !435)
!437 = !DILocation(line: 449, column: 16, scope: !438)
!438 = distinct !DILexicalBlock(scope: !427, file: !65, line: 449, column: 16)
!439 = !DILocation(line: 449, column: 23, scope: !438)
!440 = !DILocation(line: 449, column: 16, scope: !427)
!441 = !DILocation(line: 451, column: 21, scope: !442)
!442 = distinct !DILexicalBlock(scope: !438, file: !65, line: 450, column: 7)
!443 = !DILocation(line: 451, column: 19, scope: !442)
!444 = !DILocation(line: 452, column: 7, scope: !442)
!445 = !DILocation(line: 454, column: 17, scope: !446)
!446 = distinct !DILexicalBlock(scope: !438, file: !65, line: 454, column: 16)
!447 = !DILocation(line: 454, column: 24, scope: !446)
!448 = !DILocation(line: 454, column: 42, scope: !446)
!449 = !DILocation(line: 454, column: 115, scope: !446)
!450 = !DILocation(line: 454, column: 121, scope: !446)
!451 = !DILocation(line: 454, column: 142, scope: !446)
!452 = !DILocation(line: 454, column: 16, scope: !438)
!453 = !DILocation(line: 456, column: 19, scope: !454)
!454 = distinct !DILexicalBlock(scope: !446, file: !65, line: 455, column: 7)
!455 = !DILocation(line: 457, column: 7, scope: !454)
!456 = !DILocation(line: 458, column: 7, scope: !415)
!457 = !DILocation(line: 465, column: 96, scope: !458)
!458 = distinct !DILexicalBlock(scope: !334, file: !65, line: 463, column: 5)
!459 = !DILocation(line: 465, column: 103, scope: !458)
!460 = !DILocation(line: 465, column: 14, scope: !458)
!461 = !DILocation(line: 468, column: 11, scope: !462)
!462 = distinct !DILexicalBlock(scope: !458, file: !65, line: 468, column: 11)
!463 = !DILocation(line: 468, column: 18, scope: !462)
!464 = !DILocation(line: 468, column: 11, scope: !458)
!465 = !DILocation(line: 470, column: 21, scope: !466)
!466 = distinct !DILexicalBlock(scope: !462, file: !65, line: 469, column: 7)
!467 = !DILocation(line: 470, column: 19, scope: !466)
!468 = !DILocation(line: 471, column: 7, scope: !466)
!469 = !DILocation(line: 473, column: 17, scope: !470)
!470 = distinct !DILexicalBlock(scope: !462, file: !65, line: 473, column: 16)
!471 = !DILocation(line: 473, column: 24, scope: !470)
!472 = !DILocation(line: 473, column: 42, scope: !470)
!473 = !DILocation(line: 473, column: 115, scope: !470)
!474 = !DILocation(line: 473, column: 119, scope: !470)
!475 = !DILocation(line: 473, column: 140, scope: !470)
!476 = !DILocation(line: 473, column: 16, scope: !462)
!477 = !DILocation(line: 475, column: 19, scope: !478)
!478 = distinct !DILexicalBlock(scope: !470, file: !65, line: 474, column: 7)
!479 = !DILocation(line: 476, column: 7, scope: !478)
!480 = !DILocation(line: 478, column: 16, scope: !481)
!481 = distinct !DILexicalBlock(scope: !470, file: !65, line: 478, column: 16)
!482 = !DILocation(line: 478, column: 23, scope: !481)
!483 = !DILocation(line: 478, column: 16, scope: !470)
!484 = !DILocation(line: 480, column: 21, scope: !485)
!485 = distinct !DILexicalBlock(scope: !481, file: !65, line: 479, column: 7)
!486 = !DILocation(line: 480, column: 19, scope: !485)
!487 = !DILocation(line: 481, column: 7, scope: !485)
!488 = !DILocation(line: 483, column: 17, scope: !489)
!489 = distinct !DILexicalBlock(scope: !481, file: !65, line: 483, column: 16)
!490 = !DILocation(line: 483, column: 24, scope: !489)
!491 = !DILocation(line: 483, column: 42, scope: !489)
!492 = !DILocation(line: 483, column: 115, scope: !489)
!493 = !DILocation(line: 483, column: 121, scope: !489)
!494 = !DILocation(line: 483, column: 142, scope: !489)
!495 = !DILocation(line: 483, column: 16, scope: !481)
!496 = !DILocation(line: 485, column: 19, scope: !497)
!497 = distinct !DILexicalBlock(scope: !489, file: !65, line: 484, column: 7)
!498 = !DILocation(line: 486, column: 7, scope: !497)
!499 = !DILocation(line: 487, column: 7, scope: !458)
!500 = !DILocation(line: 493, column: 96, scope: !501)
!501 = distinct !DILexicalBlock(scope: !334, file: !65, line: 491, column: 5)
!502 = !DILocation(line: 493, column: 103, scope: !501)
!503 = !DILocation(line: 493, column: 14, scope: !501)
!504 = !DILocation(line: 496, column: 12, scope: !505)
!505 = distinct !DILexicalBlock(scope: !501, file: !65, line: 496, column: 11)
!506 = !DILocation(line: 496, column: 19, scope: !505)
!507 = !DILocation(line: 496, column: 37, scope: !505)
!508 = !DILocation(line: 496, column: 110, scope: !505)
!509 = !DILocation(line: 496, column: 114, scope: !505)
!510 = !DILocation(line: 496, column: 135, scope: !505)
!511 = !DILocation(line: 496, column: 11, scope: !501)
!512 = !DILocation(line: 498, column: 19, scope: !513)
!513 = distinct !DILexicalBlock(scope: !505, file: !65, line: 497, column: 7)
!514 = !DILocation(line: 499, column: 7, scope: !513)
!515 = !DILocation(line: 501, column: 16, scope: !516)
!516 = distinct !DILexicalBlock(scope: !505, file: !65, line: 501, column: 16)
!517 = !DILocation(line: 501, column: 23, scope: !516)
!518 = !DILocation(line: 501, column: 16, scope: !505)
!519 = !DILocation(line: 503, column: 21, scope: !520)
!520 = distinct !DILexicalBlock(scope: !516, file: !65, line: 502, column: 7)
!521 = !DILocation(line: 503, column: 19, scope: !520)
!522 = !DILocation(line: 504, column: 7, scope: !520)
!523 = !DILocation(line: 505, column: 7, scope: !501)
!524 = !DILocation(line: 559, column: 96, scope: !525)
!525 = distinct !DILexicalBlock(scope: !334, file: !65, line: 557, column: 5)
!526 = !DILocation(line: 559, column: 103, scope: !525)
!527 = !DILocation(line: 559, column: 14, scope: !525)
!528 = !DILocation(line: 562, column: 12, scope: !529)
!529 = distinct !DILexicalBlock(scope: !525, file: !65, line: 562, column: 11)
!530 = !DILocation(line: 562, column: 19, scope: !529)
!531 = !DILocation(line: 562, column: 37, scope: !529)
!532 = !DILocation(line: 562, column: 110, scope: !529)
!533 = !DILocation(line: 562, column: 114, scope: !529)
!534 = !DILocation(line: 562, column: 135, scope: !529)
!535 = !DILocation(line: 562, column: 11, scope: !525)
!536 = !DILocation(line: 564, column: 19, scope: !537)
!537 = distinct !DILexicalBlock(scope: !529, file: !65, line: 563, column: 7)
!538 = !DILocation(line: 565, column: 7, scope: !537)
!539 = !DILocation(line: 567, column: 17, scope: !540)
!540 = distinct !DILexicalBlock(scope: !529, file: !65, line: 567, column: 16)
!541 = !DILocation(line: 567, column: 24, scope: !540)
!542 = !DILocation(line: 567, column: 44, scope: !540)
!543 = !DILocation(line: 567, column: 117, scope: !540)
!544 = !DILocation(line: 567, column: 123, scope: !540)
!545 = !DILocation(line: 567, column: 144, scope: !540)
!546 = !DILocation(line: 567, column: 16, scope: !529)
!547 = !DILocation(line: 569, column: 19, scope: !548)
!548 = distinct !DILexicalBlock(scope: !540, file: !65, line: 568, column: 7)
!549 = !DILocation(line: 570, column: 7, scope: !548)
!550 = !DILocation(line: 571, column: 7, scope: !525)
!551 = !DILocation(line: 576, column: 7, scope: !552)
!552 = distinct !DILexicalBlock(scope: !334, file: !65, line: 575, column: 5)
!553 = !DILocation(line: 579, column: 10, scope: !321)
!554 = !DILocation(line: 579, column: 3, scope: !321)
!555 = distinct !DISubprogram(name: "HAL_RCCEx_CRSConfig", scope: !65, file: !65, line: 657, type: !556, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !81)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !558}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_CRSInitTypeDef", file: !71, line: 575, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 554, size: 192, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !567}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "Prescaler", scope: !560, file: !71, line: 556, baseType: !24, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Source", scope: !560, file: !71, line: 559, baseType: !24, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Polarity", scope: !560, file: !71, line: 562, baseType: !24, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ReloadValue", scope: !560, file: !71, line: 565, baseType: !24, size: 32, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorLimitValue", scope: !560, file: !71, line: 569, baseType: !24, size: 32, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "HSI48CalibrationValue", scope: !560, file: !71, line: 572, baseType: !24, size: 32, offset: 160)
!568 = !DILocalVariable(name: "pInit", arg: 1, scope: !555, file: !65, line: 657, type: !558)
!569 = !DILocation(line: 657, column: 46, scope: !555)
!570 = !DILocalVariable(name: "value", scope: !555, file: !65, line: 659, type: !24)
!571 = !DILocation(line: 659, column: 12, scope: !555)
!572 = !DILocation(line: 672, column: 79, scope: !555)
!573 = !DILocation(line: 673, column: 79, scope: !555)
!574 = !DILocation(line: 678, column: 12, scope: !555)
!575 = !DILocation(line: 678, column: 19, scope: !555)
!576 = !DILocation(line: 678, column: 31, scope: !555)
!577 = !DILocation(line: 678, column: 38, scope: !555)
!578 = !DILocation(line: 678, column: 29, scope: !555)
!579 = !DILocation(line: 678, column: 47, scope: !555)
!580 = !DILocation(line: 678, column: 54, scope: !555)
!581 = !DILocation(line: 678, column: 45, scope: !555)
!582 = !DILocation(line: 678, column: 9, scope: !555)
!583 = !DILocation(line: 680, column: 12, scope: !555)
!584 = !DILocation(line: 680, column: 19, scope: !555)
!585 = !DILocation(line: 680, column: 9, scope: !555)
!586 = !DILocation(line: 682, column: 13, scope: !555)
!587 = !DILocation(line: 682, column: 20, scope: !555)
!588 = !DILocation(line: 682, column: 36, scope: !555)
!589 = !DILocation(line: 682, column: 9, scope: !555)
!590 = !DILocation(line: 683, column: 63, scope: !555)
!591 = !DILocation(line: 683, column: 60, scope: !555)
!592 = !DILocation(line: 687, column: 117, scope: !555)
!593 = !DILocation(line: 687, column: 123, scope: !555)
!594 = !DILocation(line: 687, column: 152, scope: !555)
!595 = !DILocation(line: 687, column: 159, scope: !555)
!596 = !DILocation(line: 687, column: 181, scope: !555)
!597 = !DILocation(line: 687, column: 148, scope: !555)
!598 = !DILocation(line: 687, column: 60, scope: !555)
!599 = !DILocation(line: 692, column: 58, scope: !555)
!600 = !DILocation(line: 693, column: 1, scope: !555)
!601 = distinct !DISubprogram(name: "HAL_RCCEx_CRSSoftwareSynchronizationGenerate", scope: !65, file: !65, line: 699, type: !602, scopeLine: 700, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !81)
!602 = !DISubroutineType(types: !603)
!603 = !{null}
!604 = !DILocation(line: 701, column: 58, scope: !601)
!605 = !DILocation(line: 702, column: 1, scope: !601)
!606 = distinct !DISubprogram(name: "HAL_RCCEx_CRSGetSynchronizationInfo", scope: !65, file: !65, line: 709, type: !607, scopeLine: 710, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !81)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_CRSSynchroInfoTypeDef", file: !71, line: 597, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 580, size: 128, elements: !612)
!612 = !{!613, !614, !615, !616}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ReloadValue", scope: !611, file: !71, line: 582, baseType: !24, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "HSI48CalibrationValue", scope: !611, file: !71, line: 585, baseType: !24, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "FreqErrorCapture", scope: !611, file: !71, line: 588, baseType: !24, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "FreqErrorDirection", scope: !611, file: !71, line: 592, baseType: !24, size: 32, offset: 96)
!617 = !DILocalVariable(name: "pSynchroInfo", arg: 1, scope: !606, file: !65, line: 709, type: !609)
!618 = !DILocation(line: 709, column: 69, scope: !606)
!619 = !DILocation(line: 715, column: 93, scope: !606)
!620 = !DILocation(line: 715, column: 99, scope: !606)
!621 = !DILocation(line: 715, column: 3, scope: !606)
!622 = !DILocation(line: 715, column: 17, scope: !606)
!623 = !DILocation(line: 715, column: 29, scope: !606)
!624 = !DILocation(line: 718, column: 103, scope: !606)
!625 = !DILocation(line: 718, column: 107, scope: !606)
!626 = !DILocation(line: 718, column: 129, scope: !606)
!627 = !DILocation(line: 718, column: 3, scope: !606)
!628 = !DILocation(line: 718, column: 17, scope: !606)
!629 = !DILocation(line: 718, column: 39, scope: !606)
!630 = !DILocation(line: 721, column: 98, scope: !606)
!631 = !DILocation(line: 721, column: 103, scope: !606)
!632 = !DILocation(line: 721, column: 128, scope: !606)
!633 = !DILocation(line: 721, column: 3, scope: !606)
!634 = !DILocation(line: 721, column: 17, scope: !606)
!635 = !DILocation(line: 721, column: 34, scope: !606)
!636 = !DILocation(line: 724, column: 100, scope: !606)
!637 = !DILocation(line: 724, column: 105, scope: !606)
!638 = !DILocation(line: 724, column: 3, scope: !606)
!639 = !DILocation(line: 724, column: 17, scope: !606)
!640 = !DILocation(line: 724, column: 36, scope: !606)
!641 = !DILocation(line: 725, column: 1, scope: !606)
!642 = distinct !DISubprogram(name: "HAL_RCCEx_CRSWaitSynchronization", scope: !65, file: !65, line: 742, type: !322, scopeLine: 743, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !81)
!643 = !DILocalVariable(name: "Timeout", arg: 1, scope: !642, file: !65, line: 742, type: !24)
!644 = !DILocation(line: 742, column: 52, scope: !642)
!645 = !DILocalVariable(name: "crsstatus", scope: !642, file: !65, line: 744, type: !24)
!646 = !DILocation(line: 744, column: 12, scope: !642)
!647 = !DILocalVariable(name: "tickstart", scope: !642, file: !65, line: 745, type: !24)
!648 = !DILocation(line: 745, column: 12, scope: !642)
!649 = !DILocation(line: 748, column: 15, scope: !642)
!650 = !DILocation(line: 748, column: 13, scope: !642)
!651 = !DILocation(line: 751, column: 3, scope: !642)
!652 = !DILocation(line: 753, column: 8, scope: !653)
!653 = distinct !DILexicalBlock(scope: !654, file: !65, line: 753, column: 8)
!654 = distinct !DILexicalBlock(scope: !642, file: !65, line: 752, column: 3)
!655 = !DILocation(line: 753, column: 16, scope: !653)
!656 = !DILocation(line: 753, column: 8, scope: !654)
!657 = !DILocation(line: 755, column: 11, scope: !658)
!658 = distinct !DILexicalBlock(scope: !659, file: !65, line: 755, column: 10)
!659 = distinct !DILexicalBlock(scope: !653, file: !65, line: 754, column: 5)
!660 = !DILocation(line: 755, column: 19, scope: !658)
!661 = !DILocation(line: 755, column: 26, scope: !658)
!662 = !DILocation(line: 755, column: 31, scope: !658)
!663 = !DILocation(line: 755, column: 47, scope: !658)
!664 = !DILocation(line: 755, column: 45, scope: !658)
!665 = !DILocation(line: 755, column: 60, scope: !658)
!666 = !DILocation(line: 755, column: 58, scope: !658)
!667 = !DILocation(line: 755, column: 10, scope: !659)
!668 = !DILocation(line: 757, column: 19, scope: !669)
!669 = distinct !DILexicalBlock(scope: !658, file: !65, line: 756, column: 7)
!670 = !DILocation(line: 758, column: 7, scope: !669)
!671 = !DILocation(line: 759, column: 5, scope: !659)
!672 = !DILocation(line: 761, column: 60, scope: !673)
!673 = distinct !DILexicalBlock(scope: !654, file: !65, line: 761, column: 8)
!674 = !DILocation(line: 761, column: 65, scope: !673)
!675 = !DILocation(line: 761, column: 88, scope: !673)
!676 = !DILocation(line: 761, column: 8, scope: !654)
!677 = !DILocation(line: 764, column: 17, scope: !678)
!678 = distinct !DILexicalBlock(scope: !673, file: !65, line: 762, column: 5)
