; ModuleID = '../bc_files/stm32f0xx_ll_utils.bc'
source_filename = "/home/sri/zephyrproject/modules/hal/stm32/stm32cube/stm32f0xx/drivers/src/stm32f0xx_ll_utils.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.SysTick_Type = type { i32, i32, i32, i32 }
%struct.LL_UTILS_PLLInitTypeDef = type { i32, i32 }
%struct.RCC_TypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.LL_UTILS_ClkInitTypeDef = type { i32, i32 }

@SystemCoreClock = external dso_local global i32, align 4
@AHBPrescTable = external dso_local constant [16 x i8], align 1

; Function Attrs: nounwind optsize
define hidden void @LL_Init1msTick(i32 noundef %0) #0 !dbg !63 {
  %2 = alloca i32, align 4
  store i32 %0, ptr %2, align 4
  call void @llvm.dbg.declare(metadata ptr %2, metadata !68, metadata !DIExpression()), !dbg !69
  %3 = load i32, ptr %2, align 4, !dbg !70
  call void @LL_InitTick(i32 noundef %3, i32 noundef 1000) #4, !dbg !71
  ret void, !dbg !72
}

; Function Attrs: nocallback nofree nosync nounwind speculatable willreturn memory(none)
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: inlinehint nounwind optsize
define internal void @LL_InitTick(i32 noundef %0, i32 noundef %1) #2 !dbg !73 {
  %3 = alloca i32, align 4
  %4 = alloca i32, align 4
  store i32 %0, ptr %3, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "stm32f0xx_ll_utils.c", directory: "/home/sri/zephyrproject/zephyr/build")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 180, baseType: !5, size: 8, elements: !6)
!4 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f0xx.h", directory: "/home/sri/zephyrproject")
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "SUCCESS", value: 0)
!8 = !DIEnumerator(name: "ERROR", value: 1)
!9 = !{!10, !17, !24, !38}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !12, line: 454, baseType: !13)
!12 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/sri/zephyrproject")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 448, size: 128, elements: !14)
!14 = !{!15, !20, !21, !22}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !13, file: !12, line: 450, baseType: !16, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !17)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 64, baseType: !19)
!18 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !13, file: !12, line: 451, baseType: !16, size: 32, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !13, file: !12, line: 452, baseType: !16, size: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !13, file: !12, line: 453, baseType: !23, size: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !26, line: 350, baseType: !27)
!26 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 339, size: 288, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !27, file: !26, line: 341, baseType: !16, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !27, file: !26, line: 342, baseType: !16, size: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !27, file: !26, line: 343, baseType: !16, size: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !27, file: !26, line: 344, baseType: !16, size: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !27, file: !26, line: 345, baseType: !16, size: 32, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !27, file: !26, line: 346, baseType: !16, size: 32, offset: 160)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !27, file: !26, line: 347, baseType: !16, size: 32, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !27, file: !26, line: 348, baseType: !16, size: 32, offset: 224)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !27, file: !26, line: 349, baseType: !16, size: 32, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !26, line: 461, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 445, size: 448, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !40, file: !26, line: 447, baseType: !16, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !40, file: !26, line: 448, baseType: !16, size: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !40, file: !26, line: 449, baseType: !16, size: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !40, file: !26, line: 450, baseType: !16, size: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !40, file: !26, line: 451, baseType: !16, size: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !40, file: !26, line: 452, baseType: !16, size: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !40, file: !26, line: 453, baseType: !16, size: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !40, file: !26, line: 454, baseType: !16, size: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !40, file: !26, line: 455, baseType: !16, size: 32, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !40, file: !26, line: 456, baseType: !16, size: 32, offset: 288)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !40, file: !26, line: 457, baseType: !16, size: 32, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR2", scope: !40, file: !26, line: 458, baseType: !16, size: 32, offset: 352)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR3", scope: !40, file: !26, line: 459, baseType: !16, size: 32, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !40, file: !26, line: 460, baseType: !16, size: 32, offset: 416)
!56 = !{i32 7, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{i32 1, !"wchar_size", i32 4}
!59 = !{i32 1, !"static_rwdata", i32 1}
!60 = !{i32 1, !"enumsize_buildattr", i32 1}
!61 = !{i32 1, !"armlib_unavailable", i32 0}
!62 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!63 = distinct !DISubprogram(name: "LL_Init1msTick", scope: !64, file: !64, line: 141, type: !65, scopeLine: 142, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !67)
!64 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/src/stm32f0xx_ll_utils.c", directory: "/home/sri/zephyrproject")
!65 = !DISubroutineType(types: !66)
!66 = !{null, !17}
!67 = !{!68}
!68 = !DILocalVariable(name: "HCLKFrequency", arg: 1, scope: !63, file: !64, line: 141, type: !17)
!69 = !DILocation(line: 141, column: 30, scope: !63)
!70 = !DILocation(line: 144, column: 15, scope: !63)
!71 = !DILocation(line: 144, column: 3, scope: !63)
!72 = !DILocation(line: 145, column: 1, scope: !63)
!73 = distinct !DISubprogram(name: "LL_InitTick", scope: !74, file: !74, line: 219, type: !75, scopeLine: 220, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !77)
!74 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_ll_utils.h", directory: "/home/sri/zephyrproject")
!75 = !DISubroutineType(types: !76)
!76 = !{null, !17, !17}
!77 = !{!78, !79}
!78 = !DILocalVariable(name: "HCLKFrequency", arg: 1, scope: !73, file: !74, line: 219, type: !17)
!79 = !DILocalVariable(name: "Ticks", arg: 2, scope: !73, file: !74, line: 219, type: !17)
!80 = !DILocation(line: 219, column: 43, scope: !73)
!81 = !DILocation(line: 219, column: 67, scope: !73)
!82 = !DILocation(line: 222, column: 71, scope: !73)
!83 = !DILocation(line: 222, column: 87, scope: !73)
!84 = !DILocation(line: 222, column: 85, scope: !73)
!85 = !DILocation(line: 222, column: 94, scope: !73)
!86 = !DILocation(line: 222, column: 57, scope: !73)
!87 = !DILocation(line: 223, column: 56, scope: !73)
!88 = !DILocation(line: 224, column: 57, scope: !73)
!89 = !DILocation(line: 226, column: 1, scope: !73)
!90 = distinct !DISubprogram(name: "LL_mDelay", scope: !64, file: !64, line: 157, type: !65, scopeLine: 158, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !91)
!91 = !{!92, !93}
!92 = !DILocalVariable(name: "Delay", arg: 1, scope: !90, file: !64, line: 157, type: !17)
!93 = !DILocalVariable(name: "tmp", scope: !90, file: !64, line: 159, type: !16)
!94 = !DILocation(line: 157, column: 25, scope: !90)
!95 = !DILocation(line: 159, column: 3, scope: !90)
!96 = !DILocation(line: 159, column: 21, scope: !90)
!97 = !DILocation(line: 159, column: 76, scope: !90)
!98 = !DILocation(line: 161, column: 10, scope: !90)
!99 = !DILocation(line: 164, column: 7, scope: !100)
!100 = distinct !DILexicalBlock(scope: !90, file: !64, line: 164, column: 7)
!101 = !DILocation(line: 164, column: 13, scope: !100)
!102 = !DILocation(line: 164, column: 7, scope: !90)
!103 = !DILocation(line: 166, column: 10, scope: !104)
!104 = distinct !DILexicalBlock(scope: !100, file: !64, line: 165, column: 3)
!105 = !DILocation(line: 167, column: 3, scope: !104)
!106 = !DILocation(line: 169, column: 3, scope: !90)
!107 = !DILocation(line: 169, column: 10, scope: !90)
!108 = !DILocation(line: 171, column: 59, scope: !109)
!109 = distinct !DILexicalBlock(scope: !110, file: !64, line: 171, column: 9)
!110 = distinct !DILexicalBlock(scope: !90, file: !64, line: 170, column: 3)
!111 = !DILocation(line: 171, column: 64, scope: !109)
!112 = !DILocation(line: 171, column: 80, scope: !109)
!113 = !DILocation(line: 171, column: 9, scope: !110)
!114 = !DILocation(line: 173, column: 12, scope: !115)
!115 = distinct !DILexicalBlock(scope: !109, file: !64, line: 172, column: 5)
!116 = !DILocation(line: 174, column: 5, scope: !115)
!117 = distinct !{!117, !106, !118}
!118 = !DILocation(line: 175, column: 3, scope: !90)
!119 = !DILocation(line: 176, column: 1, scope: !90)
!120 = distinct !DISubprogram(name: "LL_SetSystemCoreClock", scope: !64, file: !64, line: 213, type: !65, scopeLine: 214, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !121)
!121 = !{!122}
!122 = !DILocalVariable(name: "HCLKFrequency", arg: 1, scope: !120, file: !64, line: 213, type: !17)
!123 = !DILocation(line: 213, column: 37, scope: !120)
!124 = !DILocation(line: 216, column: 21, scope: !120)
!125 = !DILocation(line: 216, column: 19, scope: !120)
!126 = !DILocation(line: 217, column: 1, scope: !120)
!127 = distinct !DISubprogram(name: "LL_SetFlashLatency", scope: !64, file: !64, line: 228, type: !128, scopeLine: 229, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !131)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !17}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorStatus", file: !4, line: 184, baseType: !3)
!131 = !{!132, !133, !134, !135, !136}
!132 = !DILocalVariable(name: "Frequency", arg: 1, scope: !127, file: !64, line: 228, type: !17)
!133 = !DILocalVariable(name: "timeout", scope: !127, file: !64, line: 230, type: !17)
!134 = !DILocalVariable(name: "getlatency", scope: !127, file: !64, line: 231, type: !17)
!135 = !DILocalVariable(name: "latency", scope: !127, file: !64, line: 232, type: !17)
!136 = !DILocalVariable(name: "status", scope: !127, file: !64, line: 233, type: !130)
!137 = !DILocation(line: 228, column: 41, scope: !127)
!138 = !DILocation(line: 230, column: 3, scope: !127)
!139 = !DILocation(line: 230, column: 12, scope: !127)
!140 = !DILocation(line: 231, column: 3, scope: !127)
!141 = !DILocation(line: 231, column: 12, scope: !127)
!142 = !DILocation(line: 232, column: 3, scope: !127)
!143 = !DILocation(line: 232, column: 12, scope: !127)
!144 = !DILocation(line: 233, column: 3, scope: !127)
!145 = !DILocation(line: 233, column: 15, scope: !127)
!146 = !DILocation(line: 236, column: 7, scope: !147)
!147 = distinct !DILexicalBlock(scope: !127, file: !64, line: 236, column: 7)
!148 = !DILocation(line: 236, column: 17, scope: !147)
!149 = !DILocation(line: 236, column: 7, scope: !127)
!150 = !DILocation(line: 238, column: 12, scope: !151)
!151 = distinct !DILexicalBlock(scope: !147, file: !64, line: 237, column: 3)
!152 = !DILocation(line: 239, column: 3, scope: !151)
!153 = !DILocation(line: 242, column: 9, scope: !154)
!154 = distinct !DILexicalBlock(scope: !155, file: !64, line: 242, column: 9)
!155 = distinct !DILexicalBlock(scope: !147, file: !64, line: 241, column: 3)
!156 = !DILocation(line: 242, column: 19, scope: !154)
!157 = !DILocation(line: 242, column: 9, scope: !155)
!158 = !DILocation(line: 245, column: 15, scope: !159)
!159 = distinct !DILexicalBlock(scope: !154, file: !64, line: 243, column: 5)
!160 = !DILocation(line: 246, column: 5, scope: !159)
!161 = !DILocation(line: 250, column: 15, scope: !162)
!162 = distinct !DILexicalBlock(scope: !154, file: !64, line: 248, column: 5)
!163 = !DILocation(line: 252, column: 9, scope: !164)
!164 = distinct !DILexicalBlock(scope: !155, file: !64, line: 252, column: 9)
!165 = !DILocation(line: 252, column: 16, scope: !164)
!166 = !DILocation(line: 252, column: 9, scope: !155)
!167 = !DILocation(line: 254, column: 27, scope: !168)
!168 = distinct !DILexicalBlock(scope: !164, file: !64, line: 253, column: 5)
!169 = !DILocation(line: 254, column: 7, scope: !168)
!170 = !DILocation(line: 258, column: 15, scope: !168)
!171 = !DILocation(line: 259, column: 7, scope: !168)
!172 = !DILocation(line: 262, column: 20, scope: !173)
!173 = distinct !DILexicalBlock(scope: !168, file: !64, line: 260, column: 7)
!174 = !DILocation(line: 262, column: 18, scope: !173)
!175 = !DILocation(line: 263, column: 14, scope: !173)
!176 = !DILocation(line: 264, column: 7, scope: !173)
!177 = !DILocation(line: 264, column: 17, scope: !168)
!178 = !DILocation(line: 264, column: 31, scope: !168)
!179 = !DILocation(line: 264, column: 28, scope: !168)
!180 = !DILocation(line: 264, column: 40, scope: !168)
!181 = !DILocation(line: 264, column: 44, scope: !168)
!182 = !DILocation(line: 264, column: 52, scope: !168)
!183 = !DILocation(line: 0, scope: !168)
!184 = distinct !{!184, !171, !185}
!185 = !DILocation(line: 264, column: 56, scope: !168)
!186 = !DILocation(line: 266, column: 10, scope: !187)
!187 = distinct !DILexicalBlock(scope: !168, file: !64, line: 266, column: 10)
!188 = !DILocation(line: 266, column: 24, scope: !187)
!189 = !DILocation(line: 266, column: 21, scope: !187)
!190 = !DILocation(line: 266, column: 10, scope: !168)
!191 = !DILocation(line: 268, column: 16, scope: !192)
!192 = distinct !DILexicalBlock(scope: !187, file: !64, line: 267, column: 7)
!193 = !DILocation(line: 269, column: 7, scope: !192)
!194 = !DILocation(line: 272, column: 16, scope: !195)
!195 = distinct !DILexicalBlock(scope: !187, file: !64, line: 271, column: 7)
!196 = !DILocation(line: 274, column: 5, scope: !168)
!197 = !DILocation(line: 277, column: 10, scope: !127)
!198 = !DILocation(line: 278, column: 1, scope: !127)
!199 = !DILocation(line: 277, column: 3, scope: !127)
!200 = distinct !DISubprogram(name: "LL_FLASH_SetLatency", scope: !201, file: !201, line: 1778, type: !65, scopeLine: 1779, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !202)
!201 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_ll_system.h", directory: "/home/sri/zephyrproject")
!202 = !{!203}
!203 = !DILocalVariable(name: "Latency", arg: 1, scope: !200, file: !201, line: 1778, type: !17)
!204 = !DILocation(line: 1778, column: 51, scope: !200)
!205 = !DILocation(line: 1780, column: 156, scope: !200)
!206 = !DILocation(line: 1780, column: 163, scope: !200)
!207 = !DILocation(line: 1780, column: 190, scope: !200)
!208 = !DILocation(line: 1780, column: 187, scope: !200)
!209 = !DILocation(line: 1780, column: 80, scope: !200)
!210 = !DILocation(line: 1781, column: 1, scope: !200)
!211 = distinct !DISubprogram(name: "LL_FLASH_GetLatency", scope: !201, file: !201, line: 1790, type: !212, scopeLine: 1791, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !214)
!212 = !DISubroutineType(types: !213)
!213 = !{!17}
!214 = !{}
!215 = !DILocation(line: 1792, column: 91, scope: !211)
!216 = !DILocation(line: 1792, column: 96, scope: !211)
!217 = !DILocation(line: 1792, column: 3, scope: !211)
!218 = distinct !DISubprogram(name: "LL_PLL_ConfigSystemClock_HSI", scope: !64, file: !64, line: 298, type: !219, scopeLine: 300, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !233)
!219 = !DISubroutineType(types: !220)
!220 = !{!130, !221, !227}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "LL_UTILS_PLLInitTypeDef", file: !74, line: 111, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 90, size: 64, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "PLLMul", scope: !223, file: !74, line: 92, baseType: !17, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "PLLDiv", scope: !223, file: !74, line: 99, baseType: !17, size: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "LL_UTILS_ClkInitTypeDef", file: !74, line: 129, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 116, size: 64, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "AHBCLKDivider", scope: !229, file: !74, line: 118, baseType: !17, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "APB1CLKDivider", scope: !229, file: !74, line: 124, baseType: !17, size: 32, offset: 32)
!233 = !{!234, !235, !236, !237}
!234 = !DILocalVariable(name: "UTILS_PLLInitStruct", arg: 1, scope: !218, file: !64, line: 298, type: !221)
!235 = !DILocalVariable(name: "UTILS_ClkInitStruct", arg: 2, scope: !218, file: !64, line: 299, type: !227)
!236 = !DILocalVariable(name: "status", scope: !218, file: !64, line: 301, type: !130)
!237 = !DILocalVariable(name: "pllfreq", scope: !218, file: !64, line: 302, type: !17)
!238 = !DILocation(line: 298, column: 67, scope: !218)
!239 = !DILocation(line: 299, column: 67, scope: !218)
!240 = !DILocation(line: 301, column: 3, scope: !218)
!241 = !DILocation(line: 301, column: 15, scope: !218)
!242 = !DILocation(line: 302, column: 3, scope: !218)
!243 = !DILocation(line: 302, column: 12, scope: !218)
!244 = !DILocation(line: 305, column: 7, scope: !245)
!245 = distinct !DILexicalBlock(scope: !218, file: !64, line: 305, column: 7)
!246 = !DILocation(line: 305, column: 26, scope: !245)
!247 = !DILocation(line: 305, column: 7, scope: !218)
!248 = !DILocation(line: 315, column: 53, scope: !249)
!249 = distinct !DILexicalBlock(scope: !245, file: !64, line: 306, column: 3)
!250 = !DILocation(line: 315, column: 15, scope: !249)
!251 = !DILocation(line: 315, column: 13, scope: !249)
!252 = !DILocation(line: 318, column: 9, scope: !253)
!253 = distinct !DILexicalBlock(scope: !249, file: !64, line: 318, column: 9)
!254 = !DILocation(line: 318, column: 30, scope: !253)
!255 = !DILocation(line: 318, column: 9, scope: !249)
!256 = !DILocation(line: 320, column: 7, scope: !257)
!257 = distinct !DILexicalBlock(scope: !253, file: !64, line: 319, column: 5)
!258 = !DILocation(line: 321, column: 7, scope: !257)
!259 = !DILocation(line: 321, column: 14, scope: !257)
!260 = !DILocation(line: 321, column: 35, scope: !257)
!261 = distinct !{!261, !258, !262}
!262 = !DILocation(line: 324, column: 7, scope: !257)
!263 = !DILocation(line: 325, column: 5, scope: !257)
!264 = !DILocation(line: 329, column: 48, scope: !249)
!265 = !DILocation(line: 329, column: 69, scope: !249)
!266 = !DILocation(line: 329, column: 77, scope: !249)
!267 = !DILocation(line: 329, column: 98, scope: !249)
!268 = !DILocation(line: 329, column: 5, scope: !249)
!269 = !DILocation(line: 335, column: 45, scope: !249)
!270 = !DILocation(line: 335, column: 54, scope: !249)
!271 = !DILocation(line: 335, column: 14, scope: !249)
!272 = !DILocation(line: 335, column: 12, scope: !249)
!273 = !DILocation(line: 336, column: 3, scope: !249)
!274 = !DILocation(line: 340, column: 12, scope: !275)
!275 = distinct !DILexicalBlock(scope: !245, file: !64, line: 338, column: 3)
!276 = !DILocation(line: 343, column: 10, scope: !218)
!277 = !DILocation(line: 344, column: 1, scope: !218)
!278 = !DILocation(line: 343, column: 3, scope: !218)
!279 = distinct !DISubprogram(name: "UTILS_PLL_IsBusy", scope: !64, file: !64, line: 530, type: !280, scopeLine: 531, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !282)
!280 = !DISubroutineType(types: !281)
!281 = !{!130}
!282 = !{!283}
!283 = !DILocalVariable(name: "status", scope: !279, file: !64, line: 532, type: !130)
!284 = !DILocation(line: 532, column: 3, scope: !279)
!285 = !DILocation(line: 532, column: 15, scope: !279)
!286 = !DILocation(line: 535, column: 7, scope: !287)
!287 = distinct !DILexicalBlock(scope: !279, file: !64, line: 535, column: 7)
!288 = !DILocation(line: 535, column: 28, scope: !287)
!289 = !DILocation(line: 535, column: 7, scope: !279)
!290 = !DILocation(line: 538, column: 12, scope: !291)
!291 = distinct !DILexicalBlock(scope: !287, file: !64, line: 536, column: 3)
!292 = !DILocation(line: 539, column: 3, scope: !291)
!293 = !DILocation(line: 541, column: 10, scope: !279)
!294 = !DILocation(line: 542, column: 1, scope: !279)
!295 = !DILocation(line: 541, column: 3, scope: !279)
