; ModuleID = '../bc_files/stm32f0xx_hal_rcc_ex.bc'
source_filename = "/home/sri/zephyrproject/modules/hal/stm32/stm32cube/stm32f0xx/drivers/src/stm32f0xx_hal_rcc_ex.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.RCC_PeriphCLKInitTypeDef = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.RCC_TypeDef = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.RCC_CRSInitTypeDef = type { i32, i32, i32, i32, i32, i32 }
%struct.CRS_TypeDef = type { i32, i32, i32, i32 }
%struct.RCC_CRSSynchroInfoTypeDef = type { i32, i32, i32, i32 }

; Function Attrs: nounwind optsize
define hidden zeroext i8 @HAL_RCCEx_PeriphCLKConfig(ptr noundef %0) #0 !dbg !62 {
  %2 = alloca i8, align 1
  %3 = alloca ptr, align 4
  %4 = alloca i32, align 4
  %5 = alloca i32, align 4
  %6 = alloca i8, align 1
  %7 = alloca i32, align 4
  %8 = alloca i32, align 4
  store ptr %0, ptr %3, align 4
  call void @llvm.dbg.declare(metadata ptr %3, metadata !80, metadata !DIExpression()), !dbg !91
  call void @llvm.lifetime.start.p0(i64 4, ptr %4) #4, !dbg !92
  call void @llvm.dbg.declare(metadata ptr %4, metadata !81, metadata !DIExpression()), !dbg !93
  store i32 0, ptr %4, align 4, !dbg !93
  call void @llvm.lifetime.start.p0(i64 4, ptr %5) #4, !dbg !94
  call void @llvm.dbg.declare(metadata ptr %5, metadata !82, metadata !DIExpression()), !dbg !95
  store i32 0, ptr %5, align 4, !dbg !95

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !16, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "stm32f0xx_hal_rcc_ex.c", directory: "/home/sri/zephyrproject/zephyr/build")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 38, baseType: !5, size: 8, elements: !6)
!4 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal_def.h", directory: "/home/sri/zephyrproject")
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "HAL_OK", value: 0)
!8 = !DIEnumerator(name: "HAL_ERROR", value: 1)
!9 = !DIEnumerator(name: "HAL_BUSY", value: 2)
!10 = !DIEnumerator(name: "HAL_TIMEOUT", value: 3)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 167, baseType: !5, size: 8, elements: !13)
!12 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f0xx.h", directory: "/home/sri/zephyrproject")
!13 = !{!14, !15}
!14 = !DIEnumerator(name: "RESET", value: 0)
!15 = !DIEnumerator(name: "SET", value: 1)
!16 = !{!17, !40, !46, !24, !47}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !19, line: 461, baseType: !20)
!19 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 445, size: 448, elements: !21)
!21 = !{!22, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !20, file: !19, line: 447, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !25, line: 64, baseType: !26)
!25 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!26 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !20, file: !19, line: 448, baseType: !23, size: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !20, file: !19, line: 449, baseType: !23, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !20, file: !19, line: 450, baseType: !23, size: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !20, file: !19, line: 451, baseType: !23, size: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !20, file: !19, line: 452, baseType: !23, size: 32, offset: 160)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !20, file: !19, line: 453, baseType: !23, size: 32, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !20, file: !19, line: 454, baseType: !23, size: 32, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !20, file: !19, line: 455, baseType: !23, size: 32, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !20, file: !19, line: 456, baseType: !23, size: 32, offset: 288)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !20, file: !19, line: 457, baseType: !23, size: 32, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR2", scope: !20, file: !19, line: 458, baseType: !23, size: 32, offset: 352)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR3", scope: !20, file: !19, line: 459, baseType: !23, size: 32, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !20, file: !19, line: 460, baseType: !23, size: 32, offset: 416)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !19, line: 439, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 435, size: 64, elements: !43)
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !42, file: !19, line: 437, baseType: !23, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !42, file: !19, line: 438, baseType: !23, size: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !25, line: 62, baseType: !5)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRS_TypeDef", file: !19, line: 266, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 260, size: 128, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !49, file: !19, line: 262, baseType: !23, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !49, file: !19, line: 263, baseType: !23, size: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !49, file: !19, line: 264, baseType: !23, size: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ICR", scope: !49, file: !19, line: 265, baseType: !23, size: 32, offset: 96)
!55 = !{i32 7, !"Dwarf Version", i32 4}
!56 = !{i32 2, !"Debug Info Version", i32 3}
!57 = !{i32 1, !"wchar_size", i32 4}
!58 = !{i32 1, !"static_rwdata", i32 1}
!59 = !{i32 1, !"enumsize_buildattr", i32 1}
!60 = !{i32 1, !"armlib_unavailable", i32 0}
!61 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!62 = distinct !DISubprogram(name: "HAL_RCCEx_PeriphCLKConfig", scope: !63, file: !63, line: 102, type: !64, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !79)
!63 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/src/stm32f0xx_hal_rcc_ex.c", directory: "/home/sri/zephyrproject")
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "HAL_StatusTypeDef", file: !4, line: 44, baseType: !3)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_PeriphCLKInitTypeDef", file: !69, line: 546, baseType: !70)
!69 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal_rcc_ex.h", directory: "/home/sri/zephyrproject")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 523, size: 224, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77, !78}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "PeriphClockSelection", scope: !70, file: !69, line: 525, baseType: !24, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "RTCClockSelection", scope: !70, file: !69, line: 528, baseType: !24, size: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Usart1ClockSelection", scope: !70, file: !69, line: 531, baseType: !24, size: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Usart2ClockSelection", scope: !70, file: !69, line: 534, baseType: !24, size: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Usart3ClockSelection", scope: !70, file: !69, line: 537, baseType: !24, size: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "I2c1ClockSelection", scope: !70, file: !69, line: 540, baseType: !24, size: 32, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "CecClockSelection", scope: !70, file: !69, line: 543, baseType: !24, size: 32, offset: 192)
!79 = !{!80, !81, !82, !83, !87}
!80 = !DILocalVariable(name: "PeriphClkInit", arg: 1, scope: !62, file: !63, line: 102, type: !67)
!81 = !DILocalVariable(name: "tickstart", scope: !62, file: !63, line: 104, type: !24)
!82 = !DILocalVariable(name: "temp_reg", scope: !62, file: !63, line: 105, type: !24)
!83 = !DILocalVariable(name: "pwrclkchanged", scope: !84, file: !63, line: 116, type: !86)
!84 = distinct !DILexicalBlock(scope: !85, file: !63, line: 112, column: 3)
!85 = distinct !DILexicalBlock(scope: !62, file: !63, line: 111, column: 6)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "FlagStatus", file: !12, line: 171, baseType: !11)
!87 = !DILocalVariable(name: "tmpreg", scope: !88, file: !63, line: 123, type: !23)
!88 = distinct !DILexicalBlock(scope: !89, file: !63, line: 123, column: 8)
!89 = distinct !DILexicalBlock(scope: !90, file: !63, line: 122, column: 5)
!90 = distinct !DILexicalBlock(scope: !84, file: !63, line: 121, column: 8)
!91 = !DILocation(line: 102, column: 71, scope: !62)
!92 = !DILocation(line: 104, column: 3, scope: !62)
!93 = !DILocation(line: 104, column: 12, scope: !62)
!94 = !DILocation(line: 105, column: 3, scope: !62)
!95 = !DILocation(line: 105, column: 12, scope: !62)
!96 = !DILocation(line: 111, column: 8, scope: !85)
!97 = !DILocation(line: 111, column: 23, scope: !85)
!98 = !DILocation(line: 111, column: 45, scope: !85)
!99 = !DILocation(line: 111, column: 62, scope: !85)
!100 = !DILocation(line: 111, column: 6, scope: !62)
!101 = !DILocation(line: 116, column: 5, scope: !84)
!102 = !DILocation(line: 116, column: 16, scope: !84)
!103 = !DILocation(line: 121, column: 76, scope: !90)
!104 = !DILocation(line: 121, column: 84, scope: !90)
!105 = !DILocation(line: 121, column: 106, scope: !90)
!106 = !DILocation(line: 121, column: 8, scope: !84)
!107 = !DILocation(line: 123, column: 5, scope: !89)
!108 = !DILocation(line: 123, column: 10, scope: !88)
!109 = !DILocation(line: 123, column: 28, scope: !88)
!110 = !DILocation(line: 123, column: 113, scope: !88)
!111 = !DILocation(line: 123, column: 214, scope: !88)
!112 = !DILocation(line: 123, column: 223, scope: !88)
!113 = !DILocation(line: 123, column: 144, scope: !88)
!114 = !DILocation(line: 123, column: 252, scope: !88)
!115 = !DILocation(line: 123, column: 260, scope: !89)
!116 = !DILocation(line: 123, column: 260, scope: !88)
!117 = !DILocation(line: 124, column: 21, scope: !89)
!118 = !DILocation(line: 125, column: 5, scope: !89)
!119 = !DILocation(line: 127, column: 60, scope: !120)
!120 = distinct !DILexicalBlock(scope: !84, file: !63, line: 127, column: 8)
!121 = !DILocation(line: 127, column: 64, scope: !120)
!122 = !DILocation(line: 127, column: 85, scope: !120)
!123 = !DILocation(line: 127, column: 8, scope: !84)
!124 = !DILocation(line: 130, column: 62, scope: !125)
!125 = distinct !DILexicalBlock(scope: !120, file: !63, line: 128, column: 5)
!126 = !DILocation(line: 133, column: 19, scope: !125)
!127 = !DILocation(line: 133, column: 17, scope: !125)
!128 = !DILocation(line: 135, column: 7, scope: !125)
!129 = !DILocation(line: 135, column: 65, scope: !125)
!130 = !DILocation(line: 135, column: 69, scope: !125)
!131 = !DILocation(line: 135, column: 90, scope: !125)
!132 = !DILocation(line: 137, column: 13, scope: !133)
!133 = distinct !DILexicalBlock(scope: !134, file: !63, line: 137, column: 12)
!134 = distinct !DILexicalBlock(scope: !125, file: !63, line: 136, column: 7)
!135 = !DILocation(line: 137, column: 29, scope: !133)
!136 = !DILocation(line: 137, column: 27, scope: !133)
!137 = !DILocation(line: 137, column: 40, scope: !133)
!138 = !DILocation(line: 137, column: 12, scope: !134)
!139 = !DILocation(line: 139, column: 11, scope: !140)
!140 = distinct !DILexicalBlock(scope: !133, file: !63, line: 138, column: 9)
!141 = distinct !{!141, !128, !142}
!142 = !DILocation(line: 141, column: 7, scope: !125)
!143 = !DILocation(line: 142, column: 5, scope: !125)
!144 = !DILocation(line: 145, column: 83, scope: !84)
!145 = !DILocation(line: 145, column: 88, scope: !84)
!146 = !DILocation(line: 145, column: 14, scope: !84)
!147 = !DILocation(line: 146, column: 9, scope: !148)
!148 = distinct !DILexicalBlock(scope: !84, file: !63, line: 146, column: 8)
!149 = !DILocation(line: 146, column: 18, scope: !148)
!150 = !DILocation(line: 146, column: 34, scope: !148)
!151 = !DILocation(line: 146, column: 38, scope: !148)
!152 = !DILocation(line: 146, column: 51, scope: !148)
!153 = !DILocation(line: 146, column: 66, scope: !148)
!154 = !DILocation(line: 146, column: 84, scope: !148)
!155 = !DILocation(line: 146, column: 47, scope: !148)
!156 = !DILocation(line: 146, column: 8, scope: !84)
!157 = !DILocation(line: 149, column: 85, scope: !158)
!158 = distinct !DILexicalBlock(scope: !148, file: !63, line: 147, column: 5)
!159 = !DILocation(line: 149, column: 90, scope: !158)
!160 = !DILocation(line: 149, column: 16, scope: !158)
!161 = !DILocation(line: 151, column: 81, scope: !158)
!162 = !DILocation(line: 152, column: 81, scope: !158)
!163 = !DILocation(line: 154, column: 80, scope: !158)
!164 = !DILocation(line: 154, column: 78, scope: !158)
!165 = !DILocation(line: 157, column: 14, scope: !166)
!166 = distinct !DILexicalBlock(scope: !158, file: !63, line: 157, column: 11)
!167 = !DILocation(line: 157, column: 24, scope: !166)
!168 = !DILocation(line: 157, column: 45, scope: !166)
!169 = !DILocation(line: 157, column: 11, scope: !158)
!170 = !DILocation(line: 160, column: 21, scope: !171)
!171 = distinct !DILexicalBlock(scope: !166, file: !63, line: 158, column: 7)
!172 = !DILocation(line: 160, column: 19, scope: !171)
!173 = !DILocation(line: 163, column: 9, scope: !171)
!174 = !DILocation(line: 163, column: 434, scope: !171)
!175 = !DILocation(line: 163, column: 512, scope: !171)
!176 = !DILocation(line: 163, column: 585, scope: !171)
!177 = !DILocation(line: 165, column: 15, scope: !178)
!178 = distinct !DILexicalBlock(scope: !179, file: !63, line: 165, column: 14)
!179 = distinct !DILexicalBlock(scope: !171, file: !63, line: 164, column: 9)
!180 = !DILocation(line: 165, column: 31, scope: !178)
!181 = !DILocation(line: 165, column: 29, scope: !178)
!182 = !DILocation(line: 165, column: 42, scope: !178)
!183 = !DILocation(line: 165, column: 14, scope: !179)
!184 = !DILocation(line: 167, column: 13, scope: !185)
!185 = distinct !DILexicalBlock(scope: !178, file: !63, line: 166, column: 11)
!186 = distinct !{!186, !173, !187}
!187 = !DILocation(line: 169, column: 9, scope: !171)
!188 = !DILocation(line: 170, column: 7, scope: !171)
!189 = !DILocation(line: 171, column: 5, scope: !158)
!190 = !DILocation(line: 172, column: 155, scope: !84)
!191 = !DILocation(line: 172, column: 163, scope: !84)
!192 = !DILocation(line: 172, column: 191, scope: !84)
!193 = !DILocation(line: 172, column: 206, scope: !84)
!194 = !DILocation(line: 172, column: 187, scope: !84)
!195 = !DILocation(line: 172, column: 81, scope: !84)
!196 = !DILocation(line: 175, column: 8, scope: !197)
!197 = distinct !DILexicalBlock(scope: !84, file: !63, line: 175, column: 8)
!198 = !DILocation(line: 175, column: 22, scope: !197)
!199 = !DILocation(line: 175, column: 8, scope: !84)
!200 = !DILocation(line: 177, column: 82, scope: !201)
!201 = distinct !DILexicalBlock(scope: !197, file: !63, line: 176, column: 5)
!202 = !DILocation(line: 178, column: 5, scope: !201)
!203 = !DILocation(line: 179, column: 3, scope: !85)
!204 = !DILocation(line: 179, column: 3, scope: !84)
!205 = !DILocation(line: 182, column: 8, scope: !206)
!206 = distinct !DILexicalBlock(scope: !62, file: !63, line: 182, column: 6)
!207 = !DILocation(line: 182, column: 23, scope: !206)
!208 = !DILocation(line: 182, column: 45, scope: !206)
!209 = !DILocation(line: 182, column: 62, scope: !206)
!210 = !DILocation(line: 182, column: 6, scope: !62)
!211 = !DILocation(line: 188, column: 156, scope: !212)
!212 = distinct !DILexicalBlock(scope: !206, file: !63, line: 183, column: 3)
!213 = !DILocation(line: 188, column: 165, scope: !212)
!214 = !DILocation(line: 188, column: 203, scope: !212)
!215 = !DILocation(line: 188, column: 218, scope: !212)
!216 = !DILocation(line: 188, column: 189, scope: !212)
!217 = !DILocation(line: 188, column: 82, scope: !212)
!218 = !DILocation(line: 189, column: 3, scope: !212)
!219 = !DILocation(line: 194, column: 8, scope: !220)
!220 = distinct !DILexicalBlock(scope: !62, file: !63, line: 194, column: 6)
!221 = !DILocation(line: 194, column: 23, scope: !220)
!222 = !DILocation(line: 194, column: 45, scope: !220)
!223 = !DILocation(line: 194, column: 62, scope: !220)
!224 = !DILocation(line: 194, column: 6, scope: !62)
!225 = !DILocation(line: 200, column: 156, scope: !226)
!226 = distinct !DILexicalBlock(scope: !220, file: !63, line: 195, column: 3)
!227 = !DILocation(line: 200, column: 165, scope: !226)
!228 = !DILocation(line: 200, column: 204, scope: !226)
!229 = !DILocation(line: 200, column: 219, scope: !226)
!230 = !DILocation(line: 200, column: 190, scope: !226)
!231 = !DILocation(line: 200, column: 82, scope: !226)
!232 = !DILocation(line: 201, column: 3, scope: !226)
!233 = !DILocation(line: 207, column: 8, scope: !234)
!234 = distinct !DILexicalBlock(scope: !62, file: !63, line: 207, column: 6)
!235 = !DILocation(line: 207, column: 23, scope: !234)
!236 = !DILocation(line: 207, column: 45, scope: !234)
!237 = !DILocation(line: 207, column: 62, scope: !234)
!238 = !DILocation(line: 207, column: 6, scope: !62)
!239 = !DILocation(line: 213, column: 156, scope: !240)
!240 = distinct !DILexicalBlock(scope: !234, file: !63, line: 208, column: 3)
!241 = !DILocation(line: 213, column: 165, scope: !240)
!242 = !DILocation(line: 213, column: 204, scope: !240)
!243 = !DILocation(line: 213, column: 219, scope: !240)
!244 = !DILocation(line: 213, column: 190, scope: !240)
!245 = !DILocation(line: 213, column: 82, scope: !240)
!246 = !DILocation(line: 214, column: 3, scope: !240)
!247 = !DILocation(line: 218, column: 8, scope: !248)
!248 = distinct !DILexicalBlock(scope: !62, file: !63, line: 218, column: 6)
!249 = !DILocation(line: 218, column: 23, scope: !248)
!250 = !DILocation(line: 218, column: 45, scope: !248)
!251 = !DILocation(line: 218, column: 62, scope: !248)
!252 = !DILocation(line: 218, column: 6, scope: !62)
!253 = !DILocation(line: 224, column: 156, scope: !254)
!254 = distinct !DILexicalBlock(scope: !248, file: !63, line: 219, column: 3)
!255 = !DILocation(line: 224, column: 165, scope: !254)
!256 = !DILocation(line: 224, column: 203, scope: !254)
!257 = !DILocation(line: 224, column: 218, scope: !254)
!258 = !DILocation(line: 224, column: 189, scope: !254)
!259 = !DILocation(line: 224, column: 82, scope: !254)
!260 = !DILocation(line: 225, column: 3, scope: !254)
!261 = !DILocation(line: 244, column: 8, scope: !262)
!262 = distinct !DILexicalBlock(scope: !62, file: !63, line: 244, column: 6)
!263 = !DILocation(line: 244, column: 23, scope: !262)
!264 = !DILocation(line: 244, column: 45, scope: !262)
!265 = !DILocation(line: 244, column: 62, scope: !262)
!266 = !DILocation(line: 244, column: 6, scope: !62)
!267 = !DILocation(line: 250, column: 156, scope: !268)
!268 = distinct !DILexicalBlock(scope: !262, file: !63, line: 245, column: 3)
!269 = !DILocation(line: 250, column: 165, scope: !268)
!270 = !DILocation(line: 250, column: 203, scope: !268)
!271 = !DILocation(line: 250, column: 218, scope: !268)
!272 = !DILocation(line: 250, column: 189, scope: !268)
!273 = !DILocation(line: 250, column: 82, scope: !268)
!274 = !DILocation(line: 251, column: 3, scope: !268)
!275 = !DILocation(line: 257, column: 3, scope: !62)
!276 = !DILocation(line: 258, column: 1, scope: !62)
!277 = !DISubprogram(name: "HAL_GetTick", scope: !278, file: !278, line: 546, type: !279, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !281)
!278 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal.h", directory: "/home/sri/zephyrproject")
!279 = !DISubroutineType(types: !280)
!280 = !{!24}
!281 = !{}
!282 = distinct !DISubprogram(name: "HAL_RCCEx_GetPeriphCLKConfig", scope: !63, file: !63, line: 268, type: !283, scopeLine: 269, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !285)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !67}
!285 = !{!286}
!286 = !DILocalVariable(name: "PeriphClkInit", arg: 1, scope: !282, file: !63, line: 268, type: !67)
!287 = !DILocation(line: 268, column: 61, scope: !282)
!288 = !DILocation(line: 272, column: 3, scope: !282)
!289 = !DILocation(line: 272, column: 18, scope: !282)
!290 = !DILocation(line: 272, column: 39, scope: !282)
!291 = !DILocation(line: 274, column: 107, scope: !282)
!292 = !DILocation(line: 274, column: 113, scope: !282)
!293 = !DILocation(line: 274, column: 3, scope: !282)
!294 = !DILocation(line: 274, column: 18, scope: !282)
!295 = !DILocation(line: 274, column: 36, scope: !282)
!296 = !DILocation(line: 276, column: 121, scope: !282)
!297 = !DILocation(line: 276, column: 128, scope: !282)
!298 = !DILocation(line: 276, column: 3, scope: !282)
!299 = !DILocation(line: 276, column: 18, scope: !282)
!300 = !DILocation(line: 276, column: 39, scope: !282)
!301 = !DILocation(line: 278, column: 119, scope: !282)
!302 = !DILocation(line: 278, column: 126, scope: !282)
!303 = !DILocation(line: 278, column: 3, scope: !282)
!304 = !DILocation(line: 278, column: 18, scope: !282)
!305 = !DILocation(line: 278, column: 37, scope: !282)
!306 = !DILocation(line: 282, column: 3, scope: !282)
!307 = !DILocation(line: 282, column: 18, scope: !282)
!308 = !DILocation(line: 282, column: 39, scope: !282)
!309 = !DILocation(line: 284, column: 121, scope: !282)
!310 = !DILocation(line: 284, column: 128, scope: !282)
!311 = !DILocation(line: 284, column: 3, scope: !282)
!312 = !DILocation(line: 284, column: 18, scope: !282)
!313 = !DILocation(line: 284, column: 39, scope: !282)
!314 = !DILocation(line: 289, column: 3, scope: !282)
!315 = !DILocation(line: 289, column: 18, scope: !282)
!316 = !DILocation(line: 289, column: 39, scope: !282)
!317 = !DILocation(line: 291, column: 121, scope: !282)
!318 = !DILocation(line: 291, column: 128, scope: !282)
!319 = !DILocation(line: 291, column: 3, scope: !282)
!320 = !DILocation(line: 291, column: 18, scope: !282)
!321 = !DILocation(line: 291, column: 39, scope: !282)
!322 = !DILocation(line: 304, column: 3, scope: !282)
!323 = !DILocation(line: 304, column: 18, scope: !282)
!324 = !DILocation(line: 304, column: 39, scope: !282)
!325 = !DILocation(line: 306, column: 118, scope: !282)
!326 = !DILocation(line: 306, column: 125, scope: !282)
!327 = !DILocation(line: 306, column: 3, scope: !282)
!328 = !DILocation(line: 306, column: 18, scope: !282)
!329 = !DILocation(line: 306, column: 36, scope: !282)
!330 = !DILocation(line: 312, column: 1, scope: !282)
!331 = distinct !DISubprogram(name: "HAL_RCCEx_GetPeriphCLKFreq", scope: !63, file: !63, line: 368, type: !332, scopeLine: 369, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !334)
!332 = !DISubroutineType(types: !333)
!333 = !{!24, !24}
!334 = !{!335, !336, !337}
!335 = !DILocalVariable(name: "PeriphClk", arg: 1, scope: !331, file: !63, line: 368, type: !24)
!336 = !DILocalVariable(name: "frequency", scope: !331, file: !63, line: 371, type: !24)
!337 = !DILocalVariable(name: "srcclk", scope: !331, file: !63, line: 373, type: !24)
!338 = !DILocation(line: 368, column: 46, scope: !331)
!339 = !DILocation(line: 371, column: 3, scope: !331)
!340 = !DILocation(line: 371, column: 12, scope: !331)
!341 = !DILocation(line: 373, column: 3, scope: !331)
!342 = !DILocation(line: 373, column: 12, scope: !331)
!343 = !DILocation(line: 381, column: 11, scope: !331)
!344 = !DILocation(line: 381, column: 3, scope: !331)
!345 = !DILocation(line: 386, column: 85, scope: !346)
!346 = distinct !DILexicalBlock(scope: !347, file: !63, line: 384, column: 5)
!347 = distinct !DILexicalBlock(scope: !331, file: !63, line: 382, column: 3)
!348 = !DILocation(line: 386, column: 91, scope: !346)
!349 = !DILocation(line: 386, column: 14, scope: !346)
!350 = !DILocation(line: 389, column: 12, scope: !351)
!351 = distinct !DILexicalBlock(scope: !346, file: !63, line: 389, column: 11)
!352 = !DILocation(line: 389, column: 19, scope: !351)
!353 = !DILocation(line: 389, column: 37, scope: !351)
!354 = !DILocation(line: 389, column: 110, scope: !351)
!355 = !DILocation(line: 389, column: 116, scope: !351)
!356 = !DILocation(line: 389, column: 137, scope: !351)
!357 = !DILocation(line: 389, column: 11, scope: !346)
!358 = !DILocation(line: 391, column: 19, scope: !359)
!359 = distinct !DILexicalBlock(scope: !351, file: !63, line: 390, column: 7)
!360 = !DILocation(line: 392, column: 7, scope: !359)
!361 = !DILocation(line: 394, column: 17, scope: !362)
!362 = distinct !DILexicalBlock(scope: !351, file: !63, line: 394, column: 16)
!363 = !DILocation(line: 394, column: 24, scope: !362)
!364 = !DILocation(line: 394, column: 42, scope: !362)
!365 = !DILocation(line: 394, column: 115, scope: !362)
!366 = !DILocation(line: 394, column: 120, scope: !362)
!367 = !DILocation(line: 394, column: 141, scope: !362)
!368 = !DILocation(line: 394, column: 16, scope: !351)
!369 = !DILocation(line: 396, column: 19, scope: !370)
!370 = distinct !DILexicalBlock(scope: !362, file: !63, line: 395, column: 7)
!371 = !DILocation(line: 397, column: 7, scope: !370)
!372 = !DILocation(line: 399, column: 17, scope: !373)
!373 = distinct !DILexicalBlock(scope: !362, file: !63, line: 399, column: 16)
!374 = !DILocation(line: 399, column: 24, scope: !373)
!375 = !DILocation(line: 399, column: 42, scope: !373)
!376 = !DILocation(line: 399, column: 115, scope: !373)
!377 = !DILocation(line: 399, column: 119, scope: !373)
!378 = !DILocation(line: 399, column: 141, scope: !373)
!379 = !DILocation(line: 399, column: 16, scope: !362)
!380 = !DILocation(line: 401, column: 19, scope: !381)
!381 = distinct !DILexicalBlock(scope: !373, file: !63, line: 400, column: 7)
!382 = !DILocation(line: 402, column: 7, scope: !381)
!383 = !DILocation(line: 403, column: 7, scope: !346)
!384 = !DILocation(line: 408, column: 96, scope: !385)
!385 = distinct !DILexicalBlock(scope: !347, file: !63, line: 406, column: 5)
!386 = !DILocation(line: 408, column: 103, scope: !385)
!387 = !DILocation(line: 408, column: 14, scope: !385)
!388 = !DILocation(line: 411, column: 11, scope: !389)
!389 = distinct !DILexicalBlock(scope: !385, file: !63, line: 411, column: 11)
!390 = !DILocation(line: 411, column: 18, scope: !389)
!391 = !DILocation(line: 411, column: 11, scope: !385)
!392 = !DILocation(line: 413, column: 21, scope: !393)
!393 = distinct !DILexicalBlock(scope: !389, file: !63, line: 412, column: 7)
!394 = !DILocation(line: 413, column: 19, scope: !393)
!395 = !DILocation(line: 414, column: 7, scope: !393)
!396 = !DILocation(line: 416, column: 17, scope: !397)
!397 = distinct !DILexicalBlock(scope: !389, file: !63, line: 416, column: 16)
!398 = !DILocation(line: 416, column: 24, scope: !397)
!399 = !DILocation(line: 416, column: 42, scope: !397)
!400 = !DILocation(line: 416, column: 115, scope: !397)
!401 = !DILocation(line: 416, column: 119, scope: !397)
!402 = !DILocation(line: 416, column: 140, scope: !397)
!403 = !DILocation(line: 416, column: 16, scope: !389)
!404 = !DILocation(line: 418, column: 19, scope: !405)
!405 = distinct !DILexicalBlock(scope: !397, file: !63, line: 417, column: 7)
!406 = !DILocation(line: 419, column: 7, scope: !405)
!407 = !DILocation(line: 421, column: 16, scope: !408)
!408 = distinct !DILexicalBlock(scope: !397, file: !63, line: 421, column: 16)
!409 = !DILocation(line: 421, column: 23, scope: !408)
!410 = !DILocation(line: 421, column: 16, scope: !397)
!411 = !DILocation(line: 423, column: 21, scope: !412)
!412 = distinct !DILexicalBlock(scope: !408, file: !63, line: 422, column: 7)
!413 = !DILocation(line: 423, column: 19, scope: !412)
!414 = !DILocation(line: 424, column: 7, scope: !412)
!415 = !DILocation(line: 426, column: 17, scope: !416)
!416 = distinct !DILexicalBlock(scope: !408, file: !63, line: 426, column: 16)
!417 = !DILocation(line: 426, column: 24, scope: !416)
!418 = !DILocation(line: 426, column: 42, scope: !416)
!419 = !DILocation(line: 426, column: 115, scope: !416)
!420 = !DILocation(line: 426, column: 121, scope: !416)
!421 = !DILocation(line: 426, column: 142, scope: !416)
!422 = !DILocation(line: 426, column: 16, scope: !408)
!423 = !DILocation(line: 428, column: 19, scope: !424)
!424 = distinct !DILexicalBlock(scope: !416, file: !63, line: 427, column: 7)
!425 = !DILocation(line: 429, column: 7, scope: !424)
!426 = !DILocation(line: 430, column: 7, scope: !385)
!427 = !DILocation(line: 436, column: 96, scope: !428)
!428 = distinct !DILexicalBlock(scope: !347, file: !63, line: 434, column: 5)
!429 = !DILocation(line: 436, column: 103, scope: !428)
!430 = !DILocation(line: 436, column: 14, scope: !428)
!431 = !DILocation(line: 439, column: 11, scope: !432)
!432 = distinct !DILexicalBlock(scope: !428, file: !63, line: 439, column: 11)
!433 = !DILocation(line: 439, column: 18, scope: !432)
!434 = !DILocation(line: 439, column: 11, scope: !428)
!435 = !DILocation(line: 441, column: 21, scope: !436)
!436 = distinct !DILexicalBlock(scope: !432, file: !63, line: 440, column: 7)
!437 = !DILocation(line: 441, column: 19, scope: !436)
!438 = !DILocation(line: 442, column: 7, scope: !436)
!439 = !DILocation(line: 444, column: 17, scope: !440)
!440 = distinct !DILexicalBlock(scope: !432, file: !63, line: 444, column: 16)
!441 = !DILocation(line: 444, column: 24, scope: !440)
!442 = !DILocation(line: 444, column: 42, scope: !440)
!443 = !DILocation(line: 444, column: 115, scope: !440)
!444 = !DILocation(line: 444, column: 119, scope: !440)
!445 = !DILocation(line: 444, column: 140, scope: !440)
!446 = !DILocation(line: 444, column: 16, scope: !432)
!447 = !DILocation(line: 446, column: 19, scope: !448)
!448 = distinct !DILexicalBlock(scope: !440, file: !63, line: 445, column: 7)
!449 = !DILocation(line: 447, column: 7, scope: !448)
!450 = !DILocation(line: 449, column: 16, scope: !451)
!451 = distinct !DILexicalBlock(scope: !440, file: !63, line: 449, column: 16)
!452 = !DILocation(line: 449, column: 23, scope: !451)
!453 = !DILocation(line: 449, column: 16, scope: !440)
!454 = !DILocation(line: 451, column: 21, scope: !455)
!455 = distinct !DILexicalBlock(scope: !451, file: !63, line: 450, column: 7)
!456 = !DILocation(line: 451, column: 19, scope: !455)
!457 = !DILocation(line: 452, column: 7, scope: !455)
!458 = !DILocation(line: 454, column: 17, scope: !459)
!459 = distinct !DILexicalBlock(scope: !451, file: !63, line: 454, column: 16)
!460 = !DILocation(line: 454, column: 24, scope: !459)
!461 = !DILocation(line: 454, column: 42, scope: !459)
!462 = !DILocation(line: 454, column: 115, scope: !459)
!463 = !DILocation(line: 454, column: 121, scope: !459)
!464 = !DILocation(line: 454, column: 142, scope: !459)
!465 = !DILocation(line: 454, column: 16, scope: !451)
!466 = !DILocation(line: 456, column: 19, scope: !467)
!467 = distinct !DILexicalBlock(scope: !459, file: !63, line: 455, column: 7)
!468 = !DILocation(line: 457, column: 7, scope: !467)
!469 = !DILocation(line: 458, column: 7, scope: !428)
!470 = !DILocation(line: 465, column: 96, scope: !471)
!471 = distinct !DILexicalBlock(scope: !347, file: !63, line: 463, column: 5)
!472 = !DILocation(line: 465, column: 103, scope: !471)
!473 = !DILocation(line: 465, column: 14, scope: !471)
!474 = !DILocation(line: 468, column: 11, scope: !475)
!475 = distinct !DILexicalBlock(scope: !471, file: !63, line: 468, column: 11)
!476 = !DILocation(line: 468, column: 18, scope: !475)
!477 = !DILocation(line: 468, column: 11, scope: !471)
!478 = !DILocation(line: 470, column: 21, scope: !479)
!479 = distinct !DILexicalBlock(scope: !475, file: !63, line: 469, column: 7)
!480 = !DILocation(line: 470, column: 19, scope: !479)
!481 = !DILocation(line: 471, column: 7, scope: !479)
!482 = !DILocation(line: 473, column: 17, scope: !483)
!483 = distinct !DILexicalBlock(scope: !475, file: !63, line: 473, column: 16)
!484 = !DILocation(line: 473, column: 24, scope: !483)
!485 = !DILocation(line: 473, column: 42, scope: !483)
!486 = !DILocation(line: 473, column: 115, scope: !483)
!487 = !DILocation(line: 473, column: 119, scope: !483)
!488 = !DILocation(line: 473, column: 140, scope: !483)
!489 = !DILocation(line: 473, column: 16, scope: !475)
!490 = !DILocation(line: 475, column: 19, scope: !491)
!491 = distinct !DILexicalBlock(scope: !483, file: !63, line: 474, column: 7)
!492 = !DILocation(line: 476, column: 7, scope: !491)
!493 = !DILocation(line: 478, column: 16, scope: !494)
!494 = distinct !DILexicalBlock(scope: !483, file: !63, line: 478, column: 16)
!495 = !DILocation(line: 478, column: 23, scope: !494)
!496 = !DILocation(line: 478, column: 16, scope: !483)
!497 = !DILocation(line: 480, column: 21, scope: !498)
!498 = distinct !DILexicalBlock(scope: !494, file: !63, line: 479, column: 7)
!499 = !DILocation(line: 480, column: 19, scope: !498)
!500 = !DILocation(line: 481, column: 7, scope: !498)
!501 = !DILocation(line: 483, column: 17, scope: !502)
!502 = distinct !DILexicalBlock(scope: !494, file: !63, line: 483, column: 16)
!503 = !DILocation(line: 483, column: 24, scope: !502)
!504 = !DILocation(line: 483, column: 42, scope: !502)
!505 = !DILocation(line: 483, column: 115, scope: !502)
!506 = !DILocation(line: 483, column: 121, scope: !502)
!507 = !DILocation(line: 483, column: 142, scope: !502)
!508 = !DILocation(line: 483, column: 16, scope: !494)
!509 = !DILocation(line: 485, column: 19, scope: !510)
!510 = distinct !DILexicalBlock(scope: !502, file: !63, line: 484, column: 7)
!511 = !DILocation(line: 486, column: 7, scope: !510)
!512 = !DILocation(line: 487, column: 7, scope: !471)
!513 = !DILocation(line: 493, column: 96, scope: !514)
!514 = distinct !DILexicalBlock(scope: !347, file: !63, line: 491, column: 5)
!515 = !DILocation(line: 493, column: 103, scope: !514)
!516 = !DILocation(line: 493, column: 14, scope: !514)
!517 = !DILocation(line: 496, column: 12, scope: !518)
!518 = distinct !DILexicalBlock(scope: !514, file: !63, line: 496, column: 11)
!519 = !DILocation(line: 496, column: 19, scope: !518)
!520 = !DILocation(line: 496, column: 37, scope: !518)
!521 = !DILocation(line: 496, column: 110, scope: !518)
!522 = !DILocation(line: 496, column: 114, scope: !518)
!523 = !DILocation(line: 496, column: 135, scope: !518)
!524 = !DILocation(line: 496, column: 11, scope: !514)
!525 = !DILocation(line: 498, column: 19, scope: !526)
!526 = distinct !DILexicalBlock(scope: !518, file: !63, line: 497, column: 7)
!527 = !DILocation(line: 499, column: 7, scope: !526)
!528 = !DILocation(line: 501, column: 16, scope: !529)
!529 = distinct !DILexicalBlock(scope: !518, file: !63, line: 501, column: 16)
!530 = !DILocation(line: 501, column: 23, scope: !529)
!531 = !DILocation(line: 501, column: 16, scope: !518)
!532 = !DILocation(line: 503, column: 21, scope: !533)
!533 = distinct !DILexicalBlock(scope: !529, file: !63, line: 502, column: 7)
!534 = !DILocation(line: 503, column: 19, scope: !533)
!535 = !DILocation(line: 504, column: 7, scope: !533)
!536 = !DILocation(line: 505, column: 7, scope: !514)
!537 = !DILocation(line: 559, column: 96, scope: !538)
!538 = distinct !DILexicalBlock(scope: !347, file: !63, line: 557, column: 5)
!539 = !DILocation(line: 559, column: 103, scope: !538)
!540 = !DILocation(line: 559, column: 14, scope: !538)
!541 = !DILocation(line: 562, column: 12, scope: !542)
!542 = distinct !DILexicalBlock(scope: !538, file: !63, line: 562, column: 11)
!543 = !DILocation(line: 562, column: 19, scope: !542)
!544 = !DILocation(line: 562, column: 37, scope: !542)
!545 = !DILocation(line: 562, column: 110, scope: !542)
!546 = !DILocation(line: 562, column: 114, scope: !542)
!547 = !DILocation(line: 562, column: 135, scope: !542)
!548 = !DILocation(line: 562, column: 11, scope: !538)
!549 = !DILocation(line: 564, column: 19, scope: !550)
!550 = distinct !DILexicalBlock(scope: !542, file: !63, line: 563, column: 7)
!551 = !DILocation(line: 565, column: 7, scope: !550)
!552 = !DILocation(line: 567, column: 17, scope: !553)
!553 = distinct !DILexicalBlock(scope: !542, file: !63, line: 567, column: 16)
!554 = !DILocation(line: 567, column: 24, scope: !553)
!555 = !DILocation(line: 567, column: 44, scope: !553)
!556 = !DILocation(line: 567, column: 117, scope: !553)
!557 = !DILocation(line: 567, column: 123, scope: !553)
!558 = !DILocation(line: 567, column: 144, scope: !553)
!559 = !DILocation(line: 567, column: 16, scope: !542)
!560 = !DILocation(line: 569, column: 19, scope: !561)
!561 = distinct !DILexicalBlock(scope: !553, file: !63, line: 568, column: 7)
!562 = !DILocation(line: 570, column: 7, scope: !561)
!563 = !DILocation(line: 571, column: 7, scope: !538)
!564 = !DILocation(line: 576, column: 7, scope: !565)
!565 = distinct !DILexicalBlock(scope: !347, file: !63, line: 575, column: 5)
!566 = !DILocation(line: 579, column: 10, scope: !331)
!567 = !DILocation(line: 580, column: 1, scope: !331)
!568 = !DILocation(line: 579, column: 3, scope: !331)
!569 = !DISubprogram(name: "HAL_RCC_GetPCLK1Freq", scope: !570, file: !570, line: 1657, type: !279, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !281)
!570 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/drivers/include/stm32f0xx_hal_rcc.h", directory: "/home/sri/zephyrproject")
!571 = !DISubprogram(name: "HAL_RCC_GetSysClockFreq", scope: !570, file: !570, line: 1655, type: !279, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !281)
!572 = distinct !DISubprogram(name: "HAL_RCCEx_CRSConfig", scope: !63, file: !63, line: 657, type: !573, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !585)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_CRSInitTypeDef", file: !69, line: 575, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 554, size: 192, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Prescaler", scope: !577, file: !69, line: 556, baseType: !24, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Source", scope: !577, file: !69, line: 559, baseType: !24, size: 32, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Polarity", scope: !577, file: !69, line: 562, baseType: !24, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ReloadValue", scope: !577, file: !69, line: 565, baseType: !24, size: 32, offset: 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ErrorLimitValue", scope: !577, file: !69, line: 569, baseType: !24, size: 32, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "HSI48CalibrationValue", scope: !577, file: !69, line: 572, baseType: !24, size: 32, offset: 160)
!585 = !{!586, !587}
!586 = !DILocalVariable(name: "pInit", arg: 1, scope: !572, file: !63, line: 657, type: !575)
!587 = !DILocalVariable(name: "value", scope: !572, file: !63, line: 659, type: !24)
!588 = !DILocation(line: 657, column: 46, scope: !572)
!589 = !DILocation(line: 659, column: 3, scope: !572)
!590 = !DILocation(line: 659, column: 12, scope: !572)
!591 = !DILocation(line: 672, column: 79, scope: !572)
!592 = !DILocation(line: 673, column: 79, scope: !572)
!593 = !DILocation(line: 678, column: 12, scope: !572)
!594 = !DILocation(line: 678, column: 19, scope: !572)
!595 = !DILocation(line: 678, column: 31, scope: !572)
!596 = !DILocation(line: 678, column: 38, scope: !572)
!597 = !DILocation(line: 678, column: 29, scope: !572)
!598 = !DILocation(line: 678, column: 47, scope: !572)
!599 = !DILocation(line: 678, column: 54, scope: !572)
!600 = !DILocation(line: 678, column: 45, scope: !572)
!601 = !DILocation(line: 678, column: 9, scope: !572)
!602 = !DILocation(line: 680, column: 12, scope: !572)
!603 = !DILocation(line: 680, column: 19, scope: !572)
!604 = !DILocation(line: 680, column: 9, scope: !572)
!605 = !DILocation(line: 682, column: 13, scope: !572)
!606 = !DILocation(line: 682, column: 20, scope: !572)
!607 = !DILocation(line: 682, column: 36, scope: !572)
!608 = !DILocation(line: 682, column: 9, scope: !572)
!609 = !DILocation(line: 683, column: 63, scope: !572)
!610 = !DILocation(line: 683, column: 60, scope: !572)
!611 = !DILocation(line: 687, column: 117, scope: !572)
!612 = !DILocation(line: 687, column: 123, scope: !572)
!613 = !DILocation(line: 687, column: 152, scope: !572)
!614 = !DILocation(line: 687, column: 159, scope: !572)
!615 = !DILocation(line: 687, column: 181, scope: !572)
!616 = !DILocation(line: 687, column: 148, scope: !572)
!617 = !DILocation(line: 687, column: 60, scope: !572)
!618 = !DILocation(line: 692, column: 58, scope: !572)
!619 = !DILocation(line: 693, column: 1, scope: !572)
!620 = distinct !DISubprogram(name: "HAL_RCCEx_CRSSoftwareSynchronizationGenerate", scope: !63, file: !63, line: 699, type: !621, scopeLine: 700, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !281)
!621 = !DISubroutineType(types: !622)
!622 = !{null}
!623 = !DILocation(line: 701, column: 58, scope: !620)
!624 = !DILocation(line: 702, column: 1, scope: !620)
!625 = distinct !DISubprogram(name: "HAL_RCCEx_CRSGetSynchronizationInfo", scope: !63, file: !63, line: 709, type: !626, scopeLine: 710, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !636)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_CRSSynchroInfoTypeDef", file: !69, line: 597, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 580, size: 128, elements: !631)
!631 = !{!632, !633, !634, !635}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ReloadValue", scope: !630, file: !69, line: 582, baseType: !24, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "HSI48CalibrationValue", scope: !630, file: !69, line: 585, baseType: !24, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "FreqErrorCapture", scope: !630, file: !69, line: 588, baseType: !24, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "FreqErrorDirection", scope: !630, file: !69, line: 592, baseType: !24, size: 32, offset: 96)
!636 = !{!637}
!637 = !DILocalVariable(name: "pSynchroInfo", arg: 1, scope: !625, file: !63, line: 709, type: !628)
!638 = !DILocation(line: 709, column: 69, scope: !625)
!639 = !DILocation(line: 715, column: 93, scope: !625)
!640 = !DILocation(line: 715, column: 99, scope: !625)
!641 = !DILocation(line: 715, column: 3, scope: !625)
!642 = !DILocation(line: 715, column: 17, scope: !625)
!643 = !DILocation(line: 715, column: 29, scope: !625)
!644 = !DILocation(line: 718, column: 103, scope: !625)
!645 = !DILocation(line: 718, column: 107, scope: !625)
!646 = !DILocation(line: 718, column: 129, scope: !625)
!647 = !DILocation(line: 718, column: 3, scope: !625)
!648 = !DILocation(line: 718, column: 17, scope: !625)
!649 = !DILocation(line: 718, column: 39, scope: !625)
!650 = !DILocation(line: 721, column: 98, scope: !625)
!651 = !DILocation(line: 721, column: 103, scope: !625)
!652 = !DILocation(line: 721, column: 128, scope: !625)
!653 = !DILocation(line: 721, column: 3, scope: !625)
!654 = !DILocation(line: 721, column: 17, scope: !625)
!655 = !DILocation(line: 721, column: 34, scope: !625)
!656 = !DILocation(line: 724, column: 100, scope: !625)
!657 = !DILocation(line: 724, column: 105, scope: !625)
!658 = !DILocation(line: 724, column: 3, scope: !625)
!659 = !DILocation(line: 724, column: 17, scope: !625)
!660 = !DILocation(line: 724, column: 36, scope: !625)
!661 = !DILocation(line: 725, column: 1, scope: !625)
!662 = distinct !DISubprogram(name: "HAL_RCCEx_CRSWaitSynchronization", scope: !63, file: !63, line: 742, type: !332, scopeLine: 743, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !663)
!663 = !{!664, !665, !666}
!664 = !DILocalVariable(name: "Timeout", arg: 1, scope: !662, file: !63, line: 742, type: !24)
!665 = !DILocalVariable(name: "crsstatus", scope: !662, file: !63, line: 744, type: !24)
!666 = !DILocalVariable(name: "tickstart", scope: !662, file: !63, line: 745, type: !24)
!667 = !DILocation(line: 742, column: 52, scope: !662)
!668 = !DILocation(line: 744, column: 3, scope: !662)
!669 = !DILocation(line: 744, column: 12, scope: !662)
!670 = !DILocation(line: 745, column: 3, scope: !662)
!671 = !DILocation(line: 745, column: 12, scope: !662)
!672 = !DILocation(line: 748, column: 15, scope: !662)
!673 = !DILocation(line: 748, column: 13, scope: !662)
!674 = !DILocation(line: 751, column: 3, scope: !662)
!675 = !DILocation(line: 753, column: 8, scope: !676)
!676 = distinct !DILexicalBlock(scope: !677, file: !63, line: 753, column: 8)
!677 = distinct !DILexicalBlock(scope: !662, file: !63, line: 752, column: 3)
!678 = !DILocation(line: 753, column: 16, scope: !676)
!679 = !DILocation(line: 753, column: 8, scope: !677)
!680 = !DILocation(line: 755, column: 11, scope: !681)
!681 = distinct !DILexicalBlock(scope: !682, file: !63, line: 755, column: 10)
!682 = distinct !DILexicalBlock(scope: !676, file: !63, line: 754, column: 5)
!683 = !DILocation(line: 755, column: 19, scope: !681)
!684 = !DILocation(line: 755, column: 26, scope: !681)
!685 = !DILocation(line: 755, column: 31, scope: !681)
!686 = !DILocation(line: 755, column: 47, scope: !681)
!687 = !DILocation(line: 755, column: 45, scope: !681)
!688 = !DILocation(line: 755, column: 60, scope: !681)
!689 = !DILocation(line: 755, column: 58, scope: !681)
!690 = !DILocation(line: 755, column: 10, scope: !682)
!691 = !DILocation(line: 757, column: 19, scope: !692)
!692 = distinct !DILexicalBlock(scope: !681, file: !63, line: 756, column: 7)
!693 = !DILocation(line: 758, column: 7, scope: !692)
!694 = !DILocation(line: 759, column: 5, scope: !682)
!695 = !DILocation(line: 761, column: 60, scope: !696)
!696 = distinct !DILexicalBlock(scope: !677, file: !63, line: 761, column: 8)
!697 = !DILocation(line: 761, column: 65, scope: !696)
