; ModuleID = '../bc_files/timeout.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/timeout.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_spinlock = type {}
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }
%struct.z_spinlock_key = type { i32 }
%struct.k_timepoint_t = type { i64 }

@timeout_lock = internal global %struct.k_spinlock zeroinitializer, align 1, !dbg !0

!35 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 26)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 27)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 28)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 29)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 30)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 31)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 32)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 33)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 34)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 35)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 36)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 37)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 38)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 39)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 40)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 41)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 42)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 43)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 44)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 45)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 46)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 47)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!87 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!88 = !{!89, !94, !96, !98, !95, !99, !125, !91}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !90, line: 46, baseType: !91)
!90 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !92, line: 59, baseType: !93)
!92 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!93 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !92, line: 58, baseType: !95)
!95 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !92, line: 64, baseType: !97)
!97 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !101, line: 254, size: 192, elements: !102)
!101 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!102 = !{!103, !119, !124}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !100, file: !101, line: 255, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !105, line: 55, baseType: !106)
!105 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !105, line: 37, size: 64, elements: !107)
!107 = !{!108, !114}
!108 = !DIDerivedType(tag: DW_TAG_member, scope: !106, file: !105, line: 38, baseType: !109, size: 32)
!109 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !106, file: !105, line: 38, size: 32, elements: !110)
!110 = !{!111, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !109, file: !105, line: 39, baseType: !112, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !109, file: !105, line: 40, baseType: !112, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, scope: !106, file: !105, line: 42, baseType: !115, size: 32, offset: 32)
!115 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !106, file: !105, line: 42, size: 32, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !115, file: !105, line: 43, baseType: !112, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !115, file: !105, line: 44, baseType: !112, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !100, file: !101, line: 256, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !101, line: 252, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !99}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !100, file: !101, line: 259, baseType: !91, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!127 = !{!128, !0, !133, !135}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "curr_tick", scope: !2, file: !130, line: 15, type: !131, isLocal: true, isDefinition: true)
!130 = !DIFile(filename: "kernel/timeout.c", directory: "/home/sri/zephyrproject/zephyr")
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !92, line: 65, baseType: !132)
!132 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "announce_remaining", scope: !2, file: !130, line: 25, type: !95, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "timeout_list", scope: !2, file: !130, line: 17, type: !137, isLocal: true, isDefinition: true)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !105, line: 51, baseType: !106)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !139, line: 45, elements: !140)
!139 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!140 = !{}
!141 = !{i32 7, !"Dwarf Version", i32 4}
!142 = !{i32 2, !"Debug Info Version", i32 3}
!143 = !{i32 1, !"wchar_size", i32 4}
!144 = !{i32 1, !"static_rwdata", i32 1}
!145 = !{i32 1, !"enumsize_buildattr", i32 1}
!146 = !{i32 1, !"armlib_unavailable", i32 0}
!147 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!148 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !6, file: !6, line: 223, type: !149, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !237)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !151, !153}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !155, line: 250, size: 896, elements: !156)
!155 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!156 = !{!157, !198, !211, !212, !213, !214, !232}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !154, file: !155, line: 252, baseType: !158, size: 384)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !155, line: 58, size: 384, elements: !159)
!159 = !{!160, !173, !179, !181, !182, !195, !196, !197}
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !158, file: !155, line: 61, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !158, file: !155, line: 61, size: 64, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !161, file: !155, line: 62, baseType: !104, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !161, file: !155, line: 63, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !166, line: 58, size: 64, elements: !167)
!166 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !165, file: !166, line: 60, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 64, elements: !171)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!171 = !{!172}
!172 = !DISubrange(count: 2)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !158, file: !155, line: 69, baseType: !174, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !101, line: 243, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 241, size: 64, elements: !177)
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !176, file: !101, line: 242, baseType: !137, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !158, file: !155, line: 72, baseType: !180, size: 8, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !92, line: 62, baseType: !7)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !158, file: !155, line: 75, baseType: !180, size: 8, offset: 104)
!182 = !DIDerivedType(tag: DW_TAG_member, scope: !158, file: !155, line: 91, baseType: !183, size: 16, offset: 112)
!183 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !158, file: !155, line: 91, size: 16, elements: !184)
!184 = !{!185, !192}
!185 = !DIDerivedType(tag: DW_TAG_member, scope: !183, file: !155, line: 92, baseType: !186, size: 16)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !183, file: !155, line: 92, size: 16, elements: !187)
!187 = !{!188, !191}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !186, file: !155, line: 97, baseType: !189, size: 8)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !92, line: 56, baseType: !190)
!190 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !186, file: !155, line: 98, baseType: !180, size: 8, offset: 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !183, file: !155, line: 101, baseType: !193, size: 16)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !92, line: 63, baseType: !194)
!194 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !158, file: !155, line: 108, baseType: !96, size: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !158, file: !155, line: 132, baseType: !98, size: 32, offset: 160)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !158, file: !155, line: 136, baseType: !100, size: 192, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !154, file: !155, line: 255, baseType: !199, size: 288, offset: 384)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !200, line: 25, size: 288, elements: !201)
!200 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !199, file: !200, line: 26, baseType: !96, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !199, file: !200, line: 27, baseType: !96, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !199, file: !200, line: 28, baseType: !96, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !199, file: !200, line: 29, baseType: !96, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !199, file: !200, line: 30, baseType: !96, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !199, file: !200, line: 31, baseType: !96, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !199, file: !200, line: 32, baseType: !96, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !199, file: !200, line: 33, baseType: !96, size: 32, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !199, file: !200, line: 34, baseType: !96, size: 32, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !154, file: !155, line: 258, baseType: !98, size: 32, offset: 672)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !154, file: !155, line: 261, baseType: !175, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !154, file: !155, line: 302, baseType: !95, size: 32, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !154, file: !155, line: 333, baseType: !215, size: 32, offset: 800)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !217, line: 5291, size: 160, elements: !218)
!217 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!218 = !{!219, !230, !231}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !216, file: !217, line: 5292, baseType: !220, size: 96)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !221, line: 56, size: 96, elements: !222)
!221 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!222 = !{!223, !226, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !220, file: !221, line: 57, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !221, line: 57, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !220, file: !221, line: 58, baseType: !98, size: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !220, file: !221, line: 59, baseType: !228, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !229, line: 46, baseType: !97)
!229 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!230 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !216, file: !217, line: 5293, baseType: !175, size: 64, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !216, file: !217, line: 5294, baseType: !138, offset: 160)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !154, file: !155, line: 355, baseType: !233, size: 64, offset: 832)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !200, line: 60, size: 64, elements: !234)
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !233, file: !200, line: 63, baseType: !96, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !233, file: !200, line: 66, baseType: !96, size: 32, offset: 32)
!237 = !{!238, !239}
!238 = !DILocalVariable(name: "object", arg: 1, scope: !148, file: !6, line: 223, type: !151)
!239 = !DILocalVariable(name: "thread", arg: 2, scope: !148, file: !6, line: 224, type: !153)
!240 = !DILocation(line: 223, column: 61, scope: !148)
!241 = !DILocation(line: 224, column: 24, scope: !148)
!242 = !DILocation(line: 226, column: 9, scope: !148)
!243 = !DILocation(line: 227, column: 9, scope: !148)
!244 = !DILocation(line: 228, column: 1, scope: !148)
!245 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !6, file: !6, line: 243, type: !246, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !248)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !151}
!248 = !{!249}
!249 = !DILocalVariable(name: "object", arg: 1, scope: !245, file: !6, line: 243, type: !151)
!250 = !DILocation(line: 243, column: 56, scope: !245)
!251 = !DILocation(line: 245, column: 9, scope: !245)
!252 = !DILocation(line: 246, column: 1, scope: !245)
!253 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !6, file: !6, line: 359, type: !254, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !256)
!254 = !DISubroutineType(types: !255)
!255 = !{!98, !5}
!256 = !{!257}
!257 = !DILocalVariable(name: "otype", arg: 1, scope: !253, file: !6, line: 359, type: !5)
!258 = !DILocation(line: 359, column: 58, scope: !253)
!259 = !DILocation(line: 361, column: 9, scope: !253)
!260 = !DILocation(line: 363, column: 2, scope: !253)
!261 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !6, file: !6, line: 366, type: !262, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !264)
!262 = !DISubroutineType(types: !263)
!263 = !{!98, !5, !228}
!264 = !{!265, !266}
!265 = !DILocalVariable(name: "otype", arg: 1, scope: !261, file: !6, line: 366, type: !5)
!266 = !DILocalVariable(name: "size", arg: 2, scope: !261, file: !6, line: 367, type: !228)
!267 = !DILocation(line: 366, column: 63, scope: !261)
!268 = !DILocation(line: 367, column: 13, scope: !261)
!269 = !DILocation(line: 369, column: 9, scope: !261)
!270 = !DILocation(line: 370, column: 9, scope: !261)
!271 = !DILocation(line: 372, column: 2, scope: !261)
!272 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !217, file: !217, line: 656, type: !273, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !277)
!273 = !DISubroutineType(types: !274)
!274 = !{!89, !275}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!277 = !{!278}
!278 = !DILocalVariable(name: "t", arg: 1, scope: !272, file: !217, line: 657, type: !275)
!279 = !DILocation(line: 657, column: 30, scope: !272)
!280 = !DILocation(line: 659, column: 28, scope: !272)
!281 = !DILocation(line: 659, column: 31, scope: !272)
!282 = !DILocation(line: 659, column: 36, scope: !272)
!283 = !DILocation(line: 659, column: 9, scope: !272)
!284 = !DILocation(line: 659, column: 2, scope: !272)
!285 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !217, file: !217, line: 671, type: !273, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !286)
!286 = !{!287}
!287 = !DILocalVariable(name: "t", arg: 1, scope: !285, file: !217, line: 672, type: !275)
!288 = !DILocation(line: 672, column: 30, scope: !285)
!289 = !DILocation(line: 674, column: 30, scope: !285)
!290 = !DILocation(line: 674, column: 33, scope: !285)
!291 = !DILocation(line: 674, column: 38, scope: !285)
!292 = !DILocation(line: 674, column: 9, scope: !285)
!293 = !DILocation(line: 674, column: 2, scope: !285)
!294 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !217, file: !217, line: 1634, type: !295, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !316)
!295 = !DISubroutineType(types: !296)
!296 = !{!89, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !217, line: 1439, size: 448, elements: !300)
!300 = !{!301, !302, !303, !308, !309, !314, !315}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !299, file: !217, line: 1445, baseType: !100, size: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !299, file: !217, line: 1448, baseType: !175, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !299, file: !217, line: 1451, baseType: !304, size: 32, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !299, file: !217, line: 1454, baseType: !304, size: 32, offset: 288)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !299, file: !217, line: 1457, baseType: !310, size: 64, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !90, line: 67, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 65, size: 64, elements: !312)
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !311, file: !90, line: 66, baseType: !89, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !299, file: !217, line: 1460, baseType: !96, size: 32, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !299, file: !217, line: 1463, baseType: !98, size: 32, offset: 416)
!316 = !{!317}
!317 = !DILocalVariable(name: "timer", arg: 1, scope: !294, file: !217, line: 1635, type: !297)
!318 = !DILocation(line: 1635, column: 34, scope: !294)
!319 = !DILocation(line: 1637, column: 28, scope: !294)
!320 = !DILocation(line: 1637, column: 35, scope: !294)
!321 = !DILocation(line: 1637, column: 9, scope: !294)
!322 = !DILocation(line: 1637, column: 2, scope: !294)
!323 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !217, file: !217, line: 1649, type: !295, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !324)
!324 = !{!325}
!325 = !DILocalVariable(name: "timer", arg: 1, scope: !323, file: !217, line: 1650, type: !297)
!326 = !DILocation(line: 1650, column: 34, scope: !323)
!327 = !DILocation(line: 1652, column: 30, scope: !323)
!328 = !DILocation(line: 1652, column: 37, scope: !323)
!329 = !DILocation(line: 1652, column: 9, scope: !323)
!330 = !DILocation(line: 1652, column: 2, scope: !323)
!331 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !217, file: !217, line: 1689, type: !332, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !334)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !307, !98}
!334 = !{!335, !336}
!335 = !DILocalVariable(name: "timer", arg: 1, scope: !331, file: !217, line: 1689, type: !307)
!336 = !DILocalVariable(name: "user_data", arg: 2, scope: !331, file: !217, line: 1690, type: !98)
!337 = !DILocation(line: 1689, column: 65, scope: !331)
!338 = !DILocation(line: 1690, column: 19, scope: !331)
!339 = !DILocation(line: 1692, column: 21, scope: !331)
!340 = !DILocation(line: 1692, column: 2, scope: !331)
!341 = !DILocation(line: 1692, column: 9, scope: !331)
!342 = !DILocation(line: 1692, column: 19, scope: !331)
!343 = !DILocation(line: 1693, column: 1, scope: !331)
!344 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !217, file: !217, line: 1704, type: !345, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !347)
!345 = !DISubroutineType(types: !346)
!346 = !{!98, !297}
!347 = !{!348}
!348 = !DILocalVariable(name: "timer", arg: 1, scope: !344, file: !217, line: 1704, type: !297)
!349 = !DILocation(line: 1704, column: 72, scope: !344)
!350 = !DILocation(line: 1706, column: 9, scope: !344)
!351 = !DILocation(line: 1706, column: 16, scope: !344)
!352 = !DILocation(line: 1706, column: 2, scope: !344)
!353 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !217, file: !217, line: 2071, type: !354, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !374)
!354 = !DISubroutineType(types: !355)
!355 = !{!95, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !217, line: 1830, size: 128, elements: !358)
!358 = !{!359, !372, !373}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !357, file: !217, line: 1831, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !361, line: 60, baseType: !362)
!361 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !361, line: 53, size: 64, elements: !363)
!363 = !{!364, !371}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !362, file: !361, line: 54, baseType: !365, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !361, line: 50, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !361, line: 44, size: 32, elements: !368)
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !367, file: !361, line: 45, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !361, line: 40, baseType: !96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !362, file: !361, line: 55, baseType: !365, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !357, file: !217, line: 1832, baseType: !138, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !357, file: !217, line: 1833, baseType: !175, size: 64, offset: 64)
!374 = !{!375}
!375 = !DILocalVariable(name: "queue", arg: 1, scope: !353, file: !217, line: 2071, type: !356)
!376 = !DILocation(line: 2071, column: 59, scope: !353)
!377 = !DILocation(line: 2073, column: 35, scope: !353)
!378 = !DILocation(line: 2073, column: 42, scope: !353)
!379 = !DILocation(line: 2073, column: 14, scope: !353)
!380 = !DILocation(line: 2073, column: 9, scope: !353)
!381 = !DILocation(line: 2073, column: 2, scope: !353)
!382 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !217, file: !217, line: 3209, type: !383, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !391)
!383 = !DISubroutineType(types: !384)
!384 = !{!97, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !217, line: 3092, size: 128, elements: !387)
!387 = !{!388, !389, !390}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !386, file: !217, line: 3093, baseType: !175, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !386, file: !217, line: 3094, baseType: !97, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !386, file: !217, line: 3095, baseType: !97, size: 32, offset: 96)
!391 = !{!392}
!392 = !DILocalVariable(name: "sem", arg: 1, scope: !382, file: !217, line: 3209, type: !385)
!393 = !DILocation(line: 3209, column: 65, scope: !382)
!394 = !DILocation(line: 3211, column: 9, scope: !382)
!395 = !DILocation(line: 3211, column: 14, scope: !382)
!396 = !DILocation(line: 3211, column: 2, scope: !382)
!397 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !217, file: !217, line: 4649, type: !398, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !413)
!398 = !DISubroutineType(types: !399)
!399 = !{!96, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !217, line: 4390, size: 320, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411, !412}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !401, file: !217, line: 4392, baseType: !175, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !401, file: !217, line: 4394, baseType: !138, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !401, file: !217, line: 4396, baseType: !228, size: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !401, file: !217, line: 4398, baseType: !96, size: 32, offset: 96)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !401, file: !217, line: 4400, baseType: !125, size: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !401, file: !217, line: 4402, baseType: !125, size: 32, offset: 160)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !401, file: !217, line: 4404, baseType: !125, size: 32, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !401, file: !217, line: 4406, baseType: !125, size: 32, offset: 224)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !401, file: !217, line: 4408, baseType: !96, size: 32, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !401, file: !217, line: 4413, baseType: !180, size: 8, offset: 288)
!413 = !{!414}
!414 = !DILocalVariable(name: "msgq", arg: 1, scope: !397, file: !217, line: 4649, type: !400)
!415 = !DILocation(line: 4649, column: 66, scope: !397)
!416 = !DILocation(line: 4651, column: 9, scope: !397)
!417 = !DILocation(line: 4651, column: 15, scope: !397)
!418 = !DILocation(line: 4651, column: 26, scope: !397)
!419 = !DILocation(line: 4651, column: 32, scope: !397)
!420 = !DILocation(line: 4651, column: 24, scope: !397)
!421 = !DILocation(line: 4651, column: 2, scope: !397)
!422 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !217, file: !217, line: 4665, type: !398, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !423)
!423 = !{!424}
!424 = !DILocalVariable(name: "msgq", arg: 1, scope: !422, file: !217, line: 4665, type: !400)
!425 = !DILocation(line: 4665, column: 66, scope: !422)
!426 = !DILocation(line: 4667, column: 9, scope: !422)
!427 = !DILocation(line: 4667, column: 15, scope: !422)
!428 = !DILocation(line: 4667, column: 2, scope: !422)
!429 = distinct !DISubprogram(name: "z_add_timeout", scope: !130, file: !130, line: 99, type: !430, scopeLine: 101, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !432)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !99, !120, !310}
!432 = !{!433, !434, !435, !436, !442, !443, !446}
!433 = !DILocalVariable(name: "to", arg: 1, scope: !429, file: !130, line: 99, type: !99)
!434 = !DILocalVariable(name: "fn", arg: 2, scope: !429, file: !130, line: 99, type: !120)
!435 = !DILocalVariable(name: "timeout", arg: 3, scope: !429, file: !130, line: 100, type: !310)
!436 = !DILocalVariable(name: "__i", scope: !437, file: !130, line: 113, type: !438)
!437 = distinct !DILexicalBlock(scope: !429, file: !130, line: 113, column: 2)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !139, line: 108, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !139, line: 34, size: 32, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !439, file: !139, line: 35, baseType: !95, size: 32)
!442 = !DILocalVariable(name: "__key", scope: !437, file: !130, line: 113, type: !438)
!443 = !DILocalVariable(name: "t", scope: !444, file: !130, line: 114, type: !99)
!444 = distinct !DILexicalBlock(scope: !445, file: !130, line: 113, column: 130)
!445 = distinct !DILexicalBlock(scope: !437, file: !130, line: 113, column: 2)
!446 = !DILocalVariable(name: "ticks", scope: !447, file: !130, line: 118, type: !89)
!447 = distinct !DILexicalBlock(scope: !448, file: !130, line: 117, column: 54)
!448 = distinct !DILexicalBlock(scope: !444, file: !130, line: 116, column: 7)
!449 = !DILocation(line: 99, column: 37, scope: !429)
!450 = !DILocation(line: 99, column: 57, scope: !429)
!451 = !DILocation(line: 100, column: 18, scope: !429)
!452 = !DILocation(line: 102, column: 17, scope: !453)
!453 = distinct !DILexicalBlock(scope: !429, file: !130, line: 102, column: 6)
!454 = !DILocation(line: 102, column: 42, scope: !453)
!455 = !DILocation(line: 102, column: 23, scope: !453)
!456 = !DILocation(line: 102, column: 6, scope: !429)
!457 = !DILocation(line: 103, column: 3, scope: !458)
!458 = distinct !DILexicalBlock(scope: !453, file: !130, line: 102, column: 84)
!459 = !DILocation(line: 111, column: 11, scope: !429)
!460 = !DILocation(line: 111, column: 2, scope: !429)
!461 = !DILocation(line: 111, column: 6, scope: !429)
!462 = !DILocation(line: 111, column: 9, scope: !429)
!463 = !DILocation(line: 113, column: 7, scope: !437)
!464 = !DILocation(line: 113, column: 24, scope: !437)
!465 = !DILocation(line: 113, column: 34, scope: !437)
