; ModuleID = '../bc_files/timeutil.bc'
source_filename = "/home/sri/zephyrproject/zephyr/lib/os/timeutil.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i32, i32 }
%struct.timeutil_sync_instant = type { i64, i64 }
%struct.timeutil_sync_state = type { ptr, %struct.timeutil_sync_instant, %struct.timeutil_sync_instant, float }
%struct.timeutil_sync_config = type { i32, i32 }

@__aeabi_ERANGE = external constant i32, align 4

; Function Attrs: noinline nounwind optnone
define hidden i64 @timeutil_timegm64(ptr noundef %0) #0 !dbg !21 {
  %2 = alloca ptr, align 4
  %3 = alloca i64, align 8
  %4 = alloca i32, align 4
  %5 = alloca i32, align 4
  %6 = alloca i64, align 8
  %7 = alloca i64, align 8
  store ptr %0, ptr %2, align 4
  call void @llvm.dbg.declare(metadata ptr %2, metadata !66, metadata !DIExpression()), !dbg !67
  call void @llvm.dbg.declare(metadata ptr %3, metadata !68, metadata !DIExpression()), !dbg !69
  %8 = load ptr, ptr %2, align 4, !dbg !70
  %9 = getelementptr inbounds %struct.tm, ptr %8, i32 0, i32 5, !dbg !71
  %10 = load i32, ptr %9, align 4, !dbg !71
  %11 = sext i32 %10 to i64, !dbg !72
  %12 = add nsw i64 1900, %11, !dbg !73
  store i64 %12, ptr %3, align 8, !dbg !69

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "timeutil.c", directory: "/home/sri/zephyrproject/zephyr/build")
!2 = !{!3, !6, !9, !10, !11}
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !4, line: 59, baseType: !5)
!4 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!5 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !7, line: 83, baseType: !8)
!7 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/time.h", directory: "")
!8 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !4, line: 58, baseType: !10)
!12 = !{i32 7, !"Dwarf Version", i32 4}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 1, !"wchar_size", i32 4}
!15 = !{i32 1, !"static_rwdata", i32 1}
!16 = !{i32 1, !"enumsize_buildattr", i32 1}
!17 = !{i32 1, !"armlib_unavailable", i32 0}
!18 = !{i32 8, !"PIC Level", i32 2}
!19 = !{i32 7, !"PIE Level", i32 2}
!20 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!21 = distinct !DISubprogram(name: "timeutil_timegm64", scope: !22, file: !22, line: 45, type: !23, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !65)
!22 = !DIFile(filename: "lib/os/timeutil.c", directory: "/home/sri/zephyrproject/zephyr")
!23 = !DISubroutineType(types: !24)
!24 = !{!3, !25}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !7, line: 90, size: 352, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !27, file: !7, line: 91, baseType: !10, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !27, file: !7, line: 93, baseType: !10, size: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !27, file: !7, line: 94, baseType: !10, size: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !27, file: !7, line: 95, baseType: !10, size: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !27, file: !7, line: 96, baseType: !10, size: 32, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !27, file: !7, line: 97, baseType: !10, size: 32, offset: 160)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !27, file: !7, line: 98, baseType: !10, size: 32, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !27, file: !7, line: 99, baseType: !10, size: 32, offset: 224)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !27, file: !7, line: 100, baseType: !10, size: 32, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, scope: !27, file: !7, line: 101, baseType: !39, size: 64, offset: 288)
!39 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !27, file: !7, line: 101, size: 64, elements: !40)
!40 = !{!41, !46, !52, !59}
!41 = !DIDerivedType(tag: DW_TAG_member, scope: !39, file: !7, line: 102, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !39, file: !7, line: 102, size: 64, elements: !43)
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__extra_1", scope: !42, file: !7, line: 103, baseType: !10, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__extra_2", scope: !42, file: !7, line: 103, baseType: !10, size: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, scope: !39, file: !7, line: 105, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !39, file: !7, line: 105, size: 64, elements: !48)
!48 = !{!49, !51}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__extra_1_long", scope: !47, file: !7, line: 106, baseType: !50, size: 32)
!50 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__extra_2_long", scope: !47, file: !7, line: 106, baseType: !50, size: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, scope: !39, file: !7, line: 108, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !39, file: !7, line: 108, size: 64, elements: !54)
!54 = !{!55, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__extra_1_cptr", scope: !53, file: !7, line: 109, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__extra_2_cptr", scope: !53, file: !7, line: 109, baseType: !56, size: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, scope: !39, file: !7, line: 111, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !39, file: !7, line: 111, size: 64, elements: !61)
!61 = !{!62, !64}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__extra_1_vptr", scope: !60, file: !7, line: 112, baseType: !63, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__extra_2_vptr", scope: !60, file: !7, line: 112, baseType: !63, size: 32, offset: 32)
!65 = !{}
!66 = !DILocalVariable(name: "tm", arg: 1, scope: !21, file: !22, line: 45, type: !25)
!67 = !DILocation(line: 45, column: 44, scope: !21)
!68 = !DILocalVariable(name: "y", scope: !21, file: !22, line: 47, type: !3)
!69 = !DILocation(line: 47, column: 10, scope: !21)
!70 = !DILocation(line: 47, column: 30, scope: !21)
!71 = !DILocation(line: 47, column: 34, scope: !21)
!72 = !DILocation(line: 47, column: 21, scope: !21)
!73 = !DILocation(line: 47, column: 19, scope: !21)
!74 = !DILocalVariable(name: "m", scope: !21, file: !22, line: 48, type: !8)
!75 = !DILocation(line: 48, column: 15, scope: !21)
!76 = !DILocation(line: 48, column: 19, scope: !21)
!77 = !DILocation(line: 48, column: 23, scope: !21)
!78 = !DILocation(line: 48, column: 30, scope: !21)
!79 = !DILocalVariable(name: "d", scope: !21, file: !22, line: 49, type: !8)
!80 = !DILocation(line: 49, column: 15, scope: !21)
!81 = !DILocation(line: 49, column: 19, scope: !21)
!82 = !DILocation(line: 49, column: 23, scope: !21)
!83 = !DILocation(line: 49, column: 31, scope: !21)
!84 = !DILocalVariable(name: "ndays", scope: !21, file: !22, line: 50, type: !3)
!85 = !DILocation(line: 50, column: 10, scope: !21)
!86 = !DILocation(line: 50, column: 39, scope: !21)
!87 = !DILocation(line: 50, column: 42, scope: !21)
!88 = !DILocation(line: 50, column: 45, scope: !21)
!89 = !DILocation(line: 50, column: 18, scope: !21)
!90 = !DILocalVariable(name: "time", scope: !21, file: !22, line: 51, type: !3)
!91 = !DILocation(line: 51, column: 10, scope: !21)
!92 = !DILocation(line: 51, column: 17, scope: !21)
!93 = !DILocation(line: 51, column: 21, scope: !21)
!94 = !DILocation(line: 53, column: 18, scope: !21)
!95 = !DILocation(line: 53, column: 22, scope: !21)
!96 = !DILocation(line: 53, column: 38, scope: !21)
!97 = !DILocation(line: 53, column: 42, scope: !21)
!98 = !DILocation(line: 53, column: 36, scope: !21)
!99 = !DILocation(line: 53, column: 29, scope: !21)
!100 = !DILocation(line: 53, column: 15, scope: !21)
!101 = !DILocation(line: 53, column: 7, scope: !21)
!102 = !DILocation(line: 54, column: 20, scope: !21)
!103 = !DILocation(line: 54, column: 18, scope: !21)
!104 = !DILocation(line: 54, column: 7, scope: !21)
!105 = !DILocation(line: 56, column: 9, scope: !21)
!106 = !DILocation(line: 56, column: 2, scope: !21)
!107 = distinct !DISubprogram(name: "time_days_from_civil", scope: !22, file: !22, line: 31, type: !108, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !65)
!108 = !DISubroutineType(types: !109)
!109 = !{!3, !3, !8, !8}
!110 = !DILocalVariable(name: "y", arg: 1, scope: !107, file: !22, line: 31, type: !3)
!111 = !DILocation(line: 31, column: 45, scope: !107)
!112 = !DILocalVariable(name: "m", arg: 2, scope: !107, file: !22, line: 32, type: !8)
!113 = !DILocation(line: 32, column: 22, scope: !107)
!114 = !DILocalVariable(name: "d", arg: 3, scope: !107, file: !22, line: 33, type: !8)
!115 = !DILocation(line: 33, column: 22, scope: !107)
!116 = !DILocation(line: 35, column: 7, scope: !107)
!117 = !DILocation(line: 35, column: 9, scope: !107)
!118 = !DILocation(line: 35, column: 4, scope: !107)
!119 = !DILocalVariable(name: "era", scope: !107, file: !22, line: 37, type: !3)
!120 = !DILocation(line: 37, column: 10, scope: !107)
!121 = !DILocation(line: 37, column: 17, scope: !107)
!122 = !DILocation(line: 37, column: 19, scope: !107)
!123 = !DILocation(line: 37, column: 26, scope: !107)
!124 = !DILocation(line: 37, column: 30, scope: !107)
!125 = !DILocation(line: 37, column: 32, scope: !107)
!126 = !DILocation(line: 37, column: 39, scope: !107)
!127 = !DILocalVariable(name: "yoe", scope: !107, file: !22, line: 38, type: !8)
!128 = !DILocation(line: 38, column: 15, scope: !107)
!129 = !DILocation(line: 38, column: 21, scope: !107)
!130 = !DILocation(line: 38, column: 25, scope: !107)
!131 = !DILocation(line: 38, column: 29, scope: !107)
!132 = !DILocation(line: 38, column: 23, scope: !107)
!133 = !DILocalVariable(name: "doy", scope: !107, file: !22, line: 39, type: !8)
!134 = !DILocation(line: 39, column: 15, scope: !107)
!135 = !DILocation(line: 39, column: 30, scope: !107)
!136 = !DILocation(line: 39, column: 35, scope: !107)
!137 = !DILocation(line: 39, column: 37, scope: !107)
!138 = !DILocation(line: 39, column: 32, scope: !107)
!139 = !DILocation(line: 39, column: 27, scope: !107)
!140 = !DILocation(line: 39, column: 52, scope: !107)
!141 = !DILocation(line: 39, column: 58, scope: !107)
!142 = !DILocation(line: 39, column: 65, scope: !107)
!143 = !DILocation(line: 39, column: 63, scope: !107)
!144 = !DILocalVariable(name: "doe", scope: !107, file: !22, line: 40, type: !8)
!145 = !DILocation(line: 40, column: 15, scope: !107)
!146 = !DILocation(line: 40, column: 21, scope: !107)
!147 = !DILocation(line: 40, column: 25, scope: !107)
!148 = !DILocation(line: 40, column: 34, scope: !107)
!149 = !DILocation(line: 40, column: 38, scope: !107)
!150 = !DILocation(line: 40, column: 32, scope: !107)
!151 = !DILocation(line: 40, column: 45, scope: !107)
!152 = !DILocation(line: 40, column: 49, scope: !107)
!153 = !DILocation(line: 40, column: 43, scope: !107)
!154 = !DILocation(line: 40, column: 58, scope: !107)
!155 = !DILocation(line: 40, column: 56, scope: !107)
!156 = !DILocation(line: 42, column: 9, scope: !107)
!157 = !DILocation(line: 42, column: 13, scope: !107)
!158 = !DILocation(line: 42, column: 32, scope: !107)
!159 = !DILocation(line: 42, column: 24, scope: !107)
!160 = !DILocation(line: 42, column: 22, scope: !107)
!161 = !DILocation(line: 42, column: 36, scope: !107)
!162 = !DILocation(line: 42, column: 2, scope: !107)
!163 = distinct !DISubprogram(name: "timeutil_timegm", scope: !22, file: !22, line: 59, type: !164, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !65)
!164 = !DISubroutineType(types: !165)
!165 = !{!6, !25}
!166 = !DILocalVariable(name: "tm", arg: 1, scope: !163, file: !22, line: 59, type: !25)
!167 = !DILocation(line: 59, column: 41, scope: !163)
!168 = !DILocalVariable(name: "time", scope: !163, file: !22, line: 61, type: !3)
!169 = !DILocation(line: 61, column: 10, scope: !163)
!170 = !DILocation(line: 61, column: 35, scope: !163)
!171 = !DILocation(line: 61, column: 17, scope: !163)
!172 = !DILocalVariable(name: "rv", scope: !163, file: !22, line: 62, type: !6)
!173 = !DILocation(line: 62, column: 9, scope: !163)
!174 = !DILocation(line: 62, column: 22, scope: !163)
!175 = !DILocation(line: 62, column: 14, scope: !163)
!176 = !DILocation(line: 64, column: 5, scope: !163)
!177 = !DILocation(line: 64, column: 27, scope: !163)
!178 = !DILocation(line: 66, column: 11, scope: !179)
!179 = distinct !DILexicalBlock(scope: !163, file: !22, line: 65, column: 6)
!180 = !DILocation(line: 66, column: 16, scope: !179)
!181 = !DILocation(line: 67, column: 3, scope: !179)
!182 = !DILocation(line: 67, column: 7, scope: !179)
!183 = !DILocation(line: 67, column: 12, scope: !179)
!184 = !DILocation(line: 65, column: 6, scope: !163)
!185 = !DILocation(line: 68, column: 31, scope: !186)
!186 = distinct !DILexicalBlock(scope: !179, file: !22, line: 67, column: 37)
!187 = !DILocation(line: 68, column: 6, scope: !186)
!188 = !DILocation(line: 68, column: 28, scope: !186)
!189 = !DILocation(line: 69, column: 6, scope: !186)
!190 = !DILocation(line: 70, column: 2, scope: !186)
!191 = !DILocation(line: 72, column: 9, scope: !163)
!192 = !DILocation(line: 72, column: 2, scope: !163)
!193 = distinct !DISubprogram(name: "timeutil_sync_state_update", scope: !22, file: !22, line: 75, type: !194, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !65)
!194 = !DISubroutineType(types: !195)
!195 = !{!10, !196, !218}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeutil_sync_state", file: !198, line: 139, size: 384, elements: !199)
!198 = !DIFile(filename: "include/zephyr/sys/timeutil.h", directory: "/home/sri/zephyrproject/zephyr")
!199 = !{!200, !208, !215, !216}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !197, file: !198, line: 141, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeutil_sync_config", file: !198, line: 83, size: 64, elements: !204)
!204 = !{!205, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ref_Hz", scope: !203, file: !198, line: 91, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !4, line: 64, baseType: !8)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "local_Hz", scope: !203, file: !198, line: 104, baseType: !206, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !197, file: !198, line: 144, baseType: !209, size: 128, offset: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeutil_sync_instant", file: !198, line: 114, size: 128, elements: !210)
!210 = !{!211, !214}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !209, file: !198, line: 120, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !4, line: 65, baseType: !213)
!213 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !209, file: !198, line: 126, baseType: !212, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "latest", scope: !197, file: !198, line: 150, baseType: !209, size: 128, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "skew", scope: !197, file: !198, line: 167, baseType: !217, size: 32, offset: 320)
!217 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!220 = !DILocalVariable(name: "tsp", arg: 1, scope: !193, file: !22, line: 75, type: !196)
!221 = !DILocation(line: 75, column: 60, scope: !193)
!222 = !DILocalVariable(name: "inst", arg: 2, scope: !193, file: !22, line: 76, type: !218)
!223 = !DILocation(line: 76, column: 47, scope: !193)
!224 = !DILocalVariable(name: "rv", scope: !193, file: !22, line: 78, type: !10)
!225 = !DILocation(line: 78, column: 6, scope: !193)
!226 = !DILocation(line: 80, column: 8, scope: !227)
!227 = distinct !DILexicalBlock(scope: !193, file: !22, line: 80, column: 6)
!228 = !DILocation(line: 80, column: 13, scope: !227)
!229 = !DILocation(line: 80, column: 18, scope: !227)
!230 = !DILocation(line: 80, column: 22, scope: !227)
!231 = !DILocation(line: 80, column: 28, scope: !227)
!232 = !DILocation(line: 80, column: 32, scope: !227)
!233 = !DILocation(line: 80, column: 38, scope: !227)
!234 = !DILocation(line: 80, column: 42, scope: !227)
!235 = !DILocation(line: 81, column: 6, scope: !227)
!236 = !DILocation(line: 81, column: 11, scope: !227)
!237 = !DILocation(line: 81, column: 17, scope: !227)
!238 = !DILocation(line: 81, column: 23, scope: !227)
!239 = !DILocation(line: 81, column: 28, scope: !227)
!240 = !DILocation(line: 81, column: 33, scope: !227)
!241 = !DILocation(line: 81, column: 21, scope: !227)
!242 = !DILocation(line: 82, column: 3, scope: !227)
!243 = !DILocation(line: 82, column: 7, scope: !227)
!244 = !DILocation(line: 82, column: 13, scope: !227)
!245 = !DILocation(line: 82, column: 21, scope: !227)
!246 = !DILocation(line: 82, column: 26, scope: !227)
!247 = !DILocation(line: 82, column: 31, scope: !227)
!248 = !DILocation(line: 82, column: 19, scope: !227)
!249 = !DILocation(line: 80, column: 6, scope: !193)
!250 = !DILocation(line: 83, column: 7, scope: !251)
!251 = distinct !DILexicalBlock(scope: !252, file: !22, line: 83, column: 7)
!252 = distinct !DILexicalBlock(scope: !227, file: !22, line: 82, column: 40)
!253 = !DILocation(line: 83, column: 12, scope: !251)
!254 = !DILocation(line: 83, column: 17, scope: !251)
!255 = !DILocation(line: 83, column: 21, scope: !251)
!256 = !DILocation(line: 83, column: 7, scope: !252)
!257 = !DILocation(line: 84, column: 4, scope: !258)
!258 = distinct !DILexicalBlock(scope: !251, file: !22, line: 83, column: 27)
!259 = !DILocation(line: 84, column: 9, scope: !258)
!260 = !DILocation(line: 84, column: 17, scope: !258)
!261 = !DILocation(line: 84, column: 16, scope: !258)
!262 = !DILocation(line: 85, column: 4, scope: !258)
!263 = !DILocation(line: 85, column: 9, scope: !258)
!264 = !DILocation(line: 85, column: 48, scope: !258)
!265 = !DILocation(line: 85, column: 18, scope: !258)
!266 = !DILocation(line: 86, column: 4, scope: !258)
!267 = !DILocation(line: 86, column: 9, scope: !258)
!268 = !DILocation(line: 86, column: 14, scope: !258)
!269 = !DILocation(line: 87, column: 7, scope: !258)
!270 = !DILocation(line: 88, column: 3, scope: !258)
!271 = !DILocation(line: 89, column: 4, scope: !272)
!272 = distinct !DILexicalBlock(scope: !251, file: !22, line: 88, column: 10)
!273 = !DILocation(line: 89, column: 9, scope: !272)
!274 = !DILocation(line: 89, column: 19, scope: !272)
!275 = !DILocation(line: 89, column: 18, scope: !272)
!276 = !DILocation(line: 90, column: 7, scope: !272)
!277 = !DILocation(line: 92, column: 2, scope: !252)
!278 = !DILocation(line: 94, column: 9, scope: !193)
!279 = !DILocation(line: 94, column: 2, scope: !193)
!280 = distinct !DISubprogram(name: "timeutil_sync_state_set_skew", scope: !22, file: !22, line: 97, type: !281, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !65)
!281 = !DISubroutineType(types: !282)
