; ModuleID = '../bc_files/timer.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/timer.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_spinlock = type {}
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }
%struct.z_spinlock_key = type { i32 }

@lock = internal global %struct.k_spinlock zeroinitializer, align 1, !dbg !0

; Function Attrs: inlinehint nounwind optsize

!26 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 17)
!27 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 18)
!28 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 19)
!29 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 20)
!30 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 21)
!31 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 22)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 25)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 26)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 27)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 28)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 29)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 30)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 31)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 32)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 33)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 34)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 35)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 36)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 37)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 38)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 39)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 40)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 41)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 42)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 43)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 44)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 45)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 46)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 47)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!87 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!88 = !{!89, !146, !140, !145, !148, !149, !231}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !91, line: 1439, size: 448, elements: !92)
!91 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!92 = !{!93, !123, !129, !133, !134, !141, !144}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !90, file: !91, line: 1445, baseType: !94, size: 192)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !95, line: 254, size: 192, elements: !96)
!95 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!96 = !{!97, !113, !119}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !94, file: !95, line: 255, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !99, line: 55, baseType: !100)
!99 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !99, line: 37, size: 64, elements: !101)
!101 = !{!102, !108}
!102 = !DIDerivedType(tag: DW_TAG_member, scope: !100, file: !99, line: 38, baseType: !103, size: 32)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !99, line: 38, size: 32, elements: !104)
!104 = !{!105, !107}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !103, file: !99, line: 39, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !103, file: !99, line: 40, baseType: !106, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, scope: !100, file: !99, line: 42, baseType: !109, size: 32, offset: 32)
!109 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !99, line: 42, size: 32, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !109, file: !99, line: 43, baseType: !106, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !109, file: !99, line: 44, baseType: !106, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !94, file: !95, line: 256, baseType: !114, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !95, line: 252, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !94, file: !95, line: 259, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !121, line: 59, baseType: !122)
!121 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!122 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !90, file: !91, line: 1448, baseType: !124, size: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !95, line: 243, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 241, size: 64, elements: !126)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !125, file: !95, line: 242, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !99, line: 51, baseType: !100)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !90, file: !91, line: 1451, baseType: !130, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !89}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !90, file: !91, line: 1454, baseType: !130, size: 32, offset: 288)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !90, file: !91, line: 1457, baseType: !135, size: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !136, line: 67, baseType: !137)
!136 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 65, size: 64, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !137, file: !136, line: 66, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !136, line: 46, baseType: !120)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !90, file: !91, line: 1460, baseType: !142, size: 32, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !121, line: 64, baseType: !143)
!143 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !90, file: !91, line: 1463, baseType: !145, size: 32, offset: 416)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!148 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !151, line: 250, size: 896, elements: !152)
!151 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!152 = !{!153, !190, !203, !204, !205, !206, !226}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !150, file: !151, line: 252, baseType: !154, size: 384)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !151, line: 58, size: 384, elements: !155)
!155 = !{!156, !169, !171, !173, !174, !187, !188, !189}
!156 = !DIDerivedType(tag: DW_TAG_member, scope: !154, file: !151, line: 61, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !154, file: !151, line: 61, size: 64, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !157, file: !151, line: 62, baseType: !98, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !157, file: !151, line: 63, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !162, line: 58, size: 64, elements: !163)
!162 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!163 = !{!164}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !161, file: !162, line: 60, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 64, elements: !167)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!167 = !{!168}
!168 = !DISubrange(count: 2)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !154, file: !151, line: 69, baseType: !170, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !154, file: !151, line: 72, baseType: !172, size: 8, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !121, line: 62, baseType: !7)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !154, file: !151, line: 75, baseType: !172, size: 8, offset: 104)
!174 = !DIDerivedType(tag: DW_TAG_member, scope: !154, file: !151, line: 91, baseType: !175, size: 16, offset: 112)
!175 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !154, file: !151, line: 91, size: 16, elements: !176)
!176 = !{!177, !184}
!177 = !DIDerivedType(tag: DW_TAG_member, scope: !175, file: !151, line: 92, baseType: !178, size: 16)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !175, file: !151, line: 92, size: 16, elements: !179)
!179 = !{!180, !183}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !178, file: !151, line: 97, baseType: !181, size: 8)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !121, line: 56, baseType: !182)
!182 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !178, file: !151, line: 98, baseType: !172, size: 8, offset: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !175, file: !151, line: 101, baseType: !185, size: 16)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !121, line: 63, baseType: !186)
!186 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !154, file: !151, line: 108, baseType: !142, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !154, file: !151, line: 132, baseType: !145, size: 32, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !154, file: !151, line: 136, baseType: !94, size: 192, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !150, file: !151, line: 255, baseType: !191, size: 288, offset: 384)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !192, line: 25, size: 288, elements: !193)
!192 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !191, file: !192, line: 26, baseType: !142, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !191, file: !192, line: 27, baseType: !142, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !191, file: !192, line: 28, baseType: !142, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !191, file: !192, line: 29, baseType: !142, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !191, file: !192, line: 30, baseType: !142, size: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !191, file: !192, line: 31, baseType: !142, size: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !191, file: !192, line: 32, baseType: !142, size: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !191, file: !192, line: 33, baseType: !142, size: 32, offset: 224)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !191, file: !192, line: 34, baseType: !142, size: 32, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !150, file: !151, line: 258, baseType: !145, size: 32, offset: 672)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !150, file: !151, line: 261, baseType: !124, size: 64, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !150, file: !151, line: 302, baseType: !148, size: 32, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !150, file: !151, line: 333, baseType: !207, size: 32, offset: 800)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !91, line: 5291, size: 160, elements: !209)
!209 = !{!210, !221, !222}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !208, file: !91, line: 5292, baseType: !211, size: 96)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !212, line: 56, size: 96, elements: !213)
!212 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!213 = !{!214, !217, !218}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !211, file: !212, line: 57, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !212, line: 57, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !211, file: !212, line: 58, baseType: !145, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !211, file: !212, line: 59, baseType: !219, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 46, baseType: !143)
!220 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!221 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !208, file: !91, line: 5293, baseType: !124, size: 64, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !208, file: !91, line: 5294, baseType: !223, offset: 160)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !224, line: 45, elements: !225)
!224 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!225 = !{}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !150, file: !151, line: 355, baseType: !227, size: 64, offset: 832)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !192, line: 60, size: 64, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !227, file: !192, line: 63, baseType: !142, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !227, file: !192, line: 66, baseType: !142, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!232 = !{!0}
!233 = !DIFile(filename: "kernel/timer.c", directory: "/home/sri/zephyrproject/zephyr")
!234 = !{i32 7, !"Dwarf Version", i32 4}
!235 = !{i32 2, !"Debug Info Version", i32 3}
!236 = !{i32 1, !"wchar_size", i32 4}
!237 = !{i32 1, !"static_rwdata", i32 1}
!238 = !{i32 1, !"enumsize_buildattr", i32 1}
!239 = !{i32 1, !"armlib_unavailable", i32 0}
!240 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!241 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !6, file: !6, line: 223, type: !242, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !246)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !244, !149}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!246 = !{!247, !248}
!247 = !DILocalVariable(name: "object", arg: 1, scope: !241, file: !6, line: 223, type: !244)
!248 = !DILocalVariable(name: "thread", arg: 2, scope: !241, file: !6, line: 224, type: !149)
!249 = !DILocation(line: 223, column: 61, scope: !241)
!250 = !DILocation(line: 224, column: 24, scope: !241)
!251 = !DILocation(line: 226, column: 9, scope: !241)
!252 = !DILocation(line: 227, column: 9, scope: !241)
!253 = !DILocation(line: 228, column: 1, scope: !241)
!254 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !6, file: !6, line: 243, type: !255, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !257)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !244}
!257 = !{!258}
!258 = !DILocalVariable(name: "object", arg: 1, scope: !254, file: !6, line: 243, type: !244)
!259 = !DILocation(line: 243, column: 56, scope: !254)
!260 = !DILocation(line: 245, column: 9, scope: !254)
!261 = !DILocation(line: 246, column: 1, scope: !254)
!262 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !6, file: !6, line: 359, type: !263, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !265)
!263 = !DISubroutineType(types: !264)
!264 = !{!145, !5}
!265 = !{!266}
!266 = !DILocalVariable(name: "otype", arg: 1, scope: !262, file: !6, line: 359, type: !5)
!267 = !DILocation(line: 359, column: 58, scope: !262)
!268 = !DILocation(line: 361, column: 9, scope: !262)
!269 = !DILocation(line: 363, column: 2, scope: !262)
!270 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !6, file: !6, line: 366, type: !271, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !273)
!271 = !DISubroutineType(types: !272)
!272 = !{!145, !5, !219}
!273 = !{!274, !275}
!274 = !DILocalVariable(name: "otype", arg: 1, scope: !270, file: !6, line: 366, type: !5)
!275 = !DILocalVariable(name: "size", arg: 2, scope: !270, file: !6, line: 367, type: !219)
!276 = !DILocation(line: 366, column: 63, scope: !270)
!277 = !DILocation(line: 367, column: 13, scope: !270)
!278 = !DILocation(line: 369, column: 9, scope: !270)
!279 = !DILocation(line: 370, column: 9, scope: !270)
!280 = !DILocation(line: 372, column: 2, scope: !270)
!281 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !91, file: !91, line: 656, type: !282, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !286)
!282 = !DISubroutineType(types: !283)
!283 = !{!140, !284}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!286 = !{!287}
!287 = !DILocalVariable(name: "t", arg: 1, scope: !281, file: !91, line: 657, type: !284)
!288 = !DILocation(line: 657, column: 30, scope: !281)
!289 = !DILocation(line: 659, column: 28, scope: !281)
!290 = !DILocation(line: 659, column: 31, scope: !281)
!291 = !DILocation(line: 659, column: 36, scope: !281)
!292 = !DILocation(line: 659, column: 9, scope: !281)
!293 = !DILocation(line: 659, column: 2, scope: !281)
!294 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !91, file: !91, line: 671, type: !282, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !295)
!295 = !{!296}
!296 = !DILocalVariable(name: "t", arg: 1, scope: !294, file: !91, line: 672, type: !284)
!297 = !DILocation(line: 672, column: 30, scope: !294)
!298 = !DILocation(line: 674, column: 30, scope: !294)
!299 = !DILocation(line: 674, column: 33, scope: !294)
!300 = !DILocation(line: 674, column: 38, scope: !294)
!301 = !DILocation(line: 674, column: 9, scope: !294)
!302 = !DILocation(line: 674, column: 2, scope: !294)
!303 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !91, file: !91, line: 1634, type: !304, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !308)
!304 = !DISubroutineType(types: !305)
!305 = !{!140, !306}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!308 = !{!309}
!309 = !DILocalVariable(name: "timer", arg: 1, scope: !303, file: !91, line: 1635, type: !306)
!310 = !DILocation(line: 1635, column: 34, scope: !303)
!311 = !DILocation(line: 1637, column: 28, scope: !303)
!312 = !DILocation(line: 1637, column: 35, scope: !303)
!313 = !DILocation(line: 1637, column: 9, scope: !303)
!314 = !DILocation(line: 1637, column: 2, scope: !303)
!315 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !91, file: !91, line: 1649, type: !304, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !316)
!316 = !{!317}
!317 = !DILocalVariable(name: "timer", arg: 1, scope: !315, file: !91, line: 1650, type: !306)
!318 = !DILocation(line: 1650, column: 34, scope: !315)
!319 = !DILocation(line: 1652, column: 30, scope: !315)
!320 = !DILocation(line: 1652, column: 37, scope: !315)
!321 = !DILocation(line: 1652, column: 9, scope: !315)
!322 = !DILocation(line: 1652, column: 2, scope: !315)
!323 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !91, file: !91, line: 1689, type: !324, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !326)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !89, !145}
!326 = !{!327, !328}
!327 = !DILocalVariable(name: "timer", arg: 1, scope: !323, file: !91, line: 1689, type: !89)
!328 = !DILocalVariable(name: "user_data", arg: 2, scope: !323, file: !91, line: 1690, type: !145)
!329 = !DILocation(line: 1689, column: 65, scope: !323)
!330 = !DILocation(line: 1690, column: 19, scope: !323)
!331 = !DILocation(line: 1692, column: 21, scope: !323)
!332 = !DILocation(line: 1692, column: 2, scope: !323)
!333 = !DILocation(line: 1692, column: 9, scope: !323)
!334 = !DILocation(line: 1692, column: 19, scope: !323)
!335 = !DILocation(line: 1693, column: 1, scope: !323)
!336 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !91, file: !91, line: 1704, type: !337, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !339)
!337 = !DISubroutineType(types: !338)
!338 = !{!145, !306}
!339 = !{!340}
!340 = !DILocalVariable(name: "timer", arg: 1, scope: !336, file: !91, line: 1704, type: !306)
!341 = !DILocation(line: 1704, column: 72, scope: !336)
!342 = !DILocation(line: 1706, column: 9, scope: !336)
!343 = !DILocation(line: 1706, column: 16, scope: !336)
!344 = !DILocation(line: 1706, column: 2, scope: !336)
!345 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !91, file: !91, line: 2071, type: !346, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !366)
!346 = !DISubroutineType(types: !347)
!347 = !{!148, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !91, line: 1830, size: 128, elements: !350)
!350 = !{!351, !364, !365}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !349, file: !91, line: 1831, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !353, line: 60, baseType: !354)
!353 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !353, line: 53, size: 64, elements: !355)
!355 = !{!356, !363}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !354, file: !353, line: 54, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !353, line: 50, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !353, line: 44, size: 32, elements: !360)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !359, file: !353, line: 45, baseType: !362, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !353, line: 40, baseType: !142)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !354, file: !353, line: 55, baseType: !357, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !349, file: !91, line: 1832, baseType: !223, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !349, file: !91, line: 1833, baseType: !124, size: 64, offset: 64)
!366 = !{!367}
!367 = !DILocalVariable(name: "queue", arg: 1, scope: !345, file: !91, line: 2071, type: !348)
!368 = !DILocation(line: 2071, column: 59, scope: !345)
!369 = !DILocation(line: 2073, column: 35, scope: !345)
!370 = !DILocation(line: 2073, column: 42, scope: !345)
!371 = !DILocation(line: 2073, column: 14, scope: !345)
!372 = !DILocation(line: 2073, column: 9, scope: !345)
!373 = !DILocation(line: 2073, column: 2, scope: !345)
!374 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !91, file: !91, line: 3209, type: !375, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !383)
!375 = !DISubroutineType(types: !376)
!376 = !{!143, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !91, line: 3092, size: 128, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !378, file: !91, line: 3093, baseType: !124, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !378, file: !91, line: 3094, baseType: !143, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !378, file: !91, line: 3095, baseType: !143, size: 32, offset: 96)
!383 = !{!384}
!384 = !DILocalVariable(name: "sem", arg: 1, scope: !374, file: !91, line: 3209, type: !377)
!385 = !DILocation(line: 3209, column: 65, scope: !374)
!386 = !DILocation(line: 3211, column: 9, scope: !374)
!387 = !DILocation(line: 3211, column: 14, scope: !374)
!388 = !DILocation(line: 3211, column: 2, scope: !374)
!389 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !91, file: !91, line: 4649, type: !390, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !405)
!390 = !DISubroutineType(types: !391)
!391 = !{!142, !392}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !91, line: 4390, size: 320, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !393, file: !91, line: 4392, baseType: !124, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !393, file: !91, line: 4394, baseType: !223, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !393, file: !91, line: 4396, baseType: !219, size: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !393, file: !91, line: 4398, baseType: !142, size: 32, offset: 96)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !393, file: !91, line: 4400, baseType: !146, size: 32, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !393, file: !91, line: 4402, baseType: !146, size: 32, offset: 160)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !393, file: !91, line: 4404, baseType: !146, size: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !393, file: !91, line: 4406, baseType: !146, size: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !393, file: !91, line: 4408, baseType: !142, size: 32, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !393, file: !91, line: 4413, baseType: !172, size: 8, offset: 288)
!405 = !{!406}
!406 = !DILocalVariable(name: "msgq", arg: 1, scope: !389, file: !91, line: 4649, type: !392)
!407 = !DILocation(line: 4649, column: 66, scope: !389)
!408 = !DILocation(line: 4651, column: 9, scope: !389)
!409 = !DILocation(line: 4651, column: 15, scope: !389)
!410 = !DILocation(line: 4651, column: 26, scope: !389)
!411 = !DILocation(line: 4651, column: 32, scope: !389)
!412 = !DILocation(line: 4651, column: 24, scope: !389)
!413 = !DILocation(line: 4651, column: 2, scope: !389)
!414 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !91, file: !91, line: 4665, type: !390, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !415)
!415 = !{!416}
!416 = !DILocalVariable(name: "msgq", arg: 1, scope: !414, file: !91, line: 4665, type: !392)
!417 = !DILocation(line: 4665, column: 66, scope: !414)
!418 = !DILocation(line: 4667, column: 9, scope: !414)
!419 = !DILocation(line: 4667, column: 15, scope: !414)
!420 = !DILocation(line: 4667, column: 2, scope: !414)
!421 = distinct !DISubprogram(name: "z_timer_expiration_handler", scope: !233, file: !233, line: 27, type: !116, scopeLine: 28, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !422)
!422 = !{!423, !424, !425, !426, !431}
!423 = !DILocalVariable(name: "t", arg: 1, scope: !421, file: !233, line: 27, type: !118)
!424 = !DILocalVariable(name: "timer", scope: !421, file: !233, line: 29, type: !89)
!425 = !DILocalVariable(name: "thread", scope: !421, file: !233, line: 30, type: !149)
!426 = !DILocalVariable(name: "key", scope: !421, file: !233, line: 31, type: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !224, line: 108, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !224, line: 34, size: 32, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !428, file: !224, line: 35, baseType: !148, size: 32)
!431 = !DILocalVariable(name: "next", scope: !432, file: !233, line: 57, type: !135)
!432 = distinct !DILexicalBlock(scope: !433, file: !233, line: 56, column: 91)
!433 = distinct !DILexicalBlock(scope: !421, file: !233, line: 55, column: 6)
!434 = !DILocation(line: 27, column: 50, scope: !421)
!435 = !DILocation(line: 29, column: 2, scope: !421)
!436 = !DILocation(line: 29, column: 18, scope: !421)
!437 = !DILocation(line: 29, column: 61, scope: !438)
!438 = distinct !DILexicalBlock(scope: !421, file: !233, line: 29, column: 27)
!439 = !DILocation(line: 29, column: 65, scope: !438)
!440 = !DILocation(line: 29, column: 27, scope: !421)
!441 = !DILocation(line: 29, column: 114, scope: !438)
!442 = !DILocation(line: 30, column: 2, scope: !421)
!443 = !DILocation(line: 30, column: 19, scope: !421)
!444 = !DILocation(line: 31, column: 2, scope: !421)
!445 = !DILocation(line: 31, column: 19, scope: !421)
!446 = !DILocalVariable(name: "l", arg: 1, scope: !447, file: !224, line: 160, type: !450)
!447 = distinct !DISubprogram(name: "k_spin_lock", scope: !224, file: !224, line: 160, type: !448, scopeLine: 161, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !451)
!448 = !DISubroutineType(types: !449)
!449 = !{!427, !450}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!451 = !{!446, !452}
!452 = !DILocalVariable(name: "k", scope: !447, file: !224, line: 163, type: !427)
!453 = !DILocation(line: 160, column: 94, scope: !447, inlinedAt: !454)
!454 = distinct !DILocation(line: 31, column: 25, scope: !421)
!455 = !DILocation(line: 162, column: 9, scope: !447, inlinedAt: !454)
