; ModuleID = '../bc_files/timeout.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/timeout.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_spinlock = type {}
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }
%struct.z_spinlock_key = type { i32 }
%struct.k_timepoint_t = type { i64 }

@timeout_lock = internal global %struct.k_spinlock zeroinitializer, align 1, !dbg !0

!35 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 26)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 27)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 28)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 29)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 30)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 31)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 32)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 33)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 34)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 35)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 36)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 37)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 38)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 39)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 40)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 41)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 42)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 43)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 44)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 45)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 46)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 47)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!87 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!88 = !{!89, !94, !96, !98, !95, !99, !125, !91}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !90, line: 46, baseType: !91)
!90 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !92, line: 59, baseType: !93)
!92 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!93 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !92, line: 58, baseType: !95)
!95 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !92, line: 64, baseType: !97)
!97 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !101, line: 254, size: 192, elements: !102)
!101 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!102 = !{!103, !119, !124}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !100, file: !101, line: 255, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !105, line: 55, baseType: !106)
!105 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !105, line: 37, size: 64, elements: !107)
!107 = !{!108, !114}
!108 = !DIDerivedType(tag: DW_TAG_member, scope: !106, file: !105, line: 38, baseType: !109, size: 32)
!109 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !106, file: !105, line: 38, size: 32, elements: !110)
!110 = !{!111, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !109, file: !105, line: 39, baseType: !112, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !109, file: !105, line: 40, baseType: !112, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, scope: !106, file: !105, line: 42, baseType: !115, size: 32, offset: 32)
!115 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !106, file: !105, line: 42, size: 32, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !115, file: !105, line: 43, baseType: !112, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !115, file: !105, line: 44, baseType: !112, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !100, file: !101, line: 256, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !101, line: 252, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !99}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !100, file: !101, line: 259, baseType: !91, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!127 = !{!128, !0, !133, !135}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "curr_tick", scope: !2, file: !130, line: 15, type: !131, isLocal: true, isDefinition: true)
!130 = !DIFile(filename: "kernel/timeout.c", directory: "/home/sri/zephyrproject/zephyr")
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !92, line: 65, baseType: !132)
!132 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "announce_remaining", scope: !2, file: !130, line: 25, type: !95, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "timeout_list", scope: !2, file: !130, line: 17, type: !137, isLocal: true, isDefinition: true)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !105, line: 51, baseType: !106)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !139, line: 45, elements: !140)
!139 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!140 = !{}
!141 = !{i32 7, !"Dwarf Version", i32 4}
!142 = !{i32 2, !"Debug Info Version", i32 3}
!143 = !{i32 1, !"wchar_size", i32 4}
!144 = !{i32 1, !"static_rwdata", i32 1}
!145 = !{i32 1, !"enumsize_buildattr", i32 1}
!146 = !{i32 1, !"armlib_unavailable", i32 0}
!147 = !{i32 8, !"PIC Level", i32 2}
!148 = !{i32 7, !"PIE Level", i32 2}
!149 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!150 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !6, file: !6, line: 223, type: !151, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !153, !155}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !157, line: 250, size: 896, elements: !158)
!157 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!158 = !{!159, !200, !213, !214, !215, !216, !234}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !156, file: !157, line: 252, baseType: !160, size: 384)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !157, line: 58, size: 384, elements: !161)
!161 = !{!162, !175, !181, !183, !184, !197, !198, !199}
!162 = !DIDerivedType(tag: DW_TAG_member, scope: !160, file: !157, line: 61, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !160, file: !157, line: 61, size: 64, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !163, file: !157, line: 62, baseType: !104, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !163, file: !157, line: 63, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 58, size: 64, elements: !169)
!168 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !167, file: !168, line: 60, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !160, file: !157, line: 69, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !101, line: 243, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 241, size: 64, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !178, file: !101, line: 242, baseType: !137, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !160, file: !157, line: 72, baseType: !182, size: 8, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !92, line: 62, baseType: !7)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !160, file: !157, line: 75, baseType: !182, size: 8, offset: 104)
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !160, file: !157, line: 91, baseType: !185, size: 16, offset: 112)
!185 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !160, file: !157, line: 91, size: 16, elements: !186)
!186 = !{!187, !194}
!187 = !DIDerivedType(tag: DW_TAG_member, scope: !185, file: !157, line: 92, baseType: !188, size: 16)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !185, file: !157, line: 92, size: 16, elements: !189)
!189 = !{!190, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !188, file: !157, line: 97, baseType: !191, size: 8)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !92, line: 56, baseType: !192)
!192 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !188, file: !157, line: 98, baseType: !182, size: 8, offset: 8)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !185, file: !157, line: 101, baseType: !195, size: 16)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !92, line: 63, baseType: !196)
!196 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !160, file: !157, line: 108, baseType: !96, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !160, file: !157, line: 132, baseType: !98, size: 32, offset: 160)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !160, file: !157, line: 136, baseType: !100, size: 192, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !156, file: !157, line: 255, baseType: !201, size: 288, offset: 384)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !202, line: 25, size: 288, elements: !203)
!202 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !201, file: !202, line: 26, baseType: !96, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !201, file: !202, line: 27, baseType: !96, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !201, file: !202, line: 28, baseType: !96, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !201, file: !202, line: 29, baseType: !96, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !201, file: !202, line: 30, baseType: !96, size: 32, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !201, file: !202, line: 31, baseType: !96, size: 32, offset: 160)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !201, file: !202, line: 32, baseType: !96, size: 32, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !201, file: !202, line: 33, baseType: !96, size: 32, offset: 224)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !201, file: !202, line: 34, baseType: !96, size: 32, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !156, file: !157, line: 258, baseType: !98, size: 32, offset: 672)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !156, file: !157, line: 261, baseType: !177, size: 64, offset: 704)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !156, file: !157, line: 302, baseType: !95, size: 32, offset: 768)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !156, file: !157, line: 333, baseType: !217, size: 32, offset: 800)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !219, line: 5291, size: 160, elements: !220)
!219 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!220 = !{!221, !232, !233}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !218, file: !219, line: 5292, baseType: !222, size: 96)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !223, line: 56, size: 96, elements: !224)
!223 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!224 = !{!225, !228, !229}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !222, file: !223, line: 57, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !223, line: 57, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !222, file: !223, line: 58, baseType: !98, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !222, file: !223, line: 59, baseType: !230, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !231, line: 46, baseType: !97)
!231 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!232 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !218, file: !219, line: 5293, baseType: !177, size: 64, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !218, file: !219, line: 5294, baseType: !138, offset: 160)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !156, file: !157, line: 355, baseType: !235, size: 64, offset: 832)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !202, line: 60, size: 64, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !235, file: !202, line: 63, baseType: !96, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !235, file: !202, line: 66, baseType: !96, size: 32, offset: 32)
!239 = !DILocalVariable(name: "object", arg: 1, scope: !150, file: !6, line: 223, type: !153)
!240 = !DILocation(line: 223, column: 61, scope: !150)
!241 = !DILocalVariable(name: "thread", arg: 2, scope: !150, file: !6, line: 224, type: !155)
!242 = !DILocation(line: 224, column: 24, scope: !150)
!243 = !DILocation(line: 226, column: 9, scope: !150)
!244 = !DILocation(line: 227, column: 9, scope: !150)
!245 = !DILocation(line: 228, column: 1, scope: !150)
!246 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !6, file: !6, line: 243, type: !247, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !153}
!249 = !DILocalVariable(name: "object", arg: 1, scope: !246, file: !6, line: 243, type: !153)
!250 = !DILocation(line: 243, column: 56, scope: !246)
!251 = !DILocation(line: 245, column: 9, scope: !246)
!252 = !DILocation(line: 246, column: 1, scope: !246)
!253 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !6, file: !6, line: 359, type: !254, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!254 = !DISubroutineType(types: !255)
!255 = !{!98, !5}
!256 = !DILocalVariable(name: "otype", arg: 1, scope: !253, file: !6, line: 359, type: !5)
!257 = !DILocation(line: 359, column: 58, scope: !253)
!258 = !DILocation(line: 361, column: 9, scope: !253)
!259 = !DILocation(line: 363, column: 2, scope: !253)
!260 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !6, file: !6, line: 366, type: !261, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!261 = !DISubroutineType(types: !262)
!262 = !{!98, !5, !230}
!263 = !DILocalVariable(name: "otype", arg: 1, scope: !260, file: !6, line: 366, type: !5)
!264 = !DILocation(line: 366, column: 63, scope: !260)
!265 = !DILocalVariable(name: "size", arg: 2, scope: !260, file: !6, line: 367, type: !230)
!266 = !DILocation(line: 367, column: 13, scope: !260)
!267 = !DILocation(line: 369, column: 9, scope: !260)
!268 = !DILocation(line: 370, column: 9, scope: !260)
!269 = !DILocation(line: 372, column: 2, scope: !260)
!270 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !219, file: !219, line: 656, type: !271, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!271 = !DISubroutineType(types: !272)
!272 = !{!89, !273}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!275 = !DILocalVariable(name: "t", arg: 1, scope: !270, file: !219, line: 657, type: !273)
!276 = !DILocation(line: 657, column: 30, scope: !270)
!277 = !DILocation(line: 659, column: 28, scope: !270)
!278 = !DILocation(line: 659, column: 31, scope: !270)
!279 = !DILocation(line: 659, column: 36, scope: !270)
!280 = !DILocation(line: 659, column: 9, scope: !270)
!281 = !DILocation(line: 659, column: 2, scope: !270)
!282 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !219, file: !219, line: 671, type: !271, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!283 = !DILocalVariable(name: "t", arg: 1, scope: !282, file: !219, line: 672, type: !273)
!284 = !DILocation(line: 672, column: 30, scope: !282)
!285 = !DILocation(line: 674, column: 30, scope: !282)
!286 = !DILocation(line: 674, column: 33, scope: !282)
!287 = !DILocation(line: 674, column: 38, scope: !282)
!288 = !DILocation(line: 674, column: 9, scope: !282)
!289 = !DILocation(line: 674, column: 2, scope: !282)
!290 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !219, file: !219, line: 1634, type: !291, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!291 = !DISubroutineType(types: !292)
!292 = !{!89, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !219, line: 1439, size: 448, elements: !296)
!296 = !{!297, !298, !299, !304, !305, !310, !311}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !295, file: !219, line: 1445, baseType: !100, size: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !295, file: !219, line: 1448, baseType: !177, size: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !295, file: !219, line: 1451, baseType: !300, size: 32, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !303}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !295, file: !219, line: 1454, baseType: !300, size: 32, offset: 288)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !295, file: !219, line: 1457, baseType: !306, size: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !90, line: 67, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 65, size: 64, elements: !308)
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !307, file: !90, line: 66, baseType: !89, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !295, file: !219, line: 1460, baseType: !96, size: 32, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !295, file: !219, line: 1463, baseType: !98, size: 32, offset: 416)
!312 = !DILocalVariable(name: "timer", arg: 1, scope: !290, file: !219, line: 1635, type: !293)
!313 = !DILocation(line: 1635, column: 34, scope: !290)
!314 = !DILocation(line: 1637, column: 28, scope: !290)
!315 = !DILocation(line: 1637, column: 35, scope: !290)
!316 = !DILocation(line: 1637, column: 9, scope: !290)
!317 = !DILocation(line: 1637, column: 2, scope: !290)
!318 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !219, file: !219, line: 1649, type: !291, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!319 = !DILocalVariable(name: "timer", arg: 1, scope: !318, file: !219, line: 1650, type: !293)
!320 = !DILocation(line: 1650, column: 34, scope: !318)
!321 = !DILocation(line: 1652, column: 30, scope: !318)
!322 = !DILocation(line: 1652, column: 37, scope: !318)
!323 = !DILocation(line: 1652, column: 9, scope: !318)
!324 = !DILocation(line: 1652, column: 2, scope: !318)
!325 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !219, file: !219, line: 1689, type: !326, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !303, !98}
!328 = !DILocalVariable(name: "timer", arg: 1, scope: !325, file: !219, line: 1689, type: !303)
!329 = !DILocation(line: 1689, column: 65, scope: !325)
!330 = !DILocalVariable(name: "user_data", arg: 2, scope: !325, file: !219, line: 1690, type: !98)
!331 = !DILocation(line: 1690, column: 19, scope: !325)
!332 = !DILocation(line: 1692, column: 21, scope: !325)
!333 = !DILocation(line: 1692, column: 2, scope: !325)
!334 = !DILocation(line: 1692, column: 9, scope: !325)
!335 = !DILocation(line: 1692, column: 19, scope: !325)
!336 = !DILocation(line: 1693, column: 1, scope: !325)
!337 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !219, file: !219, line: 1704, type: !338, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!338 = !DISubroutineType(types: !339)
!339 = !{!98, !293}
!340 = !DILocalVariable(name: "timer", arg: 1, scope: !337, file: !219, line: 1704, type: !293)
!341 = !DILocation(line: 1704, column: 72, scope: !337)
!342 = !DILocation(line: 1706, column: 9, scope: !337)
!343 = !DILocation(line: 1706, column: 16, scope: !337)
!344 = !DILocation(line: 1706, column: 2, scope: !337)
!345 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !219, file: !219, line: 2071, type: !346, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!346 = !DISubroutineType(types: !347)
!347 = !{!95, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !219, line: 1830, size: 128, elements: !350)
!350 = !{!351, !364, !365}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !349, file: !219, line: 1831, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !353, line: 60, baseType: !354)
!353 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !353, line: 53, size: 64, elements: !355)
!355 = !{!356, !363}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !354, file: !353, line: 54, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !353, line: 50, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !353, line: 44, size: 32, elements: !360)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !359, file: !353, line: 45, baseType: !362, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !353, line: 40, baseType: !96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !354, file: !353, line: 55, baseType: !357, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !349, file: !219, line: 1832, baseType: !138, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !349, file: !219, line: 1833, baseType: !177, size: 64, offset: 64)
!366 = !DILocalVariable(name: "queue", arg: 1, scope: !345, file: !219, line: 2071, type: !348)
!367 = !DILocation(line: 2071, column: 59, scope: !345)
!368 = !DILocation(line: 2073, column: 35, scope: !345)
!369 = !DILocation(line: 2073, column: 42, scope: !345)
!370 = !DILocation(line: 2073, column: 14, scope: !345)
!371 = !DILocation(line: 2073, column: 9, scope: !345)
!372 = !DILocation(line: 2073, column: 2, scope: !345)
!373 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !219, file: !219, line: 3209, type: !374, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!374 = !DISubroutineType(types: !375)
!375 = !{!97, !376}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !219, line: 3092, size: 128, elements: !378)
!378 = !{!379, !380, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !377, file: !219, line: 3093, baseType: !177, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !377, file: !219, line: 3094, baseType: !97, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !377, file: !219, line: 3095, baseType: !97, size: 32, offset: 96)
!382 = !DILocalVariable(name: "sem", arg: 1, scope: !373, file: !219, line: 3209, type: !376)
!383 = !DILocation(line: 3209, column: 65, scope: !373)
!384 = !DILocation(line: 3211, column: 9, scope: !373)
!385 = !DILocation(line: 3211, column: 14, scope: !373)
!386 = !DILocation(line: 3211, column: 2, scope: !373)
!387 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !219, file: !219, line: 4649, type: !388, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!388 = !DISubroutineType(types: !389)
!389 = !{!96, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !219, line: 4390, size: 320, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !391, file: !219, line: 4392, baseType: !177, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !391, file: !219, line: 4394, baseType: !138, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !391, file: !219, line: 4396, baseType: !230, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !391, file: !219, line: 4398, baseType: !96, size: 32, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !391, file: !219, line: 4400, baseType: !125, size: 32, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !391, file: !219, line: 4402, baseType: !125, size: 32, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !391, file: !219, line: 4404, baseType: !125, size: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !391, file: !219, line: 4406, baseType: !125, size: 32, offset: 224)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !391, file: !219, line: 4408, baseType: !96, size: 32, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !391, file: !219, line: 4413, baseType: !182, size: 8, offset: 288)
!403 = !DILocalVariable(name: "msgq", arg: 1, scope: !387, file: !219, line: 4649, type: !390)
!404 = !DILocation(line: 4649, column: 66, scope: !387)
!405 = !DILocation(line: 4651, column: 9, scope: !387)
!406 = !DILocation(line: 4651, column: 15, scope: !387)
!407 = !DILocation(line: 4651, column: 26, scope: !387)
!408 = !DILocation(line: 4651, column: 32, scope: !387)
!409 = !DILocation(line: 4651, column: 24, scope: !387)
!410 = !DILocation(line: 4651, column: 2, scope: !387)
!411 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !219, file: !219, line: 4665, type: !388, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!412 = !DILocalVariable(name: "msgq", arg: 1, scope: !411, file: !219, line: 4665, type: !390)
!413 = !DILocation(line: 4665, column: 66, scope: !411)
!414 = !DILocation(line: 4667, column: 9, scope: !411)
!415 = !DILocation(line: 4667, column: 15, scope: !411)
!416 = !DILocation(line: 4667, column: 2, scope: !411)
!417 = distinct !DISubprogram(name: "z_add_timeout", scope: !130, file: !130, line: 99, type: !418, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !140)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !99, !120, !306}
!420 = !DILocalVariable(name: "to", arg: 1, scope: !417, file: !130, line: 99, type: !99)
!421 = !DILocation(line: 99, column: 37, scope: !417)
!422 = !DILocalVariable(name: "fn", arg: 2, scope: !417, file: !130, line: 99, type: !120)
!423 = !DILocation(line: 99, column: 57, scope: !417)
!424 = !DILocalVariable(name: "timeout", arg: 3, scope: !417, file: !130, line: 100, type: !306)
!425 = !DILocation(line: 100, column: 18, scope: !417)
!426 = !DILocation(line: 102, column: 17, scope: !427)
!427 = distinct !DILexicalBlock(scope: !417, file: !130, line: 102, column: 6)
!428 = !DILocation(line: 102, column: 42, scope: !427)
!429 = !DILocation(line: 102, column: 23, scope: !427)
!430 = !DILocation(line: 102, column: 6, scope: !417)
!431 = !DILocation(line: 103, column: 3, scope: !432)
!432 = distinct !DILexicalBlock(scope: !427, file: !130, line: 102, column: 84)
!433 = !DILocation(line: 111, column: 11, scope: !417)
!434 = !DILocation(line: 111, column: 2, scope: !417)
!435 = !DILocation(line: 111, column: 6, scope: !417)
!436 = !DILocation(line: 111, column: 9, scope: !417)
!437 = !DILocalVariable(name: "__i", scope: !438, file: !130, line: 113, type: !439)
!438 = distinct !DILexicalBlock(scope: !417, file: !130, line: 113, column: 2)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !139, line: 108, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !139, line: 34, size: 32, elements: !441)
!441 = !{!442}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !440, file: !139, line: 35, baseType: !95, size: 32)
!443 = !DILocation(line: 113, column: 24, scope: !438)
!444 = !DILocalVariable(name: "__key", scope: !438, file: !130, line: 113, type: !439)
!445 = !DILocation(line: 113, column: 34, scope: !438)
!446 = !DILocalVariable(name: "l", arg: 1, scope: !447, file: !139, line: 160, type: !450)
!447 = distinct !DISubprogram(name: "k_spin_lock", scope: !139, file: !139, line: 160, type: !448, scopeLine: 161, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !140)
!448 = !DISubroutineType(types: !449)
!449 = !{!439, !450}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!451 = !DILocation(line: 160, column: 94, scope: !447, inlinedAt: !452)
!452 = distinct !DILocation(line: 113, column: 42, scope: !438)
!453 = !DILocation(line: 162, column: 9, scope: !447, inlinedAt: !452)
!454 = !DILocalVariable(name: "k", scope: !447, file: !139, line: 163, type: !439)
