; ModuleID = '../bc_files/uart_console.bc'
source_filename = "/home/sri/zephyrproject/zephyr/drivers/console/uart_console.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.device = type { ptr, ptr, ptr, ptr, ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }

!14 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!15 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!16 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!17 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!18 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!19 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!20 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!21 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!22 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!23 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!24 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!25 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!26 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 17)
!27 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 18)
!28 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 19)
!29 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 20)
!30 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!31 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 23)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 24)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 25)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 26)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 27)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 28)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 29)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 30)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 31)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 32)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 33)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 34)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 35)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 36)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 37)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 38)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 39)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 40)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 41)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 42)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 43)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 44)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 45)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 46)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 47)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!87 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!88 = !{!89, !90, !91}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !94, line: 334, size: 608, elements: !95)
!94 = !DIFile(filename: "include/zephyr/drivers/uart.h", directory: "/home/sri/zephyrproject/zephyr")
!95 = !{!96, !124, !128, !132, !147, !152, !158, !164, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !93, file: !94, line: 363, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DISubroutineType(types: !99)
!99 = !{!90, !100, !123}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !103, line: 381, size: 160, elements: !104)
!103 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!104 = !{!105, !109, !112, !113, !122}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !102, file: !103, line: 383, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !102, file: !103, line: 385, baseType: !110, size: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !102, file: !103, line: 387, baseType: !110, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !102, file: !103, line: 389, baseType: !114, size: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !103, line: 354, size: 16, elements: !116)
!116 = !{!117, !120}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !115, file: !103, line: 362, baseType: !118, size: 8)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !119, line: 62, baseType: !7)
!119 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!120 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !115, file: !103, line: 367, baseType: !121, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!121 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !102, file: !103, line: 391, baseType: !89, size: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !93, file: !94, line: 364, baseType: !125, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !100, !7}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !93, file: !94, line: 372, baseType: !129, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DISubroutineType(types: !131)
!131 = !{!90, !100}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !93, file: !94, line: 376, baseType: !133, size: 32, offset: 96)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{!90, !100, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !94, line: 119, size: 64, elements: !139)
!139 = !{!140, !143, !144, !145, !146}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !138, file: !94, line: 120, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !119, line: 64, baseType: !142)
!142 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !138, file: !94, line: 121, baseType: !118, size: 8, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !138, file: !94, line: 122, baseType: !118, size: 8, offset: 40)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !138, file: !94, line: 123, baseType: !118, size: 8, offset: 48)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !138, file: !94, line: 124, baseType: !118, size: 8, offset: 56)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !93, file: !94, line: 378, baseType: !148, size: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DISubroutineType(types: !150)
!150 = !{!90, !100, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !93, file: !94, line: 384, baseType: !153, size: 32, offset: 160)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DISubroutineType(types: !155)
!155 = !{!90, !100, !156, !90}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !93, file: !94, line: 393, baseType: !159, size: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DISubroutineType(types: !161)
!161 = !{!90, !100, !162, !163}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !93, file: !94, line: 402, baseType: !165, size: 32, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !100}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !93, file: !94, line: 405, baseType: !165, size: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !93, file: !94, line: 408, baseType: !129, size: 32, offset: 288)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !93, file: !94, line: 411, baseType: !165, size: 32, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !93, file: !94, line: 414, baseType: !165, size: 32, offset: 352)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !93, file: !94, line: 417, baseType: !129, size: 32, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !93, file: !94, line: 420, baseType: !129, size: 32, offset: 416)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !93, file: !94, line: 423, baseType: !165, size: 32, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !93, file: !94, line: 426, baseType: !165, size: 32, offset: 480)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !93, file: !94, line: 429, baseType: !129, size: 32, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !93, file: !94, line: 432, baseType: !129, size: 32, offset: 544)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !93, file: !94, line: 435, baseType: !179, size: 32, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !100, !182, !89}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !94, line: 139, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !100, !89}
!186 = !{!0, !187}
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !2, file: !189, line: 39, type: !190, isLocal: true, isDefinition: true)
!189 = !DIFile(filename: "drivers/console/uart_console.c", directory: "/home/sri/zephyrproject/zephyr")
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !193, line: 92, size: 64, elements: !194)
!193 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!194 = !{!195, !203}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !192, file: !193, line: 94, baseType: !196, size: 32)
!196 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !193, line: 59, size: 32, elements: !197)
!197 = !{!198, !202}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !196, file: !193, line: 66, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!90}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !196, file: !193, line: 75, baseType: !129, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !192, file: !193, line: 99, baseType: !100, size: 32, offset: 32)
!204 = !{i32 7, !"Dwarf Version", i32 4}
!205 = !{i32 2, !"Debug Info Version", i32 3}
!206 = !{i32 1, !"wchar_size", i32 4}
!207 = !{i32 1, !"static_rwdata", i32 1}
!208 = !{i32 1, !"enumsize_buildattr", i32 1}
!209 = !{i32 1, !"armlib_unavailable", i32 0}
!210 = !{i32 8, !"PIC Level", i32 2}
!211 = !{i32 7, !"PIE Level", i32 2}
!212 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!213 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !6, file: !6, line: 223, type: !214, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !110, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !218, line: 250, size: 896, elements: !219)
!218 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!219 = !{!220, !289, !302, !303, !304, !305, !326}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !217, file: !218, line: 252, baseType: !221, size: 384)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !218, line: 58, size: 384, elements: !222)
!222 = !{!223, !251, !259, !260, !261, !274, !275, !276}
!223 = !DIDerivedType(tag: DW_TAG_member, scope: !221, file: !218, line: 61, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !221, file: !218, line: 61, size: 64, elements: !225)
!225 = !{!226, !242}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !224, file: !218, line: 62, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !228, line: 55, baseType: !229)
!228 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !228, line: 37, size: 64, elements: !230)
!230 = !{!231, !237}
!231 = !DIDerivedType(tag: DW_TAG_member, scope: !229, file: !228, line: 38, baseType: !232, size: 32)
!232 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !229, file: !228, line: 38, size: 32, elements: !233)
!233 = !{!234, !236}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !232, file: !228, line: 39, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !228, line: 40, baseType: !235, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, scope: !229, file: !228, line: 42, baseType: !238, size: 32, offset: 32)
!238 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !229, file: !228, line: 42, size: 32, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !238, file: !228, line: 43, baseType: !235, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !238, file: !228, line: 44, baseType: !235, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !224, file: !218, line: 63, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !244, line: 58, size: 64, elements: !245)
!244 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!245 = !{!246}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !243, file: !244, line: 60, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 64, elements: !249)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!249 = !{!250}
!250 = !DISubrange(count: 2)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !221, file: !218, line: 69, baseType: !252, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !254, line: 243, baseType: !255)
!254 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 241, size: 64, elements: !256)
!256 = !{!257}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !255, file: !254, line: 242, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !228, line: 51, baseType: !229)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !221, file: !218, line: 72, baseType: !118, size: 8, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !221, file: !218, line: 75, baseType: !118, size: 8, offset: 104)
!261 = !DIDerivedType(tag: DW_TAG_member, scope: !221, file: !218, line: 91, baseType: !262, size: 16, offset: 112)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !221, file: !218, line: 91, size: 16, elements: !263)
!263 = !{!264, !271}
!264 = !DIDerivedType(tag: DW_TAG_member, scope: !262, file: !218, line: 92, baseType: !265, size: 16)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !218, line: 92, size: 16, elements: !266)
!266 = !{!267, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !265, file: !218, line: 97, baseType: !268, size: 8)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !119, line: 56, baseType: !269)
!269 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !265, file: !218, line: 98, baseType: !118, size: 8, offset: 8)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !262, file: !218, line: 101, baseType: !272, size: 16)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !119, line: 63, baseType: !273)
!273 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !221, file: !218, line: 108, baseType: !141, size: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !221, file: !218, line: 132, baseType: !89, size: 32, offset: 160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !221, file: !218, line: 136, baseType: !277, size: 192, offset: 192)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !254, line: 254, size: 192, elements: !278)
!278 = !{!279, !280, !286}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !277, file: !254, line: 255, baseType: !227, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !277, file: !254, line: 256, baseType: !281, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !254, line: 252, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !285}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !277, file: !254, line: 259, baseType: !287, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !119, line: 59, baseType: !288)
!288 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !217, file: !218, line: 255, baseType: !290, size: 288, offset: 384)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !291, line: 25, size: 288, elements: !292)
!291 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !290, file: !291, line: 26, baseType: !141, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !290, file: !291, line: 27, baseType: !141, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !290, file: !291, line: 28, baseType: !141, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !290, file: !291, line: 29, baseType: !141, size: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !290, file: !291, line: 30, baseType: !141, size: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !290, file: !291, line: 31, baseType: !141, size: 32, offset: 160)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !290, file: !291, line: 32, baseType: !141, size: 32, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !290, file: !291, line: 33, baseType: !141, size: 32, offset: 224)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !290, file: !291, line: 34, baseType: !141, size: 32, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !217, file: !218, line: 258, baseType: !89, size: 32, offset: 672)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !217, file: !218, line: 261, baseType: !253, size: 64, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !217, file: !218, line: 302, baseType: !90, size: 32, offset: 768)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !217, file: !218, line: 333, baseType: !306, size: 32, offset: 800)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !308, line: 5291, size: 160, elements: !309)
!308 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!309 = !{!310, !321, !322}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !307, file: !308, line: 5292, baseType: !311, size: 96)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !312, line: 56, size: 96, elements: !313)
!312 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!313 = !{!314, !317, !318}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !311, file: !312, line: 57, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !312, line: 57, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !311, file: !312, line: 58, baseType: !89, size: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !311, file: !312, line: 59, baseType: !319, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !320, line: 46, baseType: !142)
!320 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!321 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !307, file: !308, line: 5293, baseType: !253, size: 64, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !307, file: !308, line: 5294, baseType: !323, offset: 160)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !324, line: 45, elements: !325)
!324 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!325 = !{}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !217, file: !218, line: 355, baseType: !327, size: 64, offset: 832)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !291, line: 60, size: 64, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !327, file: !291, line: 63, baseType: !141, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !327, file: !291, line: 66, baseType: !141, size: 32, offset: 32)
!331 = !DILocalVariable(name: "object", arg: 1, scope: !213, file: !6, line: 223, type: !110)
!332 = !DILocation(line: 223, column: 61, scope: !213)
!333 = !DILocalVariable(name: "thread", arg: 2, scope: !213, file: !6, line: 224, type: !216)
!334 = !DILocation(line: 224, column: 24, scope: !213)
!335 = !DILocation(line: 226, column: 9, scope: !213)
!336 = !DILocation(line: 227, column: 9, scope: !213)
!337 = !DILocation(line: 228, column: 1, scope: !213)
!338 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !6, file: !6, line: 243, type: !339, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !110}
!341 = !DILocalVariable(name: "object", arg: 1, scope: !338, file: !6, line: 243, type: !110)
!342 = !DILocation(line: 243, column: 56, scope: !338)
!343 = !DILocation(line: 245, column: 9, scope: !338)
!344 = !DILocation(line: 246, column: 1, scope: !338)
!345 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !6, file: !6, line: 359, type: !346, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!346 = !DISubroutineType(types: !347)
!347 = !{!89, !5}
!348 = !DILocalVariable(name: "otype", arg: 1, scope: !345, file: !6, line: 359, type: !5)
!349 = !DILocation(line: 359, column: 58, scope: !345)
!350 = !DILocation(line: 361, column: 9, scope: !345)
!351 = !DILocation(line: 363, column: 2, scope: !345)
!352 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !6, file: !6, line: 366, type: !353, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!353 = !DISubroutineType(types: !354)
!354 = !{!89, !5, !319}
!355 = !DILocalVariable(name: "otype", arg: 1, scope: !352, file: !6, line: 366, type: !5)
!356 = !DILocation(line: 366, column: 63, scope: !352)
!357 = !DILocalVariable(name: "size", arg: 2, scope: !352, file: !6, line: 367, type: !319)
!358 = !DILocation(line: 367, column: 13, scope: !352)
!359 = !DILocation(line: 369, column: 9, scope: !352)
!360 = !DILocation(line: 370, column: 9, scope: !352)
!361 = !DILocation(line: 372, column: 2, scope: !352)
!362 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !308, file: !308, line: 656, type: !363, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!363 = !DISubroutineType(types: !364)
!364 = !{!365, !367}
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !366, line: 46, baseType: !287)
!366 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!369 = !DILocalVariable(name: "t", arg: 1, scope: !362, file: !308, line: 657, type: !367)
!370 = !DILocation(line: 657, column: 30, scope: !362)
!371 = !DILocation(line: 659, column: 28, scope: !362)
!372 = !DILocation(line: 659, column: 31, scope: !362)
!373 = !DILocation(line: 659, column: 36, scope: !362)
!374 = !DILocation(line: 659, column: 9, scope: !362)
!375 = !DILocation(line: 659, column: 2, scope: !362)
!376 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !308, file: !308, line: 671, type: !363, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!377 = !DILocalVariable(name: "t", arg: 1, scope: !376, file: !308, line: 672, type: !367)
!378 = !DILocation(line: 672, column: 30, scope: !376)
!379 = !DILocation(line: 674, column: 30, scope: !376)
!380 = !DILocation(line: 674, column: 33, scope: !376)
!381 = !DILocation(line: 674, column: 38, scope: !376)
!382 = !DILocation(line: 674, column: 9, scope: !376)
!383 = !DILocation(line: 674, column: 2, scope: !376)
!384 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !308, file: !308, line: 1634, type: !385, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!385 = !DISubroutineType(types: !386)
!386 = !{!365, !387}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !308, line: 1439, size: 448, elements: !390)
!390 = !{!391, !392, !393, !398, !399, !404, !405}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !389, file: !308, line: 1445, baseType: !277, size: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !389, file: !308, line: 1448, baseType: !253, size: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !389, file: !308, line: 1451, baseType: !394, size: 32, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !397}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !389, file: !308, line: 1454, baseType: !394, size: 32, offset: 288)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !389, file: !308, line: 1457, baseType: !400, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !366, line: 67, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !366, line: 65, size: 64, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !401, file: !366, line: 66, baseType: !365, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !389, file: !308, line: 1460, baseType: !141, size: 32, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !389, file: !308, line: 1463, baseType: !89, size: 32, offset: 416)
!406 = !DILocalVariable(name: "timer", arg: 1, scope: !384, file: !308, line: 1635, type: !387)
!407 = !DILocation(line: 1635, column: 34, scope: !384)
!408 = !DILocation(line: 1637, column: 28, scope: !384)
!409 = !DILocation(line: 1637, column: 35, scope: !384)
!410 = !DILocation(line: 1637, column: 9, scope: !384)
!411 = !DILocation(line: 1637, column: 2, scope: !384)
!412 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !308, file: !308, line: 1649, type: !385, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!413 = !DILocalVariable(name: "timer", arg: 1, scope: !412, file: !308, line: 1650, type: !387)
!414 = !DILocation(line: 1650, column: 34, scope: !412)
!415 = !DILocation(line: 1652, column: 30, scope: !412)
!416 = !DILocation(line: 1652, column: 37, scope: !412)
!417 = !DILocation(line: 1652, column: 9, scope: !412)
!418 = !DILocation(line: 1652, column: 2, scope: !412)
!419 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !308, file: !308, line: 1689, type: !420, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !397, !89}
!422 = !DILocalVariable(name: "timer", arg: 1, scope: !419, file: !308, line: 1689, type: !397)
!423 = !DILocation(line: 1689, column: 65, scope: !419)
!424 = !DILocalVariable(name: "user_data", arg: 2, scope: !419, file: !308, line: 1690, type: !89)
!425 = !DILocation(line: 1690, column: 19, scope: !419)
!426 = !DILocation(line: 1692, column: 21, scope: !419)
!427 = !DILocation(line: 1692, column: 2, scope: !419)
!428 = !DILocation(line: 1692, column: 9, scope: !419)
!429 = !DILocation(line: 1692, column: 19, scope: !419)
!430 = !DILocation(line: 1693, column: 1, scope: !419)
!431 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !308, file: !308, line: 1704, type: !432, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!432 = !DISubroutineType(types: !433)
!433 = !{!89, !387}
!434 = !DILocalVariable(name: "timer", arg: 1, scope: !431, file: !308, line: 1704, type: !387)
!435 = !DILocation(line: 1704, column: 72, scope: !431)
!436 = !DILocation(line: 1706, column: 9, scope: !431)
!437 = !DILocation(line: 1706, column: 16, scope: !431)
!438 = !DILocation(line: 1706, column: 2, scope: !431)
!439 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !308, file: !308, line: 2071, type: !440, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!440 = !DISubroutineType(types: !441)
!441 = !{!90, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !308, line: 1830, size: 128, elements: !444)
!444 = !{!445, !458, !459}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !443, file: !308, line: 1831, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !447, line: 60, baseType: !448)
!447 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !447, line: 53, size: 64, elements: !449)
!449 = !{!450, !457}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !448, file: !447, line: 54, baseType: !451, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !447, line: 50, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !447, line: 44, size: 32, elements: !454)
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !453, file: !447, line: 45, baseType: !456, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !447, line: 40, baseType: !141)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !448, file: !447, line: 55, baseType: !451, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !443, file: !308, line: 1832, baseType: !323, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !443, file: !308, line: 1833, baseType: !253, size: 64, offset: 64)
!460 = !DILocalVariable(name: "queue", arg: 1, scope: !439, file: !308, line: 2071, type: !442)
!461 = !DILocation(line: 2071, column: 59, scope: !439)
!462 = !DILocation(line: 2073, column: 35, scope: !439)
!463 = !DILocation(line: 2073, column: 42, scope: !439)
!464 = !DILocation(line: 2073, column: 14, scope: !439)
!465 = !DILocation(line: 2073, column: 9, scope: !439)
!466 = !DILocation(line: 2073, column: 2, scope: !439)
!467 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !308, file: !308, line: 3209, type: !468, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!468 = !DISubroutineType(types: !469)
!469 = !{!142, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 32)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !308, line: 3092, size: 128, elements: !472)
!472 = !{!473, !474, !475}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !471, file: !308, line: 3093, baseType: !253, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !471, file: !308, line: 3094, baseType: !142, size: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !471, file: !308, line: 3095, baseType: !142, size: 32, offset: 96)
!476 = !DILocalVariable(name: "sem", arg: 1, scope: !467, file: !308, line: 3209, type: !470)
!477 = !DILocation(line: 3209, column: 65, scope: !467)
!478 = !DILocation(line: 3211, column: 9, scope: !467)
!479 = !DILocation(line: 3211, column: 14, scope: !467)
!480 = !DILocation(line: 3211, column: 2, scope: !467)
!481 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !308, file: !308, line: 4649, type: !482, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!482 = !DISubroutineType(types: !483)
!483 = !{!141, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !308, line: 4390, size: 320, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !493, !494, !495, !496, !497}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !485, file: !308, line: 4392, baseType: !253, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !485, file: !308, line: 4394, baseType: !323, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !485, file: !308, line: 4396, baseType: !319, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !485, file: !308, line: 4398, baseType: !141, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !485, file: !308, line: 4400, baseType: !492, size: 32, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !485, file: !308, line: 4402, baseType: !492, size: 32, offset: 160)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !485, file: !308, line: 4404, baseType: !492, size: 32, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !485, file: !308, line: 4406, baseType: !492, size: 32, offset: 224)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !485, file: !308, line: 4408, baseType: !141, size: 32, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !485, file: !308, line: 4413, baseType: !118, size: 8, offset: 288)
!498 = !DILocalVariable(name: "msgq", arg: 1, scope: !481, file: !308, line: 4649, type: !484)
!499 = !DILocation(line: 4649, column: 66, scope: !481)
!500 = !DILocation(line: 4651, column: 9, scope: !481)
!501 = !DILocation(line: 4651, column: 15, scope: !481)
!502 = !DILocation(line: 4651, column: 26, scope: !481)
!503 = !DILocation(line: 4651, column: 32, scope: !481)
!504 = !DILocation(line: 4651, column: 24, scope: !481)
!505 = !DILocation(line: 4651, column: 2, scope: !481)
!506 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !308, file: !308, line: 4665, type: !482, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!507 = !DILocalVariable(name: "msgq", arg: 1, scope: !506, file: !308, line: 4665, type: !484)
!508 = !DILocation(line: 4665, column: 66, scope: !506)
!509 = !DILocation(line: 4667, column: 9, scope: !506)
!510 = !DILocation(line: 4667, column: 15, scope: !506)
!511 = !DILocation(line: 4667, column: 2, scope: !506)
!512 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !103, file: !103, line: 744, type: !513, scopeLine: 745, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!513 = !DISubroutineType(types: !514)
!514 = !{!121, !100}
!515 = !DILocalVariable(name: "dev", arg: 1, scope: !512, file: !103, line: 744, type: !100)
!516 = !DILocation(line: 744, column: 65, scope: !512)
!517 = !DILocation(line: 746, column: 27, scope: !512)
!518 = !DILocation(line: 746, column: 9, scope: !512)
!519 = !DILocation(line: 746, column: 2, scope: !512)
!520 = distinct !DISubprogram(name: "z_impl_uart_err_check", scope: !94, file: !94, line: 467, type: !130, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!521 = !DILocalVariable(name: "dev", arg: 1, scope: !520, file: !94, line: 467, type: !100)
!522 = !DILocation(line: 467, column: 62, scope: !520)
!523 = !DILocalVariable(name: "api", scope: !520, file: !94, line: 469, type: !91)
!524 = !DILocation(line: 469, column: 32, scope: !520)
!525 = !DILocation(line: 470, column: 35, scope: !520)
!526 = !DILocation(line: 470, column: 40, scope: !520)
!527 = !DILocation(line: 472, column: 6, scope: !528)
!528 = distinct !DILexicalBlock(scope: !520, file: !94, line: 472, column: 6)
!529 = !DILocation(line: 472, column: 11, scope: !528)
!530 = !DILocation(line: 472, column: 21, scope: !528)
!531 = !DILocation(line: 472, column: 6, scope: !520)
!532 = !DILocation(line: 473, column: 3, scope: !533)
!533 = distinct !DILexicalBlock(scope: !528, file: !94, line: 472, column: 27)
!534 = !DILocation(line: 476, column: 9, scope: !520)
!535 = !DILocation(line: 476, column: 14, scope: !520)
!536 = !DILocation(line: 476, column: 24, scope: !520)
!537 = !DILocation(line: 476, column: 2, scope: !520)
!538 = !DILocation(line: 477, column: 1, scope: !520)
!539 = distinct !DISubprogram(name: "z_impl_uart_poll_in", scope: !94, file: !94, line: 504, type: !98, scopeLine: 506, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !325)
!540 = !DILocalVariable(name: "dev", arg: 1, scope: !539, file: !94, line: 504, type: !100)
!541 = !DILocation(line: 504, column: 60, scope: !539)
!542 = !DILocalVariable(name: "p_char", arg: 2, scope: !539, file: !94, line: 505, type: !123)
!543 = !DILocation(line: 505, column: 26, scope: !539)
!544 = !DILocalVariable(name: "api", scope: !539, file: !94, line: 507, type: !91)
!545 = !DILocation(line: 507, column: 32, scope: !539)
!546 = !DILocation(line: 508, column: 35, scope: !539)
!547 = !DILocation(line: 508, column: 40, scope: !539)
!548 = !DILocation(line: 510, column: 6, scope: !549)
!549 = distinct !DILexicalBlock(scope: !539, file: !94, line: 510, column: 6)
