; ModuleID = '../bc_files/uart_console.bc'
source_filename = "/home/sri/zephyrproject/zephyr/drivers/console/uart_console.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.device = type { ptr, ptr, ptr, ptr, ptr }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._thread_arch = type { i32, i32 }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }
%struct.k_spinlock = type {}
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, ptr, ptr, ptr, ptr, i32, i8 }

!14 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!15 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!16 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!17 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!18 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!19 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!20 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!21 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!22 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!23 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!24 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!25 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!26 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 17)
!27 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 18)
!28 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 19)
!29 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 20)
!30 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 21)
!31 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 22)
!32 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!33 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!34 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 25)
!35 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 26)
!36 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 27)
!37 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 28)
!38 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 29)
!39 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 30)
!40 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 31)
!41 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 32)
!42 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 33)
!43 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 34)
!44 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 35)
!45 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 36)
!46 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 37)
!47 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 38)
!48 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 39)
!49 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 40)
!50 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 41)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 42)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 43)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 44)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 45)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 46)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 47)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!87 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!88 = !{!89, !90, !91}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !94, line: 334, size: 608, elements: !95)
!94 = !DIFile(filename: "include/zephyr/drivers/uart.h", directory: "/home/sri/zephyrproject/zephyr")
!95 = !{!96, !124, !128, !132, !147, !152, !158, !164, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !93, file: !94, line: 363, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DISubroutineType(types: !99)
!99 = !{!90, !100, !123}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !103, line: 381, size: 160, elements: !104)
!103 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!104 = !{!105, !109, !112, !113, !122}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !102, file: !103, line: 383, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !102, file: !103, line: 385, baseType: !110, size: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !102, file: !103, line: 387, baseType: !110, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !102, file: !103, line: 389, baseType: !114, size: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !103, line: 354, size: 16, elements: !116)
!116 = !{!117, !120}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !115, file: !103, line: 362, baseType: !118, size: 8)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !119, line: 62, baseType: !7)
!119 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!120 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !115, file: !103, line: 367, baseType: !121, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!121 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !102, file: !103, line: 391, baseType: !89, size: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !93, file: !94, line: 364, baseType: !125, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !100, !7}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !93, file: !94, line: 372, baseType: !129, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DISubroutineType(types: !131)
!131 = !{!90, !100}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !93, file: !94, line: 376, baseType: !133, size: 32, offset: 96)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{!90, !100, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !94, line: 119, size: 64, elements: !139)
!139 = !{!140, !143, !144, !145, !146}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !138, file: !94, line: 120, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !119, line: 64, baseType: !142)
!142 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !138, file: !94, line: 121, baseType: !118, size: 8, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !138, file: !94, line: 122, baseType: !118, size: 8, offset: 40)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !138, file: !94, line: 123, baseType: !118, size: 8, offset: 48)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !138, file: !94, line: 124, baseType: !118, size: 8, offset: 56)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !93, file: !94, line: 378, baseType: !148, size: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DISubroutineType(types: !150)
!150 = !{!90, !100, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !93, file: !94, line: 384, baseType: !153, size: 32, offset: 160)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DISubroutineType(types: !155)
!155 = !{!90, !100, !156, !90}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !93, file: !94, line: 393, baseType: !159, size: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DISubroutineType(types: !161)
!161 = !{!90, !100, !162, !163}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !93, file: !94, line: 402, baseType: !165, size: 32, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !100}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !93, file: !94, line: 405, baseType: !165, size: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !93, file: !94, line: 408, baseType: !129, size: 32, offset: 288)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !93, file: !94, line: 411, baseType: !165, size: 32, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !93, file: !94, line: 414, baseType: !165, size: 32, offset: 352)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !93, file: !94, line: 417, baseType: !129, size: 32, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !93, file: !94, line: 420, baseType: !129, size: 32, offset: 416)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !93, file: !94, line: 423, baseType: !165, size: 32, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !93, file: !94, line: 426, baseType: !165, size: 32, offset: 480)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !93, file: !94, line: 429, baseType: !129, size: 32, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !93, file: !94, line: 432, baseType: !129, size: 32, offset: 544)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !93, file: !94, line: 435, baseType: !179, size: 32, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !100, !182, !89}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !94, line: 139, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !100, !89}
!186 = !{!0, !187}
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !2, file: !189, line: 39, type: !190, isLocal: true, isDefinition: true)
!189 = !DIFile(filename: "drivers/console/uart_console.c", directory: "/home/sri/zephyrproject/zephyr")
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !193, line: 92, size: 64, elements: !194)
!193 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!194 = !{!195, !203}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !192, file: !193, line: 94, baseType: !196, size: 32)
!196 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !193, line: 59, size: 32, elements: !197)
!197 = !{!198, !202}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !196, file: !193, line: 66, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!90}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !196, file: !193, line: 75, baseType: !129, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !192, file: !193, line: 99, baseType: !100, size: 32, offset: 32)
!204 = !{i32 7, !"Dwarf Version", i32 4}
!205 = !{i32 2, !"Debug Info Version", i32 3}
!206 = !{i32 1, !"wchar_size", i32 4}
!207 = !{i32 1, !"static_rwdata", i32 1}
!208 = !{i32 1, !"enumsize_buildattr", i32 1}
!209 = !{i32 1, !"armlib_unavailable", i32 0}
!210 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!211 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !6, file: !6, line: 223, type: !212, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !329)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !110, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !216, line: 250, size: 896, elements: !217)
!216 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!217 = !{!218, !287, !300, !301, !302, !303, !324}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !215, file: !216, line: 252, baseType: !219, size: 384)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !216, line: 58, size: 384, elements: !220)
!220 = !{!221, !249, !257, !258, !259, !272, !273, !274}
!221 = !DIDerivedType(tag: DW_TAG_member, scope: !219, file: !216, line: 61, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !219, file: !216, line: 61, size: 64, elements: !223)
!223 = !{!224, !240}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !222, file: !216, line: 62, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !226, line: 55, baseType: !227)
!226 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !226, line: 37, size: 64, elements: !228)
!228 = !{!229, !235}
!229 = !DIDerivedType(tag: DW_TAG_member, scope: !227, file: !226, line: 38, baseType: !230, size: 32)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !227, file: !226, line: 38, size: 32, elements: !231)
!231 = !{!232, !234}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !230, file: !226, line: 39, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !230, file: !226, line: 40, baseType: !233, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !227, file: !226, line: 42, baseType: !236, size: 32, offset: 32)
!236 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !227, file: !226, line: 42, size: 32, elements: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !236, file: !226, line: 43, baseType: !233, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !236, file: !226, line: 44, baseType: !233, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !222, file: !216, line: 63, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !242, line: 58, size: 64, elements: !243)
!242 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !241, file: !242, line: 60, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 64, elements: !247)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!247 = !{!248}
!248 = !DISubrange(count: 2)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !219, file: !216, line: 69, baseType: !250, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !252, line: 243, baseType: !253)
!252 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 241, size: 64, elements: !254)
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !253, file: !252, line: 242, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !226, line: 51, baseType: !227)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !219, file: !216, line: 72, baseType: !118, size: 8, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !219, file: !216, line: 75, baseType: !118, size: 8, offset: 104)
!259 = !DIDerivedType(tag: DW_TAG_member, scope: !219, file: !216, line: 91, baseType: !260, size: 16, offset: 112)
!260 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !219, file: !216, line: 91, size: 16, elements: !261)
!261 = !{!262, !269}
!262 = !DIDerivedType(tag: DW_TAG_member, scope: !260, file: !216, line: 92, baseType: !263, size: 16)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !216, line: 92, size: 16, elements: !264)
!264 = !{!265, !268}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !263, file: !216, line: 97, baseType: !266, size: 8)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !119, line: 56, baseType: !267)
!267 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !263, file: !216, line: 98, baseType: !118, size: 8, offset: 8)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !260, file: !216, line: 101, baseType: !270, size: 16)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !119, line: 63, baseType: !271)
!271 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !219, file: !216, line: 108, baseType: !141, size: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !219, file: !216, line: 132, baseType: !89, size: 32, offset: 160)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !219, file: !216, line: 136, baseType: !275, size: 192, offset: 192)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !252, line: 254, size: 192, elements: !276)
!276 = !{!277, !278, !284}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !275, file: !252, line: 255, baseType: !225, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !275, file: !252, line: 256, baseType: !279, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !252, line: 252, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !275, file: !252, line: 259, baseType: !285, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !119, line: 59, baseType: !286)
!286 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !215, file: !216, line: 255, baseType: !288, size: 288, offset: 384)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !289, line: 25, size: 288, elements: !290)
!289 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !288, file: !289, line: 26, baseType: !141, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !288, file: !289, line: 27, baseType: !141, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !288, file: !289, line: 28, baseType: !141, size: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !288, file: !289, line: 29, baseType: !141, size: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !288, file: !289, line: 30, baseType: !141, size: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !288, file: !289, line: 31, baseType: !141, size: 32, offset: 160)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !288, file: !289, line: 32, baseType: !141, size: 32, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !288, file: !289, line: 33, baseType: !141, size: 32, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !288, file: !289, line: 34, baseType: !141, size: 32, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !215, file: !216, line: 258, baseType: !89, size: 32, offset: 672)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !215, file: !216, line: 261, baseType: !251, size: 64, offset: 704)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !215, file: !216, line: 302, baseType: !90, size: 32, offset: 768)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !215, file: !216, line: 333, baseType: !304, size: 32, offset: 800)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !306, line: 5291, size: 160, elements: !307)
!306 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!307 = !{!308, !319, !320}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !305, file: !306, line: 5292, baseType: !309, size: 96)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !310, line: 56, size: 96, elements: !311)
!310 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!311 = !{!312, !315, !316}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !309, file: !310, line: 57, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !310, line: 57, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !309, file: !310, line: 58, baseType: !89, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !309, file: !310, line: 59, baseType: !317, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !318, line: 46, baseType: !142)
!318 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!319 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !305, file: !306, line: 5293, baseType: !251, size: 64, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !305, file: !306, line: 5294, baseType: !321, offset: 160)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !322, line: 45, elements: !323)
!322 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!323 = !{}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !215, file: !216, line: 355, baseType: !325, size: 64, offset: 832)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !289, line: 60, size: 64, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !325, file: !289, line: 63, baseType: !141, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !325, file: !289, line: 66, baseType: !141, size: 32, offset: 32)
!329 = !{!330, !331}
!330 = !DILocalVariable(name: "object", arg: 1, scope: !211, file: !6, line: 223, type: !110)
!331 = !DILocalVariable(name: "thread", arg: 2, scope: !211, file: !6, line: 224, type: !214)
!332 = !DILocation(line: 223, column: 61, scope: !211)
!333 = !DILocation(line: 224, column: 24, scope: !211)
!334 = !DILocation(line: 226, column: 9, scope: !211)
!335 = !DILocation(line: 227, column: 9, scope: !211)
!336 = !DILocation(line: 228, column: 1, scope: !211)
!337 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !6, file: !6, line: 243, type: !338, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !340)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !110}
!340 = !{!341}
!341 = !DILocalVariable(name: "object", arg: 1, scope: !337, file: !6, line: 243, type: !110)
!342 = !DILocation(line: 243, column: 56, scope: !337)
!343 = !DILocation(line: 245, column: 9, scope: !337)
!344 = !DILocation(line: 246, column: 1, scope: !337)
!345 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !6, file: !6, line: 359, type: !346, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !348)
!346 = !DISubroutineType(types: !347)
!347 = !{!89, !5}
!348 = !{!349}
!349 = !DILocalVariable(name: "otype", arg: 1, scope: !345, file: !6, line: 359, type: !5)
!350 = !DILocation(line: 359, column: 58, scope: !345)
!351 = !DILocation(line: 361, column: 9, scope: !345)
!352 = !DILocation(line: 363, column: 2, scope: !345)
!353 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !6, file: !6, line: 366, type: !354, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !356)
!354 = !DISubroutineType(types: !355)
!355 = !{!89, !5, !317}
!356 = !{!357, !358}
!357 = !DILocalVariable(name: "otype", arg: 1, scope: !353, file: !6, line: 366, type: !5)
!358 = !DILocalVariable(name: "size", arg: 2, scope: !353, file: !6, line: 367, type: !317)
!359 = !DILocation(line: 366, column: 63, scope: !353)
!360 = !DILocation(line: 367, column: 13, scope: !353)
!361 = !DILocation(line: 369, column: 9, scope: !353)
!362 = !DILocation(line: 370, column: 9, scope: !353)
!363 = !DILocation(line: 372, column: 2, scope: !353)
!364 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !306, file: !306, line: 656, type: !365, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !371)
!365 = !DISubroutineType(types: !366)
!366 = !{!367, !369}
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !368, line: 46, baseType: !285)
!368 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!371 = !{!372}
!372 = !DILocalVariable(name: "t", arg: 1, scope: !364, file: !306, line: 657, type: !369)
!373 = !DILocation(line: 657, column: 30, scope: !364)
!374 = !DILocation(line: 659, column: 28, scope: !364)
!375 = !DILocation(line: 659, column: 31, scope: !364)
!376 = !DILocation(line: 659, column: 36, scope: !364)
!377 = !DILocation(line: 659, column: 9, scope: !364)
!378 = !DILocation(line: 659, column: 2, scope: !364)
!379 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !306, file: !306, line: 671, type: !365, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !380)
!380 = !{!381}
!381 = !DILocalVariable(name: "t", arg: 1, scope: !379, file: !306, line: 672, type: !369)
!382 = !DILocation(line: 672, column: 30, scope: !379)
!383 = !DILocation(line: 674, column: 30, scope: !379)
!384 = !DILocation(line: 674, column: 33, scope: !379)
!385 = !DILocation(line: 674, column: 38, scope: !379)
!386 = !DILocation(line: 674, column: 9, scope: !379)
!387 = !DILocation(line: 674, column: 2, scope: !379)
!388 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !306, file: !306, line: 1634, type: !389, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !410)
!389 = !DISubroutineType(types: !390)
!390 = !{!367, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !306, line: 1439, size: 448, elements: !394)
!394 = !{!395, !396, !397, !402, !403, !408, !409}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !393, file: !306, line: 1445, baseType: !275, size: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !393, file: !306, line: 1448, baseType: !251, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !393, file: !306, line: 1451, baseType: !398, size: 32, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !393, file: !306, line: 1454, baseType: !398, size: 32, offset: 288)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !393, file: !306, line: 1457, baseType: !404, size: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !368, line: 67, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 65, size: 64, elements: !406)
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !405, file: !368, line: 66, baseType: !367, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !393, file: !306, line: 1460, baseType: !141, size: 32, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !393, file: !306, line: 1463, baseType: !89, size: 32, offset: 416)
!410 = !{!411}
!411 = !DILocalVariable(name: "timer", arg: 1, scope: !388, file: !306, line: 1635, type: !391)
!412 = !DILocation(line: 1635, column: 34, scope: !388)
!413 = !DILocation(line: 1637, column: 28, scope: !388)
!414 = !DILocation(line: 1637, column: 35, scope: !388)
!415 = !DILocation(line: 1637, column: 9, scope: !388)
!416 = !DILocation(line: 1637, column: 2, scope: !388)
!417 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !306, file: !306, line: 1649, type: !389, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !418)
!418 = !{!419}
!419 = !DILocalVariable(name: "timer", arg: 1, scope: !417, file: !306, line: 1650, type: !391)
!420 = !DILocation(line: 1650, column: 34, scope: !417)
!421 = !DILocation(line: 1652, column: 30, scope: !417)
!422 = !DILocation(line: 1652, column: 37, scope: !417)
!423 = !DILocation(line: 1652, column: 9, scope: !417)
!424 = !DILocation(line: 1652, column: 2, scope: !417)
!425 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !306, file: !306, line: 1689, type: !426, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !428)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !401, !89}
!428 = !{!429, !430}
!429 = !DILocalVariable(name: "timer", arg: 1, scope: !425, file: !306, line: 1689, type: !401)
!430 = !DILocalVariable(name: "user_data", arg: 2, scope: !425, file: !306, line: 1690, type: !89)
!431 = !DILocation(line: 1689, column: 65, scope: !425)
!432 = !DILocation(line: 1690, column: 19, scope: !425)
!433 = !DILocation(line: 1692, column: 21, scope: !425)
!434 = !DILocation(line: 1692, column: 2, scope: !425)
!435 = !DILocation(line: 1692, column: 9, scope: !425)
!436 = !DILocation(line: 1692, column: 19, scope: !425)
!437 = !DILocation(line: 1693, column: 1, scope: !425)
!438 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !306, file: !306, line: 1704, type: !439, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !441)
!439 = !DISubroutineType(types: !440)
!440 = !{!89, !391}
!441 = !{!442}
!442 = !DILocalVariable(name: "timer", arg: 1, scope: !438, file: !306, line: 1704, type: !391)
!443 = !DILocation(line: 1704, column: 72, scope: !438)
!444 = !DILocation(line: 1706, column: 9, scope: !438)
!445 = !DILocation(line: 1706, column: 16, scope: !438)
!446 = !DILocation(line: 1706, column: 2, scope: !438)
!447 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !306, file: !306, line: 2071, type: !448, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !468)
!448 = !DISubroutineType(types: !449)
!449 = !{!90, !450}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !306, line: 1830, size: 128, elements: !452)
!452 = !{!453, !466, !467}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !451, file: !306, line: 1831, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !455, line: 60, baseType: !456)
!455 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !455, line: 53, size: 64, elements: !457)
!457 = !{!458, !465}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !456, file: !455, line: 54, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !455, line: 50, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !455, line: 44, size: 32, elements: !462)
!462 = !{!463}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !461, file: !455, line: 45, baseType: !464, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !455, line: 40, baseType: !141)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !456, file: !455, line: 55, baseType: !459, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !451, file: !306, line: 1832, baseType: !321, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !451, file: !306, line: 1833, baseType: !251, size: 64, offset: 64)
!468 = !{!469}
!469 = !DILocalVariable(name: "queue", arg: 1, scope: !447, file: !306, line: 2071, type: !450)
!470 = !DILocation(line: 2071, column: 59, scope: !447)
!471 = !DILocation(line: 2073, column: 35, scope: !447)
!472 = !DILocation(line: 2073, column: 42, scope: !447)
!473 = !DILocation(line: 2073, column: 14, scope: !447)
!474 = !DILocation(line: 2073, column: 9, scope: !447)
!475 = !DILocation(line: 2073, column: 2, scope: !447)
!476 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !306, file: !306, line: 3209, type: !477, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !485)
!477 = !DISubroutineType(types: !478)
!478 = !{!142, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !306, line: 3092, size: 128, elements: !481)
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !480, file: !306, line: 3093, baseType: !251, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !480, file: !306, line: 3094, baseType: !142, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !480, file: !306, line: 3095, baseType: !142, size: 32, offset: 96)
!485 = !{!486}
!486 = !DILocalVariable(name: "sem", arg: 1, scope: !476, file: !306, line: 3209, type: !479)
!487 = !DILocation(line: 3209, column: 65, scope: !476)
!488 = !DILocation(line: 3211, column: 9, scope: !476)
!489 = !DILocation(line: 3211, column: 14, scope: !476)
!490 = !DILocation(line: 3211, column: 2, scope: !476)
!491 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !306, file: !306, line: 4649, type: !492, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !508)
!492 = !DISubroutineType(types: !493)
!493 = !{!141, !494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !306, line: 4390, size: 320, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !503, !504, !505, !506, !507}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !495, file: !306, line: 4392, baseType: !251, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !495, file: !306, line: 4394, baseType: !321, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !495, file: !306, line: 4396, baseType: !317, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !495, file: !306, line: 4398, baseType: !141, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !495, file: !306, line: 4400, baseType: !502, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !495, file: !306, line: 4402, baseType: !502, size: 32, offset: 160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !495, file: !306, line: 4404, baseType: !502, size: 32, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !495, file: !306, line: 4406, baseType: !502, size: 32, offset: 224)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !495, file: !306, line: 4408, baseType: !141, size: 32, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !495, file: !306, line: 4413, baseType: !118, size: 8, offset: 288)
!508 = !{!509}
!509 = !DILocalVariable(name: "msgq", arg: 1, scope: !491, file: !306, line: 4649, type: !494)
!510 = !DILocation(line: 4649, column: 66, scope: !491)
!511 = !DILocation(line: 4651, column: 9, scope: !491)
!512 = !DILocation(line: 4651, column: 15, scope: !491)
!513 = !DILocation(line: 4651, column: 26, scope: !491)
!514 = !DILocation(line: 4651, column: 32, scope: !491)
!515 = !DILocation(line: 4651, column: 24, scope: !491)
!516 = !DILocation(line: 4651, column: 2, scope: !491)
!517 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !306, file: !306, line: 4665, type: !492, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !518)
!518 = !{!519}
!519 = !DILocalVariable(name: "msgq", arg: 1, scope: !517, file: !306, line: 4665, type: !494)
!520 = !DILocation(line: 4665, column: 66, scope: !517)
!521 = !DILocation(line: 4667, column: 9, scope: !517)
!522 = !DILocation(line: 4667, column: 15, scope: !517)
!523 = !DILocation(line: 4667, column: 2, scope: !517)
!524 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !103, file: !103, line: 744, type: !525, scopeLine: 745, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !527)
!525 = !DISubroutineType(types: !526)
!526 = !{!121, !100}
!527 = !{!528}
!528 = !DILocalVariable(name: "dev", arg: 1, scope: !524, file: !103, line: 744, type: !100)
!529 = !DILocation(line: 744, column: 65, scope: !524)
!530 = !DILocation(line: 746, column: 27, scope: !524)
!531 = !DILocation(line: 746, column: 9, scope: !524)
!532 = !DILocation(line: 746, column: 2, scope: !524)
!533 = distinct !DISubprogram(name: "z_impl_uart_err_check", scope: !94, file: !94, line: 467, type: !130, scopeLine: 468, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !534)
!534 = !{!535, !536}
!535 = !DILocalVariable(name: "dev", arg: 1, scope: !533, file: !94, line: 467, type: !100)
!536 = !DILocalVariable(name: "api", scope: !533, file: !94, line: 469, type: !91)
!537 = !DILocation(line: 467, column: 62, scope: !533)
!538 = !DILocation(line: 469, column: 2, scope: !533)
!539 = !DILocation(line: 469, column: 32, scope: !533)
!540 = !DILocation(line: 470, column: 35, scope: !533)
!541 = !DILocation(line: 470, column: 40, scope: !533)
!542 = !DILocation(line: 472, column: 6, scope: !543)
!543 = distinct !DILexicalBlock(scope: !533, file: !94, line: 472, column: 6)
!544 = !DILocation(line: 472, column: 11, scope: !543)
!545 = !DILocation(line: 472, column: 21, scope: !543)
!546 = !DILocation(line: 472, column: 6, scope: !533)
!547 = !DILocation(line: 473, column: 3, scope: !548)
!548 = distinct !DILexicalBlock(scope: !543, file: !94, line: 472, column: 27)
!549 = !DILocation(line: 476, column: 9, scope: !533)
!550 = !DILocation(line: 476, column: 14, scope: !533)
!551 = !DILocation(line: 476, column: 24, scope: !533)
!552 = !DILocation(line: 476, column: 2, scope: !533)
!553 = !DILocation(line: 477, column: 1, scope: !533)
!554 = distinct !DISubprogram(name: "z_impl_uart_poll_in", scope: !94, file: !94, line: 504, type: !98, scopeLine: 506, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !555)
!555 = !{!556, !557, !558}
!556 = !DILocalVariable(name: "dev", arg: 1, scope: !554, file: !94, line: 504, type: !100)
!557 = !DILocalVariable(name: "p_char", arg: 2, scope: !554, file: !94, line: 505, type: !123)
!558 = !DILocalVariable(name: "api", scope: !554, file: !94, line: 507, type: !91)
!559 = !DILocation(line: 504, column: 60, scope: !554)
