; ModuleID = '../bc_files/uart_stm32.bc'
source_filename = "/home/sri/zephyrproject/zephyr/drivers/serial/uart_stm32.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.uart_stm32_config = type { ptr, %struct.reset_dt_spec, ptr, i32, i8, i8, i8, i8, i8, i8, i8, i8, ptr, ptr }
%struct.reset_dt_spec = type { ptr, i32 }
%struct.uart_driver_api = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.device_state = type { i8, i8 }
%struct.uart_stm32_data = type { ptr, ptr, ptr, ptr }
%struct.device = type { ptr, ptr, ptr, ptr, ptr }
%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.stm32_pclken = type { i32, i32 }
%struct.pinctrl_dev_config = type { ptr, i8 }
%struct.pinctrl_state = type { ptr, i8, i8 }
%struct.pinctrl_soc_pin = type { i32, i32 }
%struct._isr_list = type { i32, i32, ptr, ptr }
%struct.uart_config = type { i32, i8, i8, i8, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }

!74 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!94 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !96, line: 47, baseType: !14, size: 8, elements: !97)
!96 = !DIFile(filename: "include/zephyr/drivers/uart.h", directory: "/home/sri/zephyrproject/zephyr")
!97 = !{!98, !99, !100, !101, !102, !103}
!98 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!99 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!100 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!101 = !DIEnumerator(name: "UART_BREAK", value: 8)
!102 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!103 = !DIEnumerator(name: "UART_ERROR_NOISE", value: 32)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !96, line: 77, baseType: !14, size: 8, elements: !105)
!105 = !{!106, !107, !108, !109, !110}
!106 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!107 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!108 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!109 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!110 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !96, line: 94, baseType: !14, size: 8, elements: !112)
!112 = !{!113, !114, !115, !116, !117}
!113 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!114 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!115 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!116 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!117 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !96, line: 109, baseType: !14, size: 8, elements: !119)
!119 = !{!120, !121, !122, !123}
!120 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!121 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!122 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!123 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RS485", value: 3)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !96, line: 86, baseType: !14, size: 8, elements: !125)
!125 = !{!126, !127, !128, !129}
!126 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!127 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!128 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!129 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !131, line: 44, baseType: !14, size: 8, elements: !132)
!131 = !DIFile(filename: "include/zephyr/drivers/clock_control.h", directory: "/home/sri/zephyrproject/zephyr")
!132 = !{!133, !134, !135, !136}
!133 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!134 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!135 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!136 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!137 = !{!138, !139, !140, !184, !14, !192, !167, !252, !174, !254, !274, !275, !172, !159, !223}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!139 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reset_driver_api", file: !143, line: 140, size: 128, elements: !144)
!143 = !DIFile(filename: "include/zephyr/drivers/reset.h", directory: "/home/sri/zephyrproject/zephyr")
!144 = !{!145, !175, !180, !182}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !142, file: !143, line: 141, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "reset_api_status", file: !143, line: 114, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!148 = !DISubroutineType(types: !149)
!149 = !{!139, !150, !172, !174}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !153, line: 381, size: 160, elements: !154)
!153 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!154 = !{!155, !158, !161, !162, !171}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !153, line: 383, baseType: !156, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !152, file: !153, line: 385, baseType: !159, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !152, file: !153, line: 387, baseType: !159, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !152, file: !153, line: 389, baseType: !163, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !153, line: 354, size: 16, elements: !165)
!165 = !{!166, !169}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !164, file: !153, line: 362, baseType: !167, size: 8)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !168, line: 62, baseType: !14)
!168 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!169 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !164, file: !153, line: 367, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!170 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !153, line: 391, baseType: !138, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !168, line: 64, baseType: !173)
!173 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "line_assert", scope: !142, file: !143, line: 142, baseType: !176, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "reset_api_line_assert", file: !143, line: 121, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(types: !179)
!179 = !{!139, !150, !172}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "line_deassert", scope: !142, file: !143, line: 143, baseType: !181, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "reset_api_line_deassert", file: !143, line: 128, baseType: !177)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "line_toggle", scope: !142, file: !143, line: 144, baseType: !183, size: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "reset_api_line_toggle", file: !143, line: 135, baseType: !177)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !96, line: 334, size: 608, elements: !187)
!187 = !{!188, !193, !197, !201, !214, !219, !225, !230, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !186, file: !96, line: 363, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DISubroutineType(types: !191)
!191 = !{!139, !150, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !186, file: !96, line: 364, baseType: !194, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !150, !14}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !186, file: !96, line: 372, baseType: !198, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{!139, !150}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !186, file: !96, line: 376, baseType: !202, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DISubroutineType(types: !204)
!204 = !{!139, !150, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !96, line: 119, size: 64, elements: !208)
!208 = !{!209, !210, !211, !212, !213}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !207, file: !96, line: 120, baseType: !172, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !207, file: !96, line: 121, baseType: !167, size: 8, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !207, file: !96, line: 122, baseType: !167, size: 8, offset: 40)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !207, file: !96, line: 123, baseType: !167, size: 8, offset: 48)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !207, file: !96, line: 124, baseType: !167, size: 8, offset: 56)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !186, file: !96, line: 378, baseType: !215, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = !DISubroutineType(types: !217)
!217 = !{!139, !150, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !186, file: !96, line: 384, baseType: !220, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = !DISubroutineType(types: !222)
!222 = !{!139, !150, !223, !139}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !186, file: !96, line: 393, baseType: !226, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DISubroutineType(types: !228)
!228 = !{!139, !150, !174, !229}
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !186, file: !96, line: 402, baseType: !231, size: 32, offset: 224)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !150}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !186, file: !96, line: 405, baseType: !231, size: 32, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !186, file: !96, line: 408, baseType: !198, size: 32, offset: 288)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !186, file: !96, line: 411, baseType: !231, size: 32, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !186, file: !96, line: 414, baseType: !231, size: 32, offset: 352)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !186, file: !96, line: 417, baseType: !198, size: 32, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !186, file: !96, line: 420, baseType: !198, size: 32, offset: 416)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !186, file: !96, line: 423, baseType: !231, size: 32, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !186, file: !96, line: 426, baseType: !231, size: 32, offset: 480)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !186, file: !96, line: 429, baseType: !198, size: 32, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !186, file: !96, line: 432, baseType: !198, size: 32, offset: 544)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !186, file: !96, line: 435, baseType: !245, size: 32, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !150, !248, !138}
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !96, line: 139, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !150, !138}
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !168, line: 63, baseType: !253)
!253 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "USART_TypeDef", file: !256, line: 580, baseType: !257)
!256 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !256, line: 565, size: 352, elements: !258)
!258 = !{!259, !261, !262, !263, !264, !265, !266, !267, !268, !269, !271, !272, !273}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !257, file: !256, line: 567, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !172)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !257, file: !256, line: 568, baseType: !260, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "CR3", scope: !257, file: !256, line: 569, baseType: !260, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !257, file: !256, line: 570, baseType: !260, size: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "GTPR", scope: !257, file: !256, line: 571, baseType: !260, size: 32, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "RTOR", scope: !257, file: !256, line: 572, baseType: !260, size: 32, offset: 160)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "RQR", scope: !257, file: !256, line: 573, baseType: !260, size: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !257, file: !256, line: 574, baseType: !260, size: 32, offset: 224)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ICR", scope: !257, file: !256, line: 575, baseType: !260, size: 32, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "RDR", scope: !257, file: !256, line: 576, baseType: !270, size: 16, offset: 288)
!270 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !252)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !257, file: !256, line: 577, baseType: !252, size: 16, offset: 304)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "TDR", scope: !257, file: !256, line: 578, baseType: !270, size: 16, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !257, file: !256, line: 579, baseType: !252, size: 16, offset: 336)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !131, line: 56, baseType: !138)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !131, line: 100, size: 224, elements: !278)
!278 = !{!279, !284, !285, !294, !300, !305, !311}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !277, file: !131, line: 101, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !131, line: 76, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DISubroutineType(types: !283)
!283 = !{!139, !150, !274}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !277, file: !131, line: 102, baseType: !280, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !277, file: !131, line: 103, baseType: !286, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !131, line: 83, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{!139, !150, !274, !290, !138}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !131, line: 72, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !150, !274, !138}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !277, file: !131, line: 104, baseType: !295, size: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !131, line: 79, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DISubroutineType(types: !298)
!298 = !{!139, !150, !274, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !277, file: !131, line: 105, baseType: !301, size: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !131, line: 88, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DISubroutineType(types: !304)
!304 = !{!130, !150, !274}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !277, file: !131, line: 106, baseType: !306, size: 32, offset: 160)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !131, line: 92, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DISubroutineType(types: !309)
!309 = !{!139, !150, !274, !310}
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !131, line: 64, baseType: !138)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !277, file: !131, line: 107, baseType: !312, size: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !131, line: 96, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = !DISubroutineType(types: !315)
!315 = !{!139, !150, !274, !138}
!316 = !{!0, !317, !319, !334, !7, !336, !347, !370, !373, !378, !391, !393, !402}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "__device_dts_ord_52", scope: !9, file: !2, line: 2337, type: !151, isLocal: false, isDefinition: true, align: 32)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_52", scope: !9, file: !2, line: 2337, type: !321, isLocal: true, isDefinition: true, align: 32)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !323, line: 92, size: 64, elements: !324)
!323 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!324 = !{!325, !333}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !322, file: !323, line: 94, baseType: !326, size: 32)
!326 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !323, line: 59, size: 32, elements: !327)
!327 = !{!328, !332}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !326, file: !323, line: 66, baseType: !329, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DISubroutineType(types: !331)
!331 = !{!139}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !326, file: !323, line: 75, baseType: !198, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !322, file: !323, line: 99, baseType: !150, size: 32, offset: 32)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_52", scope: !9, file: !2, line: 2337, type: !164, isLocal: true, isDefinition: true, align: 8)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "pclken_0", scope: !9, file: !2, line: 2337, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 64, elements: !345)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !341, line: 396, size: 64, elements: !342)
!341 = !DIFile(filename: "include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/sri/zephyrproject/zephyr")
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !340, file: !341, line: 397, baseType: !172, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !340, file: !341, line: 398, baseType: !172, size: 32, offset: 32)
!345 = !{!346}
!346 = !DISubrange(count: 1)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_52", scope: !9, file: !2, line: 2337, type: !349, isLocal: true, isDefinition: true)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_dev_config", file: !351, line: 60, size: 64, elements: !352)
!351 = !DIFile(filename: "include/zephyr/drivers/pinctrl.h", directory: "/home/sri/zephyrproject/zephyr")
!352 = !{!353, !369}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !350, file: !351, line: 69, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_state", file: !351, line: 50, size: 64, elements: !357)
!357 = !{!358, !367, !368}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pins", scope: !356, file: !351, line: 52, baseType: !359, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "pinctrl_soc_pin_t", file: !362, line: 37, baseType: !363)
!362 = !DIFile(filename: "soc/arm/st_stm32/common/pinctrl_soc.h", directory: "/home/sri/zephyrproject/zephyr")
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_soc_pin", file: !362, line: 32, size: 64, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pinmux", scope: !363, file: !362, line: 34, baseType: !172, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pincfg", scope: !363, file: !362, line: 36, baseType: !172, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pin_cnt", scope: !356, file: !351, line: 54, baseType: !167, size: 8, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !356, file: !351, line: 56, baseType: !167, size: 8, offset: 40)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "state_cnt", scope: !350, file: !351, line: 71, baseType: !167, size: 8, offset: 32)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "__pinctrl_states__device_dts_ord_52", scope: !9, file: !2, line: 2337, type: !372, isLocal: true, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 64, elements: !345)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "__pinctrl_state_pins_0__device_dts_ord_52", scope: !9, file: !2, line: 2337, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 128, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 2)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "__isr_uart_stm32_isr_irq_0", scope: !380, file: !2, line: 2337, type: !383, isLocal: true, isDefinition: true, align: 32)
!380 = distinct !DISubprogram(name: "uart_stm32_irq_config_func_0", scope: !2, file: !2, line: 2337, type: !232, scopeLine: 2337, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !381)
!381 = !{!382}
!382 = !DILocalVariable(name: "dev", arg: 1, scope: !380, file: !2, line: 2337, type: !150)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !384, line: 53, size: 128, elements: !385)
!384 = !DIFile(filename: "include/zephyr/sw_isr_table.h", directory: "/home/sri/zephyrproject/zephyr")
!385 = !{!386, !388, !389, !390}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !383, file: !384, line: 55, baseType: !387, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !168, line: 58, baseType: !139)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !383, file: !384, line: 57, baseType: !387, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !383, file: !384, line: 59, baseType: !138, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !383, file: !384, line: 61, baseType: !159, size: 32, offset: 96)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "uart_stm32_driver_api", scope: !9, file: !2, line: 1798, type: !185, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "uart_stm32_data_0", scope: !9, file: !2, line: 2337, type: !395, isLocal: true, isDefinition: true)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_stm32_data", file: !396, line: 86, size: 128, elements: !397)
!396 = !DIFile(filename: "drivers/serial/uart_stm32.h", directory: "/home/sri/zephyrproject/zephyr")
!397 = !{!398, !399, !400, !401}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !395, file: !396, line: 88, baseType: !150, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "uart_cfg", scope: !395, file: !396, line: 90, baseType: !218, size: 32, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "user_cb", scope: !395, file: !396, line: 92, baseType: !248, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !395, file: !396, line: 93, baseType: !138, size: 32, offset: 96)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "uart_cfg_0", scope: !9, file: !2, line: 2337, type: !207, isLocal: true, isDefinition: true)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_stm32_config", file: !396, line: 27, size: 288, elements: !406)
!406 = !{!407, !408, !414, !416, !419, !420, !421, !422, !423, !424, !425, !426, !427, !429}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "usart", scope: !405, file: !396, line: 29, baseType: !254, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !405, file: !396, line: 31, baseType: !409, size: 64, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reset_dt_spec", file: !143, line: 32, size: 64, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !410, file: !143, line: 34, baseType: !150, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !410, file: !143, line: 36, baseType: !172, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pclken", scope: !405, file: !396, line: 33, baseType: !415, size: 32, offset: 96)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pclk_len", scope: !405, file: !396, line: 35, baseType: !417, size: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !418, line: 46, baseType: !173)
!418 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!419 = !DIDerivedType(tag: DW_TAG_member, name: "single_wire", scope: !405, file: !396, line: 37, baseType: !170, size: 8, offset: 160)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tx_rx_swap", scope: !405, file: !396, line: 39, baseType: !170, size: 8, offset: 168)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "rx_invert", scope: !405, file: !396, line: 41, baseType: !170, size: 8, offset: 176)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tx_invert", scope: !405, file: !396, line: 43, baseType: !170, size: 8, offset: 184)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "de_enable", scope: !405, file: !396, line: 45, baseType: !170, size: 8, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "de_assert_time", scope: !405, file: !396, line: 47, baseType: !167, size: 8, offset: 200)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "de_deassert_time", scope: !405, file: !396, line: 49, baseType: !167, size: 8, offset: 208)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "de_invert", scope: !405, file: !396, line: 51, baseType: !170, size: 8, offset: 216)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pcfg", scope: !405, file: !396, line: 53, baseType: !428, size: 32, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "irq_config_func", scope: !405, file: !396, line: 56, baseType: !430, size: 32, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_config_func_t", file: !96, line: 147, baseType: !231)
!431 = !{i32 7, !"Dwarf Version", i32 4}
!432 = !{i32 2, !"Debug Info Version", i32 3}
!433 = !{i32 1, !"wchar_size", i32 4}
!434 = !{i32 1, !"static_rwdata", i32 1}
!435 = !{i32 1, !"enumsize_buildattr", i32 1}
!436 = !{i32 1, !"armlib_unavailable", i32 0}
!437 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!438 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !13, file: !13, line: 223, type: !439, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !550)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !159, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !443, line: 250, size: 896, elements: !444)
!443 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!444 = !{!445, !510, !523, !524, !525, !526, !545}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !442, file: !443, line: 252, baseType: !446, size: 384)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !443, line: 58, size: 384, elements: !447)
!447 = !{!448, !474, !482, !483, !484, !495, !496, !497}
!448 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !443, line: 61, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !446, file: !443, line: 61, size: 64, elements: !450)
!450 = !{!451, !467}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !449, file: !443, line: 62, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !453, line: 55, baseType: !454)
!453 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !453, line: 37, size: 64, elements: !455)
!455 = !{!456, !462}
!456 = !DIDerivedType(tag: DW_TAG_member, scope: !454, file: !453, line: 38, baseType: !457, size: 32)
!457 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !454, file: !453, line: 38, size: 32, elements: !458)
!458 = !{!459, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !457, file: !453, line: 39, baseType: !460, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !453, line: 40, baseType: !460, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, scope: !454, file: !453, line: 42, baseType: !463, size: 32, offset: 32)
!463 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !454, file: !453, line: 42, size: 32, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !463, file: !453, line: 43, baseType: !460, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !463, file: !453, line: 44, baseType: !460, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !449, file: !443, line: 63, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !469, line: 58, size: 64, elements: !470)
!469 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!470 = !{!471}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !468, file: !469, line: 60, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 64, elements: !376)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !446, file: !443, line: 69, baseType: !475, size: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !477, line: 243, baseType: !478)
!477 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 241, size: 64, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !478, file: !477, line: 242, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !453, line: 51, baseType: !454)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !446, file: !443, line: 72, baseType: !167, size: 8, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !446, file: !443, line: 75, baseType: !167, size: 8, offset: 104)
!484 = !DIDerivedType(tag: DW_TAG_member, scope: !446, file: !443, line: 91, baseType: !485, size: 16, offset: 112)
!485 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !446, file: !443, line: 91, size: 16, elements: !486)
!486 = !{!487, !494}
!487 = !DIDerivedType(tag: DW_TAG_member, scope: !485, file: !443, line: 92, baseType: !488, size: 16)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !485, file: !443, line: 92, size: 16, elements: !489)
!489 = !{!490, !493}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !488, file: !443, line: 97, baseType: !491, size: 8)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !168, line: 56, baseType: !492)
!492 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !488, file: !443, line: 98, baseType: !167, size: 8, offset: 8)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !485, file: !443, line: 101, baseType: !252, size: 16)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !446, file: !443, line: 108, baseType: !172, size: 32, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !446, file: !443, line: 132, baseType: !138, size: 32, offset: 160)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !446, file: !443, line: 136, baseType: !498, size: 192, offset: 192)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !477, line: 254, size: 192, elements: !499)
!499 = !{!500, !501, !507}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !498, file: !477, line: 255, baseType: !452, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !498, file: !477, line: 256, baseType: !502, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !477, line: 252, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !506}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !498, file: !477, line: 259, baseType: !508, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !168, line: 59, baseType: !509)
!509 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !442, file: !443, line: 255, baseType: !511, size: 288, offset: 384)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !512, line: 25, size: 288, elements: !513)
!512 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521, !522}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !511, file: !512, line: 26, baseType: !172, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !511, file: !512, line: 27, baseType: !172, size: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !511, file: !512, line: 28, baseType: !172, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !511, file: !512, line: 29, baseType: !172, size: 32, offset: 96)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !511, file: !512, line: 30, baseType: !172, size: 32, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !511, file: !512, line: 31, baseType: !172, size: 32, offset: 160)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !511, file: !512, line: 32, baseType: !172, size: 32, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !511, file: !512, line: 33, baseType: !172, size: 32, offset: 224)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !511, file: !512, line: 34, baseType: !172, size: 32, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !442, file: !443, line: 258, baseType: !138, size: 32, offset: 672)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !442, file: !443, line: 261, baseType: !476, size: 64, offset: 704)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !442, file: !443, line: 302, baseType: !139, size: 32, offset: 768)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !442, file: !443, line: 333, baseType: !527, size: 32, offset: 800)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !529, line: 5291, size: 160, elements: !530)
!529 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!530 = !{!531, !540, !541}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !528, file: !529, line: 5292, baseType: !532, size: 96)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !533, line: 56, size: 96, elements: !534)
!533 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!534 = !{!535, !538, !539}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !532, file: !533, line: 57, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !533, line: 57, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !532, file: !533, line: 58, baseType: !138, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !532, file: !533, line: 59, baseType: !417, size: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !528, file: !529, line: 5293, baseType: !476, size: 64, offset: 96)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !528, file: !529, line: 5294, baseType: !542, offset: 160)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !543, line: 45, elements: !544)
!543 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!544 = !{}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !442, file: !443, line: 355, baseType: !546, size: 64, offset: 832)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !512, line: 60, size: 64, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !546, file: !512, line: 63, baseType: !172, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !546, file: !512, line: 66, baseType: !172, size: 32, offset: 32)
!550 = !{!551, !552}
!551 = !DILocalVariable(name: "object", arg: 1, scope: !438, file: !13, line: 223, type: !159)
!552 = !DILocalVariable(name: "thread", arg: 2, scope: !438, file: !13, line: 224, type: !441)
!553 = !DILocation(line: 223, column: 61, scope: !438)
!554 = !DILocation(line: 224, column: 24, scope: !438)
!555 = !DILocation(line: 226, column: 9, scope: !438)
!556 = !DILocation(line: 227, column: 9, scope: !438)
!557 = !DILocation(line: 228, column: 1, scope: !438)
!558 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !13, file: !13, line: 243, type: !559, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !561)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !159}
!561 = !{!562}
!562 = !DILocalVariable(name: "object", arg: 1, scope: !558, file: !13, line: 243, type: !159)
!563 = !DILocation(line: 243, column: 56, scope: !558)
!564 = !DILocation(line: 245, column: 9, scope: !558)
!565 = !DILocation(line: 246, column: 1, scope: !558)
!566 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !13, file: !13, line: 359, type: !567, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !569)
!567 = !DISubroutineType(types: !568)
!568 = !{!138, !12}
!569 = !{!570}
!570 = !DILocalVariable(name: "otype", arg: 1, scope: !566, file: !13, line: 359, type: !12)
!571 = !DILocation(line: 359, column: 58, scope: !566)
!572 = !DILocation(line: 361, column: 9, scope: !566)
!573 = !DILocation(line: 363, column: 2, scope: !566)
!574 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !13, file: !13, line: 366, type: !575, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !577)
!575 = !DISubroutineType(types: !576)
!576 = !{!138, !12, !417}
!577 = !{!578, !579}
!578 = !DILocalVariable(name: "otype", arg: 1, scope: !574, file: !13, line: 366, type: !12)
!579 = !DILocalVariable(name: "size", arg: 2, scope: !574, file: !13, line: 367, type: !417)
!580 = !DILocation(line: 366, column: 63, scope: !574)
!581 = !DILocation(line: 367, column: 13, scope: !574)
!582 = !DILocation(line: 369, column: 9, scope: !574)
!583 = !DILocation(line: 370, column: 9, scope: !574)
!584 = !DILocation(line: 372, column: 2, scope: !574)
!585 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !529, file: !529, line: 656, type: !586, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !592)
!586 = !DISubroutineType(types: !587)
!587 = !{!588, !590}
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !589, line: 46, baseType: !508)
!589 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!592 = !{!593}
!593 = !DILocalVariable(name: "t", arg: 1, scope: !585, file: !529, line: 657, type: !590)
!594 = !DILocation(line: 657, column: 30, scope: !585)
!595 = !DILocation(line: 659, column: 28, scope: !585)
!596 = !DILocation(line: 659, column: 31, scope: !585)
!597 = !DILocation(line: 659, column: 36, scope: !585)
!598 = !DILocation(line: 659, column: 9, scope: !585)
!599 = !DILocation(line: 659, column: 2, scope: !585)
!600 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !529, file: !529, line: 671, type: !586, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !601)
!601 = !{!602}
!602 = !DILocalVariable(name: "t", arg: 1, scope: !600, file: !529, line: 672, type: !590)
!603 = !DILocation(line: 672, column: 30, scope: !600)
!604 = !DILocation(line: 674, column: 30, scope: !600)
!605 = !DILocation(line: 674, column: 33, scope: !600)
!606 = !DILocation(line: 674, column: 38, scope: !600)
!607 = !DILocation(line: 674, column: 9, scope: !600)
!608 = !DILocation(line: 674, column: 2, scope: !600)
!609 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !529, file: !529, line: 1634, type: !610, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !631)
!610 = !DISubroutineType(types: !611)
!611 = !{!588, !612}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !529, line: 1439, size: 448, elements: !615)
!615 = !{!616, !617, !618, !623, !624, !629, !630}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !614, file: !529, line: 1445, baseType: !498, size: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !614, file: !529, line: 1448, baseType: !476, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !614, file: !529, line: 1451, baseType: !619, size: 32, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !622}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !614, file: !529, line: 1454, baseType: !619, size: 32, offset: 288)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !614, file: !529, line: 1457, baseType: !625, size: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !589, line: 67, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !589, line: 65, size: 64, elements: !627)
!627 = !{!628}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !626, file: !589, line: 66, baseType: !588, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !614, file: !529, line: 1460, baseType: !172, size: 32, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !614, file: !529, line: 1463, baseType: !138, size: 32, offset: 416)
!631 = !{!632}
!632 = !DILocalVariable(name: "timer", arg: 1, scope: !609, file: !529, line: 1635, type: !612)
!633 = !DILocation(line: 1635, column: 34, scope: !609)
!634 = !DILocation(line: 1637, column: 28, scope: !609)
!635 = !DILocation(line: 1637, column: 35, scope: !609)
!636 = !DILocation(line: 1637, column: 9, scope: !609)
!637 = !DILocation(line: 1637, column: 2, scope: !609)
!638 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !529, file: !529, line: 1649, type: !610, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !639)
!639 = !{!640}
!640 = !DILocalVariable(name: "timer", arg: 1, scope: !638, file: !529, line: 1650, type: !612)
!641 = !DILocation(line: 1650, column: 34, scope: !638)
!642 = !DILocation(line: 1652, column: 30, scope: !638)
!643 = !DILocation(line: 1652, column: 37, scope: !638)
!644 = !DILocation(line: 1652, column: 9, scope: !638)
!645 = !DILocation(line: 1652, column: 2, scope: !638)
!646 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !529, file: !529, line: 1689, type: !647, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !649)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !622, !138}
!649 = !{!650, !651}
!650 = !DILocalVariable(name: "timer", arg: 1, scope: !646, file: !529, line: 1689, type: !622)
!651 = !DILocalVariable(name: "user_data", arg: 2, scope: !646, file: !529, line: 1690, type: !138)
!652 = !DILocation(line: 1689, column: 65, scope: !646)
!653 = !DILocation(line: 1690, column: 19, scope: !646)
!654 = !DILocation(line: 1692, column: 21, scope: !646)
!655 = !DILocation(line: 1692, column: 2, scope: !646)
!656 = !DILocation(line: 1692, column: 9, scope: !646)
!657 = !DILocation(line: 1692, column: 19, scope: !646)
!658 = !DILocation(line: 1693, column: 1, scope: !646)
!659 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !529, file: !529, line: 1704, type: !660, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !662)
!660 = !DISubroutineType(types: !661)
!661 = !{!138, !612}
!662 = !{!663}
!663 = !DILocalVariable(name: "timer", arg: 1, scope: !659, file: !529, line: 1704, type: !612)
!664 = !DILocation(line: 1704, column: 72, scope: !659)
!665 = !DILocation(line: 1706, column: 9, scope: !659)
!666 = !DILocation(line: 1706, column: 16, scope: !659)
!667 = !DILocation(line: 1706, column: 2, scope: !659)
!668 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !529, file: !529, line: 2071, type: !669, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !689)
!669 = !DISubroutineType(types: !670)
!670 = !{!139, !671}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !529, line: 1830, size: 128, elements: !673)
!673 = !{!674, !687, !688}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !672, file: !529, line: 1831, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !676, line: 60, baseType: !677)
!676 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !676, line: 53, size: 64, elements: !678)
!678 = !{!679, !686}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !677, file: !676, line: 54, baseType: !680, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !676, line: 50, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !676, line: 44, size: 32, elements: !683)
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !682, file: !676, line: 45, baseType: !685, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !676, line: 40, baseType: !172)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !677, file: !676, line: 55, baseType: !680, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !672, file: !529, line: 1832, baseType: !542, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !672, file: !529, line: 1833, baseType: !476, size: 64, offset: 64)
!689 = !{!690}
!690 = !DILocalVariable(name: "queue", arg: 1, scope: !668, file: !529, line: 2071, type: !671)
!691 = !DILocation(line: 2071, column: 59, scope: !668)
!692 = !DILocation(line: 2073, column: 35, scope: !668)
!693 = !DILocation(line: 2073, column: 42, scope: !668)
!694 = !DILocation(line: 2073, column: 14, scope: !668)
!695 = !DILocation(line: 2073, column: 9, scope: !668)
!696 = !DILocation(line: 2073, column: 2, scope: !668)
!697 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !529, file: !529, line: 3209, type: !698, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !706)
!698 = !DISubroutineType(types: !699)
!699 = !{!173, !700}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 32)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !529, line: 3092, size: 128, elements: !702)
!702 = !{!703, !704, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !701, file: !529, line: 3093, baseType: !476, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !701, file: !529, line: 3094, baseType: !173, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !701, file: !529, line: 3095, baseType: !173, size: 32, offset: 96)
!706 = !{!707}
!707 = !DILocalVariable(name: "sem", arg: 1, scope: !697, file: !529, line: 3209, type: !700)
!708 = !DILocation(line: 3209, column: 65, scope: !697)
!709 = !DILocation(line: 3211, column: 9, scope: !697)
!710 = !DILocation(line: 3211, column: 14, scope: !697)
!711 = !DILocation(line: 3211, column: 2, scope: !697)
!712 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !529, file: !529, line: 4649, type: !713, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !729)
!713 = !DISubroutineType(types: !714)
!714 = !{!172, !715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 32)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !529, line: 4390, size: 320, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !724, !725, !726, !727, !728}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !716, file: !529, line: 4392, baseType: !476, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !716, file: !529, line: 4394, baseType: !542, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !716, file: !529, line: 4396, baseType: !417, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !716, file: !529, line: 4398, baseType: !172, size: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !716, file: !529, line: 4400, baseType: !723, size: 32, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !716, file: !529, line: 4402, baseType: !723, size: 32, offset: 160)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !716, file: !529, line: 4404, baseType: !723, size: 32, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !716, file: !529, line: 4406, baseType: !723, size: 32, offset: 224)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !716, file: !529, line: 4408, baseType: !172, size: 32, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !716, file: !529, line: 4413, baseType: !167, size: 8, offset: 288)
!729 = !{!730}
!730 = !DILocalVariable(name: "msgq", arg: 1, scope: !712, file: !529, line: 4649, type: !715)
!731 = !DILocation(line: 4649, column: 66, scope: !712)
!732 = !DILocation(line: 4651, column: 9, scope: !712)
!733 = !DILocation(line: 4651, column: 15, scope: !712)
!734 = !DILocation(line: 4651, column: 26, scope: !712)
!735 = !DILocation(line: 4651, column: 32, scope: !712)
!736 = !DILocation(line: 4651, column: 24, scope: !712)
!737 = !DILocation(line: 4651, column: 2, scope: !712)
!738 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !529, file: !529, line: 4665, type: !713, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !739)
!739 = !{!740}
!740 = !DILocalVariable(name: "msgq", arg: 1, scope: !738, file: !529, line: 4665, type: !715)
!741 = !DILocation(line: 4665, column: 66, scope: !738)
!742 = !DILocation(line: 4667, column: 9, scope: !738)
!743 = !DILocation(line: 4667, column: 15, scope: !738)
!744 = !DILocation(line: 4667, column: 2, scope: !738)
!745 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !153, file: !153, line: 744, type: !746, scopeLine: 745, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !748)
!746 = !DISubroutineType(types: !747)
!747 = !{!170, !150}
!748 = !{!749}
!749 = !DILocalVariable(name: "dev", arg: 1, scope: !745, file: !153, line: 744, type: !150)
!750 = !DILocation(line: 744, column: 65, scope: !745)
!751 = !DILocation(line: 746, column: 27, scope: !745)
!752 = !DILocation(line: 746, column: 9, scope: !745)
!753 = !DILocation(line: 746, column: 2, scope: !745)
!754 = distinct !DISubprogram(name: "z_impl_reset_status", scope: !143, file: !143, line: 164, type: !148, scopeLine: 165, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !755)
!755 = !{!756, !757, !758, !759}
!756 = !DILocalVariable(name: "dev", arg: 1, scope: !754, file: !143, line: 164, type: !150)
!757 = !DILocalVariable(name: "id", arg: 2, scope: !754, file: !143, line: 164, type: !172)
!758 = !DILocalVariable(name: "status", arg: 3, scope: !754, file: !143, line: 164, type: !174)
!759 = !DILocalVariable(name: "api", scope: !754, file: !143, line: 166, type: !140)
!760 = !DILocation(line: 164, column: 60, scope: !754)
!761 = !DILocation(line: 164, column: 74, scope: !754)
!762 = !DILocation(line: 164, column: 87, scope: !754)
!763 = !DILocation(line: 166, column: 2, scope: !754)
!764 = !DILocation(line: 166, column: 33, scope: !754)
!765 = !DILocation(line: 166, column: 72, scope: !754)
!766 = !DILocation(line: 166, column: 77, scope: !754)
!767 = !DILocation(line: 168, column: 6, scope: !768)
!768 = distinct !DILexicalBlock(scope: !754, file: !143, line: 168, column: 6)
!769 = !DILocation(line: 168, column: 11, scope: !768)
!770 = !DILocation(line: 168, column: 18, scope: !768)
!771 = !DILocation(line: 168, column: 6, scope: !754)
!772 = !DILocation(line: 169, column: 3, scope: !773)
!773 = distinct !DILexicalBlock(scope: !768, file: !143, line: 168, column: 33)
!774 = !DILocation(line: 172, column: 9, scope: !754)
!775 = !DILocation(line: 172, column: 14, scope: !754)
!776 = !DILocation(line: 172, column: 21, scope: !754)
!777 = !DILocation(line: 172, column: 26, scope: !754)
!778 = !DILocation(line: 172, column: 30, scope: !754)
!779 = !DILocation(line: 172, column: 2, scope: !754)
!780 = !DILocation(line: 173, column: 1, scope: !754)
