; ModuleID = '../bc_files/uart_stm32.bc'
source_filename = "/home/sri/zephyrproject/zephyr/drivers/serial/uart_stm32.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.log_source_const_data = type { ptr, i8 }
%struct.uart_stm32_config = type { ptr, %struct.reset_dt_spec, ptr, i32, i8, i8, i8, i8, i8, i8, i8, i8, ptr, ptr }
%struct.reset_dt_spec = type { ptr, i32 }
%struct.uart_driver_api = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.device_state = type { i8, i8 }
%struct.uart_stm32_data = type { ptr, ptr, ptr, ptr }
%struct.device = type { ptr, ptr, ptr, ptr, ptr }
%struct.init_entry = type { %union.init_function, ptr }
%union.init_function = type { ptr }
%struct.stm32_pclken = type { i32, i32 }
%struct.pinctrl_dev_config = type { ptr, i8 }
%struct.pinctrl_state = type { ptr, i8, i8 }
%struct.pinctrl_soc_pin = type { i32, i32 }
%struct._isr_list = type { i32, i32, ptr, ptr }
%struct.uart_config = type { i32, i8, i8, i8, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }

!82 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!94 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !96, line: 47, baseType: !14, size: 8, elements: !97)
!96 = !DIFile(filename: "include/zephyr/drivers/uart.h", directory: "/home/sri/zephyrproject/zephyr")
!97 = !{!98, !99, !100, !101, !102, !103}
!98 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!99 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!100 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!101 = !DIEnumerator(name: "UART_BREAK", value: 8)
!102 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!103 = !DIEnumerator(name: "UART_ERROR_NOISE", value: 32)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !96, line: 77, baseType: !14, size: 8, elements: !105)
!105 = !{!106, !107, !108, !109, !110}
!106 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!107 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!108 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!109 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!110 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !96, line: 94, baseType: !14, size: 8, elements: !112)
!112 = !{!113, !114, !115, !116, !117}
!113 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!114 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!115 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!116 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!117 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !96, line: 109, baseType: !14, size: 8, elements: !119)
!119 = !{!120, !121, !122, !123}
!120 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!121 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!122 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!123 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RS485", value: 3)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !96, line: 86, baseType: !14, size: 8, elements: !125)
!125 = !{!126, !127, !128, !129}
!126 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!127 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!128 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!129 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !131, line: 128, baseType: !14, size: 8, elements: !132)
!131 = !DIFile(filename: "include/zephyr/logging/log_msg.h", directory: "/home/sri/zephyrproject/zephyr")
!132 = !{!133, !134, !135}
!133 = !DIEnumerator(name: "Z_LOG_MSG_MODE_RUNTIME", value: 0)
!134 = !DIEnumerator(name: "Z_LOG_MSG_MODE_FROM_STACK", value: 1)
!135 = !DIEnumerator(name: "Z_LOG_MSG_MODE_ZERO_COPY", value: 2)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !137, line: 44, baseType: !14, size: 8, elements: !138)
!137 = !DIFile(filename: "include/zephyr/drivers/clock_control.h", directory: "/home/sri/zephyrproject/zephyr")
!138 = !{!139, !140, !141, !142}
!139 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!140 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!141 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!142 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!143 = !{!144, !145, !146, !190, !14, !198, !173, !258, !180, !260, !280, !281, !178, !165, !229}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!145 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reset_driver_api", file: !149, line: 140, size: 128, elements: !150)
!149 = !DIFile(filename: "include/zephyr/drivers/reset.h", directory: "/home/sri/zephyrproject/zephyr")
!150 = !{!151, !181, !186, !188}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !148, file: !149, line: 141, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "reset_api_status", file: !149, line: 114, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DISubroutineType(types: !155)
!155 = !{!145, !156, !178, !180}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !159, line: 381, size: 160, elements: !160)
!159 = !DIFile(filename: "include/zephyr/device.h", directory: "/home/sri/zephyrproject/zephyr")
!160 = !{!161, !164, !167, !168, !177}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !158, file: !159, line: 383, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !158, file: !159, line: 385, baseType: !165, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !158, file: !159, line: 387, baseType: !165, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !158, file: !159, line: 389, baseType: !169, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !159, line: 354, size: 16, elements: !171)
!171 = !{!172, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !170, file: !159, line: 362, baseType: !173, size: 8)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !174, line: 62, baseType: !14)
!174 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!175 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !170, file: !159, line: 367, baseType: !176, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!176 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !158, file: !159, line: 391, baseType: !144, size: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !174, line: 64, baseType: !179)
!179 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "line_assert", scope: !148, file: !149, line: 142, baseType: !182, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "reset_api_line_assert", file: !149, line: 121, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{!145, !156, !178}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "line_deassert", scope: !148, file: !149, line: 143, baseType: !187, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "reset_api_line_deassert", file: !149, line: 128, baseType: !183)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "line_toggle", scope: !148, file: !149, line: 144, baseType: !189, size: 32, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "reset_api_line_toggle", file: !149, line: 135, baseType: !183)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !96, line: 334, size: 608, elements: !193)
!193 = !{!194, !199, !203, !207, !220, !225, !231, !236, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !192, file: !96, line: 363, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!196 = !DISubroutineType(types: !197)
!197 = !{!145, !156, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !192, file: !96, line: 364, baseType: !200, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !156, !14}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !192, file: !96, line: 372, baseType: !204, size: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DISubroutineType(types: !206)
!206 = !{!145, !156}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !192, file: !96, line: 376, baseType: !208, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DISubroutineType(types: !210)
!210 = !{!145, !156, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !96, line: 119, size: 64, elements: !214)
!214 = !{!215, !216, !217, !218, !219}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !213, file: !96, line: 120, baseType: !178, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !213, file: !96, line: 121, baseType: !173, size: 8, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !213, file: !96, line: 122, baseType: !173, size: 8, offset: 40)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !213, file: !96, line: 123, baseType: !173, size: 8, offset: 48)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !213, file: !96, line: 124, baseType: !173, size: 8, offset: 56)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !192, file: !96, line: 378, baseType: !221, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DISubroutineType(types: !223)
!223 = !{!145, !156, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !192, file: !96, line: 384, baseType: !226, size: 32, offset: 160)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DISubroutineType(types: !228)
!228 = !{!145, !156, !229, !145}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !192, file: !96, line: 393, baseType: !232, size: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DISubroutineType(types: !234)
!234 = !{!145, !156, !180, !235}
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !192, file: !96, line: 402, baseType: !237, size: 32, offset: 224)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !156}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !192, file: !96, line: 405, baseType: !237, size: 32, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !192, file: !96, line: 408, baseType: !204, size: 32, offset: 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !192, file: !96, line: 411, baseType: !237, size: 32, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !192, file: !96, line: 414, baseType: !237, size: 32, offset: 352)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !192, file: !96, line: 417, baseType: !204, size: 32, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !192, file: !96, line: 420, baseType: !204, size: 32, offset: 416)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !192, file: !96, line: 423, baseType: !237, size: 32, offset: 448)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !192, file: !96, line: 426, baseType: !237, size: 32, offset: 480)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !192, file: !96, line: 429, baseType: !204, size: 32, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !192, file: !96, line: 432, baseType: !204, size: 32, offset: 544)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !192, file: !96, line: 435, baseType: !251, size: 32, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !156, !254, !144}
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !96, line: 139, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !156, !144}
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !174, line: 63, baseType: !259)
!259 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "USART_TypeDef", file: !262, line: 580, baseType: !263)
!262 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f0xx/soc/stm32f091xc.h", directory: "/home/sri/zephyrproject")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 565, size: 352, elements: !264)
!264 = !{!265, !267, !268, !269, !270, !271, !272, !273, !274, !275, !277, !278, !279}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !263, file: !262, line: 567, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !178)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !263, file: !262, line: 568, baseType: !266, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "CR3", scope: !263, file: !262, line: 569, baseType: !266, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !263, file: !262, line: 570, baseType: !266, size: 32, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "GTPR", scope: !263, file: !262, line: 571, baseType: !266, size: 32, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "RTOR", scope: !263, file: !262, line: 572, baseType: !266, size: 32, offset: 160)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "RQR", scope: !263, file: !262, line: 573, baseType: !266, size: 32, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !263, file: !262, line: 574, baseType: !266, size: 32, offset: 224)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ICR", scope: !263, file: !262, line: 575, baseType: !266, size: 32, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "RDR", scope: !263, file: !262, line: 576, baseType: !276, size: 16, offset: 288)
!276 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !258)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !263, file: !262, line: 577, baseType: !258, size: 16, offset: 304)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "TDR", scope: !263, file: !262, line: 578, baseType: !276, size: 16, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !263, file: !262, line: 579, baseType: !258, size: 16, offset: 336)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !137, line: 56, baseType: !144)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !137, line: 100, size: 224, elements: !284)
!284 = !{!285, !290, !291, !300, !306, !311, !317}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !283, file: !137, line: 101, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !137, line: 76, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{!145, !156, !280}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !283, file: !137, line: 102, baseType: !286, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !283, file: !137, line: 103, baseType: !292, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !137, line: 83, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = !DISubroutineType(types: !295)
!295 = !{!145, !156, !280, !296, !144}
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !137, line: 72, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !156, !280, !144}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !283, file: !137, line: 104, baseType: !301, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !137, line: 79, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DISubroutineType(types: !304)
!304 = !{!145, !156, !280, !305}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !283, file: !137, line: 105, baseType: !307, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !137, line: 88, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DISubroutineType(types: !310)
!310 = !{!136, !156, !280}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !283, file: !137, line: 106, baseType: !312, size: 32, offset: 160)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !137, line: 92, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = !DISubroutineType(types: !315)
!315 = !{!145, !156, !280, !316}
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !137, line: 64, baseType: !144)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !283, file: !137, line: 107, baseType: !318, size: 32, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !137, line: 96, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DISubroutineType(types: !321)
!321 = !{!145, !156, !280, !144}
!322 = !{!0, !7, !323, !328, !330, !345, !347, !404, !409, !411, !414, !419, !431, !433, !438, !447, !455, !457, !462, !467, !472}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2337, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 16)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "__device_dts_ord_52", scope: !9, file: !2, line: 2337, type: !157, isLocal: false, isDefinition: true, align: 32)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_52", scope: !9, file: !2, line: 2337, type: !332, isLocal: true, isDefinition: true, align: 32)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !334, line: 92, size: 64, elements: !335)
!334 = !DIFile(filename: "include/zephyr/init.h", directory: "/home/sri/zephyrproject/zephyr")
!335 = !{!336, !344}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "init_fn", scope: !333, file: !334, line: 94, baseType: !337, size: 32)
!337 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "init_function", file: !334, line: 59, size: 32, elements: !338)
!338 = !{!339, !343}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !337, file: !334, line: 66, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!341 = !DISubroutineType(types: !342)
!342 = !{!145}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !337, file: !334, line: 75, baseType: !204, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !333, file: !334, line: 99, baseType: !156, size: 32, offset: 32)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_52", scope: !9, file: !2, line: 2337, type: !170, isLocal: true, isDefinition: true, align: 8)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "uart_stm32_cfg_0", scope: !9, file: !2, line: 2337, type: !349, isLocal: true, isDefinition: true)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_stm32_config", file: !351, line: 27, size: 288, elements: !352)
!351 = !DIFile(filename: "drivers/serial/uart_stm32.h", directory: "/home/sri/zephyrproject/zephyr")
!352 = !{!353, !354, !360, !368, !371, !372, !373, !374, !375, !376, !377, !378, !379, !402}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "usart", scope: !350, file: !351, line: 29, baseType: !260, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !350, file: !351, line: 31, baseType: !355, size: 64, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reset_dt_spec", file: !149, line: 32, size: 64, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !356, file: !149, line: 34, baseType: !156, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !356, file: !149, line: 36, baseType: !178, size: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pclken", scope: !350, file: !351, line: 33, baseType: !361, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !364, line: 396, size: 64, elements: !365)
!364 = !DIFile(filename: "include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/sri/zephyrproject/zephyr")
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !363, file: !364, line: 397, baseType: !178, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !363, file: !364, line: 398, baseType: !178, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pclk_len", scope: !350, file: !351, line: 35, baseType: !369, size: 32, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !370, line: 46, baseType: !179)
!370 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!371 = !DIDerivedType(tag: DW_TAG_member, name: "single_wire", scope: !350, file: !351, line: 37, baseType: !176, size: 8, offset: 160)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tx_rx_swap", scope: !350, file: !351, line: 39, baseType: !176, size: 8, offset: 168)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "rx_invert", scope: !350, file: !351, line: 41, baseType: !176, size: 8, offset: 176)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tx_invert", scope: !350, file: !351, line: 43, baseType: !176, size: 8, offset: 184)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "de_enable", scope: !350, file: !351, line: 45, baseType: !176, size: 8, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "de_assert_time", scope: !350, file: !351, line: 47, baseType: !173, size: 8, offset: 200)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "de_deassert_time", scope: !350, file: !351, line: 49, baseType: !173, size: 8, offset: 208)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "de_invert", scope: !350, file: !351, line: 51, baseType: !176, size: 8, offset: 216)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pcfg", scope: !350, file: !351, line: 53, baseType: !380, size: 32, offset: 224)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_dev_config", file: !383, line: 60, size: 64, elements: !384)
!383 = !DIFile(filename: "include/zephyr/drivers/pinctrl.h", directory: "/home/sri/zephyrproject/zephyr")
!384 = !{!385, !401}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !382, file: !383, line: 69, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_state", file: !383, line: 50, size: 64, elements: !389)
!389 = !{!390, !399, !400}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pins", scope: !388, file: !383, line: 52, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "pinctrl_soc_pin_t", file: !394, line: 37, baseType: !395)
!394 = !DIFile(filename: "soc/arm/st_stm32/common/pinctrl_soc.h", directory: "/home/sri/zephyrproject/zephyr")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_soc_pin", file: !394, line: 32, size: 64, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pinmux", scope: !395, file: !394, line: 34, baseType: !178, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pincfg", scope: !395, file: !394, line: 36, baseType: !178, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pin_cnt", scope: !388, file: !383, line: 54, baseType: !173, size: 8, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !388, file: !383, line: 56, baseType: !173, size: 8, offset: 40)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "state_cnt", scope: !382, file: !383, line: 71, baseType: !173, size: 8, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "irq_config_func", scope: !350, file: !351, line: 56, baseType: !403, size: 32, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_config_func_t", file: !96, line: 147, baseType: !237)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "pclken_0", scope: !9, file: !2, line: 2337, type: !406, isLocal: true, isDefinition: true)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 64, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 1)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_52", scope: !9, file: !2, line: 2337, type: !381, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "__pinctrl_states__device_dts_ord_52", scope: !9, file: !2, line: 2337, type: !413, isLocal: true, isDefinition: true)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 64, elements: !407)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "__pinctrl_state_pins_0__device_dts_ord_52", scope: !9, file: !2, line: 2337, type: !416, isLocal: true, isDefinition: true)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 128, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 2)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "__isr_uart_stm32_isr_irq_0", scope: !421, file: !2, line: 2337, type: !423, isLocal: true, isDefinition: true, align: 32)
!421 = distinct !DISubprogram(name: "uart_stm32_irq_config_func_0", scope: !2, file: !2, line: 2337, type: !238, scopeLine: 2337, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!422 = !{}
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !424, line: 53, size: 128, elements: !425)
!424 = !DIFile(filename: "include/zephyr/sw_isr_table.h", directory: "/home/sri/zephyrproject/zephyr")
!425 = !{!426, !428, !429, !430}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !423, file: !424, line: 55, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !174, line: 58, baseType: !145)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !423, file: !424, line: 57, baseType: !427, size: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !423, file: !424, line: 59, baseType: !144, size: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !423, file: !424, line: 61, baseType: !165, size: 32, offset: 96)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "uart_stm32_driver_api", scope: !9, file: !2, line: 1798, type: !191, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !2, line: 133, type: !435, isLocal: true, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 46)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !9, file: !2, line: 44, type: !440, isLocal: true, isDefinition: true)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !443, line: 17, size: 64, elements: !444)
!443 = !DIFile(filename: "include/zephyr/logging/log_instance.h", directory: "/home/sri/zephyrproject/zephyr")
!444 = !{!445, !446}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !442, file: !443, line: 18, baseType: !162, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !442, file: !443, line: 19, baseType: !173, size: 8, offset: 32)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "uart_stm32_data_0", scope: !9, file: !2, line: 2337, type: !449, isLocal: true, isDefinition: true)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_stm32_data", file: !351, line: 86, size: 128, elements: !450)
!450 = !{!451, !452, !453, !454}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !449, file: !351, line: 88, baseType: !156, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "uart_cfg", scope: !449, file: !351, line: 90, baseType: !224, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "user_cb", scope: !449, file: !351, line: 92, baseType: !254, size: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !449, file: !351, line: 93, baseType: !144, size: 32, offset: 96)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "uart_cfg_0", scope: !9, file: !2, line: 2337, type: !213, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1854, type: !459, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 31)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1861, type: !464, isLocal: true, isDefinition: true)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 32)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1887, type: !469, isLocal: true, isDefinition: true)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 27)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1927, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 34)
!477 = !{i32 7, !"Dwarf Version", i32 4}
!478 = !{i32 2, !"Debug Info Version", i32 3}
!479 = !{i32 1, !"wchar_size", i32 4}
!480 = !{i32 1, !"static_rwdata", i32 1}
!481 = !{i32 1, !"enumsize_buildattr", i32 1}
!482 = !{i32 1, !"armlib_unavailable", i32 0}
!483 = !{i32 8, !"PIC Level", i32 2}
!484 = !{i32 7, !"PIE Level", i32 2}
!485 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!486 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !13, file: !13, line: 223, type: !487, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !165, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 32)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !491, line: 250, size: 896, elements: !492)
!491 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!492 = !{!493, !558, !571, !572, !573, !574, !592}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !490, file: !491, line: 252, baseType: !494, size: 384)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !491, line: 58, size: 384, elements: !495)
!495 = !{!496, !522, !530, !531, !532, !543, !544, !545}
!496 = !DIDerivedType(tag: DW_TAG_member, scope: !494, file: !491, line: 61, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !494, file: !491, line: 61, size: 64, elements: !498)
!498 = !{!499, !515}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !497, file: !491, line: 62, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !501, line: 55, baseType: !502)
!501 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !501, line: 37, size: 64, elements: !503)
!503 = !{!504, !510}
!504 = !DIDerivedType(tag: DW_TAG_member, scope: !502, file: !501, line: 38, baseType: !505, size: 32)
!505 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !502, file: !501, line: 38, size: 32, elements: !506)
!506 = !{!507, !509}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !505, file: !501, line: 39, baseType: !508, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !505, file: !501, line: 40, baseType: !508, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, scope: !502, file: !501, line: 42, baseType: !511, size: 32, offset: 32)
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !502, file: !501, line: 42, size: 32, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !511, file: !501, line: 43, baseType: !508, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !511, file: !501, line: 44, baseType: !508, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !497, file: !491, line: 63, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !517, line: 58, size: 64, elements: !518)
!517 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!518 = !{!519}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !516, file: !517, line: 60, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 64, elements: !417)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !494, file: !491, line: 69, baseType: !523, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !525, line: 243, baseType: !526)
!525 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !525, line: 241, size: 64, elements: !527)
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !526, file: !525, line: 242, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !501, line: 51, baseType: !502)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !494, file: !491, line: 72, baseType: !173, size: 8, offset: 96)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !494, file: !491, line: 75, baseType: !173, size: 8, offset: 104)
!532 = !DIDerivedType(tag: DW_TAG_member, scope: !494, file: !491, line: 91, baseType: !533, size: 16, offset: 112)
!533 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !494, file: !491, line: 91, size: 16, elements: !534)
!534 = !{!535, !542}
!535 = !DIDerivedType(tag: DW_TAG_member, scope: !533, file: !491, line: 92, baseType: !536, size: 16)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !533, file: !491, line: 92, size: 16, elements: !537)
!537 = !{!538, !541}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !536, file: !491, line: 97, baseType: !539, size: 8)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !174, line: 56, baseType: !540)
!540 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !536, file: !491, line: 98, baseType: !173, size: 8, offset: 8)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !533, file: !491, line: 101, baseType: !258, size: 16)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !494, file: !491, line: 108, baseType: !178, size: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !494, file: !491, line: 132, baseType: !144, size: 32, offset: 160)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !494, file: !491, line: 136, baseType: !546, size: 192, offset: 192)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !525, line: 254, size: 192, elements: !547)
!547 = !{!548, !549, !555}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !546, file: !525, line: 255, baseType: !500, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !546, file: !525, line: 256, baseType: !550, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !525, line: 252, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !554}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !546, file: !525, line: 259, baseType: !556, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !174, line: 59, baseType: !557)
!557 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !490, file: !491, line: 255, baseType: !559, size: 288, offset: 384)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !560, line: 25, size: 288, elements: !561)
!560 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!561 = !{!562, !563, !564, !565, !566, !567, !568, !569, !570}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !559, file: !560, line: 26, baseType: !178, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !559, file: !560, line: 27, baseType: !178, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !559, file: !560, line: 28, baseType: !178, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !559, file: !560, line: 29, baseType: !178, size: 32, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !559, file: !560, line: 30, baseType: !178, size: 32, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !559, file: !560, line: 31, baseType: !178, size: 32, offset: 160)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !559, file: !560, line: 32, baseType: !178, size: 32, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !559, file: !560, line: 33, baseType: !178, size: 32, offset: 224)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !559, file: !560, line: 34, baseType: !178, size: 32, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !490, file: !491, line: 258, baseType: !144, size: 32, offset: 672)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !490, file: !491, line: 261, baseType: !524, size: 64, offset: 704)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !490, file: !491, line: 302, baseType: !145, size: 32, offset: 768)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !490, file: !491, line: 333, baseType: !575, size: 32, offset: 800)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 32)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !577, line: 5291, size: 160, elements: !578)
!577 = !DIFile(filename: "include/zephyr/kernel.h", directory: "/home/sri/zephyrproject/zephyr")
!578 = !{!579, !588, !589}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !576, file: !577, line: 5292, baseType: !580, size: 96)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !581, line: 56, size: 96, elements: !582)
!581 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!582 = !{!583, !586, !587}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !580, file: !581, line: 57, baseType: !584, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !581, line: 57, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !580, file: !581, line: 58, baseType: !144, size: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !580, file: !581, line: 59, baseType: !369, size: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !576, file: !577, line: 5293, baseType: !524, size: 64, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !576, file: !577, line: 5294, baseType: !590, offset: 160)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !591, line: 45, elements: !422)
!591 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!592 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !490, file: !491, line: 355, baseType: !593, size: 64, offset: 832)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !560, line: 60, size: 64, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !593, file: !560, line: 63, baseType: !178, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !593, file: !560, line: 66, baseType: !178, size: 32, offset: 32)
!597 = !DILocalVariable(name: "object", arg: 1, scope: !486, file: !13, line: 223, type: !165)
!598 = !DILocation(line: 223, column: 61, scope: !486)
!599 = !DILocalVariable(name: "thread", arg: 2, scope: !486, file: !13, line: 224, type: !489)
!600 = !DILocation(line: 224, column: 24, scope: !486)
!601 = !DILocation(line: 226, column: 9, scope: !486)
!602 = !DILocation(line: 227, column: 9, scope: !486)
!603 = !DILocation(line: 228, column: 1, scope: !486)
!604 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !13, file: !13, line: 243, type: !605, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !165}
!607 = !DILocalVariable(name: "object", arg: 1, scope: !604, file: !13, line: 243, type: !165)
!608 = !DILocation(line: 243, column: 56, scope: !604)
!609 = !DILocation(line: 245, column: 9, scope: !604)
!610 = !DILocation(line: 246, column: 1, scope: !604)
!611 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !13, file: !13, line: 359, type: !612, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!612 = !DISubroutineType(types: !613)
!613 = !{!144, !12}
!614 = !DILocalVariable(name: "otype", arg: 1, scope: !611, file: !13, line: 359, type: !12)
!615 = !DILocation(line: 359, column: 58, scope: !611)
!616 = !DILocation(line: 361, column: 9, scope: !611)
!617 = !DILocation(line: 363, column: 2, scope: !611)
!618 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !13, file: !13, line: 366, type: !619, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!619 = !DISubroutineType(types: !620)
!620 = !{!144, !12, !369}
!621 = !DILocalVariable(name: "otype", arg: 1, scope: !618, file: !13, line: 366, type: !12)
!622 = !DILocation(line: 366, column: 63, scope: !618)
!623 = !DILocalVariable(name: "size", arg: 2, scope: !618, file: !13, line: 367, type: !369)
!624 = !DILocation(line: 367, column: 13, scope: !618)
!625 = !DILocation(line: 369, column: 9, scope: !618)
!626 = !DILocation(line: 370, column: 9, scope: !618)
!627 = !DILocation(line: 372, column: 2, scope: !618)
!628 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !577, file: !577, line: 656, type: !629, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!629 = !DISubroutineType(types: !630)
!630 = !{!631, !633}
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !632, line: 46, baseType: !556)
!632 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!635 = !DILocalVariable(name: "t", arg: 1, scope: !628, file: !577, line: 657, type: !633)
!636 = !DILocation(line: 657, column: 30, scope: !628)
!637 = !DILocation(line: 659, column: 28, scope: !628)
!638 = !DILocation(line: 659, column: 31, scope: !628)
!639 = !DILocation(line: 659, column: 36, scope: !628)
!640 = !DILocation(line: 659, column: 9, scope: !628)
!641 = !DILocation(line: 659, column: 2, scope: !628)
!642 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !577, file: !577, line: 671, type: !629, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!643 = !DILocalVariable(name: "t", arg: 1, scope: !642, file: !577, line: 672, type: !633)
!644 = !DILocation(line: 672, column: 30, scope: !642)
!645 = !DILocation(line: 674, column: 30, scope: !642)
!646 = !DILocation(line: 674, column: 33, scope: !642)
!647 = !DILocation(line: 674, column: 38, scope: !642)
!648 = !DILocation(line: 674, column: 9, scope: !642)
!649 = !DILocation(line: 674, column: 2, scope: !642)
!650 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !577, file: !577, line: 1634, type: !651, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!651 = !DISubroutineType(types: !652)
!652 = !{!631, !653}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !577, line: 1439, size: 448, elements: !656)
!656 = !{!657, !658, !659, !664, !665, !670, !671}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !655, file: !577, line: 1445, baseType: !546, size: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !655, file: !577, line: 1448, baseType: !524, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !655, file: !577, line: 1451, baseType: !660, size: 32, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 32)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !663}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !655, file: !577, line: 1454, baseType: !660, size: 32, offset: 288)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !655, file: !577, line: 1457, baseType: !666, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !632, line: 67, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !632, line: 65, size: 64, elements: !668)
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !667, file: !632, line: 66, baseType: !631, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !655, file: !577, line: 1460, baseType: !178, size: 32, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !655, file: !577, line: 1463, baseType: !144, size: 32, offset: 416)
!672 = !DILocalVariable(name: "timer", arg: 1, scope: !650, file: !577, line: 1635, type: !653)
!673 = !DILocation(line: 1635, column: 34, scope: !650)
!674 = !DILocation(line: 1637, column: 28, scope: !650)
!675 = !DILocation(line: 1637, column: 35, scope: !650)
!676 = !DILocation(line: 1637, column: 9, scope: !650)
!677 = !DILocation(line: 1637, column: 2, scope: !650)
!678 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !577, file: !577, line: 1649, type: !651, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!679 = !DILocalVariable(name: "timer", arg: 1, scope: !678, file: !577, line: 1650, type: !653)
!680 = !DILocation(line: 1650, column: 34, scope: !678)
!681 = !DILocation(line: 1652, column: 30, scope: !678)
!682 = !DILocation(line: 1652, column: 37, scope: !678)
!683 = !DILocation(line: 1652, column: 9, scope: !678)
!684 = !DILocation(line: 1652, column: 2, scope: !678)
!685 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !577, file: !577, line: 1689, type: !686, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !663, !144}
!688 = !DILocalVariable(name: "timer", arg: 1, scope: !685, file: !577, line: 1689, type: !663)
!689 = !DILocation(line: 1689, column: 65, scope: !685)
!690 = !DILocalVariable(name: "user_data", arg: 2, scope: !685, file: !577, line: 1690, type: !144)
!691 = !DILocation(line: 1690, column: 19, scope: !685)
!692 = !DILocation(line: 1692, column: 21, scope: !685)
!693 = !DILocation(line: 1692, column: 2, scope: !685)
!694 = !DILocation(line: 1692, column: 9, scope: !685)
!695 = !DILocation(line: 1692, column: 19, scope: !685)
!696 = !DILocation(line: 1693, column: 1, scope: !685)
!697 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !577, file: !577, line: 1704, type: !698, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!698 = !DISubroutineType(types: !699)
!699 = !{!144, !653}
!700 = !DILocalVariable(name: "timer", arg: 1, scope: !697, file: !577, line: 1704, type: !653)
!701 = !DILocation(line: 1704, column: 72, scope: !697)
!702 = !DILocation(line: 1706, column: 9, scope: !697)
!703 = !DILocation(line: 1706, column: 16, scope: !697)
!704 = !DILocation(line: 1706, column: 2, scope: !697)
!705 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !577, file: !577, line: 2071, type: !706, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!706 = !DISubroutineType(types: !707)
!707 = !{!145, !708}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !577, line: 1830, size: 128, elements: !710)
!710 = !{!711, !724, !725}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !709, file: !577, line: 1831, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !713, line: 60, baseType: !714)
!713 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !713, line: 53, size: 64, elements: !715)
!715 = !{!716, !723}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !714, file: !713, line: 54, baseType: !717, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !713, line: 50, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !713, line: 44, size: 32, elements: !720)
!720 = !{!721}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !719, file: !713, line: 45, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !713, line: 40, baseType: !178)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !714, file: !713, line: 55, baseType: !717, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !709, file: !577, line: 1832, baseType: !590, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !709, file: !577, line: 1833, baseType: !524, size: 64, offset: 64)
!726 = !DILocalVariable(name: "queue", arg: 1, scope: !705, file: !577, line: 2071, type: !708)
!727 = !DILocation(line: 2071, column: 59, scope: !705)
!728 = !DILocation(line: 2073, column: 35, scope: !705)
!729 = !DILocation(line: 2073, column: 42, scope: !705)
!730 = !DILocation(line: 2073, column: 14, scope: !705)
!731 = !DILocation(line: 2073, column: 9, scope: !705)
!732 = !DILocation(line: 2073, column: 2, scope: !705)
!733 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !577, file: !577, line: 3209, type: !734, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!734 = !DISubroutineType(types: !735)
!735 = !{!179, !736}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 32)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !577, line: 3092, size: 128, elements: !738)
!738 = !{!739, !740, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !737, file: !577, line: 3093, baseType: !524, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !737, file: !577, line: 3094, baseType: !179, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !737, file: !577, line: 3095, baseType: !179, size: 32, offset: 96)
!742 = !DILocalVariable(name: "sem", arg: 1, scope: !733, file: !577, line: 3209, type: !736)
!743 = !DILocation(line: 3209, column: 65, scope: !733)
!744 = !DILocation(line: 3211, column: 9, scope: !733)
!745 = !DILocation(line: 3211, column: 14, scope: !733)
!746 = !DILocation(line: 3211, column: 2, scope: !733)
!747 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !577, file: !577, line: 4649, type: !748, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!748 = !DISubroutineType(types: !749)
!749 = !{!178, !750}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !577, line: 4390, size: 320, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !759, !760, !761, !762, !763}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !751, file: !577, line: 4392, baseType: !524, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !751, file: !577, line: 4394, baseType: !590, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !751, file: !577, line: 4396, baseType: !369, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !751, file: !577, line: 4398, baseType: !178, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !751, file: !577, line: 4400, baseType: !758, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !751, file: !577, line: 4402, baseType: !758, size: 32, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !751, file: !577, line: 4404, baseType: !758, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !751, file: !577, line: 4406, baseType: !758, size: 32, offset: 224)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !751, file: !577, line: 4408, baseType: !178, size: 32, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !751, file: !577, line: 4413, baseType: !173, size: 8, offset: 288)
!764 = !DILocalVariable(name: "msgq", arg: 1, scope: !747, file: !577, line: 4649, type: !750)
!765 = !DILocation(line: 4649, column: 66, scope: !747)
!766 = !DILocation(line: 4651, column: 9, scope: !747)
!767 = !DILocation(line: 4651, column: 15, scope: !747)
!768 = !DILocation(line: 4651, column: 26, scope: !747)
!769 = !DILocation(line: 4651, column: 32, scope: !747)
!770 = !DILocation(line: 4651, column: 24, scope: !747)
!771 = !DILocation(line: 4651, column: 2, scope: !747)
!772 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !577, file: !577, line: 4665, type: !748, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!773 = !DILocalVariable(name: "msgq", arg: 1, scope: !772, file: !577, line: 4665, type: !750)
!774 = !DILocation(line: 4665, column: 66, scope: !772)
!775 = !DILocation(line: 4667, column: 9, scope: !772)
!776 = !DILocation(line: 4667, column: 15, scope: !772)
!777 = !DILocation(line: 4667, column: 2, scope: !772)
!778 = distinct !DISubprogram(name: "z_impl_device_is_ready", scope: !159, file: !159, line: 744, type: !779, scopeLine: 745, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!779 = !DISubroutineType(types: !780)
!780 = !{!176, !156}
!781 = !DILocalVariable(name: "dev", arg: 1, scope: !778, file: !159, line: 744, type: !156)
!782 = !DILocation(line: 744, column: 65, scope: !778)
!783 = !DILocation(line: 746, column: 27, scope: !778)
!784 = !DILocation(line: 746, column: 9, scope: !778)
!785 = !DILocation(line: 746, column: 2, scope: !778)
!786 = distinct !DISubprogram(name: "z_impl_reset_status", scope: !149, file: !149, line: 164, type: !154, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!787 = !DILocalVariable(name: "dev", arg: 1, scope: !786, file: !149, line: 164, type: !156)
!788 = !DILocation(line: 164, column: 60, scope: !786)
!789 = !DILocalVariable(name: "id", arg: 2, scope: !786, file: !149, line: 164, type: !178)
!790 = !DILocation(line: 164, column: 74, scope: !786)
!791 = !DILocalVariable(name: "status", arg: 3, scope: !786, file: !149, line: 164, type: !180)
!792 = !DILocation(line: 164, column: 87, scope: !786)
!793 = !DILocalVariable(name: "api", scope: !786, file: !149, line: 166, type: !146)
!794 = !DILocation(line: 166, column: 33, scope: !786)
!795 = !DILocation(line: 166, column: 72, scope: !786)
!796 = !DILocation(line: 166, column: 77, scope: !786)
!797 = !DILocation(line: 168, column: 6, scope: !798)
!798 = distinct !DILexicalBlock(scope: !786, file: !149, line: 168, column: 6)
!799 = !DILocation(line: 168, column: 11, scope: !798)
!800 = !DILocation(line: 168, column: 18, scope: !798)
!801 = !DILocation(line: 168, column: 6, scope: !786)
!802 = !DILocation(line: 169, column: 3, scope: !803)
!803 = distinct !DILexicalBlock(scope: !798, file: !149, line: 168, column: 33)
!804 = !DILocation(line: 172, column: 9, scope: !786)
!805 = !DILocation(line: 172, column: 14, scope: !786)
!806 = !DILocation(line: 172, column: 21, scope: !786)
!807 = !DILocation(line: 172, column: 26, scope: !786)
!808 = !DILocation(line: 172, column: 30, scope: !786)
!809 = !DILocation(line: 172, column: 2, scope: !786)
!810 = !DILocation(line: 173, column: 1, scope: !786)
!811 = distinct !DISubprogram(name: "z_impl_reset_line_assert", scope: !149, file: !149, line: 207, type: !184, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !422)
!812 = !DILocalVariable(name: "dev", arg: 1, scope: !811, file: !149, line: 207, type: !156)
!813 = !DILocation(line: 207, column: 65, scope: !811)
!814 = !DILocalVariable(name: "id", arg: 2, scope: !811, file: !149, line: 207, type: !178)
