; ModuleID = '../bc_files/work.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/work.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_spinlock = type {}
%struct.k_work_q = type { %struct.k_thread, %struct._slist, %struct._wait_q_t, %struct._wait_q_t, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_arch = type { i32, i32 }
%struct._slist = type { ptr, ptr }
%struct._wait_q_t = type { %struct._dnode }
%struct.z_kernel = type { [1 x %struct._cpu], %struct._ready_q }
%struct._cpu = type { i32, ptr, ptr, ptr, i8, %struct._cpu_arch }
%struct._cpu_arch = type {}
%struct._ready_q = type { ptr, %struct._dnode }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }

!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!112 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!113 = !{!114, !119, !120, !121, !265, !267, !277, !137, !278, !284}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !115, line: 46, baseType: !116)
!115 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !117, line: 59, baseType: !118)
!117 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!118 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!120 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !6, line: 3849, size: 128, elements: !123)
!123 = !{!124, !131, !136, !264}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !122, file: !6, line: 3855, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !126, line: 39, baseType: !127)
!126 = !DIFile(filename: "include/zephyr/sys/slist.h", directory: "/home/sri/zephyrproject/zephyr")
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !126, line: 33, size: 32, elements: !128)
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !126, line: 34, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !122, file: !6, line: 3858, baseType: !132, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !6, line: 3257, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !121}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !122, file: !6, line: 3861, baseType: !137, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !6, line: 3996, size: 1152, elements: !139)
!139 = !{!140, !254, !261, !262, !263}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !138, file: !6, line: 3998, baseType: !141, size: 896)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !142, line: 250, size: 896, elements: !143)
!142 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!143 = !{!144, !213, !226, !227, !228, !229, !249}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !141, file: !142, line: 252, baseType: !145, size: 384)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !142, line: 58, size: 384, elements: !146)
!146 = !{!147, !175, !183, !185, !186, !198, !201, !202}
!147 = !DIDerivedType(tag: DW_TAG_member, scope: !145, file: !142, line: 61, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !145, file: !142, line: 61, size: 64, elements: !149)
!149 = !{!150, !166}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !148, file: !142, line: 62, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !152, line: 55, baseType: !153)
!152 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !152, line: 37, size: 64, elements: !154)
!154 = !{!155, !161}
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !153, file: !152, line: 38, baseType: !156, size: 32)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !153, file: !152, line: 38, size: 32, elements: !157)
!157 = !{!158, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !156, file: !152, line: 39, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !156, file: !152, line: 40, baseType: !159, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !153, file: !152, line: 42, baseType: !162, size: 32, offset: 32)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !153, file: !152, line: 42, size: 32, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !162, file: !152, line: 43, baseType: !159, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !162, file: !152, line: 44, baseType: !159, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !148, file: !142, line: 63, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 58, size: 64, elements: !169)
!168 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !167, file: !168, line: 60, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !145, file: !142, line: 69, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !178, line: 243, baseType: !179)
!178 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 241, size: 64, elements: !180)
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !179, file: !178, line: 242, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !152, line: 51, baseType: !153)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !145, file: !142, line: 72, baseType: !184, size: 8, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !117, line: 62, baseType: !32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !145, file: !142, line: 75, baseType: !184, size: 8, offset: 104)
!186 = !DIDerivedType(tag: DW_TAG_member, scope: !145, file: !142, line: 91, baseType: !187, size: 16, offset: 112)
!187 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !145, file: !142, line: 91, size: 16, elements: !188)
!188 = !{!189, !196}
!189 = !DIDerivedType(tag: DW_TAG_member, scope: !187, file: !142, line: 92, baseType: !190, size: 16)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !187, file: !142, line: 92, size: 16, elements: !191)
!191 = !{!192, !195}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !190, file: !142, line: 97, baseType: !193, size: 8)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !117, line: 56, baseType: !194)
!194 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !190, file: !142, line: 98, baseType: !184, size: 8, offset: 8)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !187, file: !142, line: 101, baseType: !197, size: 16)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !117, line: 63, baseType: !7)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !145, file: !142, line: 108, baseType: !199, size: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !117, line: 64, baseType: !200)
!200 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !145, file: !142, line: 132, baseType: !119, size: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !145, file: !142, line: 136, baseType: !203, size: 192, offset: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !178, line: 254, size: 192, elements: !204)
!204 = !{!205, !206, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !203, file: !178, line: 255, baseType: !151, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !203, file: !178, line: 256, baseType: !207, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !178, line: 252, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !203, file: !178, line: 259, baseType: !116, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !141, file: !142, line: 255, baseType: !214, size: 288, offset: 384)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !215, line: 25, size: 288, elements: !216)
!215 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !214, file: !215, line: 26, baseType: !199, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !214, file: !215, line: 27, baseType: !199, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !214, file: !215, line: 28, baseType: !199, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !214, file: !215, line: 29, baseType: !199, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !214, file: !215, line: 30, baseType: !199, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !214, file: !215, line: 31, baseType: !199, size: 32, offset: 160)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !214, file: !215, line: 32, baseType: !199, size: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !214, file: !215, line: 33, baseType: !199, size: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !214, file: !215, line: 34, baseType: !199, size: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !141, file: !142, line: 258, baseType: !119, size: 32, offset: 672)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !141, file: !142, line: 261, baseType: !177, size: 64, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !141, file: !142, line: 302, baseType: !120, size: 32, offset: 768)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !141, file: !142, line: 333, baseType: !230, size: 32, offset: 800)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !6, line: 5291, size: 160, elements: !232)
!232 = !{!233, !244, !245}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !231, file: !6, line: 5292, baseType: !234, size: 96)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !235, line: 56, size: 96, elements: !236)
!235 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!236 = !{!237, !240, !241}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !234, file: !235, line: 57, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !235, line: 57, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !234, file: !235, line: 58, baseType: !119, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !234, file: !235, line: 59, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !243, line: 46, baseType: !200)
!243 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!244 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !231, file: !6, line: 5293, baseType: !177, size: 64, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !231, file: !6, line: 5294, baseType: !246, offset: 160)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !247, line: 45, elements: !248)
!247 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!248 = !{}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !141, file: !142, line: 355, baseType: !250, size: 64, offset: 832)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !215, line: 60, size: 64, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !250, file: !215, line: 63, baseType: !199, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !250, file: !215, line: 66, baseType: !199, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !138, file: !6, line: 4005, baseType: !255, size: 64, offset: 896)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !126, line: 49, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !126, line: 42, size: 64, elements: !257)
!257 = !{!258, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !256, file: !126, line: 43, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !256, file: !126, line: 44, baseType: !259, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !138, file: !6, line: 4008, baseType: !177, size: 64, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !138, file: !6, line: 4011, baseType: !177, size: 64, offset: 1024)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !138, file: !6, line: 4014, baseType: !199, size: 32, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !122, file: !6, line: 3869, baseType: !199, size: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_work_flusher", file: !6, line: 3926, size: 256, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !268, file: !6, line: 3927, baseType: !122, size: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !268, file: !6, line: 3928, baseType: !272, size: 128, offset: 128)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !6, line: 3092, size: 128, elements: !273)
!273 = !{!274, !275, !276}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !272, file: !6, line: 3093, baseType: !177, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !272, file: !6, line: 3094, baseType: !200, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !272, file: !6, line: 3095, baseType: !200, size: 32, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_work_canceller", file: !6, line: 3937, size: 192, elements: !280)
!280 = !{!281, !282, !283}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !279, file: !6, line: 3938, baseType: !125, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !279, file: !6, line: 3939, baseType: !121, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !279, file: !6, line: 3940, baseType: !272, size: 128, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_delayable", file: !6, line: 3877, size: 384, elements: !286)
!286 = !{!287, !288, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !285, file: !6, line: 3879, baseType: !122, size: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !285, file: !6, line: 3882, baseType: !203, size: 192, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !285, file: !6, line: 3885, baseType: !137, size: 32, offset: 320)
!290 = !{!0, !291}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "pending_cancels", scope: !2, file: !293, line: 81, type: !255, isLocal: true, isDefinition: true)
!293 = !DIFile(filename: "kernel/work.c", directory: "/home/sri/zephyrproject/zephyr")
!294 = !{i32 7, !"Dwarf Version", i32 4}
!295 = !{i32 2, !"Debug Info Version", i32 3}
!296 = !{i32 1, !"wchar_size", i32 4}
!297 = !{i32 1, !"static_rwdata", i32 1}
!298 = !{i32 1, !"enumsize_buildattr", i32 1}
!299 = !{i32 1, !"armlib_unavailable", i32 0}
!300 = !{i32 8, !"PIC Level", i32 2}
!301 = !{i32 7, !"PIE Level", i32 2}
!302 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!303 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !31, file: !31, line: 223, type: !304, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !306, !308}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!309 = !DILocalVariable(name: "object", arg: 1, scope: !303, file: !31, line: 223, type: !306)
!310 = !DILocation(line: 223, column: 61, scope: !303)
!311 = !DILocalVariable(name: "thread", arg: 2, scope: !303, file: !31, line: 224, type: !308)
!312 = !DILocation(line: 224, column: 24, scope: !303)
!313 = !DILocation(line: 226, column: 9, scope: !303)
!314 = !DILocation(line: 227, column: 9, scope: !303)
!315 = !DILocation(line: 228, column: 1, scope: !303)
!316 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !31, file: !31, line: 243, type: !317, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !306}
!319 = !DILocalVariable(name: "object", arg: 1, scope: !316, file: !31, line: 243, type: !306)
!320 = !DILocation(line: 243, column: 56, scope: !316)
!321 = !DILocation(line: 245, column: 9, scope: !316)
!322 = !DILocation(line: 246, column: 1, scope: !316)
!323 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !31, file: !31, line: 359, type: !324, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!324 = !DISubroutineType(types: !325)
!325 = !{!119, !30}
!326 = !DILocalVariable(name: "otype", arg: 1, scope: !323, file: !31, line: 359, type: !30)
!327 = !DILocation(line: 359, column: 58, scope: !323)
!328 = !DILocation(line: 361, column: 9, scope: !323)
!329 = !DILocation(line: 363, column: 2, scope: !323)
!330 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !31, file: !31, line: 366, type: !331, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!331 = !DISubroutineType(types: !332)
!332 = !{!119, !30, !242}
!333 = !DILocalVariable(name: "otype", arg: 1, scope: !330, file: !31, line: 366, type: !30)
!334 = !DILocation(line: 366, column: 63, scope: !330)
!335 = !DILocalVariable(name: "size", arg: 2, scope: !330, file: !31, line: 367, type: !242)
!336 = !DILocation(line: 367, column: 13, scope: !330)
!337 = !DILocation(line: 369, column: 9, scope: !330)
!338 = !DILocation(line: 370, column: 9, scope: !330)
!339 = !DILocation(line: 372, column: 2, scope: !330)
!340 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !6, file: !6, line: 656, type: !341, scopeLine: 658, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!341 = !DISubroutineType(types: !342)
!342 = !{!114, !343}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!345 = !DILocalVariable(name: "t", arg: 1, scope: !340, file: !6, line: 657, type: !343)
!346 = !DILocation(line: 657, column: 30, scope: !340)
!347 = !DILocation(line: 659, column: 28, scope: !340)
!348 = !DILocation(line: 659, column: 31, scope: !340)
!349 = !DILocation(line: 659, column: 36, scope: !340)
!350 = !DILocation(line: 659, column: 9, scope: !340)
!351 = !DILocation(line: 659, column: 2, scope: !340)
!352 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !6, file: !6, line: 671, type: !341, scopeLine: 673, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!353 = !DILocalVariable(name: "t", arg: 1, scope: !352, file: !6, line: 672, type: !343)
!354 = !DILocation(line: 672, column: 30, scope: !352)
!355 = !DILocation(line: 674, column: 30, scope: !352)
!356 = !DILocation(line: 674, column: 33, scope: !352)
!357 = !DILocation(line: 674, column: 38, scope: !352)
!358 = !DILocation(line: 674, column: 9, scope: !352)
!359 = !DILocation(line: 674, column: 2, scope: !352)
!360 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !6, file: !6, line: 1634, type: !361, scopeLine: 1636, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!361 = !DISubroutineType(types: !362)
!362 = !{!114, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !6, line: 1439, size: 448, elements: !366)
!366 = !{!367, !368, !369, !374, !375, !380, !381}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !365, file: !6, line: 1445, baseType: !203, size: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !365, file: !6, line: 1448, baseType: !177, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !365, file: !6, line: 1451, baseType: !370, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !365, file: !6, line: 1454, baseType: !370, size: 32, offset: 288)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !365, file: !6, line: 1457, baseType: !376, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !115, line: 67, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 65, size: 64, elements: !378)
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !377, file: !115, line: 66, baseType: !114, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !365, file: !6, line: 1460, baseType: !199, size: 32, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !365, file: !6, line: 1463, baseType: !119, size: 32, offset: 416)
!382 = !DILocalVariable(name: "timer", arg: 1, scope: !360, file: !6, line: 1635, type: !363)
!383 = !DILocation(line: 1635, column: 34, scope: !360)
!384 = !DILocation(line: 1637, column: 28, scope: !360)
!385 = !DILocation(line: 1637, column: 35, scope: !360)
!386 = !DILocation(line: 1637, column: 9, scope: !360)
!387 = !DILocation(line: 1637, column: 2, scope: !360)
!388 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !6, file: !6, line: 1649, type: !361, scopeLine: 1651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!389 = !DILocalVariable(name: "timer", arg: 1, scope: !388, file: !6, line: 1650, type: !363)
!390 = !DILocation(line: 1650, column: 34, scope: !388)
!391 = !DILocation(line: 1652, column: 30, scope: !388)
!392 = !DILocation(line: 1652, column: 37, scope: !388)
!393 = !DILocation(line: 1652, column: 9, scope: !388)
!394 = !DILocation(line: 1652, column: 2, scope: !388)
!395 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !6, file: !6, line: 1689, type: !396, scopeLine: 1691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !373, !119}
!398 = !DILocalVariable(name: "timer", arg: 1, scope: !395, file: !6, line: 1689, type: !373)
!399 = !DILocation(line: 1689, column: 65, scope: !395)
!400 = !DILocalVariable(name: "user_data", arg: 2, scope: !395, file: !6, line: 1690, type: !119)
!401 = !DILocation(line: 1690, column: 19, scope: !395)
!402 = !DILocation(line: 1692, column: 21, scope: !395)
!403 = !DILocation(line: 1692, column: 2, scope: !395)
!404 = !DILocation(line: 1692, column: 9, scope: !395)
!405 = !DILocation(line: 1692, column: 19, scope: !395)
!406 = !DILocation(line: 1693, column: 1, scope: !395)
!407 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !6, file: !6, line: 1704, type: !408, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!408 = !DISubroutineType(types: !409)
!409 = !{!119, !363}
!410 = !DILocalVariable(name: "timer", arg: 1, scope: !407, file: !6, line: 1704, type: !363)
!411 = !DILocation(line: 1704, column: 72, scope: !407)
!412 = !DILocation(line: 1706, column: 9, scope: !407)
!413 = !DILocation(line: 1706, column: 16, scope: !407)
!414 = !DILocation(line: 1706, column: 2, scope: !407)
!415 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !6, file: !6, line: 2071, type: !416, scopeLine: 2072, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!416 = !DISubroutineType(types: !417)
!417 = !{!120, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 32)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !6, line: 1830, size: 128, elements: !420)
!420 = !{!421, !434, !435}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !419, file: !6, line: 1831, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !423, line: 60, baseType: !424)
!423 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !423, line: 53, size: 64, elements: !425)
!425 = !{!426, !433}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !424, file: !423, line: 54, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !423, line: 50, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !423, line: 44, size: 32, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !429, file: !423, line: 45, baseType: !432, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !423, line: 40, baseType: !199)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !424, file: !423, line: 55, baseType: !427, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !419, file: !6, line: 1832, baseType: !246, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !419, file: !6, line: 1833, baseType: !177, size: 64, offset: 64)
!436 = !DILocalVariable(name: "queue", arg: 1, scope: !415, file: !6, line: 2071, type: !418)
!437 = !DILocation(line: 2071, column: 59, scope: !415)
!438 = !DILocation(line: 2073, column: 35, scope: !415)
!439 = !DILocation(line: 2073, column: 42, scope: !415)
!440 = !DILocation(line: 2073, column: 14, scope: !415)
!441 = !DILocation(line: 2073, column: 9, scope: !415)
!442 = !DILocation(line: 2073, column: 2, scope: !415)
!443 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !6, file: !6, line: 3209, type: !444, scopeLine: 3210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!444 = !DISubroutineType(types: !445)
!445 = !{!200, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!447 = !DILocalVariable(name: "sem", arg: 1, scope: !443, file: !6, line: 3209, type: !446)
!448 = !DILocation(line: 3209, column: 65, scope: !443)
!449 = !DILocation(line: 3211, column: 9, scope: !443)
!450 = !DILocation(line: 3211, column: 14, scope: !443)
!451 = !DILocation(line: 3211, column: 2, scope: !443)
!452 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !6, file: !6, line: 4649, type: !453, scopeLine: 4650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!453 = !DISubroutineType(types: !454)
!454 = !{!199, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !6, line: 4390, size: 320, elements: !457)
!457 = !{!458, !459, !460, !461, !462, !463, !464, !465, !466, !467}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !456, file: !6, line: 4392, baseType: !177, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !456, file: !6, line: 4394, baseType: !246, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !456, file: !6, line: 4396, baseType: !242, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !456, file: !6, line: 4398, baseType: !199, size: 32, offset: 96)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !456, file: !6, line: 4400, baseType: !265, size: 32, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !456, file: !6, line: 4402, baseType: !265, size: 32, offset: 160)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !456, file: !6, line: 4404, baseType: !265, size: 32, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !456, file: !6, line: 4406, baseType: !265, size: 32, offset: 224)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !456, file: !6, line: 4408, baseType: !199, size: 32, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !456, file: !6, line: 4413, baseType: !184, size: 8, offset: 288)
!468 = !DILocalVariable(name: "msgq", arg: 1, scope: !452, file: !6, line: 4649, type: !455)
!469 = !DILocation(line: 4649, column: 66, scope: !452)
!470 = !DILocation(line: 4651, column: 9, scope: !452)
!471 = !DILocation(line: 4651, column: 15, scope: !452)
!472 = !DILocation(line: 4651, column: 26, scope: !452)
!473 = !DILocation(line: 4651, column: 32, scope: !452)
!474 = !DILocation(line: 4651, column: 24, scope: !452)
!475 = !DILocation(line: 4651, column: 2, scope: !452)
!476 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !6, file: !6, line: 4665, type: !453, scopeLine: 4666, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!477 = !DILocalVariable(name: "msgq", arg: 1, scope: !476, file: !6, line: 4665, type: !455)
!478 = !DILocation(line: 4665, column: 66, scope: !476)
!479 = !DILocation(line: 4667, column: 9, scope: !476)
!480 = !DILocation(line: 4667, column: 15, scope: !476)
!481 = !DILocation(line: 4667, column: 2, scope: !476)
!482 = distinct !DISubprogram(name: "k_work_init", scope: !293, file: !293, line: 134, type: !483, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !248)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !121, !132}
!485 = !DILocalVariable(name: "work", arg: 1, scope: !482, file: !293, line: 134, type: !121)
!486 = !DILocation(line: 134, column: 33, scope: !482)
!487 = !DILocalVariable(name: "handler", arg: 2, scope: !482, file: !293, line: 135, type: !132)
!488 = !DILocation(line: 135, column: 22, scope: !482)
!489 = !DILocation(line: 140, column: 3, scope: !482)
!490 = !DILocation(line: 140, column: 25, scope: !482)
!491 = !DILocation(line: 140, column: 38, scope: !482)
!492 = !DILocation(line: 140, column: 10, scope: !482)
!493 = !DILocation(line: 142, column: 2, scope: !482)
!494 = !DILocation(line: 142, column: 7, scope: !495)
!495 = distinct !DILexicalBlock(scope: !482, file: !293, line: 142, column: 5)
!496 = !DILocation(line: 143, column: 1, scope: !482)
!497 = distinct !DISubprogram(name: "k_work_busy_get", scope: !293, file: !293, line: 150, type: !498, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !248)
!498 = !DISubroutineType(types: !499)
!499 = !{!120, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!502 = !DILocalVariable(name: "work", arg: 1, scope: !497, file: !293, line: 150, type: !500)
!503 = !DILocation(line: 150, column: 42, scope: !497)
!504 = !DILocalVariable(name: "key", scope: !497, file: !293, line: 152, type: !505)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !247, line: 108, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !247, line: 34, size: 32, elements: !507)
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !506, file: !247, line: 35, baseType: !120, size: 32)
!509 = !DILocation(line: 152, column: 19, scope: !497)
!510 = !DILocalVariable(name: "l", arg: 1, scope: !511, file: !247, line: 160, type: !514)
!511 = distinct !DISubprogram(name: "k_spin_lock", scope: !247, file: !247, line: 160, type: !512, scopeLine: 161, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!512 = !DISubroutineType(types: !513)
!513 = !{!505, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!515 = !DILocation(line: 160, column: 94, scope: !511, inlinedAt: !516)
!516 = distinct !DILocation(line: 152, column: 25, scope: !497)
!517 = !DILocation(line: 162, column: 9, scope: !511, inlinedAt: !516)
!518 = !DILocalVariable(name: "k", scope: !511, file: !247, line: 163, type: !505)
!519 = !DILocation(line: 163, column: 19, scope: !511, inlinedAt: !516)
!520 = !DILocalVariable(name: "key", scope: !521, file: !522, line: 44, type: !200)
!521 = distinct !DISubprogram(name: "arch_irq_lock", scope: !522, file: !522, line: 42, type: !523, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!522 = !DIFile(filename: "include/zephyr/arch/arm/asm_inline_gcc.h", directory: "/home/sri/zephyrproject/zephyr")
!523 = !DISubroutineType(types: !524)
!524 = !{!200}
!525 = !DILocation(line: 44, column: 15, scope: !521, inlinedAt: !526)
!526 = distinct !DILocation(line: 169, column: 10, scope: !511, inlinedAt: !516)
!527 = !DILocation(line: 48, column: 2, scope: !521, inlinedAt: !526)
!528 = !{i64 66942}
!529 = !DILocation(line: 80, column: 9, scope: !521, inlinedAt: !526)
!530 = !DILocation(line: 169, column: 8, scope: !511, inlinedAt: !516)
!531 = !DILocation(line: 171, column: 26, scope: !511, inlinedAt: !516)
!532 = !DILocalVariable(name: "l", arg: 1, scope: !533, file: !247, line: 110, type: !514)
!533 = distinct !DISubprogram(name: "z_spinlock_validate_pre", scope: !247, file: !247, line: 110, type: !534, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !514}
!536 = !DILocation(line: 110, column: 94, scope: !533, inlinedAt: !537)
!537 = distinct !DILocation(line: 171, column: 2, scope: !511, inlinedAt: !516)
!538 = !DILocation(line: 112, column: 9, scope: !533, inlinedAt: !537)
!539 = !DILocation(line: 177, column: 27, scope: !511, inlinedAt: !516)
!540 = !DILocalVariable(name: "l", arg: 1, scope: !541, file: !247, line: 121, type: !514)
!541 = distinct !DISubprogram(name: "z_spinlock_validate_post", scope: !247, file: !247, line: 121, type: !534, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!542 = !DILocation(line: 121, column: 95, scope: !541, inlinedAt: !543)
!543 = distinct !DILocation(line: 177, column: 2, scope: !511, inlinedAt: !516)
!544 = !DILocation(line: 123, column: 9, scope: !541, inlinedAt: !543)
!545 = !DILocation(line: 179, column: 2, scope: !511, inlinedAt: !516)
!546 = !DILocation(line: 152, column: 25, scope: !497)
!547 = !DILocalVariable(name: "ret", scope: !497, file: !293, line: 153, type: !120)
!548 = !DILocation(line: 153, column: 6, scope: !497)
!549 = !DILocation(line: 153, column: 33, scope: !497)
!550 = !DILocation(line: 153, column: 12, scope: !497)
!551 = !DILocation(line: 155, column: 2, scope: !497)
!552 = !DILocalVariable(name: "l", arg: 1, scope: !553, file: !247, line: 235, type: !514)
!553 = distinct !DISubprogram(name: "k_spin_unlock", scope: !247, file: !247, line: 235, type: !554, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !514, !505}
!556 = !DILocation(line: 235, column: 84, scope: !553, inlinedAt: !557)
!557 = distinct !DILocation(line: 155, column: 2, scope: !497)
!558 = !DILocalVariable(name: "key", arg: 2, scope: !553, file: !247, line: 236, type: !505)
!559 = !DILocation(line: 236, column: 23, scope: !553, inlinedAt: !557)
!560 = !DILocation(line: 238, column: 9, scope: !553, inlinedAt: !557)
!561 = !DILocation(line: 261, column: 22, scope: !553, inlinedAt: !557)
!562 = !DILocalVariable(name: "key", arg: 1, scope: !563, file: !522, line: 88, type: !200)
!563 = distinct !DISubprogram(name: "arch_irq_unlock", scope: !522, file: !522, line: 88, type: !564, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !200}
!566 = !DILocation(line: 88, column: 80, scope: !563, inlinedAt: !567)
!567 = distinct !DILocation(line: 261, column: 2, scope: !553, inlinedAt: !557)
!568 = !DILocation(line: 91, column: 6, scope: !569, inlinedAt: !567)
!569 = distinct !DILexicalBlock(scope: !563, file: !522, line: 91, column: 6)
!570 = !DILocation(line: 91, column: 10, scope: !569, inlinedAt: !567)
!571 = !DILocation(line: 91, column: 6, scope: !563, inlinedAt: !567)
!572 = !DILocation(line: 92, column: 3, scope: !573, inlinedAt: !567)
!573 = distinct !DILexicalBlock(scope: !569, file: !522, line: 91, column: 17)
!574 = !DILocation(line: 94, column: 2, scope: !563, inlinedAt: !567)
!575 = !{i64 67246}
!576 = !DILocation(line: 114, column: 1, scope: !563, inlinedAt: !567)
!577 = !DILocation(line: 157, column: 9, scope: !497)
!578 = !DILocation(line: 157, column: 2, scope: !497)
!579 = distinct !DISubprogram(name: "work_busy_get_locked", scope: !293, file: !293, line: 145, type: !498, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!580 = !DILocalVariable(name: "work", arg: 1, scope: !579, file: !293, line: 145, type: !500)
!581 = !DILocation(line: 145, column: 61, scope: !579)
!582 = !DILocation(line: 147, column: 20, scope: !579)
!583 = !DILocation(line: 147, column: 26, scope: !579)
!584 = !DILocation(line: 147, column: 9, scope: !579)
!585 = !DILocation(line: 147, column: 33, scope: !579)
!586 = !DILocation(line: 147, column: 2, scope: !579)
!587 = distinct !DISubprogram(name: "z_work_submit_to_queue", scope: !293, file: !293, line: 369, type: !588, scopeLine: 371, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !248)
!588 = !DISubroutineType(types: !589)
!589 = !{!120, !137, !121}
!590 = !DILocalVariable(name: "queue", arg: 1, scope: !587, file: !293, line: 369, type: !137)
!591 = !DILocation(line: 369, column: 45, scope: !587)
!592 = !DILocalVariable(name: "work", arg: 2, scope: !587, file: !293, line: 370, type: !121)
!593 = !DILocation(line: 370, column: 20, scope: !587)
!594 = !DILocalVariable(name: "key", scope: !587, file: !293, line: 375, type: !505)
!595 = !DILocation(line: 375, column: 19, scope: !587)
!596 = !DILocation(line: 160, column: 94, scope: !511, inlinedAt: !597)
!597 = distinct !DILocation(line: 375, column: 25, scope: !587)
!598 = !DILocation(line: 162, column: 9, scope: !511, inlinedAt: !597)
!599 = !DILocation(line: 163, column: 19, scope: !511, inlinedAt: !597)
!600 = !DILocation(line: 44, column: 15, scope: !521, inlinedAt: !601)
!601 = distinct !DILocation(line: 169, column: 10, scope: !511, inlinedAt: !597)
!602 = !DILocation(line: 48, column: 2, scope: !521, inlinedAt: !601)
!603 = !DILocation(line: 80, column: 9, scope: !521, inlinedAt: !601)
!604 = !DILocation(line: 169, column: 8, scope: !511, inlinedAt: !597)
!605 = !DILocation(line: 171, column: 26, scope: !511, inlinedAt: !597)
!606 = !DILocation(line: 110, column: 94, scope: !533, inlinedAt: !607)
!607 = distinct !DILocation(line: 171, column: 2, scope: !511, inlinedAt: !597)
!608 = !DILocation(line: 112, column: 9, scope: !533, inlinedAt: !607)
!609 = !DILocation(line: 177, column: 27, scope: !511, inlinedAt: !597)
!610 = !DILocation(line: 121, column: 95, scope: !541, inlinedAt: !611)
!611 = distinct !DILocation(line: 177, column: 2, scope: !511, inlinedAt: !597)
!612 = !DILocation(line: 123, column: 9, scope: !541, inlinedAt: !611)
!613 = !DILocation(line: 179, column: 2, scope: !511, inlinedAt: !597)
!614 = !DILocation(line: 375, column: 25, scope: !587)
!615 = !DILocalVariable(name: "ret", scope: !587, file: !293, line: 377, type: !120)
!616 = !DILocation(line: 377, column: 6, scope: !587)
!617 = !DILocation(line: 377, column: 35, scope: !587)
!618 = !DILocation(line: 377, column: 12, scope: !587)
!619 = !DILocation(line: 379, column: 2, scope: !587)
!620 = !DILocation(line: 235, column: 84, scope: !553, inlinedAt: !621)
!621 = distinct !DILocation(line: 379, column: 2, scope: !587)
!622 = !DILocation(line: 236, column: 23, scope: !553, inlinedAt: !621)
!623 = !DILocation(line: 238, column: 9, scope: !553, inlinedAt: !621)
!624 = !DILocation(line: 261, column: 22, scope: !553, inlinedAt: !621)
!625 = !DILocation(line: 88, column: 80, scope: !563, inlinedAt: !626)
!626 = distinct !DILocation(line: 261, column: 2, scope: !553, inlinedAt: !621)
!627 = !DILocation(line: 91, column: 6, scope: !569, inlinedAt: !626)
!628 = !DILocation(line: 91, column: 10, scope: !569, inlinedAt: !626)
!629 = !DILocation(line: 91, column: 6, scope: !563, inlinedAt: !626)
!630 = !DILocation(line: 92, column: 3, scope: !573, inlinedAt: !626)
!631 = !DILocation(line: 94, column: 2, scope: !563, inlinedAt: !626)
!632 = !DILocation(line: 114, column: 1, scope: !563, inlinedAt: !626)
!633 = !DILocation(line: 381, column: 9, scope: !587)
!634 = !DILocation(line: 381, column: 2, scope: !587)
!635 = distinct !DISubprogram(name: "submit_to_queue_locked", scope: !293, file: !293, line: 311, type: !636, scopeLine: 313, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!636 = !DISubroutineType(types: !637)
!637 = !{!120, !121, !638}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!639 = !DILocalVariable(name: "work", arg: 1, scope: !635, file: !293, line: 311, type: !121)
!640 = !DILocation(line: 311, column: 50, scope: !635)
!641 = !DILocalVariable(name: "queuep", arg: 2, scope: !635, file: !293, line: 312, type: !638)
!642 = !DILocation(line: 312, column: 25, scope: !635)
!643 = !DILocalVariable(name: "ret", scope: !635, file: !293, line: 314, type: !120)
!644 = !DILocation(line: 314, column: 6, scope: !635)
!645 = !DILocation(line: 316, column: 17, scope: !646)
!646 = distinct !DILexicalBlock(scope: !635, file: !293, line: 316, column: 6)
!647 = !DILocation(line: 316, column: 23, scope: !646)
!648 = !DILocation(line: 316, column: 6, scope: !646)
!649 = !DILocation(line: 316, column: 6, scope: !635)
!650 = !DILocation(line: 318, column: 7, scope: !651)
!651 = distinct !DILexicalBlock(scope: !646, file: !293, line: 316, column: 53)
!652 = !DILocation(line: 319, column: 2, scope: !651)
!653 = !DILocation(line: 319, column: 25, scope: !654)
!654 = distinct !DILexicalBlock(scope: !646, file: !293, line: 319, column: 13)
!655 = !DILocation(line: 319, column: 31, scope: !654)
!656 = !DILocation(line: 319, column: 14, scope: !654)
!657 = !DILocation(line: 319, column: 13, scope: !646)
!658 = !DILocation(line: 321, column: 7, scope: !659)
!659 = distinct !DILexicalBlock(scope: !654, file: !293, line: 319, column: 58)
!660 = !DILocation(line: 325, column: 8, scope: !661)
!661 = distinct !DILexicalBlock(scope: !659, file: !293, line: 325, column: 7)
!662 = !DILocation(line: 325, column: 7, scope: !661)
!663 = !DILocation(line: 325, column: 15, scope: !661)
!664 = !DILocation(line: 325, column: 7, scope: !659)
!665 = !DILocation(line: 326, column: 14, scope: !666)
!666 = distinct !DILexicalBlock(scope: !661, file: !293, line: 325, column: 21)
!667 = !DILocation(line: 326, column: 20, scope: !666)
!668 = !DILocation(line: 326, column: 5, scope: !666)
!669 = !DILocation(line: 326, column: 12, scope: !666)
!670 = !DILocation(line: 327, column: 3, scope: !666)
!671 = !DILocation(line: 333, column: 18, scope: !672)
!672 = distinct !DILexicalBlock(scope: !659, file: !293, line: 333, column: 7)
!673 = !DILocation(line: 333, column: 24, scope: !672)
!674 = !DILocation(line: 333, column: 7, scope: !672)
!675 = !DILocation(line: 333, column: 7, scope: !659)
!676 = !DILocation(line: 335, column: 14, scope: !677)
!677 = distinct !DILexicalBlock(scope: !672, file: !293, line: 333, column: 52)
!678 = !DILocation(line: 335, column: 20, scope: !677)
!679 = !DILocation(line: 335, column: 5, scope: !677)
!680 = !DILocation(line: 335, column: 12, scope: !677)
!681 = !DILocation(line: 336, column: 8, scope: !677)
!682 = !DILocation(line: 337, column: 3, scope: !677)
!683 = !DILocalVariable(name: "rc", scope: !659, file: !293, line: 339, type: !120)
!684 = !DILocation(line: 339, column: 7, scope: !659)
!685 = !DILocation(line: 339, column: 33, scope: !659)
!686 = !DILocation(line: 339, column: 32, scope: !659)
!687 = !DILocation(line: 339, column: 41, scope: !659)
!688 = !DILocation(line: 339, column: 12, scope: !659)
!689 = !DILocation(line: 341, column: 7, scope: !690)
!690 = distinct !DILexicalBlock(scope: !659, file: !293, line: 341, column: 7)
!691 = !DILocation(line: 341, column: 10, scope: !690)
!692 = !DILocation(line: 341, column: 7, scope: !659)
!693 = !DILocation(line: 342, column: 10, scope: !694)
!694 = distinct !DILexicalBlock(scope: !690, file: !293, line: 341, column: 15)
!695 = !DILocation(line: 342, column: 8, scope: !694)
!696 = !DILocation(line: 343, column: 3, scope: !694)
!697 = !DILocation(line: 344, column: 14, scope: !698)
!698 = distinct !DILexicalBlock(scope: !690, file: !293, line: 343, column: 10)
!699 = !DILocation(line: 344, column: 20, scope: !698)
!700 = !DILocation(line: 344, column: 4, scope: !698)
!701 = !DILocation(line: 345, column: 19, scope: !698)
!702 = !DILocation(line: 345, column: 18, scope: !698)
!703 = !DILocation(line: 345, column: 4, scope: !698)
!704 = !DILocation(line: 345, column: 10, scope: !698)
!705 = !DILocation(line: 345, column: 16, scope: !698)
!706 = !DILocation(line: 347, column: 2, scope: !659)
!707 = !DILocation(line: 351, column: 6, scope: !708)
!708 = distinct !DILexicalBlock(scope: !635, file: !293, line: 351, column: 6)
!709 = !DILocation(line: 351, column: 10, scope: !708)
!710 = !DILocation(line: 351, column: 6, scope: !635)
!711 = !DILocation(line: 352, column: 4, scope: !712)
!712 = distinct !DILexicalBlock(scope: !708, file: !293, line: 351, column: 16)
!713 = !DILocation(line: 352, column: 11, scope: !712)
!714 = !DILocation(line: 353, column: 2, scope: !712)
!715 = !DILocation(line: 355, column: 9, scope: !635)
!716 = !DILocation(line: 355, column: 2, scope: !635)
!717 = distinct !DISubprogram(name: "k_work_submit_to_queue", scope: !293, file: !293, line: 384, type: !588, scopeLine: 386, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !248)
!718 = !DILocalVariable(name: "queue", arg: 1, scope: !717, file: !293, line: 384, type: !137)
!719 = !DILocation(line: 384, column: 45, scope: !717)
!720 = !DILocalVariable(name: "work", arg: 2, scope: !717, file: !293, line: 385, type: !121)
!721 = !DILocation(line: 385, column: 23, scope: !717)
!722 = !DILocation(line: 387, column: 2, scope: !717)
!723 = !DILocation(line: 387, column: 7, scope: !724)
!724 = distinct !DILexicalBlock(scope: !717, file: !293, line: 387, column: 5)
!725 = !DILocalVariable(name: "ret", scope: !717, file: !293, line: 389, type: !120)
!726 = !DILocation(line: 389, column: 6, scope: !717)
!727 = !DILocation(line: 389, column: 35, scope: !717)
!728 = !DILocation(line: 389, column: 42, scope: !717)
!729 = !DILocation(line: 389, column: 12, scope: !717)
!730 = !DILocation(line: 396, column: 6, scope: !731)
!731 = distinct !DILexicalBlock(scope: !717, file: !293, line: 396, column: 6)
!732 = !DILocation(line: 396, column: 10, scope: !731)
!733 = !DILocation(line: 396, column: 6, scope: !717)
!734 = !DILocation(line: 397, column: 3, scope: !735)
!735 = distinct !DILexicalBlock(scope: !731, file: !293, line: 396, column: 15)
!736 = !DILocation(line: 398, column: 2, scope: !735)
!737 = !DILocation(line: 400, column: 2, scope: !717)
!738 = !DILocation(line: 400, column: 7, scope: !739)
!739 = distinct !DILexicalBlock(scope: !717, file: !293, line: 400, column: 5)
!740 = !DILocation(line: 402, column: 9, scope: !717)
!741 = !DILocation(line: 402, column: 2, scope: !717)
!742 = distinct !DISubprogram(name: "z_reschedule_unlocked", scope: !743, file: !743, line: 75, type: !744, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!743 = !DIFile(filename: "kernel/include/ksched.h", directory: "/home/sri/zephyrproject/zephyr")
!744 = !DISubroutineType(types: !745)
!745 = !{null}
!746 = !DILocation(line: 44, column: 15, scope: !521, inlinedAt: !747)
!747 = distinct !DILocation(line: 77, column: 30, scope: !742)
!748 = !DILocation(line: 48, column: 2, scope: !521, inlinedAt: !747)
!749 = !DILocation(line: 80, column: 9, scope: !521, inlinedAt: !747)
!750 = !DILocation(line: 77, column: 9, scope: !742)
!751 = !DILocation(line: 78, column: 1, scope: !742)
!752 = distinct !DISubprogram(name: "k_work_submit", scope: !293, file: !293, line: 405, type: !753, scopeLine: 406, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !248)
!753 = !DISubroutineType(types: !754)
!754 = !{!120, !121}
!755 = !DILocalVariable(name: "work", arg: 1, scope: !752, file: !293, line: 405, type: !121)
!756 = !DILocation(line: 405, column: 34, scope: !752)
!757 = !DILocation(line: 407, column: 2, scope: !752)
!758 = !DILocation(line: 407, column: 7, scope: !759)
!759 = distinct !DILexicalBlock(scope: !752, file: !293, line: 407, column: 5)
!760 = !DILocalVariable(name: "ret", scope: !752, file: !293, line: 409, type: !120)
!761 = !DILocation(line: 409, column: 6, scope: !752)
!762 = !DILocation(line: 409, column: 50, scope: !752)
!763 = !DILocation(line: 409, column: 12, scope: !752)
!764 = !DILocation(line: 411, column: 2, scope: !752)
!765 = !DILocation(line: 411, column: 7, scope: !766)
!766 = distinct !DILexicalBlock(scope: !752, file: !293, line: 411, column: 5)
!767 = !DILocation(line: 413, column: 9, scope: !752)
!768 = !DILocation(line: 413, column: 2, scope: !752)
!769 = distinct !DISubprogram(name: "k_work_flush", scope: !293, file: !293, line: 449, type: !770, scopeLine: 451, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !248)
!770 = !DISubroutineType(types: !771)
!771 = !{!772, !121, !773}
!772 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_sync", file: !6, line: 3960, size: 256, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, scope: !774, file: !6, line: 3961, baseType: !777, size: 256)
!777 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !774, file: !6, line: 3961, size: 256, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flusher", scope: !777, file: !6, line: 3962, baseType: !268, size: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "canceller", scope: !777, file: !6, line: 3963, baseType: !279, size: 192)
!781 = !DILocalVariable(name: "work", arg: 1, scope: !769, file: !293, line: 449, type: !121)
!782 = !DILocation(line: 449, column: 35, scope: !769)
!783 = !DILocalVariable(name: "sync", arg: 2, scope: !769, file: !293, line: 450, type: !773)
!784 = !DILocation(line: 450, column: 25, scope: !769)
!785 = !DILocation(line: 460, column: 2, scope: !769)
!786 = !DILocation(line: 460, column: 7, scope: !787)
!787 = distinct !DILexicalBlock(scope: !769, file: !293, line: 460, column: 5)
!788 = !DILocalVariable(name: "flusher", scope: !769, file: !293, line: 462, type: !267)
!789 = !DILocation(line: 462, column: 25, scope: !769)
!790 = !DILocation(line: 462, column: 36, scope: !769)
!791 = !DILocation(line: 462, column: 42, scope: !769)
!792 = !DILocalVariable(name: "key", scope: !769, file: !293, line: 463, type: !505)
!793 = !DILocation(line: 463, column: 19, scope: !769)
!794 = !DILocation(line: 160, column: 94, scope: !511, inlinedAt: !795)
!795 = distinct !DILocation(line: 463, column: 25, scope: !769)
!796 = !DILocation(line: 162, column: 9, scope: !511, inlinedAt: !795)
!797 = !DILocation(line: 163, column: 19, scope: !511, inlinedAt: !795)
!798 = !DILocation(line: 44, column: 15, scope: !521, inlinedAt: !799)
!799 = distinct !DILocation(line: 169, column: 10, scope: !511, inlinedAt: !795)
!800 = !DILocation(line: 48, column: 2, scope: !521, inlinedAt: !799)
!801 = !DILocation(line: 80, column: 9, scope: !521, inlinedAt: !799)
!802 = !DILocation(line: 169, column: 8, scope: !511, inlinedAt: !795)
!803 = !DILocation(line: 171, column: 26, scope: !511, inlinedAt: !795)
!804 = !DILocation(line: 110, column: 94, scope: !533, inlinedAt: !805)
!805 = distinct !DILocation(line: 171, column: 2, scope: !511, inlinedAt: !795)
!806 = !DILocation(line: 112, column: 9, scope: !533, inlinedAt: !805)
!807 = !DILocation(line: 177, column: 27, scope: !511, inlinedAt: !795)
!808 = !DILocation(line: 121, column: 95, scope: !541, inlinedAt: !809)
!809 = distinct !DILocation(line: 177, column: 2, scope: !511, inlinedAt: !795)
!810 = !DILocation(line: 123, column: 9, scope: !541, inlinedAt: !809)
!811 = !DILocation(line: 179, column: 2, scope: !511, inlinedAt: !795)
!812 = !DILocation(line: 463, column: 25, scope: !769)
!813 = !DILocalVariable(name: "need_flush", scope: !769, file: !293, line: 465, type: !772)
!814 = !DILocation(line: 465, column: 8, scope: !769)
!815 = !DILocation(line: 465, column: 39, scope: !769)
!816 = !DILocation(line: 465, column: 45, scope: !769)
!817 = !DILocation(line: 465, column: 21, scope: !769)
!818 = !DILocation(line: 467, column: 2, scope: !769)
!819 = !DILocation(line: 235, column: 84, scope: !553, inlinedAt: !820)
!820 = distinct !DILocation(line: 467, column: 2, scope: !769)
!821 = !DILocation(line: 236, column: 23, scope: !553, inlinedAt: !820)
!822 = !DILocation(line: 238, column: 9, scope: !553, inlinedAt: !820)
!823 = !DILocation(line: 261, column: 22, scope: !553, inlinedAt: !820)
!824 = !DILocation(line: 88, column: 80, scope: !563, inlinedAt: !825)
!825 = distinct !DILocation(line: 261, column: 2, scope: !553, inlinedAt: !820)
!826 = !DILocation(line: 91, column: 6, scope: !569, inlinedAt: !825)
!827 = !DILocation(line: 91, column: 10, scope: !569, inlinedAt: !825)
!828 = !DILocation(line: 91, column: 6, scope: !563, inlinedAt: !825)
!829 = !DILocation(line: 92, column: 3, scope: !573, inlinedAt: !825)
!830 = !DILocation(line: 94, column: 2, scope: !563, inlinedAt: !825)
!831 = !DILocation(line: 114, column: 1, scope: !563, inlinedAt: !825)
!832 = !DILocation(line: 470, column: 6, scope: !833)
!833 = distinct !DILexicalBlock(scope: !769, file: !293, line: 470, column: 6)
!834 = !DILocation(line: 470, column: 6, scope: !769)
!835 = !DILocation(line: 471, column: 3, scope: !836)
!836 = distinct !DILexicalBlock(scope: !833, file: !293, line: 470, column: 18)
!837 = !DILocation(line: 471, column: 8, scope: !838)
!838 = distinct !DILexicalBlock(scope: !836, file: !293, line: 471, column: 6)
!839 = !DILocation(line: 473, column: 15, scope: !836)
!840 = !DILocation(line: 473, column: 24, scope: !836)
!841 = !DILocation(line: 473, column: 44, scope: !836)
!842 = !DILocation(line: 473, column: 3, scope: !836)
!843 = !DILocation(line: 474, column: 2, scope: !836)
!844 = !DILocation(line: 476, column: 2, scope: !769)
!845 = !DILocation(line: 476, column: 7, scope: !846)
!846 = distinct !DILexicalBlock(scope: !769, file: !293, line: 476, column: 5)
!847 = !DILocation(line: 478, column: 9, scope: !769)
!848 = !DILocation(line: 478, column: 2, scope: !769)
!849 = distinct !DISubprogram(name: "work_flush_locked", scope: !293, file: !293, line: 431, type: !850, scopeLine: 433, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!850 = !DISubroutineType(types: !851)
!851 = !{!772, !121, !267}
!852 = !DILocalVariable(name: "work", arg: 1, scope: !849, file: !293, line: 431, type: !121)
!853 = !DILocation(line: 431, column: 47, scope: !849)
!854 = !DILocalVariable(name: "flusher", arg: 2, scope: !849, file: !293, line: 432, type: !267)
!855 = !DILocation(line: 432, column: 33, scope: !849)
!856 = !DILocalVariable(name: "need_flush", scope: !849, file: !293, line: 434, type: !772)
!857 = !DILocation(line: 434, column: 8, scope: !849)
!858 = !DILocation(line: 434, column: 33, scope: !849)
!859 = !DILocation(line: 434, column: 39, scope: !849)
!860 = !DILocation(line: 434, column: 22, scope: !849)
!861 = !DILocation(line: 435, column: 7, scope: !849)
!862 = !DILocation(line: 435, column: 43, scope: !849)
!863 = !DILocation(line: 437, column: 6, scope: !864)
!864 = distinct !DILexicalBlock(scope: !849, file: !293, line: 437, column: 6)
!865 = !DILocation(line: 437, column: 6, scope: !849)
!866 = !DILocalVariable(name: "queue", scope: !867, file: !293, line: 438, type: !137)
!867 = distinct !DILexicalBlock(scope: !864, file: !293, line: 437, column: 18)
!868 = !DILocation(line: 438, column: 20, scope: !867)
!869 = !DILocation(line: 438, column: 28, scope: !867)
!870 = !DILocation(line: 438, column: 34, scope: !867)
!871 = !DILocation(line: 442, column: 24, scope: !867)
!872 = !DILocation(line: 442, column: 31, scope: !867)
!873 = !DILocation(line: 442, column: 37, scope: !867)
!874 = !DILocation(line: 442, column: 3, scope: !867)
!875 = !DILocation(line: 443, column: 23, scope: !867)
!876 = !DILocation(line: 443, column: 3, scope: !867)
!877 = !DILocation(line: 444, column: 2, scope: !867)
!878 = !DILocation(line: 446, column: 9, scope: !849)
!879 = !DILocation(line: 446, column: 2, scope: !849)
!880 = distinct !DISubprogram(name: "k_sem_take", scope: !881, file: !881, line: 1093, type: !882, scopeLine: 1094, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!881 = !DIFile(filename: "zephyr/include/generated/syscalls/kernel.h", directory: "/home/sri/zephyrproject/zephyr/build")
!882 = !DISubroutineType(types: !883)
!883 = !{!120, !446, !376}
!884 = !DILocalVariable(name: "sem", arg: 1, scope: !880, file: !881, line: 1093, type: !446)
!885 = !DILocation(line: 1093, column: 45, scope: !880)
!886 = !DILocalVariable(name: "timeout", arg: 2, scope: !880, file: !881, line: 1093, type: !376)
!887 = !DILocation(line: 1093, column: 62, scope: !880)
!888 = !DILocation(line: 1102, column: 2, scope: !880)
!889 = !DILocation(line: 1102, column: 7, scope: !890)
!890 = distinct !DILexicalBlock(scope: !880, file: !881, line: 1102, column: 5)
!891 = !{i64 150120}
!892 = !DILocation(line: 1102, column: 47, scope: !890)
!893 = !DILocation(line: 1103, column: 27, scope: !880)
!894 = !DILocation(line: 1103, column: 9, scope: !880)
!895 = !DILocation(line: 1103, column: 2, scope: !880)
!896 = distinct !DISubprogram(name: "k_work_cancel", scope: !293, file: !293, line: 544, type: !753, scopeLine: 545, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !248)
!897 = !DILocalVariable(name: "work", arg: 1, scope: !896, file: !293, line: 544, type: !121)
!898 = !DILocation(line: 544, column: 34, scope: !896)
!899 = !DILocation(line: 549, column: 2, scope: !896)
!900 = !DILocation(line: 549, column: 7, scope: !901)
!901 = distinct !DILexicalBlock(scope: !896, file: !293, line: 549, column: 5)
!902 = !DILocalVariable(name: "key", scope: !896, file: !293, line: 551, type: !505)
!903 = !DILocation(line: 551, column: 19, scope: !896)
!904 = !DILocation(line: 160, column: 94, scope: !511, inlinedAt: !905)
!905 = distinct !DILocation(line: 551, column: 25, scope: !896)
!906 = !DILocation(line: 162, column: 9, scope: !511, inlinedAt: !905)
!907 = !DILocation(line: 163, column: 19, scope: !511, inlinedAt: !905)
!908 = !DILocation(line: 44, column: 15, scope: !521, inlinedAt: !909)
!909 = distinct !DILocation(line: 169, column: 10, scope: !511, inlinedAt: !905)
!910 = !DILocation(line: 48, column: 2, scope: !521, inlinedAt: !909)
!911 = !DILocation(line: 80, column: 9, scope: !521, inlinedAt: !909)
!912 = !DILocation(line: 169, column: 8, scope: !511, inlinedAt: !905)
!913 = !DILocation(line: 171, column: 26, scope: !511, inlinedAt: !905)
!914 = !DILocation(line: 110, column: 94, scope: !533, inlinedAt: !915)
!915 = distinct !DILocation(line: 171, column: 2, scope: !511, inlinedAt: !905)
!916 = !DILocation(line: 112, column: 9, scope: !533, inlinedAt: !915)
!917 = !DILocation(line: 177, column: 27, scope: !511, inlinedAt: !905)
!918 = !DILocation(line: 121, column: 95, scope: !541, inlinedAt: !919)
!919 = distinct !DILocation(line: 177, column: 2, scope: !511, inlinedAt: !905)
!920 = !DILocation(line: 123, column: 9, scope: !541, inlinedAt: !919)
!921 = !DILocation(line: 179, column: 2, scope: !511, inlinedAt: !905)
!922 = !DILocation(line: 551, column: 25, scope: !896)
!923 = !DILocalVariable(name: "ret", scope: !896, file: !293, line: 552, type: !120)
!924 = !DILocation(line: 552, column: 6, scope: !896)
!925 = !DILocation(line: 552, column: 32, scope: !896)
!926 = !DILocation(line: 552, column: 12, scope: !896)
!927 = !DILocation(line: 554, column: 2, scope: !896)
!928 = !DILocation(line: 235, column: 84, scope: !553, inlinedAt: !929)
!929 = distinct !DILocation(line: 554, column: 2, scope: !896)
!930 = !DILocation(line: 236, column: 23, scope: !553, inlinedAt: !929)
!931 = !DILocation(line: 238, column: 9, scope: !553, inlinedAt: !929)
!932 = !DILocation(line: 261, column: 22, scope: !553, inlinedAt: !929)
!933 = !DILocation(line: 88, column: 80, scope: !563, inlinedAt: !934)
!934 = distinct !DILocation(line: 261, column: 2, scope: !553, inlinedAt: !929)
!935 = !DILocation(line: 91, column: 6, scope: !569, inlinedAt: !934)
!936 = !DILocation(line: 91, column: 10, scope: !569, inlinedAt: !934)
!937 = !DILocation(line: 91, column: 6, scope: !563, inlinedAt: !934)
!938 = !DILocation(line: 92, column: 3, scope: !573, inlinedAt: !934)
!939 = !DILocation(line: 94, column: 2, scope: !563, inlinedAt: !934)
!940 = !DILocation(line: 114, column: 1, scope: !563, inlinedAt: !934)
!941 = !DILocation(line: 556, column: 2, scope: !896)
!942 = !DILocation(line: 556, column: 7, scope: !943)
!943 = distinct !DILexicalBlock(scope: !896, file: !293, line: 556, column: 5)
!944 = !DILocation(line: 558, column: 9, scope: !896)
!945 = !DILocation(line: 558, column: 2, scope: !896)
!946 = distinct !DISubprogram(name: "cancel_async_locked", scope: !293, file: !293, line: 492, type: !753, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!947 = !DILocalVariable(name: "work", arg: 1, scope: !946, file: !293, line: 492, type: !121)
!948 = !DILocation(line: 492, column: 47, scope: !946)
!949 = !DILocation(line: 495, column: 18, scope: !950)
!950 = distinct !DILexicalBlock(scope: !946, file: !293, line: 495, column: 6)
!951 = !DILocation(line: 495, column: 24, scope: !950)
!952 = !DILocation(line: 495, column: 7, scope: !950)
!953 = !DILocation(line: 495, column: 6, scope: !946)
!954 = !DILocation(line: 497, column: 23, scope: !955)
!955 = distinct !DILexicalBlock(scope: !950, file: !293, line: 495, column: 54)
!956 = !DILocation(line: 497, column: 29, scope: !955)
!957 = !DILocation(line: 497, column: 36, scope: !955)
!958 = !DILocation(line: 497, column: 3, scope: !955)
!959 = !DILocation(line: 498, column: 2, scope: !955)
!960 = !DILocalVariable(name: "ret", scope: !946, file: !293, line: 503, type: !120)
!961 = !DILocation(line: 503, column: 6, scope: !946)
!962 = !DILocation(line: 503, column: 33, scope: !946)
!963 = !DILocation(line: 503, column: 12, scope: !946)
!964 = !DILocation(line: 505, column: 6, scope: !965)
!965 = distinct !DILexicalBlock(scope: !946, file: !293, line: 505, column: 6)
!966 = !DILocation(line: 505, column: 10, scope: !965)
!967 = !DILocation(line: 505, column: 6, scope: !946)
!968 = !DILocation(line: 506, column: 13, scope: !969)
!969 = distinct !DILexicalBlock(scope: !965, file: !293, line: 505, column: 16)
!970 = !DILocation(line: 506, column: 19, scope: !969)
!971 = !DILocation(line: 506, column: 3, scope: !969)
!972 = !DILocation(line: 507, column: 30, scope: !969)
!973 = !DILocation(line: 507, column: 9, scope: !969)
!974 = !DILocation(line: 507, column: 7, scope: !969)
!975 = !DILocation(line: 508, column: 2, scope: !969)
!976 = !DILocation(line: 510, column: 9, scope: !946)
!977 = !DILocation(line: 510, column: 2, scope: !946)
!978 = distinct !DISubprogram(name: "k_work_cancel_sync", scope: !293, file: !293, line: 561, type: !770, scopeLine: 563, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !248)
!979 = !DILocalVariable(name: "work", arg: 1, scope: !978, file: !293, line: 561, type: !121)
!980 = !DILocation(line: 561, column: 41, scope: !978)
!981 = !DILocalVariable(name: "sync", arg: 2, scope: !978, file: !293, line: 562, type: !773)
!982 = !DILocation(line: 562, column: 24, scope: !978)
!983 = !DILocation(line: 572, column: 2, scope: !978)
!984 = !DILocation(line: 572, column: 7, scope: !985)
!985 = distinct !DILexicalBlock(scope: !978, file: !293, line: 572, column: 5)
!986 = !DILocalVariable(name: "canceller", scope: !978, file: !293, line: 574, type: !278)
!987 = !DILocation(line: 574, column: 27, scope: !978)
!988 = !DILocation(line: 574, column: 40, scope: !978)
!989 = !DILocation(line: 574, column: 46, scope: !978)
!990 = !DILocalVariable(name: "key", scope: !978, file: !293, line: 575, type: !505)
!991 = !DILocation(line: 575, column: 19, scope: !978)
!992 = !DILocation(line: 160, column: 94, scope: !511, inlinedAt: !993)
!993 = distinct !DILocation(line: 575, column: 25, scope: !978)
!994 = !DILocation(line: 162, column: 9, scope: !511, inlinedAt: !993)
!995 = !DILocation(line: 163, column: 19, scope: !511, inlinedAt: !993)
!996 = !DILocation(line: 44, column: 15, scope: !521, inlinedAt: !997)
!997 = distinct !DILocation(line: 169, column: 10, scope: !511, inlinedAt: !993)
!998 = !DILocation(line: 48, column: 2, scope: !521, inlinedAt: !997)
!999 = !DILocation(line: 80, column: 9, scope: !521, inlinedAt: !997)
!1000 = !DILocation(line: 169, column: 8, scope: !511, inlinedAt: !993)
!1001 = !DILocation(line: 171, column: 26, scope: !511, inlinedAt: !993)
!1002 = !DILocation(line: 110, column: 94, scope: !533, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 171, column: 2, scope: !511, inlinedAt: !993)
!1004 = !DILocation(line: 112, column: 9, scope: !533, inlinedAt: !1003)
!1005 = !DILocation(line: 177, column: 27, scope: !511, inlinedAt: !993)
!1006 = !DILocation(line: 121, column: 95, scope: !541, inlinedAt: !1007)
!1007 = distinct !DILocation(line: 177, column: 2, scope: !511, inlinedAt: !993)
!1008 = !DILocation(line: 123, column: 9, scope: !541, inlinedAt: !1007)
!1009 = !DILocation(line: 179, column: 2, scope: !511, inlinedAt: !993)
!1010 = !DILocation(line: 575, column: 25, scope: !978)
!1011 = !DILocalVariable(name: "pending", scope: !978, file: !293, line: 576, type: !772)
!1012 = !DILocation(line: 576, column: 8, scope: !978)
!1013 = !DILocation(line: 576, column: 40, scope: !978)
!1014 = !DILocation(line: 576, column: 19, scope: !978)
!1015 = !DILocation(line: 576, column: 46, scope: !978)
!1016 = !DILocalVariable(name: "need_wait", scope: !978, file: !293, line: 577, type: !772)
!1017 = !DILocation(line: 577, column: 8, scope: !978)
!1018 = !DILocation(line: 579, column: 6, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !978, file: !293, line: 579, column: 6)
!1020 = !DILocation(line: 579, column: 6, scope: !978)
!1021 = !DILocation(line: 580, column: 29, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1019, file: !293, line: 579, column: 15)
!1023 = !DILocation(line: 580, column: 9, scope: !1022)
!1024 = !DILocation(line: 581, column: 34, scope: !1022)
!1025 = !DILocation(line: 581, column: 40, scope: !1022)
!1026 = !DILocation(line: 581, column: 15, scope: !1022)
!1027 = !DILocation(line: 581, column: 13, scope: !1022)
!1028 = !DILocation(line: 582, column: 2, scope: !1022)
!1029 = !DILocation(line: 584, column: 2, scope: !978)
!1030 = !DILocation(line: 235, column: 84, scope: !553, inlinedAt: !1031)
!1031 = distinct !DILocation(line: 584, column: 2, scope: !978)
!1032 = !DILocation(line: 236, column: 23, scope: !553, inlinedAt: !1031)
!1033 = !DILocation(line: 238, column: 9, scope: !553, inlinedAt: !1031)
!1034 = !DILocation(line: 261, column: 22, scope: !553, inlinedAt: !1031)
!1035 = !DILocation(line: 88, column: 80, scope: !563, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 261, column: 2, scope: !553, inlinedAt: !1031)
!1037 = !DILocation(line: 91, column: 6, scope: !569, inlinedAt: !1036)
!1038 = !DILocation(line: 91, column: 10, scope: !569, inlinedAt: !1036)
!1039 = !DILocation(line: 91, column: 6, scope: !563, inlinedAt: !1036)
!1040 = !DILocation(line: 92, column: 3, scope: !573, inlinedAt: !1036)
!1041 = !DILocation(line: 94, column: 2, scope: !563, inlinedAt: !1036)
!1042 = !DILocation(line: 114, column: 1, scope: !563, inlinedAt: !1036)
!1043 = !DILocation(line: 586, column: 6, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !978, file: !293, line: 586, column: 6)
!1045 = !DILocation(line: 586, column: 6, scope: !978)
!1046 = !DILocation(line: 587, column: 3, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1044, file: !293, line: 586, column: 17)
!1048 = !DILocation(line: 587, column: 8, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1047, file: !293, line: 587, column: 6)
!1050 = !DILocation(line: 589, column: 15, scope: !1047)
!1051 = !DILocation(line: 589, column: 26, scope: !1047)
!1052 = !DILocation(line: 589, column: 46, scope: !1047)
!1053 = !DILocation(line: 589, column: 3, scope: !1047)
!1054 = !DILocation(line: 590, column: 2, scope: !1047)
!1055 = !DILocation(line: 592, column: 2, scope: !978)
!1056 = !DILocation(line: 592, column: 7, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !978, file: !293, line: 592, column: 5)
!1058 = !DILocation(line: 593, column: 9, scope: !978)
!1059 = !DILocation(line: 593, column: 2, scope: !978)
!1060 = distinct !DISubprogram(name: "cancel_sync_locked", scope: !293, file: !293, line: 528, type: !1061, scopeLine: 530, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !248)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!772, !121, !278}
!1063 = !DILocalVariable(name: "work", arg: 1, scope: !1060, file: !293, line: 528, type: !121)
!1064 = !DILocation(line: 528, column: 48, scope: !1060)
!1065 = !DILocalVariable(name: "canceller", arg: 2, scope: !1060, file: !293, line: 529, type: !278)
!1066 = !DILocation(line: 529, column: 36, scope: !1060)
!1067 = !DILocalVariable(name: "ret", scope: !1060, file: !293, line: 531, type: !772)
!1068 = !DILocation(line: 531, column: 8, scope: !1060)
!1069 = !DILocation(line: 531, column: 25, scope: !1060)
!1070 = !DILocation(line: 531, column: 31, scope: !1060)
!1071 = !DILocation(line: 531, column: 14, scope: !1060)
!1072 = !DILocation(line: 537, column: 6, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1060, file: !293, line: 537, column: 6)
!1074 = !DILocation(line: 537, column: 6, scope: !1060)
!1075 = !DILocation(line: 538, column: 20, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1073, file: !293, line: 537, column: 11)
!1077 = !DILocation(line: 538, column: 31, scope: !1076)
!1078 = !DILocation(line: 538, column: 3, scope: !1076)
!1079 = !DILocation(line: 539, column: 2, scope: !1076)
!1080 = !DILocation(line: 541, column: 9, scope: !1060)
!1081 = !DILocation(line: 541, column: 2, scope: !1060)
!1082 = distinct !DISubprogram(name: "k_work_queue_init", scope: !293, file: !293, line: 699, type: !1083, scopeLine: 700, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !248)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{null, !137}
!1085 = !DILocalVariable(name: "queue", arg: 1, scope: !1082, file: !293, line: 699, type: !137)
!1086 = !DILocation(line: 699, column: 41, scope: !1082)
!1087 = !DILocation(line: 703, column: 3, scope: !1082)
!1088 = !DILocation(line: 703, column: 11, scope: !1082)
!1089 = !DILocation(line: 707, column: 2, scope: !1082)
!1090 = !DILocation(line: 707, column: 7, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1082, file: !293, line: 707, column: 5)
!1092 = !DILocation(line: 708, column: 1, scope: !1082)
!1093 = distinct !DISubprogram(name: "k_work_queue_start", scope: !293, file: !293, line: 710, type: !1094, scopeLine: 715, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !248)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{null, !137, !1096, !1103, !120, !1105}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 32)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !1098, line: 44, baseType: !1099)
!1098 = !DIFile(filename: "include/zephyr/sys/arch_interface.h", directory: "/home/sri/zephyrproject/zephyr")
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !1100, line: 47, size: 8, elements: !1101)
!1100 = !DIFile(filename: "include/zephyr/kernel/thread_stack.h", directory: "/home/sri/zephyrproject/zephyr")
!1101 = !{!1102}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1099, file: !1100, line: 48, baseType: !266, size: 8)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1104, line: 51, baseType: !200)
!1104 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/string.h", directory: "")
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_queue_config", file: !6, line: 3973, size: 64, elements: !1108)
!1108 = !{!1109, !1112}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1107, file: !6, line: 3978, baseType: !1110, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 32)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "no_yield", scope: !1107, file: !6, line: 3992, baseType: !772, size: 8, offset: 32)
!1113 = !DILocalVariable(name: "queue", arg: 1, scope: !1093, file: !293, line: 710, type: !137)
!1114 = !DILocation(line: 710, column: 42, scope: !1093)
!1115 = !DILocalVariable(name: "stack", arg: 2, scope: !1093, file: !293, line: 711, type: !1096)
!1116 = !DILocation(line: 711, column: 22, scope: !1093)
!1117 = !DILocalVariable(name: "stack_size", arg: 3, scope: !1093, file: !293, line: 712, type: !1103)
!1118 = !DILocation(line: 712, column: 11, scope: !1093)
!1119 = !DILocalVariable(name: "prio", arg: 4, scope: !1093, file: !293, line: 713, type: !120)
!1120 = !DILocation(line: 713, column: 8, scope: !1093)
!1121 = !DILocalVariable(name: "cfg", arg: 5, scope: !1093, file: !293, line: 714, type: !1105)
!1122 = !DILocation(line: 714, column: 38, scope: !1093)
!1123 = !DILocalVariable(name: "flags", scope: !1093, file: !293, line: 719, type: !199)
!1124 = !DILocation(line: 719, column: 11, scope: !1093)
!1125 = !DILocation(line: 721, column: 2, scope: !1093)
!1126 = !DILocation(line: 721, column: 7, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1093, file: !293, line: 721, column: 5)
!1128 = !DILocation(line: 723, column: 18, scope: !1093)
!1129 = !DILocation(line: 723, column: 25, scope: !1093)
!1130 = !DILocation(line: 723, column: 2, scope: !1093)
!1131 = !DILocation(line: 724, column: 16, scope: !1093)
!1132 = !DILocation(line: 724, column: 23, scope: !1093)
!1133 = !DILocation(line: 724, column: 2, scope: !1093)
!1134 = !DILocation(line: 725, column: 16, scope: !1093)
!1135 = !DILocation(line: 725, column: 23, scope: !1093)
!1136 = !DILocation(line: 725, column: 2, scope: !1093)
!1137 = !DILocation(line: 727, column: 7, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1093, file: !293, line: 727, column: 6)
!1139 = !DILocation(line: 727, column: 11, scope: !1138)
!1140 = !DILocation(line: 727, column: 17, scope: !1138)
!1141 = !DILocation(line: 727, column: 20, scope: !1138)
!1142 = !DILocation(line: 727, column: 25, scope: !1138)
!1143 = !DILocation(line: 727, column: 6, scope: !1093)
!1144 = !DILocation(line: 728, column: 9, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1138, file: !293, line: 727, column: 35)
!1146 = !DILocation(line: 729, column: 2, scope: !1145)
!1147 = !DILocation(line: 735, column: 13, scope: !1093)
!1148 = !DILocation(line: 735, column: 20, scope: !1093)
!1149 = !DILocation(line: 735, column: 27, scope: !1093)
!1150 = !DILocation(line: 735, column: 2, scope: !1093)
!1151 = !DILocation(line: 737, column: 25, scope: !1093)
!1152 = !DILocation(line: 737, column: 32, scope: !1093)
!1153 = !DILocation(line: 737, column: 40, scope: !1093)
!1154 = !DILocation(line: 737, column: 47, scope: !1093)
!1155 = !DILocation(line: 738, column: 27, scope: !1093)
!1156 = !DILocation(line: 739, column: 10, scope: !1093)
!1157 = !DILocation(line: 739, column: 34, scope: !1093)
!1158 = !DILocation(line: 737, column: 8, scope: !1093)
!1159 = !DILocation(line: 741, column: 7, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1093, file: !293, line: 741, column: 6)
!1161 = !DILocation(line: 741, column: 11, scope: !1160)
!1162 = !DILocation(line: 741, column: 17, scope: !1160)
!1163 = !DILocation(line: 741, column: 21, scope: !1160)
!1164 = !DILocation(line: 741, column: 26, scope: !1160)
!1165 = !DILocation(line: 741, column: 31, scope: !1160)
!1166 = !DILocation(line: 741, column: 6, scope: !1093)
!1167 = !DILocation(line: 742, column: 22, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1160, file: !293, line: 741, column: 38)
!1169 = !DILocation(line: 742, column: 29, scope: !1168)
!1170 = !DILocation(line: 742, column: 37, scope: !1168)
!1171 = !DILocation(line: 742, column: 42, scope: !1168)
!1172 = !DILocation(line: 742, column: 3, scope: !1168)
!1173 = !DILocation(line: 743, column: 2, scope: !1168)
!1174 = !DILocation(line: 745, column: 18, scope: !1093)
