; ModuleID = '../bc_files/work.bc'
source_filename = "/home/sri/zephyrproject/zephyr/kernel/work.c"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-arm-none-eabi"

%struct.k_spinlock = type {}
%struct.k_work_q = type { %struct.k_thread, %struct._slist, %struct._wait_q_t, %struct._wait_q_t, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, ptr, %struct._wait_q_t, i32, ptr, %struct._thread_arch }
%struct._thread_base = type { %union.anon, ptr, i8, i8, %union.anon.2, i32, ptr, %struct._timeout }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.1 }
%union.anon.0 = type { ptr }
%union.anon.1 = type { ptr }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, ptr, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_arch = type { i32, i32 }
%struct._slist = type { ptr, ptr }
%struct._wait_q_t = type { %struct._dnode }
%struct.z_kernel = type { [1 x %struct._cpu], %struct._ready_q }
%struct._cpu = type { i32, ptr, ptr, ptr, i8, %struct._cpu_arch }
%struct._cpu_arch = type {}
%struct._ready_q = type { ptr, %struct._dnode }
%struct.k_timer = type { %struct._timeout, %struct._wait_q_t, ptr, ptr, %struct.k_timeout_t, i32, ptr }
%struct.k_timeout_t = type { i64 }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %struct._wait_q_t }
%struct._sflist = type { ptr, ptr }

!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_AUXDISPLAY", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_CHARGER", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE_EMUL", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_EMUL_SENSOR_BACKEND_API", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_FUEL_GAUGE", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_HWSPINLOCK", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR_PARENT", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_RETAINED_MEM", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_RTC", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_SMBUS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 68)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_TGPIO", value: 69)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 70)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_SVC", value: 71)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12_EMUL", value: 72)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_BC12", value: 73)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 74)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 75)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_BACKEND_API", value: 76)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 77)
!112 = !DIEnumerator(name: "K_OBJ_LAST", value: 78)
!113 = !{!114, !119, !120, !121, !265, !267, !277, !137, !278, !284}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !115, line: 46, baseType: !116)
!115 = !DIFile(filename: "include/zephyr/sys_clock.h", directory: "/home/sri/zephyrproject/zephyr")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !117, line: 59, baseType: !118)
!117 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/stdint.h", directory: "")
!118 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!120 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !6, line: 3849, size: 128, elements: !123)
!123 = !{!124, !131, !136, !264}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !122, file: !6, line: 3855, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !126, line: 39, baseType: !127)
!126 = !DIFile(filename: "include/zephyr/sys/slist.h", directory: "/home/sri/zephyrproject/zephyr")
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !126, line: 33, size: 32, elements: !128)
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !126, line: 34, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !122, file: !6, line: 3858, baseType: !132, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !6, line: 3257, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !121}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !122, file: !6, line: 3861, baseType: !137, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !6, line: 3996, size: 1152, elements: !139)
!139 = !{!140, !254, !261, !262, !263}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !138, file: !6, line: 3998, baseType: !141, size: 896)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !142, line: 250, size: 896, elements: !143)
!142 = !DIFile(filename: "include/zephyr/kernel/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!143 = !{!144, !213, !226, !227, !228, !229, !249}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !141, file: !142, line: 252, baseType: !145, size: 384)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !142, line: 58, size: 384, elements: !146)
!146 = !{!147, !175, !183, !185, !186, !198, !201, !202}
!147 = !DIDerivedType(tag: DW_TAG_member, scope: !145, file: !142, line: 61, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !145, file: !142, line: 61, size: 64, elements: !149)
!149 = !{!150, !166}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !148, file: !142, line: 62, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !152, line: 55, baseType: !153)
!152 = !DIFile(filename: "include/zephyr/sys/dlist.h", directory: "/home/sri/zephyrproject/zephyr")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !152, line: 37, size: 64, elements: !154)
!154 = !{!155, !161}
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !153, file: !152, line: 38, baseType: !156, size: 32)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !153, file: !152, line: 38, size: 32, elements: !157)
!157 = !{!158, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !156, file: !152, line: 39, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !156, file: !152, line: 40, baseType: !159, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !153, file: !152, line: 42, baseType: !162, size: 32, offset: 32)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !153, file: !152, line: 42, size: 32, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !162, file: !152, line: 43, baseType: !159, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !162, file: !152, line: 44, baseType: !159, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !148, file: !142, line: 63, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 58, size: 64, elements: !169)
!168 = !DIFile(filename: "include/zephyr/sys/rb.h", directory: "/home/sri/zephyrproject/zephyr")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !167, file: !168, line: 60, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !145, file: !142, line: 69, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !178, line: 243, baseType: !179)
!178 = !DIFile(filename: "include/zephyr/kernel_structs.h", directory: "/home/sri/zephyrproject/zephyr")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 241, size: 64, elements: !180)
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !179, file: !178, line: 242, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !152, line: 51, baseType: !153)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !145, file: !142, line: 72, baseType: !184, size: 8, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !117, line: 62, baseType: !32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !145, file: !142, line: 75, baseType: !184, size: 8, offset: 104)
!186 = !DIDerivedType(tag: DW_TAG_member, scope: !145, file: !142, line: 91, baseType: !187, size: 16, offset: 112)
!187 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !145, file: !142, line: 91, size: 16, elements: !188)
!188 = !{!189, !196}
!189 = !DIDerivedType(tag: DW_TAG_member, scope: !187, file: !142, line: 92, baseType: !190, size: 16)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !187, file: !142, line: 92, size: 16, elements: !191)
!191 = !{!192, !195}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !190, file: !142, line: 97, baseType: !193, size: 8)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !117, line: 56, baseType: !194)
!194 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !190, file: !142, line: 98, baseType: !184, size: 8, offset: 8)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !187, file: !142, line: 101, baseType: !197, size: 16)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !117, line: 63, baseType: !7)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !145, file: !142, line: 108, baseType: !199, size: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !117, line: 64, baseType: !200)
!200 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !145, file: !142, line: 132, baseType: !119, size: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !145, file: !142, line: 136, baseType: !203, size: 192, offset: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !178, line: 254, size: 192, elements: !204)
!204 = !{!205, !206, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !203, file: !178, line: 255, baseType: !151, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !203, file: !178, line: 256, baseType: !207, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !178, line: 252, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !203, file: !178, line: 259, baseType: !116, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !141, file: !142, line: 255, baseType: !214, size: 288, offset: 384)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !215, line: 25, size: 288, elements: !216)
!215 = !DIFile(filename: "include/zephyr/arch/arm/thread.h", directory: "/home/sri/zephyrproject/zephyr")
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !214, file: !215, line: 26, baseType: !199, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !214, file: !215, line: 27, baseType: !199, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !214, file: !215, line: 28, baseType: !199, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !214, file: !215, line: 29, baseType: !199, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !214, file: !215, line: 30, baseType: !199, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !214, file: !215, line: 31, baseType: !199, size: 32, offset: 160)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !214, file: !215, line: 32, baseType: !199, size: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !214, file: !215, line: 33, baseType: !199, size: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !214, file: !215, line: 34, baseType: !199, size: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !141, file: !142, line: 258, baseType: !119, size: 32, offset: 672)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !141, file: !142, line: 261, baseType: !177, size: 64, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !141, file: !142, line: 302, baseType: !120, size: 32, offset: 768)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !141, file: !142, line: 333, baseType: !230, size: 32, offset: 800)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !6, line: 5291, size: 160, elements: !232)
!232 = !{!233, !244, !245}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !231, file: !6, line: 5292, baseType: !234, size: 96)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !235, line: 56, size: 96, elements: !236)
!235 = !DIFile(filename: "include/zephyr/sys/sys_heap.h", directory: "/home/sri/zephyrproject/zephyr")
!236 = !{!237, !240, !241}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !234, file: !235, line: 57, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !235, line: 57, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !234, file: !235, line: 58, baseType: !119, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !234, file: !235, line: 59, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !243, line: 46, baseType: !200)
!243 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/lib/clang/17/include/stddef.h", directory: "")
!244 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !231, file: !6, line: 5293, baseType: !177, size: 64, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !231, file: !6, line: 5294, baseType: !246, offset: 160)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !247, line: 45, elements: !248)
!247 = !DIFile(filename: "include/zephyr/spinlock.h", directory: "/home/sri/zephyrproject/zephyr")
!248 = !{}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !141, file: !142, line: 355, baseType: !250, size: 64, offset: 832)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !215, line: 60, size: 64, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !250, file: !215, line: 63, baseType: !199, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !250, file: !215, line: 66, baseType: !199, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !138, file: !6, line: 4005, baseType: !255, size: 64, offset: 896)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !126, line: 49, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !126, line: 42, size: 64, elements: !257)
!257 = !{!258, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !256, file: !126, line: 43, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !256, file: !126, line: 44, baseType: !259, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !138, file: !6, line: 4008, baseType: !177, size: 64, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !138, file: !6, line: 4011, baseType: !177, size: 64, offset: 1024)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !138, file: !6, line: 4014, baseType: !199, size: 32, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !122, file: !6, line: 3869, baseType: !199, size: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_work_flusher", file: !6, line: 3926, size: 256, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !268, file: !6, line: 3927, baseType: !122, size: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !268, file: !6, line: 3928, baseType: !272, size: 128, offset: 128)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !6, line: 3092, size: 128, elements: !273)
!273 = !{!274, !275, !276}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !272, file: !6, line: 3093, baseType: !177, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !272, file: !6, line: 3094, baseType: !200, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !272, file: !6, line: 3095, baseType: !200, size: 32, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_work_canceller", file: !6, line: 3937, size: 192, elements: !280)
!280 = !{!281, !282, !283}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !279, file: !6, line: 3938, baseType: !125, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !279, file: !6, line: 3939, baseType: !121, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !279, file: !6, line: 3940, baseType: !272, size: 128, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_delayable", file: !6, line: 3877, size: 384, elements: !286)
!286 = !{!287, !288, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !285, file: !6, line: 3879, baseType: !122, size: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !285, file: !6, line: 3882, baseType: !203, size: 192, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !285, file: !6, line: 3885, baseType: !137, size: 32, offset: 320)
!290 = !{!0, !291}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "pending_cancels", scope: !2, file: !293, line: 81, type: !255, isLocal: true, isDefinition: true)
!293 = !DIFile(filename: "kernel/work.c", directory: "/home/sri/zephyrproject/zephyr")
!294 = !{i32 7, !"Dwarf Version", i32 4}
!295 = !{i32 2, !"Debug Info Version", i32 3}
!296 = !{i32 1, !"wchar_size", i32 4}
!297 = !{i32 1, !"static_rwdata", i32 1}
!298 = !{i32 1, !"enumsize_buildattr", i32 1}
!299 = !{i32 1, !"armlib_unavailable", i32 0}
!300 = !{!"Component: Arm Compiler for Embedded 6.20 Tool: armclang [5e9ad700]"}
!301 = distinct !DISubprogram(name: "z_impl_k_object_access_grant", scope: !31, file: !31, line: 223, type: !302, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !307)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !304, !306}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!307 = !{!308, !309}
!308 = !DILocalVariable(name: "object", arg: 1, scope: !301, file: !31, line: 223, type: !304)
!309 = !DILocalVariable(name: "thread", arg: 2, scope: !301, file: !31, line: 224, type: !306)
!310 = !DILocation(line: 223, column: 61, scope: !301)
!311 = !DILocation(line: 224, column: 24, scope: !301)
!312 = !DILocation(line: 226, column: 9, scope: !301)
!313 = !DILocation(line: 227, column: 9, scope: !301)
!314 = !DILocation(line: 228, column: 1, scope: !301)
!315 = distinct !DISubprogram(name: "z_impl_k_object_release", scope: !31, file: !31, line: 243, type: !316, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !318)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !304}
!318 = !{!319}
!319 = !DILocalVariable(name: "object", arg: 1, scope: !315, file: !31, line: 243, type: !304)
!320 = !DILocation(line: 243, column: 56, scope: !315)
!321 = !DILocation(line: 245, column: 9, scope: !315)
!322 = !DILocation(line: 246, column: 1, scope: !315)
!323 = distinct !DISubprogram(name: "z_impl_k_object_alloc", scope: !31, file: !31, line: 359, type: !324, scopeLine: 360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !326)
!324 = !DISubroutineType(types: !325)
!325 = !{!119, !30}
!326 = !{!327}
!327 = !DILocalVariable(name: "otype", arg: 1, scope: !323, file: !31, line: 359, type: !30)
!328 = !DILocation(line: 359, column: 58, scope: !323)
!329 = !DILocation(line: 361, column: 9, scope: !323)
!330 = !DILocation(line: 363, column: 2, scope: !323)
!331 = distinct !DISubprogram(name: "z_impl_k_object_alloc_size", scope: !31, file: !31, line: 366, type: !332, scopeLine: 368, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !334)
!332 = !DISubroutineType(types: !333)
!333 = !{!119, !30, !242}
!334 = !{!335, !336}
!335 = !DILocalVariable(name: "otype", arg: 1, scope: !331, file: !31, line: 366, type: !30)
!336 = !DILocalVariable(name: "size", arg: 2, scope: !331, file: !31, line: 367, type: !242)
!337 = !DILocation(line: 366, column: 63, scope: !331)
!338 = !DILocation(line: 367, column: 13, scope: !331)
!339 = !DILocation(line: 369, column: 9, scope: !331)
!340 = !DILocation(line: 370, column: 9, scope: !331)
!341 = !DILocation(line: 372, column: 2, scope: !331)
!342 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_expires_ticks", scope: !6, file: !6, line: 656, type: !343, scopeLine: 658, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !347)
!343 = !DISubroutineType(types: !344)
!344 = !{!114, !345}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!347 = !{!348}
!348 = !DILocalVariable(name: "t", arg: 1, scope: !342, file: !6, line: 657, type: !345)
!349 = !DILocation(line: 657, column: 30, scope: !342)
!350 = !DILocation(line: 659, column: 28, scope: !342)
!351 = !DILocation(line: 659, column: 31, scope: !342)
!352 = !DILocation(line: 659, column: 36, scope: !342)
!353 = !DILocation(line: 659, column: 9, scope: !342)
!354 = !DILocation(line: 659, column: 2, scope: !342)
!355 = distinct !DISubprogram(name: "z_impl_k_thread_timeout_remaining_ticks", scope: !6, file: !6, line: 671, type: !343, scopeLine: 673, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !356)
!356 = !{!357}
!357 = !DILocalVariable(name: "t", arg: 1, scope: !355, file: !6, line: 672, type: !345)
!358 = !DILocation(line: 672, column: 30, scope: !355)
!359 = !DILocation(line: 674, column: 30, scope: !355)
!360 = !DILocation(line: 674, column: 33, scope: !355)
!361 = !DILocation(line: 674, column: 38, scope: !355)
!362 = !DILocation(line: 674, column: 9, scope: !355)
!363 = !DILocation(line: 674, column: 2, scope: !355)
!364 = distinct !DISubprogram(name: "z_impl_k_timer_expires_ticks", scope: !6, file: !6, line: 1634, type: !365, scopeLine: 1636, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !386)
!365 = !DISubroutineType(types: !366)
!366 = !{!114, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !6, line: 1439, size: 448, elements: !370)
!370 = !{!371, !372, !373, !378, !379, !384, !385}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !369, file: !6, line: 1445, baseType: !203, size: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !369, file: !6, line: 1448, baseType: !177, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !369, file: !6, line: 1451, baseType: !374, size: 32, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !369, file: !6, line: 1454, baseType: !374, size: 32, offset: 288)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !369, file: !6, line: 1457, baseType: !380, size: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !115, line: 67, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 65, size: 64, elements: !382)
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !381, file: !115, line: 66, baseType: !114, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !369, file: !6, line: 1460, baseType: !199, size: 32, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !369, file: !6, line: 1463, baseType: !119, size: 32, offset: 416)
!386 = !{!387}
!387 = !DILocalVariable(name: "timer", arg: 1, scope: !364, file: !6, line: 1635, type: !367)
!388 = !DILocation(line: 1635, column: 34, scope: !364)
!389 = !DILocation(line: 1637, column: 28, scope: !364)
!390 = !DILocation(line: 1637, column: 35, scope: !364)
!391 = !DILocation(line: 1637, column: 9, scope: !364)
!392 = !DILocation(line: 1637, column: 2, scope: !364)
!393 = distinct !DISubprogram(name: "z_impl_k_timer_remaining_ticks", scope: !6, file: !6, line: 1649, type: !365, scopeLine: 1651, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !394)
!394 = !{!395}
!395 = !DILocalVariable(name: "timer", arg: 1, scope: !393, file: !6, line: 1650, type: !367)
!396 = !DILocation(line: 1650, column: 34, scope: !393)
!397 = !DILocation(line: 1652, column: 30, scope: !393)
!398 = !DILocation(line: 1652, column: 37, scope: !393)
!399 = !DILocation(line: 1652, column: 9, scope: !393)
!400 = !DILocation(line: 1652, column: 2, scope: !393)
!401 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_set", scope: !6, file: !6, line: 1689, type: !402, scopeLine: 1691, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !404)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !377, !119}
!404 = !{!405, !406}
!405 = !DILocalVariable(name: "timer", arg: 1, scope: !401, file: !6, line: 1689, type: !377)
!406 = !DILocalVariable(name: "user_data", arg: 2, scope: !401, file: !6, line: 1690, type: !119)
!407 = !DILocation(line: 1689, column: 65, scope: !401)
!408 = !DILocation(line: 1690, column: 19, scope: !401)
!409 = !DILocation(line: 1692, column: 21, scope: !401)
!410 = !DILocation(line: 1692, column: 2, scope: !401)
!411 = !DILocation(line: 1692, column: 9, scope: !401)
!412 = !DILocation(line: 1692, column: 19, scope: !401)
!413 = !DILocation(line: 1693, column: 1, scope: !401)
!414 = distinct !DISubprogram(name: "z_impl_k_timer_user_data_get", scope: !6, file: !6, line: 1704, type: !415, scopeLine: 1705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !417)
!415 = !DISubroutineType(types: !416)
!416 = !{!119, !367}
!417 = !{!418}
!418 = !DILocalVariable(name: "timer", arg: 1, scope: !414, file: !6, line: 1704, type: !367)
!419 = !DILocation(line: 1704, column: 72, scope: !414)
!420 = !DILocation(line: 1706, column: 9, scope: !414)
!421 = !DILocation(line: 1706, column: 16, scope: !414)
!422 = !DILocation(line: 1706, column: 2, scope: !414)
!423 = distinct !DISubprogram(name: "z_impl_k_queue_is_empty", scope: !6, file: !6, line: 2071, type: !424, scopeLine: 2072, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !444)
!424 = !DISubroutineType(types: !425)
!425 = !{!120, !426}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !6, line: 1830, size: 128, elements: !428)
!428 = !{!429, !442, !443}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !427, file: !6, line: 1831, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !431, line: 60, baseType: !432)
!431 = !DIFile(filename: "include/zephyr/sys/sflist.h", directory: "/home/sri/zephyrproject/zephyr")
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !431, line: 53, size: 64, elements: !433)
!433 = !{!434, !441}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !432, file: !431, line: 54, baseType: !435, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !431, line: 50, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !431, line: 44, size: 32, elements: !438)
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !437, file: !431, line: 45, baseType: !440, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !431, line: 40, baseType: !199)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !432, file: !431, line: 55, baseType: !435, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !427, file: !6, line: 1832, baseType: !246, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !427, file: !6, line: 1833, baseType: !177, size: 64, offset: 64)
!444 = !{!445}
!445 = !DILocalVariable(name: "queue", arg: 1, scope: !423, file: !6, line: 2071, type: !426)
!446 = !DILocation(line: 2071, column: 59, scope: !423)
!447 = !DILocation(line: 2073, column: 35, scope: !423)
!448 = !DILocation(line: 2073, column: 42, scope: !423)
!449 = !DILocation(line: 2073, column: 14, scope: !423)
!450 = !DILocation(line: 2073, column: 9, scope: !423)
!451 = !DILocation(line: 2073, column: 2, scope: !423)
!452 = distinct !DISubprogram(name: "z_impl_k_sem_count_get", scope: !6, file: !6, line: 3209, type: !453, scopeLine: 3210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !456)
!453 = !DISubroutineType(types: !454)
!454 = !{!200, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!456 = !{!457}
!457 = !DILocalVariable(name: "sem", arg: 1, scope: !452, file: !6, line: 3209, type: !455)
!458 = !DILocation(line: 3209, column: 65, scope: !452)
!459 = !DILocation(line: 3211, column: 9, scope: !452)
!460 = !DILocation(line: 3211, column: 14, scope: !452)
!461 = !DILocation(line: 3211, column: 2, scope: !452)
!462 = distinct !DISubprogram(name: "z_impl_k_msgq_num_free_get", scope: !6, file: !6, line: 4649, type: !463, scopeLine: 4650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !478)
!463 = !DISubroutineType(types: !464)
!464 = !{!199, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !6, line: 4390, size: 320, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !466, file: !6, line: 4392, baseType: !177, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !466, file: !6, line: 4394, baseType: !246, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !466, file: !6, line: 4396, baseType: !242, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !466, file: !6, line: 4398, baseType: !199, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !466, file: !6, line: 4400, baseType: !265, size: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !466, file: !6, line: 4402, baseType: !265, size: 32, offset: 160)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !466, file: !6, line: 4404, baseType: !265, size: 32, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !466, file: !6, line: 4406, baseType: !265, size: 32, offset: 224)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !466, file: !6, line: 4408, baseType: !199, size: 32, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !466, file: !6, line: 4413, baseType: !184, size: 8, offset: 288)
!478 = !{!479}
!479 = !DILocalVariable(name: "msgq", arg: 1, scope: !462, file: !6, line: 4649, type: !465)
!480 = !DILocation(line: 4649, column: 66, scope: !462)
!481 = !DILocation(line: 4651, column: 9, scope: !462)
!482 = !DILocation(line: 4651, column: 15, scope: !462)
!483 = !DILocation(line: 4651, column: 26, scope: !462)
!484 = !DILocation(line: 4651, column: 32, scope: !462)
!485 = !DILocation(line: 4651, column: 24, scope: !462)
!486 = !DILocation(line: 4651, column: 2, scope: !462)
!487 = distinct !DISubprogram(name: "z_impl_k_msgq_num_used_get", scope: !6, file: !6, line: 4665, type: !463, scopeLine: 4666, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !488)
!488 = !{!489}
!489 = !DILocalVariable(name: "msgq", arg: 1, scope: !487, file: !6, line: 4665, type: !465)
!490 = !DILocation(line: 4665, column: 66, scope: !487)
!491 = !DILocation(line: 4667, column: 9, scope: !487)
!492 = !DILocation(line: 4667, column: 15, scope: !487)
!493 = !DILocation(line: 4667, column: 2, scope: !487)
!494 = distinct !DISubprogram(name: "k_work_init", scope: !293, file: !293, line: 134, type: !495, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !497)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !121, !132}
!497 = !{!498, !499}
!498 = !DILocalVariable(name: "work", arg: 1, scope: !494, file: !293, line: 134, type: !121)
!499 = !DILocalVariable(name: "handler", arg: 2, scope: !494, file: !293, line: 135, type: !132)
!500 = !DILocation(line: 134, column: 33, scope: !494)
!501 = !DILocation(line: 135, column: 22, scope: !494)
!502 = !DILocation(line: 140, column: 3, scope: !494)
!503 = !DILocation(line: 140, column: 25, scope: !494)
!504 = !DILocation(line: 140, column: 38, scope: !494)
!505 = !DILocation(line: 140, column: 10, scope: !494)
!506 = !DILocation(line: 142, column: 2, scope: !494)
!507 = !DILocation(line: 142, column: 7, scope: !508)
!508 = distinct !DILexicalBlock(scope: !494, file: !293, line: 142, column: 5)
!509 = !DILocation(line: 143, column: 1, scope: !494)
!510 = distinct !DISubprogram(name: "k_work_busy_get", scope: !293, file: !293, line: 150, type: !511, scopeLine: 151, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !515)
!511 = !DISubroutineType(types: !512)
!512 = !{!120, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!515 = !{!516, !517, !522}
!516 = !DILocalVariable(name: "work", arg: 1, scope: !510, file: !293, line: 150, type: !513)
!517 = !DILocalVariable(name: "key", scope: !510, file: !293, line: 152, type: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !247, line: 108, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !247, line: 34, size: 32, elements: !520)
!520 = !{!521}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !519, file: !247, line: 35, baseType: !120, size: 32)
!522 = !DILocalVariable(name: "ret", scope: !510, file: !293, line: 153, type: !120)
!523 = !DILocation(line: 150, column: 42, scope: !510)
!524 = !DILocation(line: 152, column: 2, scope: !510)
!525 = !DILocation(line: 152, column: 19, scope: !510)
!526 = !DILocalVariable(name: "l", arg: 1, scope: !527, file: !247, line: 160, type: !530)
!527 = distinct !DISubprogram(name: "k_spin_lock", scope: !247, file: !247, line: 160, type: !528, scopeLine: 161, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !531)
!528 = !DISubroutineType(types: !529)
!529 = !{!518, !530}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!531 = !{!526, !532}
!532 = !DILocalVariable(name: "k", scope: !527, file: !247, line: 163, type: !518)
!533 = !DILocation(line: 160, column: 94, scope: !527, inlinedAt: !534)
!534 = distinct !DILocation(line: 152, column: 25, scope: !510)
!535 = !DILocation(line: 162, column: 9, scope: !527, inlinedAt: !534)
!536 = !DILocation(line: 163, column: 19, scope: !527, inlinedAt: !534)
!537 = !DILocation(line: 44, column: 2, scope: !538, inlinedAt: !544)
!538 = distinct !DISubprogram(name: "arch_irq_lock", scope: !539, file: !539, line: 42, type: !540, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !542)
!539 = !DIFile(filename: "include/zephyr/arch/arm/asm_inline_gcc.h", directory: "/home/sri/zephyrproject/zephyr")
!540 = !DISubroutineType(types: !541)
!541 = !{!200}
!542 = !{!543}
!543 = !DILocalVariable(name: "key", scope: !538, file: !539, line: 44, type: !200)
!544 = distinct !DILocation(line: 169, column: 10, scope: !527, inlinedAt: !534)
!545 = !DILocation(line: 44, column: 15, scope: !538, inlinedAt: !544)
!546 = !DILocation(line: 48, column: 2, scope: !538, inlinedAt: !544)
!547 = !{i64 66942}
!548 = !DILocation(line: 80, column: 9, scope: !538, inlinedAt: !544)
!549 = !DILocation(line: 81, column: 1, scope: !538, inlinedAt: !544)
!550 = !DILocation(line: 169, column: 8, scope: !527, inlinedAt: !534)
!551 = !DILocation(line: 171, column: 26, scope: !527, inlinedAt: !534)
!552 = !DILocalVariable(name: "l", arg: 1, scope: !553, file: !247, line: 110, type: !530)
!553 = distinct !DISubprogram(name: "z_spinlock_validate_pre", scope: !247, file: !247, line: 110, type: !554, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !556)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !530}
!556 = !{!552}
!557 = !DILocation(line: 110, column: 94, scope: !553, inlinedAt: !558)
!558 = distinct !DILocation(line: 171, column: 2, scope: !527, inlinedAt: !534)
!559 = !DILocation(line: 112, column: 9, scope: !553, inlinedAt: !558)
!560 = !DILocation(line: 177, column: 27, scope: !527, inlinedAt: !534)
!561 = !DILocalVariable(name: "l", arg: 1, scope: !562, file: !247, line: 121, type: !530)
!562 = distinct !DISubprogram(name: "z_spinlock_validate_post", scope: !247, file: !247, line: 121, type: !554, scopeLine: 122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !563)
!563 = !{!561}
!564 = !DILocation(line: 121, column: 95, scope: !562, inlinedAt: !565)
!565 = distinct !DILocation(line: 177, column: 2, scope: !527, inlinedAt: !534)
!566 = !DILocation(line: 123, column: 9, scope: !562, inlinedAt: !565)
!567 = !DILocation(line: 179, column: 2, scope: !527, inlinedAt: !534)
!568 = !DILocation(line: 152, column: 25, scope: !510)
!569 = !DILocation(line: 153, column: 2, scope: !510)
!570 = !DILocation(line: 153, column: 6, scope: !510)
!571 = !DILocation(line: 153, column: 33, scope: !510)
!572 = !DILocation(line: 153, column: 12, scope: !510)
!573 = !DILocation(line: 155, column: 2, scope: !510)
!574 = !DILocalVariable(name: "l", arg: 1, scope: !575, file: !247, line: 235, type: !530)
!575 = distinct !DISubprogram(name: "k_spin_unlock", scope: !247, file: !247, line: 235, type: !576, scopeLine: 237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !578)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !530, !518}
!578 = !{!574, !579}
!579 = !DILocalVariable(name: "key", arg: 2, scope: !575, file: !247, line: 236, type: !518)
!580 = !DILocation(line: 235, column: 84, scope: !575, inlinedAt: !581)
!581 = distinct !DILocation(line: 155, column: 2, scope: !510)
!582 = !DILocation(line: 236, column: 23, scope: !575, inlinedAt: !581)
!583 = !DILocation(line: 238, column: 9, scope: !575, inlinedAt: !581)
!584 = !DILocation(line: 261, column: 22, scope: !575, inlinedAt: !581)
!585 = !DILocalVariable(name: "key", arg: 1, scope: !586, file: !539, line: 88, type: !200)
!586 = distinct !DISubprogram(name: "arch_irq_unlock", scope: !539, file: !539, line: 88, type: !587, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !200}
!589 = !{!585}
!590 = !DILocation(line: 88, column: 80, scope: !586, inlinedAt: !591)
!591 = distinct !DILocation(line: 261, column: 2, scope: !575, inlinedAt: !581)
!592 = !DILocation(line: 91, column: 6, scope: !593, inlinedAt: !591)
!593 = distinct !DILexicalBlock(scope: !586, file: !539, line: 91, column: 6)
!594 = !DILocation(line: 91, column: 10, scope: !593, inlinedAt: !591)
!595 = !DILocation(line: 91, column: 6, scope: !586, inlinedAt: !591)
!596 = !DILocation(line: 92, column: 3, scope: !597, inlinedAt: !591)
!597 = distinct !DILexicalBlock(scope: !593, file: !539, line: 91, column: 17)
!598 = !DILocation(line: 94, column: 2, scope: !586, inlinedAt: !591)
!599 = !{i64 67246}
!600 = !DILocation(line: 114, column: 1, scope: !586, inlinedAt: !591)
!601 = !DILocation(line: 157, column: 9, scope: !510)
!602 = !DILocation(line: 158, column: 1, scope: !510)
!603 = !DILocation(line: 157, column: 2, scope: !510)
!604 = distinct !DISubprogram(name: "work_busy_get_locked", scope: !293, file: !293, line: 145, type: !511, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !605)
!605 = !{!606}
!606 = !DILocalVariable(name: "work", arg: 1, scope: !604, file: !293, line: 145, type: !513)
!607 = !DILocation(line: 145, column: 61, scope: !604)
!608 = !DILocation(line: 147, column: 20, scope: !604)
!609 = !DILocation(line: 147, column: 26, scope: !604)
!610 = !DILocation(line: 147, column: 9, scope: !604)
!611 = !DILocation(line: 147, column: 33, scope: !604)
!612 = !DILocation(line: 147, column: 2, scope: !604)
!613 = distinct !DISubprogram(name: "z_work_submit_to_queue", scope: !293, file: !293, line: 369, type: !614, scopeLine: 371, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !616)
!614 = !DISubroutineType(types: !615)
!615 = !{!120, !137, !121}
!616 = !{!617, !618, !619, !620}
!617 = !DILocalVariable(name: "queue", arg: 1, scope: !613, file: !293, line: 369, type: !137)
!618 = !DILocalVariable(name: "work", arg: 2, scope: !613, file: !293, line: 370, type: !121)
!619 = !DILocalVariable(name: "key", scope: !613, file: !293, line: 375, type: !518)
!620 = !DILocalVariable(name: "ret", scope: !613, file: !293, line: 377, type: !120)
!621 = !DILocation(line: 369, column: 45, scope: !613)
!622 = !DILocation(line: 370, column: 20, scope: !613)
!623 = !DILocation(line: 375, column: 2, scope: !613)
!624 = !DILocation(line: 375, column: 19, scope: !613)
!625 = !DILocation(line: 160, column: 94, scope: !527, inlinedAt: !626)
!626 = distinct !DILocation(line: 375, column: 25, scope: !613)
!627 = !DILocation(line: 162, column: 9, scope: !527, inlinedAt: !626)
!628 = !DILocation(line: 163, column: 19, scope: !527, inlinedAt: !626)
!629 = !DILocation(line: 44, column: 2, scope: !538, inlinedAt: !630)
!630 = distinct !DILocation(line: 169, column: 10, scope: !527, inlinedAt: !626)
!631 = !DILocation(line: 44, column: 15, scope: !538, inlinedAt: !630)
!632 = !DILocation(line: 48, column: 2, scope: !538, inlinedAt: !630)
!633 = !DILocation(line: 80, column: 9, scope: !538, inlinedAt: !630)
!634 = !DILocation(line: 81, column: 1, scope: !538, inlinedAt: !630)
!635 = !DILocation(line: 169, column: 8, scope: !527, inlinedAt: !626)
!636 = !DILocation(line: 171, column: 26, scope: !527, inlinedAt: !626)
!637 = !DILocation(line: 110, column: 94, scope: !553, inlinedAt: !638)
!638 = distinct !DILocation(line: 171, column: 2, scope: !527, inlinedAt: !626)
!639 = !DILocation(line: 112, column: 9, scope: !553, inlinedAt: !638)
!640 = !DILocation(line: 177, column: 27, scope: !527, inlinedAt: !626)
!641 = !DILocation(line: 121, column: 95, scope: !562, inlinedAt: !642)
!642 = distinct !DILocation(line: 177, column: 2, scope: !527, inlinedAt: !626)
!643 = !DILocation(line: 123, column: 9, scope: !562, inlinedAt: !642)
!644 = !DILocation(line: 179, column: 2, scope: !527, inlinedAt: !626)
!645 = !DILocation(line: 375, column: 25, scope: !613)
!646 = !DILocation(line: 377, column: 2, scope: !613)
!647 = !DILocation(line: 377, column: 6, scope: !613)
!648 = !DILocation(line: 377, column: 35, scope: !613)
!649 = !DILocation(line: 377, column: 12, scope: !613)
!650 = !DILocation(line: 379, column: 2, scope: !613)
!651 = !DILocation(line: 235, column: 84, scope: !575, inlinedAt: !652)
!652 = distinct !DILocation(line: 379, column: 2, scope: !613)
!653 = !DILocation(line: 236, column: 23, scope: !575, inlinedAt: !652)
!654 = !DILocation(line: 238, column: 9, scope: !575, inlinedAt: !652)
!655 = !DILocation(line: 261, column: 22, scope: !575, inlinedAt: !652)
!656 = !DILocation(line: 88, column: 80, scope: !586, inlinedAt: !657)
!657 = distinct !DILocation(line: 261, column: 2, scope: !575, inlinedAt: !652)
!658 = !DILocation(line: 91, column: 6, scope: !593, inlinedAt: !657)
!659 = !DILocation(line: 91, column: 10, scope: !593, inlinedAt: !657)
!660 = !DILocation(line: 91, column: 6, scope: !586, inlinedAt: !657)
!661 = !DILocation(line: 92, column: 3, scope: !597, inlinedAt: !657)
!662 = !DILocation(line: 94, column: 2, scope: !586, inlinedAt: !657)
!663 = !DILocation(line: 114, column: 1, scope: !586, inlinedAt: !657)
!664 = !DILocation(line: 381, column: 9, scope: !613)
!665 = !DILocation(line: 382, column: 1, scope: !613)
!666 = !DILocation(line: 381, column: 2, scope: !613)
!667 = distinct !DISubprogram(name: "submit_to_queue_locked", scope: !293, file: !293, line: 311, type: !668, scopeLine: 313, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !671)
!668 = !DISubroutineType(types: !669)
!669 = !{!120, !121, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!671 = !{!672, !673, !674, !675}
!672 = !DILocalVariable(name: "work", arg: 1, scope: !667, file: !293, line: 311, type: !121)
!673 = !DILocalVariable(name: "queuep", arg: 2, scope: !667, file: !293, line: 312, type: !670)
!674 = !DILocalVariable(name: "ret", scope: !667, file: !293, line: 314, type: !120)
!675 = !DILocalVariable(name: "rc", scope: !676, file: !293, line: 339, type: !120)
!676 = distinct !DILexicalBlock(scope: !677, file: !293, line: 319, column: 58)
!677 = distinct !DILexicalBlock(scope: !678, file: !293, line: 319, column: 13)
!678 = distinct !DILexicalBlock(scope: !667, file: !293, line: 316, column: 6)
!679 = !DILocation(line: 311, column: 50, scope: !667)
!680 = !DILocation(line: 312, column: 25, scope: !667)
!681 = !DILocation(line: 314, column: 2, scope: !667)
!682 = !DILocation(line: 314, column: 6, scope: !667)
!683 = !DILocation(line: 316, column: 17, scope: !678)
!684 = !DILocation(line: 316, column: 23, scope: !678)
!685 = !DILocation(line: 316, column: 6, scope: !678)
!686 = !DILocation(line: 316, column: 6, scope: !667)
!687 = !DILocation(line: 318, column: 7, scope: !688)
!688 = distinct !DILexicalBlock(scope: !678, file: !293, line: 316, column: 53)
!689 = !DILocation(line: 319, column: 2, scope: !688)
!690 = !DILocation(line: 319, column: 25, scope: !677)
!691 = !DILocation(line: 319, column: 31, scope: !677)
!692 = !DILocation(line: 319, column: 14, scope: !677)
!693 = !DILocation(line: 319, column: 13, scope: !678)
!694 = !DILocation(line: 321, column: 7, scope: !676)
!695 = !DILocation(line: 325, column: 8, scope: !696)
!696 = distinct !DILexicalBlock(scope: !676, file: !293, line: 325, column: 7)
!697 = !DILocation(line: 325, column: 7, scope: !696)
!698 = !DILocation(line: 325, column: 15, scope: !696)
!699 = !DILocation(line: 325, column: 7, scope: !676)
!700 = !DILocation(line: 326, column: 14, scope: !701)
!701 = distinct !DILexicalBlock(scope: !696, file: !293, line: 325, column: 21)
!702 = !DILocation(line: 326, column: 20, scope: !701)
!703 = !DILocation(line: 326, column: 5, scope: !701)
!704 = !DILocation(line: 326, column: 12, scope: !701)
!705 = !DILocation(line: 327, column: 3, scope: !701)
!706 = !DILocation(line: 333, column: 18, scope: !707)
!707 = distinct !DILexicalBlock(scope: !676, file: !293, line: 333, column: 7)
!708 = !DILocation(line: 333, column: 24, scope: !707)
!709 = !DILocation(line: 333, column: 7, scope: !707)
!710 = !DILocation(line: 333, column: 7, scope: !676)
!711 = !DILocation(line: 335, column: 14, scope: !712)
!712 = distinct !DILexicalBlock(scope: !707, file: !293, line: 333, column: 52)
!713 = !DILocation(line: 335, column: 20, scope: !712)
!714 = !DILocation(line: 335, column: 5, scope: !712)
!715 = !DILocation(line: 335, column: 12, scope: !712)
!716 = !DILocation(line: 336, column: 8, scope: !712)
!717 = !DILocation(line: 337, column: 3, scope: !712)
!718 = !DILocation(line: 339, column: 3, scope: !676)
!719 = !DILocation(line: 339, column: 7, scope: !676)
!720 = !DILocation(line: 339, column: 33, scope: !676)
!721 = !DILocation(line: 339, column: 32, scope: !676)
!722 = !DILocation(line: 339, column: 41, scope: !676)
!723 = !DILocation(line: 339, column: 12, scope: !676)
!724 = !DILocation(line: 341, column: 7, scope: !725)
!725 = distinct !DILexicalBlock(scope: !676, file: !293, line: 341, column: 7)
!726 = !DILocation(line: 341, column: 10, scope: !725)
!727 = !DILocation(line: 341, column: 7, scope: !676)
!728 = !DILocation(line: 342, column: 10, scope: !729)
!729 = distinct !DILexicalBlock(scope: !725, file: !293, line: 341, column: 15)
!730 = !DILocation(line: 342, column: 8, scope: !729)
!731 = !DILocation(line: 343, column: 3, scope: !729)
!732 = !DILocation(line: 344, column: 14, scope: !733)
!733 = distinct !DILexicalBlock(scope: !725, file: !293, line: 343, column: 10)
!734 = !DILocation(line: 344, column: 20, scope: !733)
!735 = !DILocation(line: 344, column: 4, scope: !733)
!736 = !DILocation(line: 345, column: 19, scope: !733)
!737 = !DILocation(line: 345, column: 18, scope: !733)
!738 = !DILocation(line: 345, column: 4, scope: !733)
!739 = !DILocation(line: 345, column: 10, scope: !733)
!740 = !DILocation(line: 345, column: 16, scope: !733)
!741 = !DILocation(line: 347, column: 2, scope: !677)
!742 = !DILocation(line: 347, column: 2, scope: !676)
!743 = !DILocation(line: 351, column: 6, scope: !744)
!744 = distinct !DILexicalBlock(scope: !667, file: !293, line: 351, column: 6)
!745 = !DILocation(line: 351, column: 10, scope: !744)
!746 = !DILocation(line: 351, column: 6, scope: !667)
!747 = !DILocation(line: 352, column: 4, scope: !748)
!748 = distinct !DILexicalBlock(scope: !744, file: !293, line: 351, column: 16)
!749 = !DILocation(line: 352, column: 11, scope: !748)
!750 = !DILocation(line: 353, column: 2, scope: !748)
!751 = !DILocation(line: 355, column: 9, scope: !667)
!752 = !DILocation(line: 356, column: 1, scope: !667)
!753 = !DILocation(line: 355, column: 2, scope: !667)
!754 = distinct !DISubprogram(name: "k_work_submit_to_queue", scope: !293, file: !293, line: 384, type: !614, scopeLine: 386, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !755)
!755 = !{!756, !757, !758}
!756 = !DILocalVariable(name: "queue", arg: 1, scope: !754, file: !293, line: 384, type: !137)
!757 = !DILocalVariable(name: "work", arg: 2, scope: !754, file: !293, line: 385, type: !121)
!758 = !DILocalVariable(name: "ret", scope: !754, file: !293, line: 389, type: !120)
!759 = !DILocation(line: 384, column: 45, scope: !754)
!760 = !DILocation(line: 385, column: 23, scope: !754)
!761 = !DILocation(line: 387, column: 2, scope: !754)
!762 = !DILocation(line: 387, column: 7, scope: !763)
!763 = distinct !DILexicalBlock(scope: !754, file: !293, line: 387, column: 5)
!764 = !DILocation(line: 389, column: 2, scope: !754)
!765 = !DILocation(line: 389, column: 6, scope: !754)
!766 = !DILocation(line: 389, column: 35, scope: !754)
!767 = !DILocation(line: 389, column: 42, scope: !754)
!768 = !DILocation(line: 389, column: 12, scope: !754)
!769 = !DILocation(line: 396, column: 6, scope: !770)
!770 = distinct !DILexicalBlock(scope: !754, file: !293, line: 396, column: 6)
!771 = !DILocation(line: 396, column: 10, scope: !770)
!772 = !DILocation(line: 396, column: 6, scope: !754)
!773 = !DILocation(line: 397, column: 3, scope: !774)
!774 = distinct !DILexicalBlock(scope: !770, file: !293, line: 396, column: 15)
!775 = !DILocation(line: 398, column: 2, scope: !774)
!776 = !DILocation(line: 400, column: 2, scope: !754)
!777 = !DILocation(line: 400, column: 7, scope: !778)
!778 = distinct !DILexicalBlock(scope: !754, file: !293, line: 400, column: 5)
!779 = !DILocation(line: 402, column: 9, scope: !754)
!780 = !DILocation(line: 403, column: 1, scope: !754)
!781 = !DILocation(line: 402, column: 2, scope: !754)
!782 = distinct !DISubprogram(name: "z_reschedule_unlocked", scope: !783, file: !783, line: 75, type: !784, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !248)
!783 = !DIFile(filename: "kernel/include/ksched.h", directory: "/home/sri/zephyrproject/zephyr")
!784 = !DISubroutineType(types: !785)
!785 = !{null}
!786 = !DILocation(line: 44, column: 2, scope: !538, inlinedAt: !787)
!787 = distinct !DILocation(line: 77, column: 30, scope: !782)
!788 = !DILocation(line: 44, column: 15, scope: !538, inlinedAt: !787)
!789 = !DILocation(line: 48, column: 2, scope: !538, inlinedAt: !787)
!790 = !DILocation(line: 80, column: 9, scope: !538, inlinedAt: !787)
!791 = !DILocation(line: 81, column: 1, scope: !538, inlinedAt: !787)
!792 = !DILocation(line: 77, column: 9, scope: !782)
!793 = !DILocation(line: 78, column: 1, scope: !782)
!794 = distinct !DISubprogram(name: "k_work_submit", scope: !293, file: !293, line: 405, type: !795, scopeLine: 406, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{!120, !121}
!797 = !{!798, !799}
!798 = !DILocalVariable(name: "work", arg: 1, scope: !794, file: !293, line: 405, type: !121)
!799 = !DILocalVariable(name: "ret", scope: !794, file: !293, line: 409, type: !120)
!800 = !DILocation(line: 405, column: 34, scope: !794)
!801 = !DILocation(line: 407, column: 2, scope: !794)
!802 = !DILocation(line: 407, column: 7, scope: !803)
!803 = distinct !DILexicalBlock(scope: !794, file: !293, line: 407, column: 5)
!804 = !DILocation(line: 409, column: 2, scope: !794)
!805 = !DILocation(line: 409, column: 6, scope: !794)
!806 = !DILocation(line: 409, column: 50, scope: !794)
!807 = !DILocation(line: 409, column: 12, scope: !794)
!808 = !DILocation(line: 411, column: 2, scope: !794)
!809 = !DILocation(line: 411, column: 7, scope: !810)
!810 = distinct !DILexicalBlock(scope: !794, file: !293, line: 411, column: 5)
!811 = !DILocation(line: 413, column: 9, scope: !794)
!812 = !DILocation(line: 414, column: 1, scope: !794)
!813 = !DILocation(line: 413, column: 2, scope: !794)
!814 = distinct !DISubprogram(name: "k_work_flush", scope: !293, file: !293, line: 449, type: !815, scopeLine: 451, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !826)
!815 = !DISubroutineType(types: !816)
!816 = !{!817, !121, !818}
!817 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_sync", file: !6, line: 3960, size: 256, elements: !820)
!820 = !{!821}
!821 = !DIDerivedType(tag: DW_TAG_member, scope: !819, file: !6, line: 3961, baseType: !822, size: 256)
!822 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !819, file: !6, line: 3961, size: 256, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flusher", scope: !822, file: !6, line: 3962, baseType: !268, size: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "canceller", scope: !822, file: !6, line: 3963, baseType: !279, size: 192)
!826 = !{!827, !828, !829, !830, !831}
!827 = !DILocalVariable(name: "work", arg: 1, scope: !814, file: !293, line: 449, type: !121)
!828 = !DILocalVariable(name: "sync", arg: 2, scope: !814, file: !293, line: 450, type: !818)
!829 = !DILocalVariable(name: "flusher", scope: !814, file: !293, line: 462, type: !267)
!830 = !DILocalVariable(name: "key", scope: !814, file: !293, line: 463, type: !518)
!831 = !DILocalVariable(name: "need_flush", scope: !814, file: !293, line: 465, type: !817)
!832 = !DILocation(line: 449, column: 35, scope: !814)
!833 = !DILocation(line: 450, column: 25, scope: !814)
!834 = !DILocation(line: 460, column: 2, scope: !814)
!835 = !DILocation(line: 460, column: 7, scope: !836)
!836 = distinct !DILexicalBlock(scope: !814, file: !293, line: 460, column: 5)
!837 = !DILocation(line: 462, column: 2, scope: !814)
!838 = !DILocation(line: 462, column: 25, scope: !814)
!839 = !DILocation(line: 462, column: 36, scope: !814)
!840 = !DILocation(line: 462, column: 42, scope: !814)
!841 = !DILocation(line: 463, column: 2, scope: !814)
!842 = !DILocation(line: 463, column: 19, scope: !814)
!843 = !DILocation(line: 160, column: 94, scope: !527, inlinedAt: !844)
!844 = distinct !DILocation(line: 463, column: 25, scope: !814)
!845 = !DILocation(line: 162, column: 9, scope: !527, inlinedAt: !844)
!846 = !DILocation(line: 163, column: 19, scope: !527, inlinedAt: !844)
!847 = !DILocation(line: 44, column: 2, scope: !538, inlinedAt: !848)
!848 = distinct !DILocation(line: 169, column: 10, scope: !527, inlinedAt: !844)
!849 = !DILocation(line: 44, column: 15, scope: !538, inlinedAt: !848)
!850 = !DILocation(line: 48, column: 2, scope: !538, inlinedAt: !848)
!851 = !DILocation(line: 80, column: 9, scope: !538, inlinedAt: !848)
!852 = !DILocation(line: 81, column: 1, scope: !538, inlinedAt: !848)
!853 = !DILocation(line: 169, column: 8, scope: !527, inlinedAt: !844)
!854 = !DILocation(line: 171, column: 26, scope: !527, inlinedAt: !844)
!855 = !DILocation(line: 110, column: 94, scope: !553, inlinedAt: !856)
!856 = distinct !DILocation(line: 171, column: 2, scope: !527, inlinedAt: !844)
!857 = !DILocation(line: 112, column: 9, scope: !553, inlinedAt: !856)
!858 = !DILocation(line: 177, column: 27, scope: !527, inlinedAt: !844)
!859 = !DILocation(line: 121, column: 95, scope: !562, inlinedAt: !860)
!860 = distinct !DILocation(line: 177, column: 2, scope: !527, inlinedAt: !844)
!861 = !DILocation(line: 123, column: 9, scope: !562, inlinedAt: !860)
!862 = !DILocation(line: 179, column: 2, scope: !527, inlinedAt: !844)
!863 = !DILocation(line: 463, column: 25, scope: !814)
!864 = !DILocation(line: 465, column: 2, scope: !814)
!865 = !DILocation(line: 465, column: 8, scope: !814)
!866 = !DILocation(line: 465, column: 39, scope: !814)
!867 = !DILocation(line: 465, column: 45, scope: !814)
!868 = !DILocation(line: 465, column: 21, scope: !814)
!869 = !DILocation(line: 467, column: 2, scope: !814)
!870 = !DILocation(line: 235, column: 84, scope: !575, inlinedAt: !871)
!871 = distinct !DILocation(line: 467, column: 2, scope: !814)
!872 = !DILocation(line: 236, column: 23, scope: !575, inlinedAt: !871)
!873 = !DILocation(line: 238, column: 9, scope: !575, inlinedAt: !871)
!874 = !DILocation(line: 261, column: 22, scope: !575, inlinedAt: !871)
!875 = !DILocation(line: 88, column: 80, scope: !586, inlinedAt: !876)
!876 = distinct !DILocation(line: 261, column: 2, scope: !575, inlinedAt: !871)
!877 = !DILocation(line: 91, column: 6, scope: !593, inlinedAt: !876)
!878 = !DILocation(line: 91, column: 10, scope: !593, inlinedAt: !876)
!879 = !DILocation(line: 91, column: 6, scope: !586, inlinedAt: !876)
!880 = !DILocation(line: 92, column: 3, scope: !597, inlinedAt: !876)
!881 = !DILocation(line: 94, column: 2, scope: !586, inlinedAt: !876)
!882 = !DILocation(line: 114, column: 1, scope: !586, inlinedAt: !876)
!883 = !DILocation(line: 470, column: 6, scope: !884)
!884 = distinct !DILexicalBlock(scope: !814, file: !293, line: 470, column: 6)
!885 = !{i8 0, i8 2}
!886 = !DILocation(line: 470, column: 6, scope: !814)
!887 = !DILocation(line: 471, column: 3, scope: !888)
!888 = distinct !DILexicalBlock(scope: !884, file: !293, line: 470, column: 18)
!889 = !DILocation(line: 471, column: 8, scope: !890)
!890 = distinct !DILexicalBlock(scope: !888, file: !293, line: 471, column: 6)
!891 = !DILocation(line: 473, column: 15, scope: !888)
!892 = !DILocation(line: 473, column: 24, scope: !888)
!893 = !DILocation(line: 473, column: 44, scope: !888)
!894 = !DILocation(line: 473, column: 3, scope: !888)
!895 = !DILocation(line: 474, column: 2, scope: !888)
!896 = !DILocation(line: 476, column: 2, scope: !814)
!897 = !DILocation(line: 476, column: 7, scope: !898)
!898 = distinct !DILexicalBlock(scope: !814, file: !293, line: 476, column: 5)
!899 = !DILocation(line: 478, column: 9, scope: !814)
!900 = !DILocation(line: 479, column: 1, scope: !814)
!901 = !DILocation(line: 478, column: 2, scope: !814)
!902 = distinct !DISubprogram(name: "work_flush_locked", scope: !293, file: !293, line: 431, type: !903, scopeLine: 433, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !905)
!903 = !DISubroutineType(types: !904)
!904 = !{!817, !121, !267}
!905 = !{!906, !907, !908, !909}
!906 = !DILocalVariable(name: "work", arg: 1, scope: !902, file: !293, line: 431, type: !121)
!907 = !DILocalVariable(name: "flusher", arg: 2, scope: !902, file: !293, line: 432, type: !267)
!908 = !DILocalVariable(name: "need_flush", scope: !902, file: !293, line: 434, type: !817)
!909 = !DILocalVariable(name: "queue", scope: !910, file: !293, line: 438, type: !137)
!910 = distinct !DILexicalBlock(scope: !911, file: !293, line: 437, column: 18)
!911 = distinct !DILexicalBlock(scope: !902, file: !293, line: 437, column: 6)
!912 = !DILocation(line: 431, column: 47, scope: !902)
!913 = !DILocation(line: 432, column: 33, scope: !902)
!914 = !DILocation(line: 434, column: 2, scope: !902)
!915 = !DILocation(line: 434, column: 8, scope: !902)
!916 = !DILocation(line: 434, column: 33, scope: !902)
!917 = !DILocation(line: 434, column: 39, scope: !902)
!918 = !DILocation(line: 434, column: 22, scope: !902)
!919 = !DILocation(line: 435, column: 7, scope: !902)
!920 = !DILocation(line: 435, column: 43, scope: !902)
!921 = !DILocation(line: 437, column: 6, scope: !911)
!922 = !DILocation(line: 437, column: 6, scope: !902)
!923 = !DILocation(line: 438, column: 3, scope: !910)
!924 = !DILocation(line: 438, column: 20, scope: !910)
!925 = !DILocation(line: 438, column: 28, scope: !910)
!926 = !DILocation(line: 438, column: 34, scope: !910)
!927 = !DILocation(line: 442, column: 24, scope: !910)
!928 = !DILocation(line: 442, column: 31, scope: !910)
!929 = !DILocation(line: 442, column: 37, scope: !910)
!930 = !DILocation(line: 442, column: 3, scope: !910)
!931 = !DILocation(line: 443, column: 23, scope: !910)
!932 = !DILocation(line: 443, column: 3, scope: !910)
!933 = !DILocation(line: 444, column: 2, scope: !911)
!934 = !DILocation(line: 444, column: 2, scope: !910)
!935 = !DILocation(line: 446, column: 9, scope: !902)
!936 = !DILocation(line: 447, column: 1, scope: !902)
!937 = !DILocation(line: 446, column: 2, scope: !902)
!938 = distinct !DISubprogram(name: "k_sem_take", scope: !939, file: !939, line: 1093, type: !940, scopeLine: 1094, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !942)
!939 = !DIFile(filename: "zephyr/include/generated/syscalls/kernel.h", directory: "/home/sri/zephyrproject/zephyr/build")
!940 = !DISubroutineType(types: !941)
!941 = !{!120, !455, !380}
!942 = !{!943, !944}
!943 = !DILocalVariable(name: "sem", arg: 1, scope: !938, file: !939, line: 1093, type: !455)
!944 = !DILocalVariable(name: "timeout", arg: 2, scope: !938, file: !939, line: 1093, type: !380)
!945 = !DILocation(line: 1093, column: 45, scope: !938)
!946 = !DILocation(line: 1093, column: 62, scope: !938)
!947 = !DILocation(line: 1102, column: 2, scope: !938)
!948 = !DILocation(line: 1102, column: 7, scope: !949)
!949 = distinct !DILexicalBlock(scope: !938, file: !939, line: 1102, column: 5)
!950 = !{i64 150120}
!951 = !DILocation(line: 1102, column: 47, scope: !949)
!952 = !DILocation(line: 1103, column: 27, scope: !938)
!953 = !DILocation(line: 1103, column: 9, scope: !938)
!954 = !DILocation(line: 1103, column: 2, scope: !938)
!955 = distinct !DISubprogram(name: "k_work_cancel", scope: !293, file: !293, line: 544, type: !795, scopeLine: 545, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !956)
!956 = !{!957, !958, !959}
!957 = !DILocalVariable(name: "work", arg: 1, scope: !955, file: !293, line: 544, type: !121)
!958 = !DILocalVariable(name: "key", scope: !955, file: !293, line: 551, type: !518)
!959 = !DILocalVariable(name: "ret", scope: !955, file: !293, line: 552, type: !120)
!960 = !DILocation(line: 544, column: 34, scope: !955)
!961 = !DILocation(line: 549, column: 2, scope: !955)
!962 = !DILocation(line: 549, column: 7, scope: !963)
!963 = distinct !DILexicalBlock(scope: !955, file: !293, line: 549, column: 5)
!964 = !DILocation(line: 551, column: 2, scope: !955)
!965 = !DILocation(line: 551, column: 19, scope: !955)
!966 = !DILocation(line: 160, column: 94, scope: !527, inlinedAt: !967)
!967 = distinct !DILocation(line: 551, column: 25, scope: !955)
!968 = !DILocation(line: 162, column: 9, scope: !527, inlinedAt: !967)
!969 = !DILocation(line: 163, column: 19, scope: !527, inlinedAt: !967)
!970 = !DILocation(line: 44, column: 2, scope: !538, inlinedAt: !971)
!971 = distinct !DILocation(line: 169, column: 10, scope: !527, inlinedAt: !967)
!972 = !DILocation(line: 44, column: 15, scope: !538, inlinedAt: !971)
!973 = !DILocation(line: 48, column: 2, scope: !538, inlinedAt: !971)
!974 = !DILocation(line: 80, column: 9, scope: !538, inlinedAt: !971)
!975 = !DILocation(line: 81, column: 1, scope: !538, inlinedAt: !971)
!976 = !DILocation(line: 169, column: 8, scope: !527, inlinedAt: !967)
!977 = !DILocation(line: 171, column: 26, scope: !527, inlinedAt: !967)
!978 = !DILocation(line: 110, column: 94, scope: !553, inlinedAt: !979)
!979 = distinct !DILocation(line: 171, column: 2, scope: !527, inlinedAt: !967)
!980 = !DILocation(line: 112, column: 9, scope: !553, inlinedAt: !979)
!981 = !DILocation(line: 177, column: 27, scope: !527, inlinedAt: !967)
!982 = !DILocation(line: 121, column: 95, scope: !562, inlinedAt: !983)
!983 = distinct !DILocation(line: 177, column: 2, scope: !527, inlinedAt: !967)
!984 = !DILocation(line: 123, column: 9, scope: !562, inlinedAt: !983)
!985 = !DILocation(line: 179, column: 2, scope: !527, inlinedAt: !967)
!986 = !DILocation(line: 551, column: 25, scope: !955)
!987 = !DILocation(line: 552, column: 2, scope: !955)
!988 = !DILocation(line: 552, column: 6, scope: !955)
!989 = !DILocation(line: 552, column: 32, scope: !955)
!990 = !DILocation(line: 552, column: 12, scope: !955)
!991 = !DILocation(line: 554, column: 2, scope: !955)
!992 = !DILocation(line: 235, column: 84, scope: !575, inlinedAt: !993)
!993 = distinct !DILocation(line: 554, column: 2, scope: !955)
!994 = !DILocation(line: 236, column: 23, scope: !575, inlinedAt: !993)
!995 = !DILocation(line: 238, column: 9, scope: !575, inlinedAt: !993)
!996 = !DILocation(line: 261, column: 22, scope: !575, inlinedAt: !993)
!997 = !DILocation(line: 88, column: 80, scope: !586, inlinedAt: !998)
!998 = distinct !DILocation(line: 261, column: 2, scope: !575, inlinedAt: !993)
!999 = !DILocation(line: 91, column: 6, scope: !593, inlinedAt: !998)
!1000 = !DILocation(line: 91, column: 10, scope: !593, inlinedAt: !998)
!1001 = !DILocation(line: 91, column: 6, scope: !586, inlinedAt: !998)
!1002 = !DILocation(line: 92, column: 3, scope: !597, inlinedAt: !998)
!1003 = !DILocation(line: 94, column: 2, scope: !586, inlinedAt: !998)
!1004 = !DILocation(line: 114, column: 1, scope: !586, inlinedAt: !998)
!1005 = !DILocation(line: 556, column: 2, scope: !955)
!1006 = !DILocation(line: 556, column: 7, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !955, file: !293, line: 556, column: 5)
!1008 = !DILocation(line: 558, column: 9, scope: !955)
!1009 = !DILocation(line: 559, column: 1, scope: !955)
!1010 = !DILocation(line: 558, column: 2, scope: !955)
!1011 = distinct !DISubprogram(name: "cancel_async_locked", scope: !293, file: !293, line: 492, type: !795, scopeLine: 493, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1012)
!1012 = !{!1013, !1014}
!1013 = !DILocalVariable(name: "work", arg: 1, scope: !1011, file: !293, line: 492, type: !121)
!1014 = !DILocalVariable(name: "ret", scope: !1011, file: !293, line: 503, type: !120)
!1015 = !DILocation(line: 492, column: 47, scope: !1011)
!1016 = !DILocation(line: 495, column: 18, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1011, file: !293, line: 495, column: 6)
!1018 = !DILocation(line: 495, column: 24, scope: !1017)
!1019 = !DILocation(line: 495, column: 7, scope: !1017)
!1020 = !DILocation(line: 495, column: 6, scope: !1011)
!1021 = !DILocation(line: 497, column: 23, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1017, file: !293, line: 495, column: 54)
!1023 = !DILocation(line: 497, column: 29, scope: !1022)
!1024 = !DILocation(line: 497, column: 36, scope: !1022)
!1025 = !DILocation(line: 497, column: 3, scope: !1022)
!1026 = !DILocation(line: 498, column: 2, scope: !1022)
!1027 = !DILocation(line: 503, column: 2, scope: !1011)
!1028 = !DILocation(line: 503, column: 6, scope: !1011)
!1029 = !DILocation(line: 503, column: 33, scope: !1011)
!1030 = !DILocation(line: 503, column: 12, scope: !1011)
!1031 = !DILocation(line: 505, column: 6, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1011, file: !293, line: 505, column: 6)
!1033 = !DILocation(line: 505, column: 10, scope: !1032)
!1034 = !DILocation(line: 505, column: 6, scope: !1011)
!1035 = !DILocation(line: 506, column: 13, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1032, file: !293, line: 505, column: 16)
!1037 = !DILocation(line: 506, column: 19, scope: !1036)
!1038 = !DILocation(line: 506, column: 3, scope: !1036)
!1039 = !DILocation(line: 507, column: 30, scope: !1036)
!1040 = !DILocation(line: 507, column: 9, scope: !1036)
!1041 = !DILocation(line: 507, column: 7, scope: !1036)
!1042 = !DILocation(line: 508, column: 2, scope: !1036)
!1043 = !DILocation(line: 510, column: 9, scope: !1011)
!1044 = !DILocation(line: 511, column: 1, scope: !1011)
!1045 = !DILocation(line: 510, column: 2, scope: !1011)
!1046 = distinct !DISubprogram(name: "k_work_cancel_sync", scope: !293, file: !293, line: 561, type: !815, scopeLine: 563, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1047)
!1047 = !{!1048, !1049, !1050, !1051, !1052, !1053}
!1048 = !DILocalVariable(name: "work", arg: 1, scope: !1046, file: !293, line: 561, type: !121)
!1049 = !DILocalVariable(name: "sync", arg: 2, scope: !1046, file: !293, line: 562, type: !818)
!1050 = !DILocalVariable(name: "canceller", scope: !1046, file: !293, line: 574, type: !278)
!1051 = !DILocalVariable(name: "key", scope: !1046, file: !293, line: 575, type: !518)
!1052 = !DILocalVariable(name: "pending", scope: !1046, file: !293, line: 576, type: !817)
!1053 = !DILocalVariable(name: "need_wait", scope: !1046, file: !293, line: 577, type: !817)
!1054 = !DILocation(line: 561, column: 41, scope: !1046)
!1055 = !DILocation(line: 562, column: 24, scope: !1046)
!1056 = !DILocation(line: 572, column: 2, scope: !1046)
!1057 = !DILocation(line: 572, column: 7, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1046, file: !293, line: 572, column: 5)
!1059 = !DILocation(line: 574, column: 2, scope: !1046)
!1060 = !DILocation(line: 574, column: 27, scope: !1046)
!1061 = !DILocation(line: 574, column: 40, scope: !1046)
!1062 = !DILocation(line: 574, column: 46, scope: !1046)
!1063 = !DILocation(line: 575, column: 2, scope: !1046)
!1064 = !DILocation(line: 575, column: 19, scope: !1046)
!1065 = !DILocation(line: 160, column: 94, scope: !527, inlinedAt: !1066)
!1066 = distinct !DILocation(line: 575, column: 25, scope: !1046)
!1067 = !DILocation(line: 162, column: 9, scope: !527, inlinedAt: !1066)
!1068 = !DILocation(line: 163, column: 19, scope: !527, inlinedAt: !1066)
!1069 = !DILocation(line: 44, column: 2, scope: !538, inlinedAt: !1070)
!1070 = distinct !DILocation(line: 169, column: 10, scope: !527, inlinedAt: !1066)
!1071 = !DILocation(line: 44, column: 15, scope: !538, inlinedAt: !1070)
!1072 = !DILocation(line: 48, column: 2, scope: !538, inlinedAt: !1070)
!1073 = !DILocation(line: 80, column: 9, scope: !538, inlinedAt: !1070)
!1074 = !DILocation(line: 81, column: 1, scope: !538, inlinedAt: !1070)
!1075 = !DILocation(line: 169, column: 8, scope: !527, inlinedAt: !1066)
!1076 = !DILocation(line: 171, column: 26, scope: !527, inlinedAt: !1066)
!1077 = !DILocation(line: 110, column: 94, scope: !553, inlinedAt: !1078)
!1078 = distinct !DILocation(line: 171, column: 2, scope: !527, inlinedAt: !1066)
!1079 = !DILocation(line: 112, column: 9, scope: !553, inlinedAt: !1078)
!1080 = !DILocation(line: 177, column: 27, scope: !527, inlinedAt: !1066)
!1081 = !DILocation(line: 121, column: 95, scope: !562, inlinedAt: !1082)
!1082 = distinct !DILocation(line: 177, column: 2, scope: !527, inlinedAt: !1066)
!1083 = !DILocation(line: 123, column: 9, scope: !562, inlinedAt: !1082)
!1084 = !DILocation(line: 179, column: 2, scope: !527, inlinedAt: !1066)
!1085 = !DILocation(line: 575, column: 25, scope: !1046)
!1086 = !DILocation(line: 576, column: 2, scope: !1046)
!1087 = !DILocation(line: 576, column: 8, scope: !1046)
!1088 = !DILocation(line: 576, column: 40, scope: !1046)
!1089 = !DILocation(line: 576, column: 19, scope: !1046)
!1090 = !DILocation(line: 576, column: 46, scope: !1046)
!1091 = !DILocation(line: 577, column: 2, scope: !1046)
!1092 = !DILocation(line: 577, column: 8, scope: !1046)
!1093 = !DILocation(line: 579, column: 6, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1046, file: !293, line: 579, column: 6)
!1095 = !DILocation(line: 579, column: 6, scope: !1046)
!1096 = !DILocation(line: 580, column: 29, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1094, file: !293, line: 579, column: 15)
!1098 = !DILocation(line: 580, column: 9, scope: !1097)
!1099 = !DILocation(line: 581, column: 34, scope: !1097)
!1100 = !DILocation(line: 581, column: 40, scope: !1097)
!1101 = !DILocation(line: 581, column: 15, scope: !1097)
!1102 = !DILocation(line: 581, column: 13, scope: !1097)
!1103 = !DILocation(line: 582, column: 2, scope: !1097)
!1104 = !DILocation(line: 584, column: 2, scope: !1046)
!1105 = !DILocation(line: 235, column: 84, scope: !575, inlinedAt: !1106)
!1106 = distinct !DILocation(line: 584, column: 2, scope: !1046)
!1107 = !DILocation(line: 236, column: 23, scope: !575, inlinedAt: !1106)
!1108 = !DILocation(line: 238, column: 9, scope: !575, inlinedAt: !1106)
!1109 = !DILocation(line: 261, column: 22, scope: !575, inlinedAt: !1106)
!1110 = !DILocation(line: 88, column: 80, scope: !586, inlinedAt: !1111)
!1111 = distinct !DILocation(line: 261, column: 2, scope: !575, inlinedAt: !1106)
!1112 = !DILocation(line: 91, column: 6, scope: !593, inlinedAt: !1111)
!1113 = !DILocation(line: 91, column: 10, scope: !593, inlinedAt: !1111)
!1114 = !DILocation(line: 91, column: 6, scope: !586, inlinedAt: !1111)
!1115 = !DILocation(line: 92, column: 3, scope: !597, inlinedAt: !1111)
!1116 = !DILocation(line: 94, column: 2, scope: !586, inlinedAt: !1111)
!1117 = !DILocation(line: 114, column: 1, scope: !586, inlinedAt: !1111)
!1118 = !DILocation(line: 586, column: 6, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1046, file: !293, line: 586, column: 6)
!1120 = !DILocation(line: 586, column: 6, scope: !1046)
!1121 = !DILocation(line: 587, column: 3, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1119, file: !293, line: 586, column: 17)
!1123 = !DILocation(line: 587, column: 8, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1122, file: !293, line: 587, column: 6)
!1125 = !DILocation(line: 589, column: 15, scope: !1122)
!1126 = !DILocation(line: 589, column: 26, scope: !1122)
!1127 = !DILocation(line: 589, column: 46, scope: !1122)
!1128 = !DILocation(line: 589, column: 3, scope: !1122)
!1129 = !DILocation(line: 590, column: 2, scope: !1122)
!1130 = !DILocation(line: 592, column: 2, scope: !1046)
!1131 = !DILocation(line: 592, column: 7, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1046, file: !293, line: 592, column: 5)
!1133 = !DILocation(line: 593, column: 9, scope: !1046)
!1134 = !DILocation(line: 594, column: 1, scope: !1046)
!1135 = !DILocation(line: 593, column: 2, scope: !1046)
!1136 = distinct !DISubprogram(name: "cancel_sync_locked", scope: !293, file: !293, line: 528, type: !1137, scopeLine: 530, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1139)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!817, !121, !278}
!1139 = !{!1140, !1141, !1142}
!1140 = !DILocalVariable(name: "work", arg: 1, scope: !1136, file: !293, line: 528, type: !121)
!1141 = !DILocalVariable(name: "canceller", arg: 2, scope: !1136, file: !293, line: 529, type: !278)
!1142 = !DILocalVariable(name: "ret", scope: !1136, file: !293, line: 531, type: !817)
!1143 = !DILocation(line: 528, column: 48, scope: !1136)
!1144 = !DILocation(line: 529, column: 36, scope: !1136)
!1145 = !DILocation(line: 531, column: 2, scope: !1136)
!1146 = !DILocation(line: 531, column: 8, scope: !1136)
!1147 = !DILocation(line: 531, column: 25, scope: !1136)
!1148 = !DILocation(line: 531, column: 31, scope: !1136)
!1149 = !DILocation(line: 531, column: 14, scope: !1136)
!1150 = !DILocation(line: 537, column: 6, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1136, file: !293, line: 537, column: 6)
!1152 = !DILocation(line: 537, column: 6, scope: !1136)
!1153 = !DILocation(line: 538, column: 20, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1151, file: !293, line: 537, column: 11)
!1155 = !DILocation(line: 538, column: 31, scope: !1154)
!1156 = !DILocation(line: 538, column: 3, scope: !1154)
!1157 = !DILocation(line: 539, column: 2, scope: !1154)
!1158 = !DILocation(line: 541, column: 9, scope: !1136)
!1159 = !DILocation(line: 542, column: 1, scope: !1136)
!1160 = !DILocation(line: 541, column: 2, scope: !1136)
!1161 = distinct !DISubprogram(name: "k_work_queue_init", scope: !293, file: !293, line: 699, type: !1162, scopeLine: 700, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1164)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{null, !137}
!1164 = !{!1165}
!1165 = !DILocalVariable(name: "queue", arg: 1, scope: !1161, file: !293, line: 699, type: !137)
!1166 = !DILocation(line: 699, column: 41, scope: !1161)
!1167 = !DILocation(line: 703, column: 3, scope: !1161)
!1168 = !DILocation(line: 703, column: 11, scope: !1161)
!1169 = !DILocation(line: 707, column: 2, scope: !1161)
!1170 = !DILocation(line: 707, column: 7, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1161, file: !293, line: 707, column: 5)
!1172 = !DILocation(line: 708, column: 1, scope: !1161)
!1173 = distinct !DISubprogram(name: "k_work_queue_start", scope: !293, file: !293, line: 710, type: !1174, scopeLine: 715, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1193)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{null, !137, !1176, !1183, !120, !1185}
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 32)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !1178, line: 44, baseType: !1179)
!1178 = !DIFile(filename: "include/zephyr/sys/arch_interface.h", directory: "/home/sri/zephyrproject/zephyr")
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !1180, line: 47, size: 8, elements: !1181)
!1180 = !DIFile(filename: "include/zephyr/kernel/thread_stack.h", directory: "/home/sri/zephyrproject/zephyr")
!1181 = !{!1182}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1179, file: !1180, line: 48, baseType: !266, size: 8)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1184, line: 51, baseType: !200)
!1184 = !DIFile(filename: "/opt/arm/developmentstudio-2023.0/sw/ARMCompiler6.20/bin/../include/string.h", directory: "")
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 32)
!1186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_queue_config", file: !6, line: 3973, size: 64, elements: !1188)
!1188 = !{!1189, !1192}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1187, file: !6, line: 3978, baseType: !1190, size: 32)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 32)
!1191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "no_yield", scope: !1187, file: !6, line: 3992, baseType: !817, size: 8, offset: 32)
!1193 = !{!1194, !1195, !1196, !1197, !1198, !1199}
!1194 = !DILocalVariable(name: "queue", arg: 1, scope: !1173, file: !293, line: 710, type: !137)
!1195 = !DILocalVariable(name: "stack", arg: 2, scope: !1173, file: !293, line: 711, type: !1176)
!1196 = !DILocalVariable(name: "stack_size", arg: 3, scope: !1173, file: !293, line: 712, type: !1183)
!1197 = !DILocalVariable(name: "prio", arg: 4, scope: !1173, file: !293, line: 713, type: !120)
!1198 = !DILocalVariable(name: "cfg", arg: 5, scope: !1173, file: !293, line: 714, type: !1185)
!1199 = !DILocalVariable(name: "flags", scope: !1173, file: !293, line: 719, type: !199)
!1200 = !DILocation(line: 710, column: 42, scope: !1173)
!1201 = !DILocation(line: 711, column: 22, scope: !1173)
!1202 = !DILocation(line: 712, column: 11, scope: !1173)
!1203 = !DILocation(line: 713, column: 8, scope: !1173)
!1204 = !DILocation(line: 714, column: 38, scope: !1173)
!1205 = !DILocation(line: 719, column: 2, scope: !1173)
!1206 = !DILocation(line: 719, column: 11, scope: !1173)
!1207 = !DILocation(line: 721, column: 2, scope: !1173)
!1208 = !DILocation(line: 721, column: 7, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1173, file: !293, line: 721, column: 5)
!1210 = !DILocation(line: 723, column: 18, scope: !1173)
!1211 = !DILocation(line: 723, column: 25, scope: !1173)
!1212 = !DILocation(line: 723, column: 2, scope: !1173)
!1213 = !DILocation(line: 724, column: 16, scope: !1173)
!1214 = !DILocation(line: 724, column: 23, scope: !1173)
!1215 = !DILocation(line: 724, column: 2, scope: !1173)
!1216 = !DILocation(line: 725, column: 16, scope: !1173)
!1217 = !DILocation(line: 725, column: 23, scope: !1173)
!1218 = !DILocation(line: 725, column: 2, scope: !1173)
!1219 = !DILocation(line: 727, column: 7, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1173, file: !293, line: 727, column: 6)
!1221 = !DILocation(line: 727, column: 11, scope: !1220)
!1222 = !DILocation(line: 727, column: 17, scope: !1220)
!1223 = !DILocation(line: 727, column: 20, scope: !1220)
!1224 = !DILocation(line: 727, column: 25, scope: !1220)
!1225 = !DILocation(line: 727, column: 6, scope: !1173)
!1226 = !DILocation(line: 728, column: 9, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1220, file: !293, line: 727, column: 35)
!1228 = !DILocation(line: 729, column: 2, scope: !1227)
!1229 = !DILocation(line: 735, column: 13, scope: !1173)
!1230 = !DILocation(line: 735, column: 20, scope: !1173)
!1231 = !DILocation(line: 735, column: 27, scope: !1173)
!1232 = !DILocation(line: 735, column: 2, scope: !1173)
!1233 = !DILocation(line: 737, column: 25, scope: !1173)
!1234 = !DILocation(line: 737, column: 32, scope: !1173)
!1235 = !DILocation(line: 737, column: 40, scope: !1173)
!1236 = !DILocation(line: 737, column: 47, scope: !1173)
!1237 = !DILocation(line: 738, column: 27, scope: !1173)
!1238 = !DILocation(line: 739, column: 10, scope: !1173)
!1239 = !DILocation(line: 739, column: 34, scope: !1173)
!1240 = !DILocation(line: 737, column: 8, scope: !1173)
!1241 = !DILocation(line: 741, column: 7, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1173, file: !293, line: 741, column: 6)
!1243 = !DILocation(line: 741, column: 11, scope: !1242)
!1244 = !DILocation(line: 741, column: 17, scope: !1242)
!1245 = !DILocation(line: 741, column: 21, scope: !1242)
!1246 = !DILocation(line: 741, column: 26, scope: !1242)
!1247 = !DILocation(line: 741, column: 31, scope: !1242)
!1248 = !DILocation(line: 741, column: 6, scope: !1173)
!1249 = !DILocation(line: 742, column: 22, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1242, file: !293, line: 741, column: 38)
!1251 = !DILocation(line: 742, column: 29, scope: !1250)
!1252 = !DILocation(line: 742, column: 37, scope: !1250)
!1253 = !DILocation(line: 742, column: 42, scope: !1250)
!1254 = !DILocation(line: 742, column: 3, scope: !1250)
